---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male 
> Tenure controlled/Urban 1979 Highgen ManualD MaleTenure controlled.log
  log type:  text
 opened on:   6 Aug 2024, 17:28:02

. use "`datapath'", clear

. 
. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,431 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(33,372 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(5,190 real changes made)

. 
. *Step Two: Regressions (Three parts Ideally: Firstly rdrobust from birthmonth to earning; S
> econdly rdrobust from birthmonth to higheredu; Thirdly rdrobust*2 or rdrobust+OLS or ivregr
> ess from higheredu to earning. Each part has 6 sheets)
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11533      .0818   1.4099   0.159   -.044993       .27566
    Bias-corrected |   .1327      .0818   1.6223   0.105   -.027624       .29303
            Robust |   .1327     .12966   1.0235   0.306   -.121425      .386832
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07706     .05091   1.5137   0.130   -.022719      .176841
    Bias-corrected |   .1086     .05091   2.1333   0.033    .008822      .208382
            Robust |   .1086     .07283   1.4911   0.136   -.034149      .251353
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      2379        2604            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.560      62.560
       BW bias (b) |    95.495      95.495
         rho (h/b) |     0.655       0.655
        Unique obs |       370         261

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03911     .04136   0.9457   0.344    -.04195      .120176
    Bias-corrected |  .04138     .04136   1.0004   0.317   -.039688      .122438
            Robust |  .04138     .04937   0.8381   0.402   -.055385      .138135
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07426      .1075   0.6908   0.490   -.136435      .284965
    Bias-corrected |  .11574      .1075   1.0767   0.282   -.094958      .326442
            Robust |  .11574     .16312   0.7096   0.478   -.203962      .435447
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11779      .0652   1.8067   0.071   -.009996      .245575
    Bias-corrected |  .07335      .0652   1.1250   0.261   -.054436      .201134
            Robust |  .07335     .09449   0.7763   0.438   -.111846      .258544
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      1509        1903            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.755      63.755
       BW bias (b) |    96.647      96.647
         rho (h/b) |     0.660       0.660
        Unique obs |       320         248

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06477     .05285   1.2256   0.220   -.038807      .168342
    Bias-corrected |  .06602     .05285   1.2494   0.212   -.037551      .169598
            Robust |  .06602     .06326   1.0436   0.297   -.057974       .19002
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10655     .18331   -0.5813  0.561   -.465828      .252719
    Bias-corrected | -.11588     .18331   -0.6322  0.527   -.475155      .243392
            Robust | -.11588     .27284   -0.4247  0.671   -.650631      .418868
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13436     .10565   1.2717   0.203   -.072714      .341433
    Bias-corrected |  .03763     .10565   0.3561   0.722   -.169446        .2447
            Robust |  .03763      .1575   0.2389   0.811   -.271068      .346321
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       576         600            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.040      70.040
       BW bias (b) |   110.780     110.780
         rho (h/b) |     0.632       0.632
        Unique obs |       236         243

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09651     .07975   1.2101   0.226   -.059798      .252815
    Bias-corrected |  .10794     .07975   1.3535   0.176   -.048363      .264251
            Robust |  .10794     .09583   1.1264   0.260   -.079887      .295775
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16452     .13104   1.2555   0.209   -.092313      .421353
    Bias-corrected |  .23262     .13104   1.7752   0.076   -.024217      .489448
            Robust |  .23262     .20126   1.1558   0.248   -.161846      .627077
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10718     .08109   1.3216   0.186   -.051766      .266119
    Bias-corrected |  .09361     .08109   1.1543   0.248   -.065337      .252548
            Robust |  .09361     .11729   0.7981   0.425   -.136276      .323487
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |       975        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.329      62.329
       BW bias (b) |    95.581      95.581
         rho (h/b) |     0.652       0.652
        Unique obs |       315         237

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04209     .06722   0.6263   0.531   -.089648      .173838
    Bias-corrected |  .03131     .06722   0.4658   0.641   -.100436      .163049
            Robust |  .03131     .07954   0.3936   0.694   -.124581      .187194
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        305
-------------------+----------------------            BW type       =     Manual
     Number of obs |       171         134            Kernel        =    Uniform
Eff. Number of obs |       171         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17615     .10957   1.6077   0.108   -.038595      .390903
    Bias-corrected |  .26168     .10957   2.3883   0.017    .046931      .476429
            Robust |  .26168     .16956   1.5433   0.123   -.070655      .594015
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        879
-------------------+----------------------            BW type       =     Manual
     Number of obs |       452         427            Kernel        =    Uniform
Eff. Number of obs |       452         427            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01767     .07801   -0.2265  0.821   -.170561      .135225
    Bias-corrected |  .13831     .07801   1.7730   0.076   -.014586        .2912
            Robust |  .13831     .10578   1.3075   0.191    -.06901      .345624
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5468
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3700        1768            Kernel        = Epanechnikov
Eff. Number of obs |       869         715            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.153      61.153
       BW bias (b) |    94.183      94.183
         rho (h/b) |     0.649       0.649
        Unique obs |       356         245

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03231     .06313   -0.5118  0.609   -.156049      .091424
    Bias-corrected | -.03506     .06313   -0.5554  0.579     -.1588      .088673
            Robust | -.03506     .07521   -0.4662  0.641   -.182479      .112352
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11533     .10521   1.0963   0.273   -.090868      .321535
    Bias-corrected |   .1327     .10521   1.2614   0.207   -.073499      .338905
            Robust |   .1327     .17482   0.7591   0.448   -.209939      .475346
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07706     .06538   1.1787   0.239    -.05108      .205202
    Bias-corrected |   .1086     .06538   1.6611   0.097   -.019539      .236743
            Robust |   .1086     .09355   1.1609   0.246   -.074749      .291953
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      2798        2981            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    72.357      72.357
       BW bias (b) |    92.382      92.382
         rho (h/b) |     0.783       0.783
        Unique obs |       370         261
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0337     .06073   0.5548   0.579   -.085337      .152727
    Bias-corrected |  .03772     .06073   0.6211   0.535    -.08131      .156754
            Robust |  .03772     .06499   0.5805   0.562   -.089651      .165094
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07426     .14624   0.5078   0.612   -.212364      .360894
    Bias-corrected |  .11574     .14624   0.7914   0.429   -.170887      .402371
            Robust |  .11574      .2192   0.5280   0.597   -.313884      .545369
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11779     .08727   1.3497   0.177   -.053255      .288834
    Bias-corrected |  .07335     .08727   0.8405   0.401   -.097695      .244394
            Robust |  .07335      .1191   0.6159   0.538   -.160074      .306772
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provinc
> e_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      1952        2452            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    81.584      81.584
       BW bias (b) |    96.051      96.051
         rho (h/b) |     0.849       0.849
        Unique obs |       320         248
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05513     .08304   0.6639   0.507   -.107622      .217882
    Bias-corrected |  .05802     .08304   0.6987   0.485   -.104733      .220771
            Robust |  .05802      .0894   0.6490   0.516   -.117205      .233243
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10655     .19959   -0.5339  0.593   -.497745      .284636
    Bias-corrected | -.11588     .19959   -0.5806  0.562   -.507072      .275309
            Robust | -.11588     .29328   -0.3951  0.693   -.690694       .45893
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13436     .11503   1.1680   0.243   -.091105      .359824
    Bias-corrected |  .03763     .11503   0.3271   0.744   -.187838      .263091
            Robust |  .03763     .19353   0.1944   0.846   -.341694      .416948
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       555         584            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.593      67.593
       BW bias (b) |   104.549     104.549
         rho (h/b) |     0.647       0.647
        Unique obs |       236         243
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10168     .10279   0.9893   0.323   -.099776      .303145
    Bias-corrected |  .11973     .10279   1.1649   0.244   -.081727      .321193
            Robust |  .11973     .11806   1.0141   0.311   -.111668      .351134
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16452     .14033   1.1723   0.241   -.110531      .439571
    Bias-corrected |  .23262     .14033   1.6576   0.097   -.042436      .507667
            Robust |  .23262     .25191   0.9234   0.356   -.261122      .726353
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10718     .09624   1.1136   0.265    -.08145      .295802
    Bias-corrected |  .09361     .09624   0.9726   0.331   -.095021      .282232
            Robust |  .09361     .11917   0.7855   0.432   -.139967      .327178
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |      1275        1746            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.978      80.978
       BW bias (b) |    94.272      94.272
         rho (h/b) |     0.859       0.859
        Unique obs |       315         237
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04618     .08858   0.5213   0.602   -.127432      .219791
    Bias-corrected |  .02815     .08858   0.3178   0.751    -.14546      .201763
            Robust |  .02815     .09203   0.3059   0.760   -.152224      .208527
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        305
-------------------+----------------------            BW type       =     Manual
     Number of obs |       171         134            Kernel        =    Uniform
Eff. Number of obs |       171         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17615     .09694   1.8171   0.069   -.013852      .366159
    Bias-corrected |  .26168     .09694   2.6993   0.007    .071675      .451686
            Robust |  .26168     .12362   2.1167   0.034    .019381       .50398
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        879
-------------------+----------------------            BW type       =     Manual
     Number of obs |       452         427            Kernel        =    Uniform
Eff. Number of obs |       452         427            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01767     .06028   -0.2931  0.769   -.135819      .100483
    Bias-corrected |  .13831     .06028   2.2943   0.022    .020156      .256458
            Robust |  .13831     .10237   1.3510   0.177   -.062339      .338953
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5468
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3700        1768            Kernel        = Epanechnikov
Eff. Number of obs |       909         734            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.541      63.541
       BW bias (b) |    96.148      96.148
         rho (h/b) |     0.661       0.661
        Unique obs |       356         245
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03152     .06101   -0.5166  0.605   -.151094       .08806
    Bias-corrected | -.03334     .06101   -0.5464  0.585   -.152912      .086242
            Robust | -.03334     .07026   -0.4745  0.635   -.171033      .104363
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04482     .09615   0.4662   0.641   -.143623      .233268
    Bias-corrected |  -.0529     .09615   -0.5502  0.582   -.241345      .135545
            Robust |  -.0529     .17585   -0.3008  0.764   -.397552      .291752
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04767     .05442   0.8760   0.381    -.05899      .154328
    Bias-corrected |  .05185     .05442   0.9529   0.341   -.054805      .158513
            Robust |  .05185     .08252   0.6284   0.530   -.109882      .213591
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      2399        2614            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.163      64.163
       BW bias (b) |   102.759     102.759
         rho (h/b) |     0.624       0.624
        Unique obs |       369         260

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01156     .04255   0.2718   0.786   -.071829      .094954
    Bias-corrected |  .00458     .04255   0.1077   0.914    -.07881      .087973
            Robust |  .00458     .05099   0.0898   0.928   -.095353      .104516
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03432     .13032   -0.2634  0.792   -.289749      .221102
    Bias-corrected | -.12556     .13032   -0.9635  0.335   -.380986      .129865
            Robust | -.12556     .23309   -0.5387  0.590     -.5824      .331279
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09325     .06988   1.3344   0.182   -.043711      .230212
    Bias-corrected | -.00624     .06988   -0.0892  0.929   -.143198      .130725
            Robust | -.00624     .10855   -0.0575  0.954   -.218995      .206521
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1473        1858            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.224      63.224
       BW bias (b) |   102.564     102.564
         rho (h/b) |     0.616       0.616
        Unique obs |       319         247

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04091     .05532   0.7395   0.460   -.067521      .149344
    Bias-corrected |   .0301     .05532   0.5440   0.586   -.078335      .138531
            Robust |   .0301     .06615   0.4550   0.649   -.099553      .159749
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13188     .22229   -0.5933  0.553    -.56757      .303811
    Bias-corrected | -.22581     .22229   -1.0158  0.310     -.6615       .20988
            Robust | -.22581     .41795   -0.5403  0.589   -1.04498      .593356
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17838     .11093   1.6080   0.108   -.039039      .395807
    Bias-corrected |  .09723     .11093   0.8765   0.381   -.120193      .314653
            Robust |  .09723     .17713   0.5489   0.583    -.24993       .44439
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       485         525            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.228      60.228
       BW bias (b) |   104.094     104.094
         rho (h/b) |     0.579       0.579
        Unique obs |       235         242

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15393     .08761   1.7570   0.079   -.017785      .325646
    Bias-corrected |  .17821     .08761   2.0341   0.042    .006494      .349925
            Robust |  .17821     .10379   1.7170   0.086   -.025219      .381638
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00658     .16092   -0.0409  0.967   -.321971      .308808
    Bias-corrected | -.13848     .16092   -0.8606  0.389   -.453873      .176906
            Robust | -.13848     .28553   -0.4850  0.628    -.69812      .421154
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04529     .08784   0.5156   0.606   -.126873      .217459
    Bias-corrected | -.05473     .08784   -0.6230  0.533   -.226892      .117441
            Robust | -.05473     .13688   -0.3998  0.689   -.323012      .213561
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |       872        1169            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.448      58.448
       BW bias (b) |   103.688     103.688
         rho (h/b) |     0.564       0.564
        Unique obs |       314         236

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00847     .07319   -0.1158  0.908    -.15192      .134972
    Bias-corrected | -.03287     .07319   -0.4491  0.653   -.176315      .110576
            Robust | -.03287      .0845   -0.3890  0.697   -.198485      .132745
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        283
-------------------+----------------------            BW type       =     Manual
     Number of obs |       163         120            Kernel        =    Uniform
Eff. Number of obs |       163         120            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1377     .13365   1.0303   0.303   -.124253      .399645
    Bias-corrected |  .16174     .13365   1.2102   0.226   -.100211      .423686
            Robust |  .16174     .25027   0.6463   0.518   -.328775       .65225
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        857
-------------------+----------------------            BW type       =     Manual
     Number of obs |       444         413            Kernel        =    Uniform
Eff. Number of obs |       444         413            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05323     .08468   -0.6287  0.530   -.219202      .112733
    Bias-corrected |  .09667     .08468   1.1416   0.254   -.069302      .262633
            Robust |  .09667     .12356   0.7823   0.434   -.145508       .33884
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5446
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3692        1754            Kernel        = Epanechnikov
Eff. Number of obs |       861         701            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.366      61.366
       BW bias (b) |    98.329      98.329
         rho (h/b) |     0.624       0.624
        Unique obs |       355         244

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06013     .06685   -0.8994  0.368   -.191165        .0709
    Bias-corrected | -.06851     .06685   -1.0248  0.305   -.199545       .06252
            Robust | -.06851     .08003   -0.8561  0.392   -.225373      .088349
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04482     .08922   0.5024   0.615   -.130037      .219682
    Bias-corrected |  -.0529     .08922   -0.5929  0.553   -.227759      .121959
            Robust |  -.0529     .19484   -0.2715  0.786    -.43477       .32897
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04767     .06757   0.7055   0.481   -.084768      .180105
    Bias-corrected |  .05185     .06757   0.7674   0.443   -.080582      .184291
            Robust |  .05185     .09663   0.5366   0.592   -.137536      .241245
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pr
> ovince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      2723        2871            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.059      71.059
       BW bias (b) |    98.283      98.283
         rho (h/b) |     0.723       0.723
        Unique obs |       369         260
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00987     .06126   0.1612   0.872   -.110193      .129938
    Bias-corrected |  .00182     .06126   0.0298   0.976   -.118241      .121889
            Robust |  .00182     .06738   0.0271   0.978   -.130236      .133883
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03432     .12732   -0.2696  0.787   -.283864      .215217
    Bias-corrected | -.12556     .12732   -0.9862  0.324   -.375101       .12398
            Robust | -.12556      .2652   -0.4735  0.636   -.645334      .394213
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09325     .08754   1.0653   0.287   -.078316      .264817
    Bias-corrected | -.00624     .08754   -0.0712  0.943   -.177803       .16533
            Robust | -.00624     .11382   -0.0548  0.956   -.229318      .216845
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(
> nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1819        2293            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.625      77.625
       BW bias (b) |    93.866      93.866
         rho (h/b) |     0.827       0.827
        Unique obs |       319         247
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03331     .08501   0.3919   0.695   -.133304      .199933
    Bias-corrected |  .02597     .08501   0.3055   0.760   -.140645      .192592
            Robust |  .02597      .0926   0.2805   0.779    -.15551      .207457
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13188     .17337   -0.7607  0.447   -.471679       .20792
    Bias-corrected | -.22581     .17337   -1.3025  0.193    -.56561      .113989
            Robust | -.22581     .39478   -0.5720  0.567   -.999567      .547946
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17838     .09843   1.8123   0.070   -.014532        .3713
    Bias-corrected |  .09723     .09843   0.9878   0.323   -.095686      .290146
            Robust |  .09723     .17022   0.5712   0.568   -.236394      .430854
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       429         470            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.146      53.146
       BW bias (b) |    97.131      97.131
         rho (h/b) |     0.547       0.547
        Unique obs |       235         242
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17097     .09467   1.8060   0.071   -.014574      .356519
    Bias-corrected |  .20033     .09467   2.1161   0.034    .014785      .385878
            Robust |  .20033     .10842   1.8477   0.065   -.012167       .41283
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00658     .14303   -0.0460  0.963   -.286921      .273758
    Bias-corrected | -.13848     .14303   -0.9682  0.333   -.418822      .141856
            Robust | -.13848     .31249   -0.4432  0.658   -.750956      .473989
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04529     .10505   0.4311   0.666   -.160606      .251192
    Bias-corrected | -.05473     .10505   -0.5209  0.602   -.260624      .151174
            Robust | -.05473     .13198   -0.4146  0.678   -.313401       .20395
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |      1085        1463            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.176      70.176
       BW bias (b) |    97.322      97.322
         rho (h/b) |     0.721       0.721
        Unique obs |       314         236
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00978     .09712   -0.1007  0.920   -.200124      .180565
    Bias-corrected | -.04633     .09712   -0.4771  0.633   -.236675      .144014
            Robust | -.04633     .10579   -0.4380  0.661   -.253668      .161006
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        283
-------------------+----------------------            BW type       =     Manual
     Number of obs |       163         120            Kernel        =    Uniform
Eff. Number of obs |       163         120            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1377     .12536   1.0984   0.272      -.108      .383392
    Bias-corrected |  .16174     .12536   1.2902   0.197   -.083959      .407434
            Robust |  .16174     .17642   0.9168   0.359   -.184038      .507514
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        857
-------------------+----------------------            BW type       =     Manual
     Number of obs |       444         413            Kernel        =    Uniform
Eff. Number of obs |       444         413            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05323     .06236   -0.8537  0.393   -.175459       .06899
    Bias-corrected |  .09667     .06236   1.5501   0.121   -.025558       .21889
            Robust |  .09667     .11236   0.8603   0.390   -.123561      .316893
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5446
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3692        1754            Kernel        = Epanechnikov
Eff. Number of obs |       911         727            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.209      64.209
       BW bias (b) |   102.406     102.406
         rho (h/b) |     0.627       0.627
        Unique obs |       355         244
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05798     .06077   -0.9540  0.340   -.177082      .061132
    Bias-corrected | -.06371     .06077   -1.0483  0.295   -.182812      .055402
            Robust | -.06371     .07134   -0.8930  0.372   -.203521      .076111
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03373     .13163   0.2562   0.798   -.224269      .291727
    Bias-corrected | -.25144     .13163   -1.9102  0.056   -.509439      .006557
            Robust | -.25144     .31407   -0.8006  0.423   -.867012       .36413
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0449     .06051   0.7420   0.458   -.073704       .16351
    Bias-corrected |   .0447     .06051   0.7386   0.460    -.07391      .163303
            Robust |   .0447     .10264   0.4355   0.663   -.156482      .245875
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      2287        2489            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.579      62.579
       BW bias (b) |   105.116     105.116
         rho (h/b) |     0.595       0.595
        Unique obs |       368         259

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00659     .04625   0.1426   0.887   -.084045      .097235
    Bias-corrected | -.00308     .04625   -0.0665  0.947   -.093717      .087563
            Robust | -.00308     .05565   -0.0553  0.956    -.11215      .105997
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.08509     .17842   -0.4769  0.633   -.434794      .264613
    Bias-corrected | -.49676     .17842   -2.7842  0.005   -.846464     -.147057
            Robust | -.49676     .43763   -1.1351  0.256    -1.3545      .360975
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10189     .07715   1.3206   0.187   -.049328      .253099
    Bias-corrected | -.02472     .07715   -0.3204  0.749   -.175933      .126494
            Robust | -.02472     .13434   -0.1840  0.854   -.288031      .238592
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |      1370        1702            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.904      60.904
       BW bias (b) |   101.953     101.953
         rho (h/b) |     0.597       0.597
        Unique obs |       318         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04658     .06042   0.7710   0.441   -.071834      .164999
    Bias-corrected |  .03511     .06042   0.5812   0.561   -.083304      .153529
            Robust |  .03511     .07287   0.4818   0.630   -.107712      .177937
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.19921     .27438   -0.7260  0.468   -.736998      .338568
    Bias-corrected | -.71608     .27438   -2.6098  0.009   -1.25386     -.178298
            Robust | -.71608     .70854   -1.0106  0.312   -2.10479       .67263
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19001     .11861   1.6020   0.109   -.042455      .422477
    Bias-corrected |  .11797     .11861   0.9947   0.320   -.114493      .350438
            Robust |  .11797      .2017   0.5849   0.559   -.277345       .51329
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       455         501            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.559      58.559
       BW bias (b) |   103.723     103.723
         rho (h/b) |     0.565       0.565
        Unique obs |       234         241

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16571     .09293   1.7832   0.075   -.016431       .34785
    Bias-corrected |   .1922     .09293   2.0683   0.039    .010064      .374345
            Robust |   .1922     .11063   1.7373   0.082   -.024629      .409038
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00228      .2286   0.0100   0.992   -.445764      .450325
    Bias-corrected | -.38587      .2286   -1.6880  0.091   -.833918       .06217
            Robust | -.38587     .54268   -0.7111  0.477   -1.44951      .677757
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0543     .09826   0.5527   0.580   -.138282      .246892
    Bias-corrected | -.08211     .09826   -0.8357  0.403     -.2747      .110475
            Robust | -.08211     .17501   -0.4692  0.639   -.425133      .260908
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       799        1068            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.536      55.536
       BW bias (b) |   101.052     101.052
         rho (h/b) |     0.550       0.550
        Unique obs |       313         235

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01235     .08154   -0.1515  0.880   -.172163      .147461
    Bias-corrected | -.03974     .08154   -0.4874  0.626   -.199554       .12007
            Robust | -.03974     .09529   -0.4171  0.677     -.2265      .147017
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        249
-------------------+----------------------            BW type       =     Manual
     Number of obs |       151          98            Kernel        =    Uniform
Eff. Number of obs |       151          98            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12284     .20098   0.6112   0.541    -.27108      .516756
    Bias-corrected |  .12302     .20098   0.6121   0.540     -.2709      .516935
            Robust |  .12302     .48731   0.2524   0.801   -.832085      1.07812
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       432         391            Kernel        =    Uniform
Eff. Number of obs |       432         391            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10053     .09811   -1.0246  0.306   -.292833      .091768
    Bias-corrected |  .05247     .09811   0.5348   0.593    -.13983      .244772
            Robust |  .05247     .16502   0.3180   0.751   -.270957      .375899
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5412
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3680        1732            Kernel        = Epanechnikov
Eff. Number of obs |       870         691            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.749      62.749
       BW bias (b) |   106.622     106.622
         rho (h/b) |     0.589       0.589
        Unique obs |       354         243

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09277     .07298   -1.2711  0.204   -.235819      .050272
    Bias-corrected | -.10686     .07298   -1.4641  0.143   -.249903      .036189
            Robust | -.10686     .08799   -1.2144  0.225   -.279313      .065599
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03373     .11127   0.3031   0.762   -.184349      .251806
    Bias-corrected | -.25144     .11127   -2.2598  0.024   -.469519     -.033364
            Robust | -.25144      .3349   -0.7508  0.453   -.907829      .404946
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0449     .07081   0.6341   0.526   -.093885      .183691
    Bias-corrected |   .0447     .07081   0.6312   0.528   -.094091      .183484
            Robust |   .0447     .11051   0.4045   0.686   -.171897      .261289
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pr
> ovince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      2439        2632            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.886      66.886
       BW bias (b) |   100.764     100.764
         rho (h/b) |     0.664       0.664
        Unique obs |       368         259
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00313     .06309   0.0496   0.960   -.120525      .126785
    Bias-corrected |  -.0078     .06309   -0.1236  0.902   -.131452      .115858
            Robust |  -.0078     .07101   -0.1098  0.913   -.146976      .131383
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.08509     .15704   -0.5418  0.588   -.392889      .222708
    Bias-corrected | -.49676     .15704   -3.1632  0.002   -.804559     -.188962
            Robust | -.49676      .4539   -1.0944  0.274   -1.38638      .392862
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10189     .09186   1.1091   0.267   -.078164      .281936
    Bias-corrected | -.02472     .09186   -0.2691  0.788   -.204769      .155331
            Robust | -.02472     .14298   -0.1729  0.863   -.304956      .255517
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(
> nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |      1613        2013            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.018      70.018
       BW bias (b) |    96.619      96.619
         rho (h/b) |     0.725       0.725
        Unique obs |       318         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0315     .08801   0.3579   0.720   -.141001      .204008
    Bias-corrected |  .02225     .08801   0.2528   0.800    -.15025      .194759
            Robust |  .02225     .10034   0.2218   0.824     -.1744      .218909
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.19921     .20408   -0.9761  0.329   -.599213      .200783
    Bias-corrected | -.71608     .20408   -3.5087  0.000   -1.11608     -.316083
            Robust | -.71608     .68163   -1.0505  0.293   -2.05204      .619882
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19001     .11421   1.6637   0.096   -.033843      .413865
    Bias-corrected |  .11797     .11421   1.0329   0.302   -.105881      .341826
            Robust |  .11797     .21834   0.5403   0.589   -.309958      .545903
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       437         483            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.095      55.095
       BW bias (b) |   101.974     101.974
         rho (h/b) |     0.540       0.540
        Unique obs |       234         241
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17985     .10122   1.7768   0.076   -.018539      .378232
    Bias-corrected |  .20628     .10122   2.0380   0.042    .007896      .404668
            Robust |  .20628     .11662   1.7688   0.077   -.022294      .434858
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00228     .16479   0.0138   0.989   -.320709       .32527
    Bias-corrected | -.38587     .16479   -2.3416  0.019   -.708864     -.062885
            Robust | -.38587     .51514   -0.7491  0.454   -1.39554      .623791
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0543     .11104   0.4890   0.625   -.163334      .271943
    Bias-corrected | -.08211     .11104   -0.7395  0.460   -.299751      .135526
            Robust | -.08211     .15897   -0.5165  0.605   -.393681      .229456
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       951        1302            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.796      64.796
       BW bias (b) |    97.199      97.199
         rho (h/b) |     0.667       0.667
        Unique obs |       313         235
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01428     .10406   -0.1372  0.891   -.218227      .189672
    Bias-corrected | -.05134     .10406   -0.4934  0.622   -.255289       .15261
            Robust | -.05134     .11693   -0.4391  0.661   -.280521      .177841
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        249
-------------------+----------------------            BW type       =     Manual
     Number of obs |       151          98            Kernel        =    Uniform
Eff. Number of obs |       151          98            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12284     .20627   0.5955   0.551   -.281439      .527116
    Bias-corrected |  .12302     .20627   0.5964   0.551    -.28126      .527295
            Robust |  .12302     .49495   0.2485   0.804   -.847064       1.0931
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       432         391            Kernel        =    Uniform
Eff. Number of obs |       432         391            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10053     .07487   -1.3428  0.179   -.247272      .046207
    Bias-corrected |  .05247     .07487   0.7008   0.483   -.094268       .19921
            Robust |  .05247      .1299   0.4039   0.686    -.20212      .307061
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5412
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3680        1732            Kernel        = Epanechnikov
Eff. Number of obs |       889         698            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.163      63.163
       BW bias (b) |   109.712     109.712
         rho (h/b) |     0.576       0.576
        Unique obs |       354         243
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09227     .06717   -1.3736  0.170   -.223921       .03939
    Bias-corrected | -.10672     .06717   -1.5887  0.112   -.238372      .024939
            Robust | -.10672     .08071   -1.3222  0.186   -.264912      .051479
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Earning Sheet 6 results.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *2_2) RDD Higheredu t
. 
. *2_2_1) rdrobust on higheredu, sheet 1, no province no omitting local variables
. 
. **2_2_1_1 Pooled 
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06824     .04713   1.4479   0.148   -.024131       .16061
    Bias-corrected |  .02455     .04713   0.5209   0.602   -.067823      .116919
            Robust |  .02455     .07316   0.3355   0.737   -.118847      .167943
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", replace ctitle(no province no 
> local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02009     .02838   0.7081   0.479   -.035523      .075711
    Bias-corrected |   .0425     .02838   1.4976   0.134   -.013121      .098113
            Robust |   .0425     .04132   1.0284   0.304   -.038497      .123489
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat != ., covs(male tenure t
> enuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      1944        2155            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.310      52.310
       BW bias (b) |    86.837      86.837
         rho (h/b) |     0.602       0.602
        Unique obs |       370         261

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00665     .02506   0.2654   0.791   -.042472      .055777
    Bias-corrected | -.00217     .02506   -0.0866  0.931   -.051296      .046954
            Robust | -.00217     .02923   -0.0743  0.941   -.059465      .055123
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09537     .06532   1.4600   0.144   -.032657      .223406
    Bias-corrected |   .1005     .06532   1.5385   0.124   -.027531      .228532
            Robust |   .1005     .09506   1.0572   0.290   -.085814      .286814
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02627     .04005   0.6560   0.512   -.052216      .104759
    Bias-corrected |  .04375     .04005   1.0925   0.275   -.034736      .122239
            Robust |  .04375     .05793   0.7552   0.450   -.069796      .157299
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat==2), covs(m
> ale tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      1206        1505            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    51.653      51.653
       BW bias (b) |    86.994      86.994
         rho (h/b) |     0.594       0.594
        Unique obs |       320         248

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01094     .03571   0.3064   0.759   -.059047      .080925
    Bias-corrected |   -.002     .03571   -0.0560  0.955   -.071984      .067987
            Robust |   -.002     .04138   -0.0483  0.961   -.083106      .079109
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_3 SecVoc
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0125     .03378   0.3699   0.711    -.05372      .078713
    Bias-corrected | -.02254     .03378   -0.6671  0.505   -.088756      .043677
            Robust | -.02254     .02589   -0.8706  0.384   -.073279        .0282
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01663     .02399   0.6931   0.488   -.030393       .06365
    Bias-corrected |   .0215     .02399   0.8963   0.370   -.025518      .068525
            Robust |   .0215     .03724   0.5775   0.564   -.051482      .094489
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(male tenure te
> nuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       497         541            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.363      60.363
       BW bias (b) |   101.079     101.079
         rho (h/b) |     0.597       0.597
        Unique obs |       236         243

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0019     .01844   0.1030   0.918   -.034248      .038045
    Bias-corrected | -.00087     .01844   -0.0474  0.962    -.03702      .035273
            Robust | -.00087     .02194   -0.0398  0.968   -.043871      .042125
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_4 SecGen
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14456     .08514   1.6979   0.090   -.022315      .311425
    Bias-corrected |   .1573     .08514   1.8476   0.065   -.009566      .324174
            Robust |   .1573     .12509   1.2576   0.209    -.08786      .402469
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02609     .05354   0.4873   0.626    -.07885      .131026
    Bias-corrected |   .0737     .05354   1.3765   0.169   -.031237      .178639
            Robust |   .0737     .07667   0.9613   0.336   -.076568       .22397
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(male tenure te
> nuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |       731         963            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    48.317      48.317
       BW bias (b) |    81.942      81.942
         rho (h/b) |     0.590       0.590
        Unique obs |       315         237

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01376     .04935   0.2788   0.780   -.082962      .110477
    Bias-corrected | -.00339     .04935   -0.0686  0.945   -.100107      .093332
            Robust | -.00339     .05674   -0.0597  0.952     -.1146      .107825
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_5 SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        305
-------------------+----------------------            BW type       =     Manual
     Number of obs |       171         134            Kernel        =    Uniform
Eff. Number of obs |       171         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        879
-------------------+----------------------            BW type       =     Manual
     Number of obs |       452         427            Kernel        =    Uniform
Eff. Number of obs |       452         427            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(male tenure te
> nuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5468
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3700        1768            Kernel        = Epanechnikov
Eff. Number of obs |      3699        1768            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       356         245

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *2_2_2) rdrobust on higheredu, sheet 2, province-clustered no omitting local variables
. 
. **2_2_2_1 Pooled 
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06824     .05762   1.1843   0.236   -.044696      .181174
    Bias-corrected |  .02455     .05762   0.4260   0.670   -.088387      .137483
            Robust |  .02455     .08228   0.2984   0.765   -.136709      .185805
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", replace ctitle(province-cluste
> red no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02009      .0447   0.4496   0.653   -.067511      .107699
    Bias-corrected |   .0425      .0447   0.9507   0.342   -.045109      .130101
            Robust |   .0425     .04772   0.8906   0.373   -.051026      .136017
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat != ., covs(male tenure t
> enuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      2767        2930            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.074      71.074
       BW bias (b) |    91.798      91.798
         rho (h/b) |     0.774       0.774
        Unique obs |       370         261
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01621     .03291   0.4926   0.622   -.048287      .080705
    Bias-corrected | -.00028     .03291   -0.0085  0.993   -.064775      .064218
            Robust | -.00028     .03571   -0.0078  0.994   -.070276      .069719
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09537     .07809   1.2214   0.222   -.057678      .248427
    Bias-corrected |   .1005     .07809   1.2870   0.198   -.052552      .253553
            Robust |   .1005     .10696   0.9396   0.347   -.109136      .310137
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02627     .05959   0.4409   0.659   -.090516      .143059
    Bias-corrected |  .04375     .05959   0.7343   0.463   -.073036      .160538
            Robust |  .04375     .06219   0.7035   0.482   -.078137       .16564
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat==2), covs(m
> ale tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      1581        1983            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.728      66.728
       BW bias (b) |    94.640      94.640
         rho (h/b) |     0.705       0.705
        Unique obs |       320         248
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02156     .04549   0.4740   0.636   -.067595      .110717
    Bias-corrected |  .00047     .04549   0.0104   0.992   -.088683      .089629
            Robust |  .00047     .05049   0.0094   0.993   -.098477      .099423
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_3 SecVoc
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0125     .03155   0.3961   0.692   -.049342      .074334
    Bias-corrected | -.02254     .03155   -0.7144  0.475   -.084377      .039299
            Robust | -.02254     .02828   -0.7971  0.425   -.077959       .03288
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01663      .0229   0.7260   0.468   -.028262      .061519
    Bias-corrected |   .0215      .0229   0.9389   0.348   -.023386      .066394
            Robust |   .0215     .03477   0.6185   0.536   -.046637      .089644
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(male tenure te
> nuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       449         493            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.198      54.198
       BW bias (b) |    94.047      94.047
         rho (h/b) |     0.576       0.576
        Unique obs |       236         243
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00515       .018   0.2861   0.775   -.030137       .04044
    Bias-corrected |   .0026       .018   0.1443   0.885   -.032691      .037886
            Robust |   .0026     .02078   0.1250   0.901   -.038128      .043323
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_4 SecGen
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14456     .09529   1.5170   0.129   -.042208      .331319
    Bias-corrected |   .1573     .09529   1.6508   0.099   -.029459      .344068
            Robust |   .1573     .14152   1.1115   0.266   -.120072       .43468
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02609     .07165   0.3641   0.716   -.114348      .166524
    Bias-corrected |   .0737     .07165   1.0286   0.304   -.066735      .214137
            Robust |   .0737     .08011   0.9200   0.358   -.083304      .230707
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(male tenure te
> nuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |       896        1198            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.212      58.212
       BW bias (b) |    84.644      84.644
         rho (h/b) |     0.688       0.688
        Unique obs |       315         237
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01937     .05873   0.3299   0.741   -.095738      .134486
    Bias-corrected | -.00668     .05873   -0.1137  0.909   -.121789      .108434
            Robust | -.00668     .06516   -0.1025  0.918   -.134389      .121034
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_5 SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        305
-------------------+----------------------            BW type       =     Manual
     Number of obs |       171         134            Kernel        =    Uniform
Eff. Number of obs |       171         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        879
-------------------+----------------------            BW type       =     Manual
     Number of obs |       452         427            Kernel        =    Uniform
Eff. Number of obs |       452         427            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(male tenure te
> nuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5468
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3700        1768            Kernel        = Epanechnikov
Eff. Number of obs |      3699        1768            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       356         245
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *2_2_3) rdrobust on higheredu, sheet 3, no province no Aug-Sep
. 
. **2_2_3_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07183     .05505   1.3048   0.192   -.036066      .179732
    Bias-corrected |  .01875     .05505   0.3406   0.733    -.08915      .126648
            Robust |  .01875      .1013   0.1851   0.853   -.179795      .217294
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", replace ctitle(no province no 
> Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01315     .03005   0.4377   0.662   -.045752      .072059
    Bias-corrected |  .03912     .03005   1.3015   0.193   -.019788      .098022
            Robust |  .03912     .04645   0.8421   0.400   -.051926      .130159
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      1734        1916            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    48.520      48.520
       BW bias (b) |    83.396      83.396
         rho (h/b) |     0.582       0.582
        Unique obs |       369         260

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00075     .02717   -0.0278  0.978   -.054014      .052506
    Bias-corrected | -.01027     .02717   -0.3779  0.705   -.063529       .04299
            Robust | -.01027     .03195   -0.3214  0.748   -.072891      .052352
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09072     .08205   1.1057   0.269   -.070092      .251523
    Bias-corrected |   .1281     .08205   1.5613   0.118   -.032706      .288909
            Robust |   .1281     .14624   0.8760   0.381   -.158526      .414728
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01337     .04344   0.3077   0.758   -.071775      .098508
    Bias-corrected |  .02389     .04344   0.5500   0.582    -.06125      .109034
            Robust |  .02389     .06875   0.3475   0.728   -.110863      .158648
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1060        1329            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.418      47.418
       BW bias (b) |    83.724      83.724
         rho (h/b) |     0.566       0.566
        Unique obs |       319         247

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00338     .03987   -0.0847  0.933   -.081525      .074773
    Bias-corrected | -.01804     .03987   -0.4524  0.651   -.096189      .060109
            Robust | -.01804     .04655   -0.3875  0.698    -.10928        .0732
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03882     .05959   0.6515   0.515   -.077972       .15561
    Bias-corrected | -.04909     .05959   -0.8238  0.410   -.165882      .067699
            Robust | -.04909     .08324   -0.5898  0.555   -.212235      .114052
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02157     .02899   0.7439   0.457   -.035254      .078387
    Bias-corrected |   .0412     .02899   1.4213   0.155   -.015616      .098026
            Robust |   .0412      .0553   0.7451   0.456   -.067178      .149588
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       502         543            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.342      62.342
       BW bias (b) |   109.892     109.892
         rho (h/b) |     0.567       0.567
        Unique obs |       235         242

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    .003     .02084   0.1438   0.886   -.037854      .043848
    Bias-corrected | -.00116     .02084   -0.0554  0.956   -.042006      .039695
            Robust | -.00116     .02503   -0.0462  0.963   -.050209      .047898
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11003     .10573   1.0406   0.298   -.097202      .317254
    Bias-corrected |  .12267     .10573   1.1602   0.246   -.084557        .3299
            Robust |  .12267     .18655   0.6576   0.511   -.242963      .488307
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00302     .05813   -0.0520  0.959   -.116947      .110902
    Bias-corrected |  .02816     .05813   0.4844   0.628   -.085768      .142081
            Robust |  .02816     .09049   0.3111   0.756   -.149205      .205517
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |       584         820            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    42.007      42.007
       BW bias (b) |    76.697      76.697
         rho (h/b) |     0.548       0.548
        Unique obs |       314         236

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00913     .05682   -0.1606  0.872   -.120487      .102232
    Bias-corrected | -.03084     .05682   -0.5428  0.587   -.142198      .080522
            Robust | -.03084     .06536   -0.4718  0.637    -.15894      .097264
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        283
-------------------+----------------------            BW type       =     Manual
     Number of obs |       163         120            Kernel        =    Uniform
Eff. Number of obs |       163         120            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        857
-------------------+----------------------            BW type       =     Manual
     Number of obs |       444         413            Kernel        =    Uniform
Eff. Number of obs |       444         413            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5446
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3692        1754            Kernel        = Epanechnikov
Eff. Number of obs |      3691        1754            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       355         244

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *2_2_4) rdrobust on higheredu, sheet 4, province-clustered no Aug-Sep
. 
. **2_2_4_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster p
> rovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07183     .06296   1.1409   0.254   -.051571      .195237
    Bias-corrected |  .01875     .06296   0.2978   0.766   -.104655      .142153
            Robust |  .01875     .08795   0.2132   0.831   -.153621      .191119
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", replace ctitle(province-cluste
> red no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster p
> rovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01315     .04747   0.2771   0.782   -.079876      .106184
    Bias-corrected |  .03912     .04747   0.8241   0.410   -.053913      .132147
            Robust |  .03912     .05333   0.7335   0.463   -.065412      .143646
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code
> )
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      2292        2498            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.299      61.299
       BW bias (b) |    85.749      85.749
         rho (h/b) |     0.715       0.715
        Unique obs |       369         260
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00422     .03666   0.1150   0.908   -.067635      .076066
    Bias-corrected | -.01221     .03666   -0.3330  0.739   -.084056      .059644
            Robust | -.01221     .04168   -0.2929  0.770   -.093889      .069477
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce
> (nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09072     .08583   1.0569   0.291   -.077516      .258947
    Bias-corrected |   .1281     .08583   1.4924   0.136    -.04013      .296333
            Robust |   .1281      .1219   1.0508   0.293   -.110825      .367028
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce
> (nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01337     .06461   0.2069   0.836   -.113271      .140004
    Bias-corrected |  .02389     .06461   0.3698   0.712   -.102745       .15053
            Robust |  .02389     .07217   0.3311   0.741   -.117557      .165342
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster p
> rovince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1293        1615            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.739      56.739
       BW bias (b) |    88.867      88.867
         rho (h/b) |     0.638       0.638
        Unique obs |       319         247
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00067     .05188   0.0129   0.990   -.101015      .102352
    Bias-corrected | -.02161     .05188   -0.4166  0.677   -.123297       .08007
            Robust | -.02161      .0591   -0.3657  0.715   -.137456      .094228
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03882     .05416   0.7167   0.474   -.067335      .144973
    Bias-corrected | -.04909     .05416   -0.9064  0.365   -.155246      .057063
            Robust | -.04909     .08629   -0.5689  0.569   -.218208      .120025
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02157      .0274   0.7870   0.431   -.032145      .075278
    Bias-corrected |   .0412      .0274   1.5036   0.133   -.012507      .094916
            Robust |   .0412     .05174   0.7964   0.426   -.060203      .142612
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       466         507            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.260      58.260
       BW bias (b) |   101.827     101.827
         rho (h/b) |     0.572       0.572
        Unique obs |       235         242
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00475     .02033   0.2337   0.815   -.035094      .044594
    Bias-corrected |  .00188     .02033   0.0924   0.926   -.037965      .041723
            Robust |  .00188      .0236   0.0796   0.937   -.044381      .048139
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11003     .10006   1.0996   0.271   -.086081      .306133
    Bias-corrected |  .12267     .10006   1.2260   0.220   -.073435      .318778
            Robust |  .12267      .1673   0.7333   0.463   -.205226       .45057
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00302     .07887   -0.0383  0.969   -.157604       .15156
    Bias-corrected |  .02816     .07887   0.3570   0.721   -.126426      .182738
            Robust |  .02816     .09508   0.2961   0.767   -.158205      .214518
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |       707         934            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    48.223      48.223
       BW bias (b) |    79.200      79.200
         rho (h/b) |     0.609       0.609
        Unique obs |       314         236
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01552     .06933   -0.2238  0.823   -.151407      .120371
    Bias-corrected |  -.0431     .06933   -0.6216  0.534   -.178985      .092794
            Robust |  -.0431     .07883   -0.5467  0.585   -.197607      .111416
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        283
-------------------+----------------------            BW type       =     Manual
     Number of obs |       163         120            Kernel        =    Uniform
Eff. Number of obs |       163         120            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        857
-------------------+----------------------            BW type       =     Manual
     Number of obs |       444         413            Kernel        =    Uniform
Eff. Number of obs |       444         413            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5446
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3692        1754            Kernel        = Epanechnikov
Eff. Number of obs |      3691        1754            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       355         244
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *2_2_5) rdrobust on higheredu, sheet 5, no province no July-Oct
. 
. **2_2_5_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09211      .0696   1.3234   0.186   -.044306      .228535
    Bias-corrected |  .04314      .0696   0.6198   0.535   -.093277      .179564
            Robust |  .04314     .15472   0.2789   0.780   -.260092       .34638
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", replace ctitle(no province no 
> July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00968     .03258   0.2970   0.766   -.054179      .073532
    Bias-corrected |  .04277     .03258   1.3128   0.189   -.021085      .106626
            Robust |  .04277     .05485   0.7797   0.436   -.064738       .15028
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      1535        1747            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    45.255      45.255
       BW bias (b) |    81.016      81.016
         rho (h/b) |     0.559       0.559
        Unique obs |       368         259

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00297     .03013   -0.0986  0.921   -.062031      .056087
    Bias-corrected | -.01368     .03013   -0.4539  0.650   -.072736      .045383
            Robust | -.01368     .03575   -0.3825  0.702   -.083752      .056399
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07475     .10733   0.6964   0.486   -.135619      .285125
    Bias-corrected |  .12574     .10733   1.1714   0.241   -.084637      .336108
            Robust |  .12574     .25042   0.5021   0.616   -.365078      .616549
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0026     .04722   -0.0551  0.956   -.095155      .089954
    Bias-corrected | -.01558     .04722   -0.3298  0.742    -.10813      .076979
            Robust | -.01558     .08287   -0.1880  0.851   -.177994      .146843
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |       883        1173            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    42.716      42.716
       BW bias (b) |    79.689      79.689
         rho (h/b) |     0.536       0.536
        Unique obs |       318         246

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01639     .04547   -0.3605  0.718   -.105511      .072725
    Bias-corrected |   -.034     .04547   -0.7478  0.455   -.123118      .055117
            Robust |   -.034     .05333   -0.6375  0.524   -.138526      .070525
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04128     .08896   0.4640   0.643   -.133075      .215635
    Bias-corrected |  -.1729     .08896   -1.9436  0.052   -.347259      .001452
            Robust |  -.1729      .2567   -0.6736  0.501   -.676029      .330222
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0221     .03236   0.6829   0.495   -.041328      .085526
    Bias-corrected |  .04197     .03236   1.2968   0.195   -.021461      .105394
            Robust |  .04197     .07194   0.5834   0.560   -.099026      .182959
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       499         546            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.574      63.574
       BW bias (b) |   116.115     116.115
         rho (h/b) |     0.548       0.548
        Unique obs |       234         241

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00042     .02219   0.0191   0.985   -.043064      .043912
    Bias-corrected | -.00463     .02219   -0.2087  0.835   -.048119      .038858
            Robust | -.00463     .02664   -0.1738  0.862   -.056838      .047578
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13161     .14295   0.9207   0.357   -.148553      .411782
    Bias-corrected |  .22768     .14295   1.5927   0.111   -.052492      .507843
            Robust |  .22768     .32392   0.7029   0.482   -.407202      .862552
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01892     .06416   -0.2949  0.768   -.144672       .10683
    Bias-corrected | -.00257     .06416   -0.0401  0.968   -.128326      .123176
            Robust | -.00257     .11198   -0.0230  0.982   -.222044      .216895
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       510         710            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    38.582      38.582
       BW bias (b) |    75.054      75.054
         rho (h/b) |     0.514       0.514
        Unique obs |       313         235

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02147     .06591   -0.3257  0.745   -.150653      .107721
    Bias-corrected | -.04835     .06591   -0.7336  0.463   -.177539      .080835
            Robust | -.04835     .07617   -0.6348  0.526   -.197645      .100941
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        249
-------------------+----------------------            BW type       =     Manual
     Number of obs |       151          98            Kernel        =    Uniform
Eff. Number of obs |       151          98            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       432         391            Kernel        =    Uniform
Eff. Number of obs |       432         391            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5412
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3680        1732            Kernel        = Epanechnikov
Eff. Number of obs |      3679        1732            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       354         243

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *2_2_6) rdrobust on higheredu, sheet 6, province-clustered no July-Oct
. 
. **2_2_6_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster p
> rovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09211     .08666   1.0629   0.288   -.077738      .261967
    Bias-corrected |  .04314     .08666   0.4978   0.619   -.126709      .212996
            Robust |  .04314     .12785   0.3375   0.736    -.20744      .293728
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", replace ctitle(province-cluste
> red no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster p
> rovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00968     .05253   0.1842   0.854   -.093277       .11263
    Bias-corrected |  .04277     .05253   0.8142   0.416   -.060183      .145724
            Robust |  .04277      .0679   0.6299   0.529   -.090303      .175845
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code
> )
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      1985        2160            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.948      55.948
       BW bias (b) |    86.839      86.839
         rho (h/b) |     0.644       0.644
        Unique obs |       368         259
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00448      .0403   -0.1112  0.911   -.083464      .074505
    Bias-corrected | -.02202      .0403   -0.5464  0.585   -.101003      .056966
            Robust | -.02202     .04661   -0.4724  0.637   -.113366      .069329
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce
> (nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07475     .12366   0.6045   0.546   -.167615      .317121
    Bias-corrected |  .12574     .12366   1.0168   0.309   -.116633      .368103
            Robust |  .12574     .20972   0.5995   0.549    -.28531      .536781
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce
> (nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0026     .07283   -0.0357  0.972   -.145337      .140135
    Bias-corrected | -.01558     .07283   -0.2139  0.831   -.158312       .12716
            Robust | -.01558     .09732   -0.1601  0.873   -.206311       .17516
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster p
> rovince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |      1116        1404            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.514      50.514
       BW bias (b) |    87.476      87.476
         rho (h/b) |     0.577       0.577
        Unique obs |       318         246
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01998     .05998   -0.3331  0.739   -.137546       .09759
    Bias-corrected | -.04431     .05998   -0.7387  0.460   -.161878      .073257
            Robust | -.04431     .06951   -0.6375  0.524   -.180543      .091922
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04128     .08287   0.4982   0.618   -.121134      .203694
    Bias-corrected |  -.1729     .08287   -2.0865  0.037   -.335318     -.010489
            Robust |  -.1729     .26652   -0.6487  0.517   -.695272      .349465
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0221     .03122   0.7078   0.479   -.039095      .083294
    Bias-corrected |  .04197     .03122   1.3441   0.179   -.019228      .103161
            Robust |  .04197     .06729   0.6236   0.533   -.089924      .173858
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       462         511            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.286      59.286
       BW bias (b) |   107.978     107.978
         rho (h/b) |     0.549       0.549
        Unique obs |       234         241
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00258     .02245   0.1148   0.909    -.04143      .046583
    Bias-corrected | -.00172     .02245   -0.0768  0.939   -.045731      .042282
            Robust | -.00172     .02623   -0.0657  0.948   -.053137      .049688
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13161     .16073   0.8188   0.413   -.183412      .446641
    Bias-corrected |  .22768     .16073   1.4165   0.157   -.087351      .542702
            Robust |  .22768     .28856   0.7890   0.430   -.337898      .793248
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01892     .09415   -0.2010  0.841   -.203455      .165613
    Bias-corrected | -.00257     .09415   -0.0273  0.978   -.187109       .18196
            Robust | -.00257     .14329   -0.0180  0.986   -.283412      .278263
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       598         831            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    44.858      44.858
       BW bias (b) |    81.862      81.862
         rho (h/b) |     0.548       0.548
        Unique obs |       313         235
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03296     .08684   -0.3796  0.704   -.203154      .137233
    Bias-corrected | -.06517     .08684   -0.7505  0.453   -.235362      .105025
            Robust | -.06517     .09963   -0.6541  0.513   -.260433      .130095
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        249
-------------------+----------------------            BW type       =     Manual
     Number of obs |       151          98            Kernel        =    Uniform
Eff. Number of obs |       151          98            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster pr
> ovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       432         391            Kernel        =    Uniform
Eff. Number of obs |       432         391            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5412
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3680        1732            Kernel        = Epanechnikov
Eff. Number of obs |      3679        1732            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       354         243
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Tenure contro
> lled/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male 
> Tenure controlled/Urban 1979 Highgen ManualD MaleTenure controlled.log
  log type:  text
 closed on:   6 Aug 2024, 17:29:10
---------------------------------------------------------------------------------------------
