---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8
>  10/Urban tables.log
  log type:  text
 opened on:  24 Oct 2024, 17:42:37

. use "`datapath'", clear

. 
. 
. *Step Zero: A New Dataset for Merging
. 
. gen headsecedu = .
(36,259 missing values generated)

. gen headhighedu = .
(36,259 missing values generated)

. gen spousesecedu = .
(36,259 missing values generated)

. gen spousehighedu = .
(36,259 missing values generated)

. gen headparty = .
(36,259 missing values generated)

. gen spouseparty = .
(36,259 missing values generated)

. gen spouseparentsecedu = .
(36,259 missing values generated)

. gen spouseparenthighedu = .
(36,259 missing values generated)

. gen spouseparentparty = .
(36,259 missing values generated)

. gen headparentsecedu = .
(36,259 missing values generated)

. gen headparenthighedu = .
(36,259 missing values generated)

. gen headparentparty = .
(36,259 missing values generated)

. replace headsecedu = 1 if A02 == 1 & inrange(A13_1, 4, 9)
(6,181 real changes made)

. replace headsecedu = 0 if A02 == 1 & inrange(A13_1, 1, 3)
(5,310 real changes made)

. replace headhighedu = 1 if A02 == 1 & inrange(A13_1, 7, 9)
(3,235 real changes made)

. replace headhighedu = 0 if A02 == 1 & inrange(A13_1, 1, 6)
(8,256 real changes made)

. replace spousesecedu = 1 if A02 == 2 & inrange(A13_1, 4, 9)
(4,780 real changes made)

. replace spousesecedu = 0 if A02 == 2 & inrange(A13_1, 1, 3)
(5,112 real changes made)

. replace spousehighedu = 1 if A02 == 2 & inrange(A13_1, 7, 9)
(2,420 real changes made)

. replace spousehighedu = 0 if A02 == 2 & inrange(A13_1, 1, 6)
(7,472 real changes made)

. replace headparty = 1 if A02 == 1 & A07_1 == 1
(2,477 real changes made)

. replace headparty = 0 if A02 == 1 & inrange(A07_1, 2, 4)
(9,027 real changes made)

. replace spouseparty = 1 if A02 == 2 & A07_1 == 1
(1,231 real changes made)

. replace spouseparty = 0 if A02 == 2 & inrange(A07_1, 2, 4)
(8,672 real changes made)

. replace spouseparentsecedu = 0 if A02 == 5 & inrange(A13_1, 1, 3)
(239 real changes made)

. replace spouseparentsecedu = 1 if A02 == 5 & inrange(A13_1, 4, 9)
(63 real changes made)

. replace spouseparenthighedu = 0 if A02 == 5 & inrange(A13_1, 1, 6)
(289 real changes made)

. replace spouseparenthighedu = 1 if A02 == 5 & inrange(A13_1, 7, 9)
(13 real changes made)

. replace spouseparentparty = 0 if A02 == 5 & inrange(A07_1, 2, 4)
(273 real changes made)

. replace spouseparentparty = 1 if A02 == 5 & A07_1 == 1
(33 real changes made)

. replace headparentsecedu = 0 if A02 == 4 & inrange(A13_1, 1, 3)
(1,208 real changes made)

. replace headparentsecedu = 1 if A02 == 4 & inrange(A13_1, 4, 9)
(308 real changes made)

. replace headparenthighedu = 0 if A02 == 4 & inrange(A13_1, 1, 6)
(1,450 real changes made)

. replace headparenthighedu = 1 if A02 == 4 & inrange(A13_1, 7, 9)
(66 real changes made)

. replace headparentparty = 0 if A02 == 4 & inrange(A07_1, 2, 4)
(1,366 real changes made)

. replace headparentparty = 1 if A02 == 4 & A07_1 == 1
(160 real changes made)

. collapse (max) headsecedu headhighedu spousesecedu spousehighedu headparty spouseparty spou
> separentsecedu spouseparenthighedu spouseparentparty headparentsecedu headparenthighedu hea
> dparentparty, by(hhcode)

. 
. save "`folderpath'/`filename'.dta", replace
file /Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8
    10/Urban tables.dta saved

. 
. *Step One: Variables and Data Processing (See Selmlog Urban Basics for more info)
. 
. use "`datapath'", clear

. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. gen yearat15 = birthyear+15

. local obsnum = _N

. forval i =  1/`obsnum' {
  2.         qui sum yearat15  in `i'
  3.         local yearvalue = round(mod(r(mean),100))
  4.         if inrange(`yearvalue', 0, 9) {
  5.                 local czgrad_year = "czgrad0`yearvalue'"
  6.                 local gzgrad_year = "gzgrad0`yearvalue'"
  7.         }
  8.         else {
  9.                 local czgrad_year = "czgrad`yearvalue'"
 10.                 local gzgrad_year = "gzgrad`yearvalue'"
 11.         }
 12.         if inrange(`yearvalue'+1, 0, 9) {
 13.                 local gzentrant_year = "gzentrant0`=`yearvalue'+1'"
 14.                 local gxentrant_year = "gxentrant0`=`yearvalue'+1'"
 15.                 local vsentrant_year = "vsentrant0`=`yearvalue'+1'"
 16.                 local tsentrant_year = "tsentrant0`=`yearvalue'+1'"
 17.         }
 18.         else{
 19.                 if `yearvalue' == 99 {
 20.                 local gzentrant_year = "gzentrant00"
 21.                 local gxentrant_year = "gxentrant00"
 22.                 local vsentrant_year = "vsentrant00"
 23.                 local tsentrant_year = "tsentrant00"
 24.                 }
 25.         else {
 26.                 local gzentrant_year = "gzentrant`=`yearvalue'+1'"
 27.                 local gxentrant_year = "gxentrant`=`yearvalue'+1'"
 28.                 local vsentrant_year = "vsentrant`=`yearvalue'+1'"
 29.                 local tsentrant_year = "tsentrant`=`yearvalue'+1'"
 30.         }
 31.         }
 32.         capture ds `czgrad_year' `gzgrad_year' `gzentrant_year' `gxentrant_year'
 33.         if _rc == 0 {
 34.                 capture ds ins1_secgen_entrant_relative ins2_highedu_entrant_relative
 35.                 if _rc!=0 {
 36.                         qui gen ins1_secgen_entrant_relative = `gzentrant_year'/`czgrad_
> year' if _n == `i'
 37.                         qui gen ins2_highedu_entrant_relative = `gxentrant_year'/`gzgrad
> _year' if _n == `i'
 38.                 
.                 }
 39.                 else {
 40.                         qui replace ins1_secgen_entrant_relative = `gzentrant_year'/`czg
> rad_year' if _n == `i'
 41.                         qui replace ins2_highedu_entrant_relative = `gxentrant_year'/`gz
> grad_year' if _n == `i'
 42.                 }
 43.         }
 44.         capture ds `czgrad_year' `vsentrant_year'
 45.         if _rc == 0 {
 46.                 capture ds ins3_vs_entrant_relative
 47.                 if _rc!=0 {
 48.                         qui gen ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_year
> ' if _n == `i'
 49.                 }
 50.                 else {
 51.                         qui replace ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_
> year' if _n == `i'
 52.                 }
 53.         }
 54. }

. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. replace province_code = 51 if province_code==.
(2 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.00
         44 |      4,331       11.94       79.95
         50 |      2,115        5.83       85.78
         51 |      2,798        7.72       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. merge m:1 hhcode using "`folderpath'/`filename'.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            36,259  (_merge==3)
    -----------------------------------------

. gen parent_secedu = 0 if (A02==1 & (inrange(H03_R1, 1, 3) | inrange(H03_R2, 1, 3))) | (A02=
> =2 & (inrange(H03_R3, 1, 3) | inrange(H03_R4, 1, 3)))
(25,313 missing values generated)

. replace parent_secedu = 0 if A02 ==3 & (headsecedu == 0 | spousesecedu == 0)
(6,013 real changes made)

. replace parent_secedu = 0 if (A02 == 2 & spouseparentsecedu == 0) | (A02 == 1 & headparents
> ecedu == 0)
(241 real changes made)

. replace parent_secedu=1 if (A02==1 & (inrange(H03_R1, 4, 9) | inrange(H03_R2, 4, 9)))|(A02=
> =2 & (inrange(H03_R3, 4, 9) | inrange(H03_R4, 4, 9)))
(2,797 real changes made)

. replace parent_secedu = 1 if A02 ==3 & (headsecedu == 1 | spousesecedu == 1)
(5,871 real changes made)

. replace parent_secedu = 1 if (A02 == 2 & spouseparentsecedu == 1) | (A02 == 1 & headparents
> ecedu == 1)
(60 real changes made)

. tab parent_secedu

parent_sece |
         du |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,468       60.68       60.68
          1 |      8,728       39.32      100.00
------------+-----------------------------------
      Total |     22,196      100.00

. gen parent_highedu = 0 if (A02==1 & (inrange(H03_R1, 1, 6) | inrange(H03_R2, 1, 6))) | (A02
> ==2 & (inrange(H03_R3, 1, 6) | inrange(H03_R4, 1, 6)))
(24,480 missing values generated)

. replace parent_highedu = 0 if A02 == 3 & (headhighedu == 0 | spousehighedu == 0)
(8,028 real changes made)

. replace parent_highedu = 0 if (A02 == 2 & spouseparenthighedu == 0) | (A02 == 1 & headparen
> thighedu == 0)
(256 real changes made)

. replace parent_highedu=1 if (A02==1 & (inrange(H03_R1, 7, 9) | inrange(H03_R2, 7, 9)))|(A02
> ==2 & (inrange(H03_R3, 7, 9) | inrange(H03_R4, 7, 9)))
(546 real changes made)

. replace parent_highedu = 1 if A02 == 3 & (headhighedu == 1 | spousehighedu == 1)
(3,206 real changes made)

. replace parent_highedu = 1 if (A02 == 2 & spouseparenthighedu == 1) | (A02 == 1 & headparen
> thighedu == 1)
(18 real changes made)

. tab parent_highedu

parent_high |
        edu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,426       83.01       83.01
          1 |      3,770       16.99      100.00
------------+-----------------------------------
      Total |     22,196      100.00

. gen parent_partymember = 0 if ((A02==1 & (inrange(H07_R1, 2, 4) | inrange(H07_R2, 2, 4))) |
>  (A02==2 & (inrange(H07_R3, 2, 4) | inrange(H07_R4, 2, 4))))
(24,599 missing values generated)

. replace parent_partymember = 0 if A02 == 3 & (headparty == 0 | spouseparty == 0)
(9,506 real changes made)

. replace parent_partymember = 0 if (A02 == 2 & spouseparentparty == 0) | (A02 == 1 & headpar
> entparty == 0)
(246 real changes made)

. replace parent_partymember=1 if (A02==1 & (H07_R1 == 1 | H07_R2 == 1)) | (A02==2 & (H07_R3 
> == 1 | H07_R4 == 1))
(2,132 real changes made)

. replace parent_partymember = 1 if A02 == 3 & (headparty == 1 | spouseparty == 1)
(2,343 real changes made)

. replace parent_partymember = 1 if (A02 == 2 & spouseparentparty == 1) | (A02 == 1 & headpar
> entparty == 1)
(42 real changes made)

. tab parent_partymember

parent_part |
    ymember |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,694       79.66       79.66
          1 |      4,517       20.34      100.00
------------+-----------------------------------
      Total |     22,211      100.00

. gen Keyschool = 0 if A14 != .

. replace Keyschool = 1 if inrange(A14, 1, 3)
(5,933 real changes made)

. gen TakeGaoKao = 1 if A15_1 == 1
(27,995 missing values generated)

. replace TakeGaoKao = 0 if A15_1 == 2
(22,524 real changes made)

. tab TakeGaoKao

 TakeGaoKao |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,524       73.16       73.16
          1 |      8,264       26.84      100.00
------------+-----------------------------------
      Total |     30,788      100.00

. tab TakeGaoKao educat

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |     2,910      3,884      8,219 |    15,013 
         1 |       631      7,499         80 |     8,210 
-----------+---------------------------------+----------
     Total |     3,541     11,383      8,299 |    23,223 

. tab TakeGaoKao educat if male==1

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |     1,459      2,029      4,141 |     7,629 
         1 |       324      3,958         41 |     4,323 
-----------+---------------------------------+----------
     Total |     1,783      5,987      4,182 |    11,952 

. tab TakeGaoKao educat if male==0

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |     1,451      1,855      4,078 |     7,384 
         1 |       307      3,541         39 |     3,887 
-----------+---------------------------------+----------
     Total |     1,758      5,396      4,117 |    11,271 

. gen unemp_A20_5 = 1 if A20 == 5
(35,581 missing values generated)

. replace unemp_A20_5 = 0 if inrange(A20, 1, 4) | inrange(A20, 6, 9)
(34,591 real changes made)

. gen voc_unemp_A20_5 = unemp_A20_5 if educat == 1
(32,694 missing values generated)

. gen gen_unemp_A20_5 = unemp_A20_5 if educat == 2
(24,957 missing values generated)

. gen unemp_A20_59 = unemp_A20_5
(990 missing values generated)

. replace unemp_A20_59 = 1 if A20 == 9
(3,949 real changes made)

. gen voc_unemp_A20_59 = unemp_A20_59 if educat == 1
(32,694 missing values generated)

. gen gen_unemp_A20_59 = unemp_A20_59 if educat == 2
(24,957 missing values generated)

. gen highocc = 1 if C03_4 == 1 | C03_4 == 2
(32,049 missing values generated)

. replace highocc = 0 if inrange(C03_4, 3, 8)
(14,667 real changes made)

. gen voc_highocc = highocc if educat == 1
(33,436 missing values generated)

. gen gen_highocc = highocc if educat == 2
(28,151 missing values generated)

. gen longtermcontract = 1 if C07_1 == 1 | C07_1 == 2
(29,167 missing values generated)

. replace longtermcontract = 0 if inrange(C07_1, 3, 5)
(8,506 real changes made)

. gen voc_longtermcontract= longtermcontract if educat == 1
(33,791 missing values generated)

. gen gen_longtermcontract = longtermcontract if educat == 2
(28,951 missing values generated)

. sum unemp_A20_5, d

                         unemp_A20_5
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              35,269
25%            0              0       Sum of wgt.      35,269

50%            0                      Mean           .0192237
                        Largest       Std. dev.      .1373123
75%            0              1
90%            0              1       Variance       .0188547
95%            0              1       Skewness       7.002769
99%            1              1       Kurtosis       50.03877

. sum unemp_A20_59, d

                        unemp_A20_59
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              35,269
25%            0              0       Sum of wgt.      35,269

50%            0                      Mean           .1311917
                        Largest       Std. dev.      .3376147
75%            0              1
90%            1              1       Variance       .1139837
95%            1              1       Skewness       2.184819
99%            1              1       Kurtosis       5.773435

. sum highocc, d

                           highocc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              18,877
25%            0              0       Sum of wgt.      18,877

50%            0                      Mean           .2230227
                        Largest       Std. dev.      .4162845
75%            0              1
90%            1              1       Variance       .1732928
95%            1              1       Skewness       1.330747
99%            1              1       Kurtosis       2.770887

. sum longtermcontract, d

                      longtermcontract
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              15,598
25%            0              0       Sum of wgt.      15,598

50%            0                      Mean           .4546737
                        Largest       Std. dev.      .4979572
75%            1              1
90%            1              1       Variance       .2479614
95%            1              1       Skewness       .1820549
99%            1              1       Kurtosis       1.033144

. gen bornafter79=1 if birthyear>=1980 & birthyear<=2018
(18,574 missing values generated)

. replace bornafter79=0 if birthyear<1980 & birthyear>0
(18,574 real changes made)

. gen highvocafter79=highvocedu*bornafter79

. gen highgenafter79=highgenedu*bornafter79

. gen adulteduafter79=adultedu*bornafter79

. gen highereduafter79=higheredu*bornafter79

. 
. ***To label used variables (m1 m2 m3 need to be labelled afterwords, before generating tabl
> es again, because we drop m1 m2 m3 during regressing)
. local variablenames male exp expsqr higheredu highvocedu highgenedu adultedu highereduafter
> 79 TakeGaoKao parent_secedu parent_highedu parent_partymember

. local variablelabels ""Sex (male=1)" "Experience (years)" "Experience squared (years)" "Any
>  higher ed degree (yes=1)" "Higher voc ed degree (yes=1)" "University degree (yes=1)" "Adul
> t continuing ed degree (yes=1)" "Any higher ed degree * born after 1979 birth cohort" "Univ
> ersity entrance exam (took exam=1)" "Parent with upper secondary degree (yes=1)" "Parent wi
> th higher ed degree (yes=1)" "Parent party member (yes=1)""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. 
. 
. *Step Two: Graphing Regressions & Output
. 
. ***Table 2 with sequence: Two_tracks > Higher_edu Combined/Seperated > Gender(s), 2*2*3=12 
> columns in total.
. 
. 
. local folderpath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 
> 2 4 6 8 10"

. local filename "Urban tables"

. local datapath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/20240716 Urban 
> Chip2018 and Instrumental Statistics and Inflation.dta"

. 
. 
. local xlspath "`folderpath'/`filename'.xls"

. 
. eststo clear

. 
. **Below are columns 1-3
. 
. selmlog voc_log_monthlyearning male exp expsqr higheredu provincedum2-provincedum15 if inra
> nge(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsq
> r ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(
> 2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,063
-------------+----------------------------------   F(21, 2041)     =     15.62
       Model |  118.698363        21    5.652303   Prob > F        =    0.0000
    Residual |  738.370257     2,041  .361768867   R-squared       =    0.1385
-------------+----------------------------------   Adj R-squared   =    0.1296
       Total |   857.06862     2,062  .415649185   Root MSE        =    .60147

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .2110356   .0356817     5.91   0.000     .1410592    .2810119
          exp |   .0509658   .0294617     1.73   0.084    -.0068123    .1087439
       expsqr |  -.0014325   .0008713    -1.64   0.100    -.0031412    .0002762
    higheredu |   .3335894   .0303048    11.01   0.000     .2741579    .3930209
 provincedum2 |  -.4024547   .0782113    -5.15   0.000     -.555837   -.2490724
 provincedum3 |   -.329365   .0826795    -3.98   0.000    -.4915099   -.1672201
 provincedum4 |  -.3672796   .0757031    -4.85   0.000     -.515743   -.2188162
 provincedum5 |   .0355883   .0700662     0.51   0.612    -.1018204    .1729969
 provincedum6 |   -.126891   .0862173    -1.47   0.141    -.2959741    .0421922
 provincedum7 |  -.1437312   .0752191    -1.91   0.056    -.2912454    .0037831
 provincedum8 |  -.2915746   .0781222    -3.73   0.000    -.4447821   -.1383671
 provincedum9 |  -.0709441   .0737111    -0.96   0.336     -.215501    .0736128
provincedum10 |  -.1453347   .0731471    -1.99   0.047    -.2887854   -.0018839
provincedum11 |   .0489819   .0697749     0.70   0.483    -.0878555    .1858193
provincedum12 |  -.2284973   .0792372    -2.88   0.004    -.3838914   -.0731031
provincedum13 |  -.0313868   .0774105    -0.41   0.685    -.1831986    .1204251
provincedum14 |  -.2927369   .0852522    -3.43   0.001    -.4599274   -.1255464
provincedum15 |  -.1551623   .0946997    -1.64   0.101    -.3408803    .0305558
          _m1 |   .3689883   .2312918     1.60   0.111    -.0846043     .822581
          _m2 |  -1.344337   .6758616    -1.99   0.047    -2.669787   -.0188863
          _m3 |  -1.145537   .5715952    -2.00   0.045    -2.266508   -.0245662
        _cons |   6.343703   .8721126     7.27   0.000      4.63338    8.054027
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .9783419          .        .       .            .           .
        rho1 |   .3730502          .        .       .            .           .
        rho2 |  -1.359136          .        .       .            .           .
        rho3 |  -1.158147          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu provincedum2-provincedum15 m1 
> m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. eststo 
(est1 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of voc_log_monthlyearning

H0: Constant variance

    chi2(1) =   1.08
Prob > chi2 = 0.2996

. local het_p = r(p)

. local het_df = r(df)

. sum voc_log_monthlyearning male exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      2,063     8.31855    .6447086   5.521461   10.12663
        male |      2,063    .5094523    .5000319          0          1
         exp |      2,063    17.87349    6.449986          1         32
      expsqr |      2,063    361.0436    235.3402          1       1024
   higheredu |      2,063    .3044111    .4602691          0          1
-------------+---------------------------------------------------------
          m1 |      2,063    1.125546    .1784658   .8143778    1.98121
          m2 |      2,063   -.5321525    .1428741   -.726001  -.0397592
          m3 |      2,063   -.3377138    .1875969  -.7252195  -.0051956

. outreg2 using "`xlspath'", replace ctitle(Sec Voc, All Gender, Non-specified Higheredu, Pro
> vince Dum) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 if male==1 &
>  inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp 
> expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative)
>  dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -5728.6772
Iteration 1:  Log likelihood = -4866.6828
Iteration 2:  Log likelihood = -4802.6497
Iteration 3:  Log likelihood =  -4796.833
Iteration 4:  Log likelihood = -4796.7459
Iteration 5:  Log likelihood = -4796.7459

Multinomial logistic regression                   Number of obs   =       5615
                                                  LR chi2(10)     =    1863.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -4796.7459                       Pseudo R2       =     0.1627

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |   .3346149    .033643     9.95   0.000     .2686759    .4005539
      expsqr |  -.0064558   .0008564    -7.54   0.000    -.0081343   -.0047773
ins1_secge~e |    3.54565   .5799686     6.11   0.000     2.408932    4.682368
ins2_highe~e |   .2686378   .1189817     2.26   0.024     .0354379    .5018377
ins3_vs_en~e |   .4630486   .5493956     0.84   0.399     -.613747    1.539844
       _cons |  -5.833726   .4271537   -13.66   0.000    -6.670932   -4.996521
-------------+----------------------------------------------------------------
3            |
         exp |   .5674049    .041221    13.76   0.000     .4866133    .6481965
      expsqr |  -.0071321   .0009344    -7.63   0.000    -.0089634   -.0053007
ins1_secge~e |   9.676755   .6198538    15.61   0.000     8.461864    10.89165
ins2_highe~e |   .3983786   .1227425     3.25   0.001     .1578077    .6389495
ins3_vs_en~e |   .4109329   .5833055     0.70   0.481    -.7323247    1.554191
       _cons |  -11.61776   .5542328   -20.96   0.000    -12.70403   -10.53148
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,051
-------------+----------------------------------   F(20, 1030)     =      4.92
       Model |  37.1164323        20  1.85582162   Prob > F        =    0.0000
    Residual |  388.716443     1,030  .377394605   R-squared       =    0.0872
-------------+----------------------------------   Adj R-squared   =    0.0694
       Total |  425.832875     1,050  .405555119   Root MSE        =    .61432

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   .0442812    .051803     0.85   0.393    -.0573702    .1459327
       expsqr |  -.0012408   .0016683    -0.74   0.457    -.0045145    .0020329
    higheredu |   .2591401   .0445298     5.82   0.000     .1717607    .3465196
 provincedum2 |  -.2700157    .121012    -2.23   0.026     -.507474   -.0325575
 provincedum3 |  -.1677645   .1284622    -1.31   0.192    -.4198419     .084313
 provincedum4 |  -.1960388   .1128982    -1.74   0.083    -.4175756     .025498
 provincedum5 |   .1688669   .1074846     1.57   0.116    -.0420469    .3797807
 provincedum6 |   .0867966   .1329773     0.65   0.514    -.1741409     .347734
 provincedum7 |  -.0702568   .1187522    -0.59   0.554    -.3032807    .1627671
 provincedum8 |  -.1867681   .1250699    -1.49   0.136    -.4321891    .0586528
 provincedum9 |   .0518185   .1143232     0.45   0.650    -.1725144    .2761514
provincedum10 |  -.1473508    .120255    -1.23   0.221    -.3833235     .088622
provincedum11 |   .1598838   .1097577     1.46   0.146    -.0554904     .375258
provincedum12 |  -.1220773   .1201335    -1.02   0.310    -.3578117    .1136571
provincedum13 |  -.0403223   .1225475    -0.33   0.742    -.2807937    .2001491
provincedum14 |   -.339403   .1348309    -2.52   0.012    -.6039776   -.0748285
provincedum15 |  -.0831845   .1471069    -0.57   0.572    -.3718479    .2054788
          _m1 |   .3844092    .479056     0.80   0.422    -.5556279    1.324446
          _m2 |  -1.577429    1.37108    -1.15   0.250    -4.267859    1.113001
          _m3 |   -1.38742   1.241585    -1.12   0.264    -3.823746    1.048905
        _cons |   6.310743   1.881925     3.35   0.001     2.617898    10.00359
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.212124          .        .       .            .           .
        rho1 |   .3491566          .        .       .            .           .
        rho2 |  -1.432769          .        .       .            .           .
        rho3 |  -1.260185          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3
>  if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. eststo 
(est2 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of voc_log_monthlyearning

H0: Constant variance

    chi2(1) =   0.06
Prob > chi2 = 0.8037

. local het_p = r(p)

. local het_df = r(df)

. sum voc_log_monthlyearning exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,051    8.437622    .6368321   5.521461   10.12663
         exp |      1,051    17.81446    6.410023          4         32
      expsqr |      1,051    358.4044    232.9682         16       1024
   higheredu |      1,051     .282588    .4504721          0          1
          m1 |      1,051    1.153466     .172252   .8625615   2.047997
-------------+---------------------------------------------------------
          m2 |      1,051   -.5389283    .1420744   -.726002  -.0366317
          m3 |      1,051   -.3387716    .1864332  -.7256799  -.0092626

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Male, Non-specified Higheredu, Province D
> um) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 if male==0 &
>  inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp 
> expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative)
>  dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -5055.8576
Iteration 1:  Log likelihood = -4297.4227
Iteration 2:  Log likelihood =  -4235.419
Iteration 3:  Log likelihood = -4228.8483
Iteration 4:  Log likelihood = -4228.7204
Iteration 5:  Log likelihood = -4228.7203

Multinomial logistic regression                   Number of obs   =       4897
                                                  LR chi2(10)     =    1654.27
                                                  Prob > chi2     =     0.0000
Log likelihood = -4228.7203                       Pseudo R2       =     0.1636

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |   .3425434   .0343131     9.98   0.000     .2752909    .4097958
      expsqr |  -.0067418   .0008725    -7.73   0.000    -.0084519   -.0050316
ins1_secge~e |   2.947418   .5838224     5.05   0.000     1.803147    4.091689
ins2_highe~e |   .0131145   .1241387     0.11   0.916     -.230193    .2564219
ins3_vs_en~e |    1.19774   .5660029     2.12   0.034     .0883947    2.307085
       _cons |  -5.566881   .4279263   -13.01   0.000    -6.405602   -4.728161
-------------+----------------------------------------------------------------
3            |
         exp |   .6415311   .0445191    14.41   0.000     .5542752     .728787
      expsqr |  -.0093472    .001007    -9.28   0.000    -.0113209   -.0073736
ins1_secge~e |   8.150034   .6393358    12.75   0.000     6.896959    9.403109
ins2_highe~e |   .5980405   .1352367     4.42   0.000     .3329815    .8630996
ins3_vs_en~e |   -2.07414    .645978    -3.21   0.001    -3.340233    -.808046
       _cons |  -11.20186   .5767557   -19.42   0.000    -12.33228   -10.07144
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,012
-------------+----------------------------------   F(20, 991)      =      9.72
       Model |  65.7448448        20  3.28724224   Prob > F        =    0.0000
    Residual |  335.114128       991  .338157546   R-squared       =    0.1640
-------------+----------------------------------   Adj R-squared   =    0.1471
       Total |  400.858973     1,011    .3964975   Root MSE        =    .58151

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   .0780829   .0375246     2.08   0.038     .0044461    .1517196
       expsqr |  -.0022243   .0010195    -2.18   0.029     -.004225   -.0002236
    higheredu |   .3929823   .0409719     9.59   0.000     .3125806     .473384
 provincedum2 |  -.5283826   .1041555    -5.07   0.000    -.7327733   -.3239919
 provincedum3 |  -.4654802     .11485    -4.05   0.000    -.6908574    -.240103
 provincedum4 |  -.5278723   .1037647    -5.09   0.000     -.731496   -.3242485
 provincedum5 |  -.0983435   .0967644    -1.02   0.310    -.2882302    .0915431
 provincedum6 |  -.3058892    .113661    -2.69   0.007    -.5289331   -.0828453
 provincedum7 |   -.209639    .097453    -2.15   0.032    -.4008769   -.0184011
 provincedum8 |  -.3896806   .1012861    -3.85   0.000    -.5884405   -.1909206
 provincedum9 |  -.1894418   .0997625    -1.90   0.058    -.3852119    .0063283
provincedum10 |   -.148556   .0948572    -1.57   0.118    -.3347001    .0375881
provincedum11 |  -.0590761   .0916688    -0.64   0.519    -.2389633     .120811
provincedum12 |  -.3207789     .10576    -3.03   0.002    -.5283182   -.1132395
provincedum13 |   -.014037   .1007639    -0.14   0.889    -.2117722    .1836982
provincedum14 |  -.2501623   .1119529    -2.23   0.026    -.4698542   -.0304704
provincedum15 |  -.2215975   .1282423    -1.73   0.084    -.4732551    .0300602
          _m1 |   .5367864    .252415     2.13   0.034     .0414571    1.032116
          _m2 |   -1.01489   .7079498    -1.43   0.152    -2.404143    .3743626
          _m3 |  -.8659631    .553549    -1.56   0.118    -1.952226    .2202998
        _cons |   6.291111   .8338479     7.54   0.000     4.654801    7.927422
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .8114962          .        .       .            .           .
        rho1 |   .5958792          .        .       .            .           .
        rho2 |  -1.126616          .        .       .            .           .
        rho3 |  -.9612938          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3
>  if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. eststo 
(est3 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of voc_log_monthlyearning

H0: Constant variance

    chi2(1) =  28.65
Prob > chi2 = 0.0000

. local het_p = r(p)

. local het_df = r(df)

. sum voc_log_monthlyearning male exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,012    8.194889    .6296805   5.521461   10.05764
        male |      1,012           0           0          0          0
         exp |      1,012    17.93478     6.49383          1         32
      expsqr |      1,012    363.7846    237.8628          1       1024
   higheredu |      1,012    .3270751    .4693769          0          1
-------------+---------------------------------------------------------
          m1 |      1,012    1.094195    .1843831    .716741   1.966683
          m2 |      1,012   -.5244179    .1441819  -.7259927  -.0660745
          m3 |      1,012   -.3357755    .1903012  -.7259893  -.0039632

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Female, Non-specified Higheredu, Province
>  Dum) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. **Below are columns 4-6
. 
. selmlog voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu provincedum2-
> provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(
> educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_e
> ntrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,063
-------------+----------------------------------   F(23, 2039)     =     15.17
       Model |  125.219598        23  5.44433035   Prob > F        =    0.0000
    Residual |  731.849022     2,039  .358925465   R-squared       =    0.1461
-------------+----------------------------------   Adj R-squared   =    0.1365
       Total |   857.06862     2,062  .415649185   Root MSE        =     .5991

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .2115767   .0355487     5.95   0.000     .1418612    .2812922
          exp |   .0480332   .0294299     1.63   0.103    -.0096826    .1057489
       expsqr |  -.0014063   .0008694    -1.62   0.106    -.0031114    .0002987
   highvocedu |   .2215294   .0436395     5.08   0.000     .1359467    .3071121
   highgenedu |   .5649429   .0802164     7.04   0.000     .4076282    .7222576
     adultedu |   .3730497   .0381526     9.78   0.000     .2982276    .4478718
 provincedum2 |  -.3817714   .0780622    -4.89   0.000    -.5348613   -.2286814
 provincedum3 |  -.3156642   .0824635    -3.83   0.000    -.4773856   -.1539427
 provincedum4 |  -.3465216    .075613    -4.58   0.000    -.4948083   -.1982348
 provincedum5 |   .0582611   .0700306     0.83   0.406     -.079078    .1956001
 provincedum6 |  -.1123068   .0859471    -1.31   0.191    -.2808601    .0562466
 provincedum7 |  -.1339494   .0751601    -1.78   0.075     -.281348    .0134493
 provincedum8 |  -.2734299   .0779751    -3.51   0.000     -.426349   -.1205107
 provincedum9 |    -.05569   .0735112    -0.76   0.449    -.1998549    .0884749
provincedum10 |  -.1260023   .0730031    -1.73   0.085    -.2691708    .0171661
provincedum11 |    .066454    .069656     0.95   0.340    -.0701504    .2030584
provincedum12 |   -.212628   .0790173    -2.69   0.007    -.3675912   -.0576649
provincedum13 |  -.0142784   .0772408    -0.18   0.853    -.1657576    .1372007
provincedum14 |   -.280138   .0849991    -3.30   0.001    -.4468321   -.1134438
provincedum15 |  -.1523108   .0943293    -1.61   0.107    -.3373027     .032681
          _m1 |   .3851241   .2304315     1.67   0.095    -.0667817    .8370299
          _m2 |  -1.405667   .6735926    -2.09   0.037    -2.726668   -.0846655
          _m3 |  -1.231011   .5698255    -2.16   0.031    -2.348512   -.1135104
        _cons |   6.291468   .8694347     7.24   0.000     4.586395    7.996541
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.049269          .        .       .            .           .
        rho1 |   .3759736          .        .       .            .           .
        rho2 |  -1.372268          .        .       .            .           .
        rho3 |  -1.201763          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu provinced
> um2-provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250,
>  25000)

. eststo
(est4 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of voc_log_monthlyearning

H0: Constant variance

    chi2(1) =   2.34
Prob > chi2 = 0.1258

. local het_p = r(p)

. local het_df = r(df)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sam
> ple)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      2,063     8.31855    .6447086   5.521461   10.12663
        male |      2,063    .5094523    .5000319          0          1
         exp |      2,063    17.87349    6.449986          1         32
      expsqr |      2,063    361.0436    235.3402          1       1024
  highvocedu |      2,063    .1158507    .3201234          0          1
-------------+---------------------------------------------------------
  highgenedu |      2,063    .0290839    .1680824          0          1
    adultedu |      2,063    .1594765    .3662086          0          1
          m1 |      2,063    1.125546    .1784658   .8143778    1.98121
          m2 |      2,063   -.5321525    .1428741   -.726001  -.0397592
          m3 |      2,063   -.3377138    .1875969  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Sec Voc, All Gender, Specified Higheredu, Province
>  Dum) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-provi
> ncedum15 if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000),
>  sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3
> _vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -5728.6772
Iteration 1:  Log likelihood = -4866.6828
Iteration 2:  Log likelihood = -4802.6497
Iteration 3:  Log likelihood =  -4796.833
Iteration 4:  Log likelihood = -4796.7459
Iteration 5:  Log likelihood = -4796.7459

Multinomial logistic regression                   Number of obs   =       5615
                                                  LR chi2(10)     =    1863.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -4796.7459                       Pseudo R2       =     0.1627

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |   .3346149    .033643     9.95   0.000     .2686759    .4005539
      expsqr |  -.0064558   .0008564    -7.54   0.000    -.0081343   -.0047773
ins1_secge~e |    3.54565   .5799686     6.11   0.000     2.408932    4.682368
ins2_highe~e |   .2686378   .1189817     2.26   0.024     .0354379    .5018377
ins3_vs_en~e |   .4630486   .5493956     0.84   0.399     -.613747    1.539844
       _cons |  -5.833726   .4271537   -13.66   0.000    -6.670932   -4.996521
-------------+----------------------------------------------------------------
3            |
         exp |   .5674049    .041221    13.76   0.000     .4866133    .6481965
      expsqr |  -.0071321   .0009344    -7.63   0.000    -.0089634   -.0053007
ins1_secge~e |   9.676755   .6198538    15.61   0.000     8.461864    10.89165
ins2_highe~e |   .3983786   .1227425     3.25   0.001     .1578077    .6389495
ins3_vs_en~e |   .4109329   .5833055     0.70   0.481    -.7323247    1.554191
       _cons |  -11.61776   .5542328   -20.96   0.000    -12.70403   -10.53148
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,051
-------------+----------------------------------   F(22, 1028)     =      5.00
       Model |  41.1632466        22  1.87105666   Prob > F        =    0.0000
    Residual |  384.669628     1,028  .374192246   R-squared       =    0.0967
-------------+----------------------------------   Adj R-squared   =    0.0773
       Total |  425.832875     1,050  .405555119   Root MSE        =    .61171

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   .0299283   .0518218     0.58   0.564    -.0717604     .131617
       expsqr |  -.0008264   .0016668    -0.50   0.620    -.0040971    .0024442
   highvocedu |   .1555696   .0625182     2.49   0.013     .0328919    .2782474
   highgenedu |   .5838618   .1239649     4.71   0.000     .3406087    .8271149
     adultedu |   .2854681   .0573958     4.97   0.000     .1728419    .3980943
 provincedum2 |  -.2537852    .120732    -2.10   0.036    -.4906945   -.0168759
 provincedum3 |  -.1632324   .1283029    -1.27   0.204    -.4149979     .088533
 provincedum4 |  -.1822737   .1129391    -1.61   0.107    -.4038912    .0393438
 provincedum5 |   .1838064    .107497     1.71   0.088    -.0271322    .3947449
 provincedum6 |   .0958543   .1326356     0.72   0.470    -.1644131    .3561218
 provincedum7 |  -.0707809   .1188753    -0.60   0.552    -.3040469    .1624852
 provincedum8 |  -.1761705    .124941    -1.41   0.159    -.4213391    .0689981
 provincedum9 |   .0648004   .1139586     0.57   0.570    -.1588177    .2884185
provincedum10 |  -.1268676   .1200362    -1.06   0.291    -.3624115    .1086764
provincedum11 |   .1702006   .1097896     1.55   0.121    -.0452368    .3856379
provincedum12 |  -.1108498   .1199115    -0.92   0.355    -.3461489    .1244494
provincedum13 |  -.0304216   .1222319    -0.25   0.804    -.2702741     .209431
provincedum14 |  -.3242635   .1343508    -2.41   0.016    -.5878968   -.0606303
provincedum15 |  -.0760424   .1464979    -0.52   0.604    -.3635116    .2114267
          _m1 |   .2778841   .4781271     0.58   0.561    -.6603325    1.216101
          _m2 |    -1.3385   1.367646    -0.98   0.328    -4.022197    1.345198
          _m3 |  -1.183816    1.23794    -0.96   0.339    -3.612993    1.245361
        _cons |    6.72834   1.878596     3.58   0.000      3.04202    10.41466
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .9581917          .        .       .            .           .
        rho1 |   .2838818          .        .       .            .           .
        rho2 |  -1.367389          .        .       .            .           .
        rho3 |  -1.209367          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-p
> rovincedum15 m1 m2 m3 if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning,
>  250, 25000)

. eststo
(est5 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of voc_log_monthlyearning

H0: Constant variance

    chi2(1) =   0.86
Prob > chi2 = 0.3533

. local het_p = r(p)

. local het_df = r(df)

. sum voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,051    8.437622    .6368321   5.521461   10.12663
         exp |      1,051    17.81446    6.410023          4         32
      expsqr |      1,051    358.4044    232.9682         16       1024
  highvocedu |      1,051    .1151284    .3193288          0          1
  highgenedu |      1,051    .0247383    .1554006          0          1
-------------+---------------------------------------------------------
    adultedu |      1,051    .1427212    .3499549          0          1
          m1 |      1,051    1.153466     .172252   .8625615   2.047997
          m2 |      1,051   -.5389283    .1420744   -.726002  -.0366317
          m3 |      1,051   -.3387716    .1864332  -.7256799  -.0092626

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Male, Specified Higheredu, Province Dum) 
> pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-provi
> ncedum15 if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000),
>  sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3
> _vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -5055.8576
Iteration 1:  Log likelihood = -4297.4227
Iteration 2:  Log likelihood =  -4235.419
Iteration 3:  Log likelihood = -4228.8483
Iteration 4:  Log likelihood = -4228.7204
Iteration 5:  Log likelihood = -4228.7203

Multinomial logistic regression                   Number of obs   =       4897
                                                  LR chi2(10)     =    1654.27
                                                  Prob > chi2     =     0.0000
Log likelihood = -4228.7203                       Pseudo R2       =     0.1636

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |   .3425434   .0343131     9.98   0.000     .2752909    .4097958
      expsqr |  -.0067418   .0008725    -7.73   0.000    -.0084519   -.0050316
ins1_secge~e |   2.947418   .5838224     5.05   0.000     1.803147    4.091689
ins2_highe~e |   .0131145   .1241387     0.11   0.916     -.230193    .2564219
ins3_vs_en~e |    1.19774   .5660029     2.12   0.034     .0883947    2.307085
       _cons |  -5.566881   .4279263   -13.01   0.000    -6.405602   -4.728161
-------------+----------------------------------------------------------------
3            |
         exp |   .6415311   .0445191    14.41   0.000     .5542752     .728787
      expsqr |  -.0093472    .001007    -9.28   0.000    -.0113209   -.0073736
ins1_secge~e |   8.150034   .6393358    12.75   0.000     6.896959    9.403109
ins2_highe~e |   .5980405   .1352367     4.42   0.000     .3329815    .8630996
ins3_vs_en~e |   -2.07414    .645978    -3.21   0.001    -3.340233    -.808046
       _cons |  -11.20186   .5767557   -19.42   0.000    -12.33228   -10.07144
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,012
-------------+----------------------------------   F(22, 989)      =      9.24
       Model |  68.3249417        22  3.10567917   Prob > F        =    0.0000
    Residual |  332.534031       989   .33623259   R-squared       =    0.1704
-------------+----------------------------------   Adj R-squared   =    0.1520
       Total |  400.858973     1,011    .3964975   Root MSE        =    .57986

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   .0750612   .0375563     2.00   0.046     .0013621    .1487603
       expsqr |  -.0021922   .0010198    -2.15   0.032    -.0041935   -.0001909
   highvocedu |   .2739653   .0605423     4.53   0.000     .1551592    .3927713
   highgenedu |   .5203471   .1043397     4.99   0.000     .3155944    .7250998
     adultedu |   .4462958   .0505743     8.82   0.000     .3470505    .5455412
 provincedum2 |  -.5038274    .104279    -4.83   0.000    -.7084609   -.2991938
 provincedum3 |  -.4435145   .1148495    -3.86   0.000    -.6688912   -.2181379
 provincedum4 |  -.5045497   .1038386    -4.86   0.000    -.7083191   -.3007803
 provincedum5 |  -.0701283   .0970999    -0.72   0.470    -.2606737    .1204172
 provincedum6 |  -.2905346   .1136087    -2.56   0.011    -.5134763   -.0675929
 provincedum7 |   -.189489   .0974866    -1.94   0.052    -.3807934    .0018154
 provincedum8 |  -.3661322   .1013946    -3.61   0.000    -.5651055   -.1671589
 provincedum9 |  -.1725529   .0998298    -1.73   0.084    -.3684556    .0233497
provincedum10 |  -.1274282   .0949905    -1.34   0.180    -.3138344    .0589779
provincedum11 |  -.0390278   .0917953    -0.43   0.671    -.2191637     .141108
provincedum12 |  -.3042388   .1057629    -2.88   0.004    -.5117842   -.0966935
provincedum13 |   .0107977   .1008877     0.11   0.915    -.1871808    .2087762
provincedum14 |   -.239751   .1119988    -2.14   0.033    -.4595336   -.0199684
provincedum15 |   -.211577   .1279302    -1.65   0.098    -.4626228    .0394687
          _m1 |   .5603544   .2520009     2.22   0.026     .0658366    1.054872
          _m2 |   -1.08299   .7066261    -1.53   0.126    -2.469649    .3036688
          _m3 |  -.9436749   .5530557    -1.71   0.088    -2.028972    .1416226
        _cons |    6.22735   .8336371     7.47   0.000      4.59145    7.863251
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .8749169          .        .       .            .           .
        rho1 |   .5990725          .        .       .            .           .
        rho2 |   -1.15782          .        .       .            .           .
        rho3 |  -1.008879          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-p
> rovincedum15 m1 m2 m3 if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning,
>  250, 25000)

. eststo
(est6 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of voc_log_monthlyearning

H0: Constant variance

    chi2(1) =  29.02
Prob > chi2 = 0.0000

. local het_p = r(p)

. local het_df = r(df)

. sum voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,012    8.194889    .6296805   5.521461   10.05764
         exp |      1,012    17.93478     6.49383          1         32
      expsqr |      1,012    363.7846    237.8628          1       1024
  highvocedu |      1,012    .1166008    .3211027          0          1
  highgenedu |      1,012    .0335968    .1802781          0          1
-------------+---------------------------------------------------------
    adultedu |      1,012    .1768775    .3817536          0          1
          m1 |      1,012    1.094195    .1843831    .716741   1.966683
          m2 |      1,012   -.5244179    .1441819  -.7259927  -.0660745
          m3 |      1,012   -.3357755    .1903012  -.7259893  -.0039632

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Female, Specified Higheredu, Province Dum
> ) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. **Below are columns 7-9
. 
. selmlog gen_log_monthlyearning male exp expsqr higheredu provincedum2-provincedum15 if inra
> nge(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsq
> r ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(
> 2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,294
-------------+----------------------------------   F(21, 5272)     =     43.50
       Model |  398.506447        21  18.9764975   Prob > F        =    0.0000
    Residual |  2300.01981     5,272  .436270828   R-squared       =    0.1477
-------------+----------------------------------   Adj R-squared   =    0.1443
       Total |  2698.52625     5,293  .509829256   Root MSE        =    .66051

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .2019911   .0211278     9.56   0.000     .1605718    .2434103
          exp |   .0946614   .0167767     5.64   0.000     .0617721    .1275507
       expsqr |  -.0025141   .0005324    -4.72   0.000    -.0035578   -.0014703
    higheredu |   .3255137   .0243986    13.34   0.000     .2776823    .3733451
 provincedum2 |  -.7121981    .048855   -14.58   0.000    -.8079742    -.616422
 provincedum3 |  -.3239263   .0465649    -6.96   0.000    -.4152128   -.2326398
 provincedum4 |  -.4889635   .0496106    -9.86   0.000    -.5862208   -.3917061
 provincedum5 |  -.0975578   .0438781    -2.22   0.026     -.183577   -.0115386
 provincedum6 |   -.464204   .0518348    -8.96   0.000    -.5658217   -.3625864
 provincedum7 |  -.4245549   .0492449    -8.62   0.000    -.5210953   -.3280145
 provincedum8 |  -.7038836   .0477325   -14.75   0.000    -.7974591   -.6103082
 provincedum9 |  -.2186744   .0454281    -4.81   0.000    -.3077322   -.1296165
provincedum10 |  -.2940494   .0479054    -6.14   0.000    -.3879639   -.2001349
provincedum11 |  -.1782124   .0410466    -4.34   0.000    -.2586807   -.0977442
provincedum12 |  -.3507175    .051085    -6.87   0.000    -.4508652   -.2505697
provincedum13 |  -.2966559    .047335    -6.27   0.000     -.389452   -.2038597
provincedum14 |  -.3643087   .0638858    -5.70   0.000    -.4895513    -.239066
provincedum15 |   -.471541   .0571027    -8.26   0.000    -.5834859   -.3595962
          _m1 |   1.538628   .3701599     4.16   0.000     .8129612    2.264294
          _m2 |  -.1422922   .1196016    -1.19   0.234    -.3767608    .0921764
          _m3 |  -.0719519   .2649313    -0.27   0.786    -.5913269    .4474231
        _cons |   8.183904   .0642744   127.33   0.000       8.0579    8.309909
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.039519          .        .       .            .           .
        rho1 |   1.509098          .        .       .            .           .
        rho2 |  -.1395612          .        .       .            .           .
        rho3 |   -.070571          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu provincedum2-provincedum15 m1 
> m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. eststo
(est7 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of gen_log_monthlyearning

H0: Constant variance

    chi2(1) =   0.75
Prob > chi2 = 0.3862

. local het_p = r(p)

. local het_df = r(df)

. sum gen_log_monthlyearning male exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      5,294    8.479013    .7140233   5.521461   10.12663
        male |      5,294    .5379675    .4986035          0          1
         exp |      5,294    15.03589     6.94652          0         33
      expsqr |      5,294     274.323    231.9129          0       1089
   higheredu |      5,294    .7665281    .4230798          0          1
-------------+---------------------------------------------------------
          m1 |      5,294   -.2756862    .0701061  -.4284056  -.0389473
          m2 |      5,294    .4519296    .3422949   .0001547   2.301244
          m3 |      5,294   -.2510442     .196665   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Sec Gen, All Gender, Non-specified Higheredu, Prov
> ince Dum) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 if male==1 &
>  inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp 
> expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative)
>  dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -5728.6772
Iteration 1:  Log likelihood = -4866.6828
Iteration 2:  Log likelihood = -4802.6497
Iteration 3:  Log likelihood =  -4796.833
Iteration 4:  Log likelihood = -4796.7459
Iteration 5:  Log likelihood = -4796.7459

Multinomial logistic regression                   Number of obs   =       5615
                                                  LR chi2(10)     =    1863.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -4796.7459                       Pseudo R2       =     0.1627

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |   .3346149    .033643     9.95   0.000     .2686759    .4005539
      expsqr |  -.0064558   .0008564    -7.54   0.000    -.0081343   -.0047773
ins1_secge~e |    3.54565   .5799686     6.11   0.000     2.408932    4.682368
ins2_highe~e |   .2686378   .1189817     2.26   0.024     .0354379    .5018377
ins3_vs_en~e |   .4630486   .5493956     0.84   0.399     -.613747    1.539844
       _cons |  -5.833726   .4271537   -13.66   0.000    -6.670932   -4.996521
-------------+----------------------------------------------------------------
3            |
         exp |   .5674049    .041221    13.76   0.000     .4866133    .6481965
      expsqr |  -.0071321   .0009344    -7.63   0.000    -.0089634   -.0053007
ins1_secge~e |   9.676755   .6198538    15.61   0.000     8.461864    10.89165
ins2_highe~e |   .3983786   .1227425     3.25   0.001     .1578077    .6389495
ins3_vs_en~e |   .4109329   .5833055     0.70   0.481    -.7323247    1.554191
       _cons |  -11.61776   .5542328   -20.96   0.000    -12.70403   -10.53148
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,848
-------------+----------------------------------   F(20, 2827)     =     17.52
       Model |  159.893402        20  7.99467009   Prob > F        =    0.0000
    Residual |  1290.01352     2,827  .456318897   R-squared       =    0.1103
-------------+----------------------------------   Adj R-squared   =    0.1040
       Total |  1449.90692     2,847   .50927535   Root MSE        =    .67551

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |    .106391   .0226238     4.70   0.000     .0620303    .1507517
       expsqr |  -.0029136   .0007457    -3.91   0.000    -.0043758   -.0014513
    higheredu |   .2569428   .0333631     7.70   0.000     .1915243    .3223613
 provincedum2 |  -.7083628   .0700353   -10.11   0.000    -.8456882   -.5710373
 provincedum3 |  -.3376746   .0674203    -5.01   0.000    -.4698725   -.2054766
 provincedum4 |  -.4698473   .0716821    -6.55   0.000    -.6104018   -.3292929
 provincedum5 |  -.1219056   .0622256    -1.96   0.050    -.2439177    .0001065
 provincedum6 |  -.4674837   .0725065    -6.45   0.000    -.6096546   -.3253128
 provincedum7 |  -.3924067   .0712439    -5.51   0.000     -.532102   -.2527115
 provincedum8 |  -.7477533   .0680296   -10.99   0.000     -.881146   -.6143607
 provincedum9 |   -.182216   .0642016    -2.84   0.005    -.3081028   -.0563293
provincedum10 |  -.2695877   .0674496    -4.00   0.000    -.4018432   -.1373323
provincedum11 |  -.1780364   .0589831    -3.02   0.003    -.2936906   -.0623821
provincedum12 |  -.3303367   .0733697    -4.50   0.000    -.4742003   -.1864731
provincedum13 |  -.3107815   .0672764    -4.62   0.000    -.4426973   -.1788656
provincedum14 |  -.4098937   .0930289    -4.41   0.000     -.592305   -.2274824
provincedum15 |  -.5504531   .0821339    -6.70   0.000    -.7115016   -.3894046
          _m1 |   1.814819   .5354367     3.39   0.001     .7649334    2.864706
          _m2 |   -.085807   .1572687    -0.55   0.585      -.39418    .2225659
          _m3 |  -.1387095   .3668859    -0.38   0.705    -.8581005    .5806816
        _cons |   8.407954   .0918686    91.52   0.000     8.227818    8.588091
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.286581          .        .       .            .           .
        rho1 |   1.599981          .        .       .            .           .
        rho2 |  -.0756492          .        .       .            .           .
        rho3 |   -.122289          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3
>  if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. eststo
(est8 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of gen_log_monthlyearning

H0: Constant variance

    chi2(1) =   5.09
Prob > chi2 = 0.0240

. local het_p = r(p)

. local het_df = r(df)

. sum gen_log_monthlyearning male exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      2,848    8.587107    .7136353   5.521461   10.12663
        male |      2,848           1           0          1          1
         exp |      2,848    15.29916    6.907363          1         32
      expsqr |      2,848    281.7591     231.362          1       1024
   higheredu |      2,848    .7545646    .4304206          0          1
-------------+---------------------------------------------------------
          m1 |      2,848   -.2692273    .0657111  -.4031221  -.0422804
          m2 |      2,848    .4466593    .3325175   .0086655    2.50078
          m3 |      2,848   -.2565531    .1944388  -.7259604  -.0036679

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Male, Non-specified Higheredu, Province D
> um) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 if male==0 &
>  inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp 
> expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative)
>  dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -5055.8576
Iteration 1:  Log likelihood = -4297.4227
Iteration 2:  Log likelihood =  -4235.419
Iteration 3:  Log likelihood = -4228.8483
Iteration 4:  Log likelihood = -4228.7204
Iteration 5:  Log likelihood = -4228.7203

Multinomial logistic regression                   Number of obs   =       4897
                                                  LR chi2(10)     =    1654.27
                                                  Prob > chi2     =     0.0000
Log likelihood = -4228.7203                       Pseudo R2       =     0.1636

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |   .3425434   .0343131     9.98   0.000     .2752909    .4097958
      expsqr |  -.0067418   .0008725    -7.73   0.000    -.0084519   -.0050316
ins1_secge~e |   2.947418   .5838224     5.05   0.000     1.803147    4.091689
ins2_highe~e |   .0131145   .1241387     0.11   0.916     -.230193    .2564219
ins3_vs_en~e |    1.19774   .5660029     2.12   0.034     .0883947    2.307085
       _cons |  -5.566881   .4279263   -13.01   0.000    -6.405602   -4.728161
-------------+----------------------------------------------------------------
3            |
         exp |   .6415311   .0445191    14.41   0.000     .5542752     .728787
      expsqr |  -.0093472    .001007    -9.28   0.000    -.0113209   -.0073736
ins1_secge~e |   8.150034   .6393358    12.75   0.000     6.896959    9.403109
ins2_highe~e |   .5980405   .1352367     4.42   0.000     .3329815    .8630996
ins3_vs_en~e |   -2.07414    .645978    -3.21   0.001    -3.340233    -.808046
       _cons |  -11.20186   .5767557   -19.42   0.000    -12.33228   -10.07144
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,446
-------------+----------------------------------   F(20, 2425)     =     22.12
       Model |  181.529145        20  9.07645724   Prob > F        =    0.0000
    Residual |  995.066656     2,425  .410336765   R-squared       =    0.1543
-------------+----------------------------------   Adj R-squared   =    0.1473
       Total |   1176.5958     2,445  .481225276   Root MSE        =    .64058

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   .0674431   .0227664     2.96   0.003     .0227995    .1120868
       expsqr |  -.0016725   .0006793    -2.46   0.014    -.0030046   -.0003404
    higheredu |   .4159305   .0358653    11.60   0.000     .3456007    .4862603
 provincedum2 |  -.7129826   .0679084   -10.50   0.000     -.846147   -.5798181
 provincedum3 |   -.341972   .0673943    -5.07   0.000    -.4741283   -.2098158
 provincedum4 |  -.5075825   .0681394    -7.45   0.000       -.6412    -.373965
 provincedum5 |  -.0789075   .0622867    -1.27   0.205    -.2010482    .0432331
 provincedum6 |   -.462592   .0749628    -6.17   0.000    -.6095898   -.3155943
 provincedum7 |  -.4542236   .0675761    -6.72   0.000    -.5867365   -.3217108
 provincedum8 |  -.6365212   .0665919    -9.56   0.000    -.7671042   -.5059382
 provincedum9 |  -.2639776    .064467    -4.09   0.000    -.3903937   -.1375615
provincedum10 |  -.3361018   .0685547    -4.90   0.000    -.4705337   -.2016699
provincedum11 |  -.1755908   .0566527    -3.10   0.002    -.2866835   -.0644981
provincedum12 |  -.3560123    .070599    -5.04   0.000     -.494453   -.2175717
provincedum13 |    -.27958   .0662483    -4.22   0.000     -.409489    -.149671
provincedum14 |    -.30849   .0874878    -3.53   0.000    -.4800486   -.1369314
provincedum15 |  -.3757873   .0790825    -4.75   0.000    -.5308635   -.2207111
          _m1 |   .9267835   .4587101     2.02   0.043     .0272792    1.826288
          _m2 |  -.0621495   .1756069    -0.35   0.723    -.4065046    .2822055
          _m3 |   .2412589   .3404283     0.71   0.479    -.4263015    .9088194
        _cons |   8.151131   .0890779    91.51   0.000     7.976454    8.325807
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .6359991          .        .       .            .           .
        rho1 |   1.162118          .        .       .            .           .
        rho2 |  -.0779309          .        .       .            .           .
        rho3 |   .3025207          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3
>  if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. eststo
(est9 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of gen_log_monthlyearning

H0: Constant variance

    chi2(1) =   0.73
Prob > chi2 = 0.3924

. local het_p = r(p)

. local het_df = r(df)

. sum gen_log_monthlyearning exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      2,446    8.353153     .693704   5.521461   10.12663
         exp |      2,446    14.72935    6.980746          0         33
      expsqr |      2,446    265.6648    232.3001          0       1089
   higheredu |      2,446    .7804579    .4140211          0          1
          m1 |      2,446   -.2831295    .0748304  -.4688301  -.0388292
-------------+---------------------------------------------------------
          m2 |      2,446    .4563298    .3507745   -.000019   2.060829
          m3 |      2,446   -.2434341    .1999238  -.7259893  -.0007886

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Female, Non-specified Higheredu, Province
>  Dum) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. **Below are columns 10-12
. 
. selmlog gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu provincedum2-
> provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(
> educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_e
> ntrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,294
-------------+----------------------------------   F(23, 5270)     =     49.95
       Model |  482.980701        23  20.9991609   Prob > F        =    0.0000
    Residual |  2215.54555     5,270  .420407126   R-squared       =    0.1790
-------------+----------------------------------   Adj R-squared   =    0.1754
       Total |  2698.52625     5,293  .509829256   Root MSE        =    .64839

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .2083718   .0207618    10.04   0.000     .1676701    .2490734
          exp |   .0838296   .0164917     5.08   0.000     .0514991      .11616
       expsqr |   -.002283    .000523    -4.37   0.000    -.0033083   -.0012577
   highvocedu |   .1797798   .0277564     6.48   0.000     .1253659    .2341938
   highgenedu |   .4974524    .027148    18.32   0.000      .444231    .5506738
     adultedu |   .2616962   .0333753     7.84   0.000     .1962667    .3271257
 provincedum2 |  -.6403026   .0482368   -13.27   0.000    -.7348669   -.5457384
 provincedum3 |  -.2961985   .0457545    -6.47   0.000    -.3858963   -.2065006
 provincedum4 |   -.463227   .0487368    -9.50   0.000    -.5587713   -.3676828
 provincedum5 |  -.0712177   .0431422    -1.65   0.099    -.1557942    .0133588
 provincedum6 |  -.4031879   .0510824    -7.89   0.000    -.5033306   -.3030451
 provincedum7 |  -.3671266   .0485352    -7.56   0.000    -.4622757   -.2719774
 provincedum8 |  -.6302581   .0471585   -13.36   0.000    -.7227082   -.5378079
 provincedum9 |  -.1738014   .0447408    -3.88   0.000    -.2615118   -.0860909
provincedum10 |  -.2250484   .0472884    -4.76   0.000    -.3177532   -.1323435
provincedum11 |  -.1144832   .0405521    -2.82   0.005    -.1939822   -.0349843
provincedum12 |  -.2966067   .0502928    -5.90   0.000    -.3952013   -.1980121
provincedum13 |  -.2321831   .0466912    -4.97   0.000    -.3237173    -.140649
provincedum14 |  -.3147707   .0628242    -5.01   0.000    -.4379322   -.1916091
provincedum15 |  -.4623992   .0560771    -8.25   0.000    -.5723335   -.3524649
          _m1 |   1.145286   .3644417     3.14   0.002     .4308293    1.859743
          _m2 |  -.0977253   .1174943    -0.83   0.406    -.3280628    .1326123
          _m3 |  -.1896631   .2606068    -0.73   0.467    -.7005605    .3212343
        _cons |   8.049459   .0639804   125.81   0.000     7.924031    8.174887
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .7590513          .        .       .            .           .
        rho1 |   1.314554          .        .       .            .           .
        rho2 |  -.1121686          .        .       .            .           .
        rho3 |  -.2176944          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu provinced
> um2-provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250,
>  25000)

. eststo
(est10 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of gen_log_monthlyearning

H0: Constant variance

    chi2(1) =   2.25
Prob > chi2 = 0.1336

. local het_p = r(p)

. local het_df = r(df)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sam
> ple)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      5,294    8.479013    .7140233   5.521461   10.12663
        male |      5,294    .5379675    .4986035          0          1
         exp |      5,294    15.03589     6.94652          0         33
      expsqr |      5,294     274.323    231.9129          0       1089
  highvocedu |      5,294    .2529278     .434731          0          1
-------------+---------------------------------------------------------
  highgenedu |      5,294    .4036645    .4906781          0          1
    adultedu |      5,294    .1099358    .3128392          0          1
          m1 |      5,294   -.2756862    .0701061  -.4284056  -.0389473
          m2 |      5,294    .4519296    .3422949   .0001547   2.301244
          m3 |      5,294   -.2510442     .196665   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Sec Gen, All Gender, Specified Higheredu, Province
>  Dum) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-provi
> ncedum15 if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000),
>  sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3
> _vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -5728.6772
Iteration 1:  Log likelihood = -4866.6828
Iteration 2:  Log likelihood = -4802.6497
Iteration 3:  Log likelihood =  -4796.833
Iteration 4:  Log likelihood = -4796.7459
Iteration 5:  Log likelihood = -4796.7459

Multinomial logistic regression                   Number of obs   =       5615
                                                  LR chi2(10)     =    1863.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -4796.7459                       Pseudo R2       =     0.1627

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |   .3346149    .033643     9.95   0.000     .2686759    .4005539
      expsqr |  -.0064558   .0008564    -7.54   0.000    -.0081343   -.0047773
ins1_secge~e |    3.54565   .5799686     6.11   0.000     2.408932    4.682368
ins2_highe~e |   .2686378   .1189817     2.26   0.024     .0354379    .5018377
ins3_vs_en~e |   .4630486   .5493956     0.84   0.399     -.613747    1.539844
       _cons |  -5.833726   .4271537   -13.66   0.000    -6.670932   -4.996521
-------------+----------------------------------------------------------------
3            |
         exp |   .5674049    .041221    13.76   0.000     .4866133    .6481965
      expsqr |  -.0071321   .0009344    -7.63   0.000    -.0089634   -.0053007
ins1_secge~e |   9.676755   .6198538    15.61   0.000     8.461864    10.89165
ins2_highe~e |   .3983786   .1227425     3.25   0.001     .1578077    .6389495
ins3_vs_en~e |   .4109329   .5833055     0.70   0.481    -.7323247    1.554191
       _cons |  -11.61776   .5542328   -20.96   0.000    -12.70403   -10.53148
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,848
-------------+----------------------------------   F(22, 2825)     =     19.91
       Model |  194.644668        22   8.8474849   Prob > F        =    0.0000
    Residual |  1255.26225     2,825  .444340621   R-squared       =    0.1342
-------------+----------------------------------   Adj R-squared   =    0.1275
       Total |  1449.90692     2,847   .50927535   Root MSE        =    .66659

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   .0915248   .0223898     4.09   0.000     .0476227    .1354269
       expsqr |  -.0025205   .0007372    -3.42   0.001     -.003966   -.0010749
   highvocedu |   .1330326   .0383316     3.47   0.001     .0578718    .2081933
   highgenedu |   .4054601   .0371552    10.91   0.000     .3326061    .4783141
     adultedu |   .1756085   .0480204     3.66   0.000     .0814498    .2697671
 provincedum2 |  -.6377292   .0696624    -9.15   0.000    -.7743234    -.501135
 provincedum3 |  -.2972919   .0667093    -4.46   0.000    -.4280958   -.1664881
 provincedum4 |   -.441873   .0708064    -6.24   0.000    -.5807106   -.3030354
 provincedum5 |  -.0920578    .061603    -1.49   0.135    -.2128493    .0287337
 provincedum6 |  -.4128644   .0718943    -5.74   0.000    -.5538351   -.2718938
 provincedum7 |  -.3405297   .0706364    -4.82   0.000     -.479034   -.2020255
 provincedum8 |  -.6759595   .0676838    -9.99   0.000    -.8086741   -.5432448
 provincedum9 |  -.1370718   .0636789    -2.15   0.031    -.2619336   -.0122099
provincedum10 |  -.2035545   .0670343    -3.04   0.002    -.3349957   -.0721133
provincedum11 |  -.1211522   .0586262    -2.07   0.039    -.2361068   -.0061977
provincedum12 |  -.2900278   .0725892    -4.00   0.000    -.4323609   -.1476947
provincedum13 |  -.2481174   .0668127    -3.71   0.000     -.379124   -.1171107
provincedum14 |  -.3624759   .0919614    -3.94   0.000    -.5427941   -.1821577
provincedum15 |  -.5401547   .0810862    -6.66   0.000    -.6991488   -.3811606
          _m1 |   1.376926    .530713     2.59   0.010     .3363018     2.41755
          _m2 |  -.0415446   .1553657    -0.27   0.789    -.3461863    .2630971
          _m3 |  -.1813278   .3624422    -0.50   0.617    -.8920059    .5293504
        _cons |   8.310292   .0913708    90.95   0.000     8.131131    8.489452
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .9237394          .        .       .            .           .
        rho1 |   1.432636          .        .       .            .           .
        rho2 |  -.0432255          .        .       .            .           .
        rho3 |  -.1886642          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-p
> rovincedum15 m1 m2 m3 if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning,
>  250, 25000)

. eststo
(est11 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of gen_log_monthlyearning

H0: Constant variance

    chi2(1) =   6.61
Prob > chi2 = 0.0102

. local het_p = r(p)

. local het_df = r(df)

. sum gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      2,848    8.587107    .7136353   5.521461   10.12663
         exp |      2,848    15.29916    6.907363          1         32
      expsqr |      2,848    281.7591     231.362          1       1024
  highvocedu |      2,848    .2538624    .4352962          0          1
  highgenedu |      2,848    .4009831    .4901837          0          1
-------------+---------------------------------------------------------
    adultedu |      2,848    .0997191    .2996777          0          1
          m1 |      2,848   -.2692273    .0657111  -.4031221  -.0422804
          m2 |      2,848    .4466593    .3325175   .0086655    2.50078
          m3 |      2,848   -.2565531    .1944388  -.7259604  -.0036679

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Male, Specified Higheredu, Province Dum) 
> pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-provi
> ncedum15 if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000),
>  sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3
> _vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -5055.8576
Iteration 1:  Log likelihood = -4297.4227
Iteration 2:  Log likelihood =  -4235.419
Iteration 3:  Log likelihood = -4228.8483
Iteration 4:  Log likelihood = -4228.7204
Iteration 5:  Log likelihood = -4228.7203

Multinomial logistic regression                   Number of obs   =       4897
                                                  LR chi2(10)     =    1654.27
                                                  Prob > chi2     =     0.0000
Log likelihood = -4228.7203                       Pseudo R2       =     0.1636

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |   .3425434   .0343131     9.98   0.000     .2752909    .4097958
      expsqr |  -.0067418   .0008725    -7.73   0.000    -.0084519   -.0050316
ins1_secge~e |   2.947418   .5838224     5.05   0.000     1.803147    4.091689
ins2_highe~e |   .0131145   .1241387     0.11   0.916     -.230193    .2564219
ins3_vs_en~e |    1.19774   .5660029     2.12   0.034     .0883947    2.307085
       _cons |  -5.566881   .4279263   -13.01   0.000    -6.405602   -4.728161
-------------+----------------------------------------------------------------
3            |
         exp |   .6415311   .0445191    14.41   0.000     .5542752     .728787
      expsqr |  -.0093472    .001007    -9.28   0.000    -.0113209   -.0073736
ins1_secge~e |   8.150034   .6393358    12.75   0.000     6.896959    9.403109
ins2_highe~e |   .5980405   .1352367     4.42   0.000     .3329815    .8630996
ins3_vs_en~e |   -2.07414    .645978    -3.21   0.001    -3.340233    -.808046
       _cons |  -11.20186   .5767557   -19.42   0.000    -12.33228   -10.07144
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,446
-------------+----------------------------------   F(22, 2423)     =     27.11
       Model |  232.424013        22  10.5647279   Prob > F        =    0.0000
    Residual |  944.171788     2,423  .389670569   R-squared       =    0.1975
-------------+----------------------------------   Adj R-squared   =    0.1903
       Total |   1176.5958     2,445  .481225276   Root MSE        =    .62424

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |    .059817   .0222062     2.69   0.007      .016272     .103362
       expsqr |  -.0015787   .0006624    -2.38   0.017    -.0028776   -.0002798
   highvocedu |   .2504435   .0402056     6.23   0.000     .1716027    .3292844
   highgenedu |    .619413   .0399571    15.50   0.000     .5410594    .6977666
     adultedu |    .370122   .0463231     7.99   0.000     .2792851     .460959
 provincedum2 |  -.6432967   .0664578    -9.68   0.000    -.7736166   -.5129767
 provincedum3 |  -.3256716   .0656912    -4.96   0.000    -.4544883   -.1968549
 provincedum4 |   -.483917   .0664447    -7.28   0.000    -.6142113   -.3536226
 provincedum5 |  -.0593517   .0607334    -0.98   0.329    -.1784464    .0597429
 provincedum6 |  -.3940244   .0733003    -5.38   0.000    -.5377621   -.2502867
 provincedum7 |  -.3914139   .0660895    -5.92   0.000    -.5210117   -.2618161
 provincedum8 |  -.5624594   .0652196    -8.62   0.000    -.6903513   -.4345676
 provincedum9 |  -.2215653   .0629447    -3.52   0.000    -.3449963   -.0981344
provincedum10 |  -.2618809   .0671211    -3.90   0.000    -.3935017   -.1302601
provincedum11 |    -.10413   .0555614    -1.87   0.061    -.2130827    .0048228
provincedum12 |  -.2859197   .0691134    -4.14   0.000    -.4214471   -.1503923
provincedum13 |  -.2168107    .064797    -3.35   0.001     -.343874   -.0897474
provincedum14 |  -.2554877   .0855087    -2.99   0.003    -.4231654   -.0878099
provincedum15 |  -.3656365   .0770922    -4.74   0.000      -.51681   -.2144631
          _m1 |   .5368534   .4483113     1.20   0.231    -.3422597    1.415966
          _m2 |  -.0321506   .1711832    -0.19   0.851    -.3678312      .30353
          _m3 |   .0125528   .3331579     0.04   0.970     -.640751    .6658566
        _cons |   7.975932   .0889081    89.71   0.000     7.801588    8.150276
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4594806          .        .       .            .           .
        rho1 |   .7919944          .        .       .            .           .
        rho2 |  -.0474303          .        .       .            .           .
        rho3 |   .0185185          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-p
> rovincedum15 m1 m2 m3 if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning,
>  250, 25000)

. eststo
(est12 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of gen_log_monthlyearning

H0: Constant variance

    chi2(1) =   2.93
Prob > chi2 = 0.0870

. local het_p = r(p)

. local het_df = r(df)

. sum gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      2,446    8.353153     .693704   5.521461   10.12663
         exp |      2,446    14.72935    6.980746          0         33
      expsqr |      2,446    265.6648    232.3001          0       1089
  highvocedu |      2,446    .2518397    .4341584          0          1
  highgenedu |      2,446    .4067866    .4913349          0          1
-------------+---------------------------------------------------------
    adultedu |      2,446    .1218316    .3271581          0          1
          m1 |      2,446   -.2831295    .0748304  -.4688301  -.0388292
          m2 |      2,446    .4563298    .3507745   -.000019   2.060829
          m3 |      2,446   -.2434341    .1999238  -.7259893  -.0007886

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Female, Specified Higheredu, Province Dum
> ) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. 
. ***Table 2 Generation
. 
. local variablenames m1 m2 m3

. local variablelabels ""Upper secondary vocational track selection correction" "Upper second
> ary general track selection correction" "No upper secondary degree selection correction""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. local estlist est1 est2 est3 est4 est5 est6 est7 est8 est9 est10 est11 est12

. 
. outreg2 [`estlist'] using "Table 2/Table2.xls", excel replace pvalue adjr2 drop(provincedum
> *) dec(3) sortvar(male exp expsqr higheredu) title("Table 2 (Sec Voc 1-6, Sec Gen 7-10; Non
> -specified 1-3 & 7-9, Specified 4-6 & 10-12; Genders repeat under for every 3 columns)") ct
> itle(" ") addnote("More notes") label
Table 2/Table2.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. ***Table 4 with sequence: Gaokao indicator / Parent indicator > Two_tracks > Higher_edu Com
> bined/Seperated, 2*2*2=8 columns in total.
. 
. *Prepare
. 
. drop m1 m2 m3

. local folderpath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 
> 2 4 6 8 10"

. local filename "Urban tables"

. local datapath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/20240716 Urban 
> Chip2018 and Instrumental Statistics and Inflation.dta"

. 
. 
. local xlspath "`folderpath'/`filename'.xls"

. 
. eststo clear

. 
. *columns 1-4
. 
. selmlog voc_log_monthlyearning  male exp expsqr higheredu TakeGaoKao provincedum2-provinced
> um15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=ma
> le exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_re
> lative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,012
-------------+----------------------------------   F(22, 1989)     =     14.63
       Model |  116.759397        22  5.30724533   Prob > F        =    0.0000
    Residual |  721.578358     1,989  .362784494   R-squared       =    0.1393
-------------+----------------------------------   Adj R-squared   =    0.1298
       Total |  838.337755     2,011  .416876059   Root MSE        =    .60232

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .2064619   .0360382     5.73   0.000     .1357852    .2771385
          exp |   .0559765   .0298422     1.88   0.061    -.0025487    .1145018
       expsqr |  -.0015628   .0008837    -1.77   0.077    -.0032958    .0001702
    higheredu |   .3349364   .0305392    10.97   0.000     .2750443    .3948285
   TakeGaoKao |   .0247288   .0370316     0.67   0.504    -.0478961    .0973536
 provincedum2 |  -.4025666   .0787018    -5.12   0.000    -.5569133     -.24822
 provincedum3 |  -.3404445   .0838242    -4.06   0.000    -.5048369   -.1760521
 provincedum4 |  -.3665964   .0761178    -4.82   0.000    -.5158755   -.2173173
 provincedum5 |   .0266702   .0710309     0.38   0.707    -.1126325     .165973
 provincedum6 |  -.1249465   .0888518    -1.41   0.160    -.2991988    .0493058
 provincedum7 |  -.1447925    .075636    -1.91   0.056    -.2931265    .0035415
 provincedum8 |  -.3032418   .0787872    -3.85   0.000    -.4577559   -.1487277
 provincedum9 |  -.0834087   .0746481    -1.12   0.264    -.2298055     .062988
provincedum10 |  -.1760986   .0742271    -2.37   0.018    -.3216696   -.0305275
provincedum11 |   .0438524   .0705556     0.62   0.534    -.0945181     .182223
provincedum12 |  -.2301134    .079531    -2.89   0.004    -.3860862   -.0741407
provincedum13 |  -.0338069   .0779881    -0.43   0.665    -.1867538    .1191401
provincedum14 |  -.3036402   .0876062    -3.47   0.001    -.4754497   -.1318306
provincedum15 |  -.1484594   .0955111    -1.55   0.120    -.3357717     .038853
          _m1 |   .3994946   .2349203     1.70   0.089    -.0612211    .8602103
          _m2 |   -1.33488   .6858353    -1.95   0.052    -2.679911    .0101505
          _m3 |  -1.113617   .5807596    -1.92   0.055    -2.252578     .025344
        _cons |   6.282479     .88531     7.10   0.000     4.546246    8.018711
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .974033          .        .       .            .           .
        rho1 |   .4047847          .        .       .            .           .
        rho2 |  -1.352557          .        .       .            .           .
        rho3 |  -1.128363          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu TakeGaoKao provincedum2-provin
> cedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. eststo
(est1 stored)

. sum voc_log_monthlyearning male exp expsqr higheredu TakeGaoKao provincedum2-provincedum15 
> m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      2,012    8.316332    .6456594   5.521461   10.12663
        male |      2,012    .5079523     .500061          0          1
         exp |      2,012    17.89861     6.45257          1         32
      expsqr |      2,012    361.9751    235.7509          1       1024
   higheredu |      2,012    .3116302    .4632748          0          1
-------------+---------------------------------------------------------
  TakeGaoKao |      2,012    .1719682    .3774466          0          1
provincedum2 |      2,012    .0641153    .2450191          0          1
provincedum3 |      2,012    .0407555    .1977723          0          1
provincedum4 |      2,012    .0710736    .2570116          0          1
provincedum5 |      2,012    .0790258    .2698462          0          1
-------------+---------------------------------------------------------
provincedum6 |      2,012    .0452286    .2078569          0          1
provincedum7 |      2,012    .0904573     .286907          0          1
provincedum8 |      2,012     .082008     .274445          0          1
provincedum9 |      2,012    .0661034    .2485245          0          1
provinced~10 |      2,012    .0680915    .2519654          0          1
-------------+---------------------------------------------------------
provinced~11 |      2,012    .1148111    .3188731          0          1
provinced~12 |      2,012    .0581511    .2340871          0          1
provinced~13 |      2,012    .0670974    .2502528          0          1
provinced~14 |      2,012    .0412525    .1989231          0          1
provinced~15 |      2,012     .028827    .1673618          0          1
-------------+---------------------------------------------------------
          m1 |      2,012    1.126098    .1784558   .8143778    1.98121
          m2 |      2,012   -.5319673    .1432733   -.726001  -.0397592
          m3 |      2,012   -.3379441    .1880053  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu TakeGaoKao p
> rovincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 
> 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relati
> ve ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,012
-------------+----------------------------------   F(24, 1987)     =     14.32
       Model |  123.588566        24  5.14952358   Prob > F        =    0.0000
    Residual |  714.749189     1,987  .359712727   R-squared       =    0.1474
-------------+----------------------------------   Adj R-squared   =    0.1371
       Total |  838.337755     2,011  .416876059   Root MSE        =    .59976

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .2074554   .0358985     5.78   0.000     .1370528     .277858
          exp |   .0520168   .0298121     1.74   0.081    -.0064494    .1104831
       expsqr |  -.0015127   .0008817    -1.72   0.086    -.0032419    .0002165
   highvocedu |   .2154272    .044354     4.86   0.000      .128442    .3024124
   highgenedu |   .5644264   .0810285     6.97   0.000     .4055166    .7233362
     adultedu |   .3792578   .0384514     9.86   0.000     .3038485    .4546672
   TakeGaoKao |    .042326   .0375156     1.13   0.259    -.0312481    .1159001
 provincedum2 |  -.3792227   .0785647    -4.83   0.000    -.5333005    -.225145
 provincedum3 |  -.3268405   .0835608    -3.91   0.000    -.4907165   -.1629644
 provincedum4 |   -.342148   .0760787    -4.50   0.000    -.4913505   -.1929455
 provincedum5 |   .0544897    .071064     0.77   0.443     -.084878    .1938574
 provincedum6 |  -.1079161   .0885651    -1.22   0.223    -.2816062    .0657741
 provincedum7 |  -.1315761   .0756242    -1.74   0.082    -.2798871     .016735
 provincedum8 |  -.2835283   .0786306    -3.61   0.000    -.4377354   -.1293212
 provincedum9 |  -.0683088   .0744215    -0.92   0.359    -.2142612    .0776435
provincedum10 |  -.1544838   .0740835    -2.09   0.037    -.2997733   -.0091943
provincedum11 |   .0643941   .0704682     0.91   0.361    -.0738053    .2025934
provincedum12 |  -.2121013   .0793098    -2.67   0.008    -.3676404   -.0565622
provincedum13 |  -.0153892   .0778031    -0.20   0.843    -.1679735    .1371951
provincedum14 |  -.2887489   .0873239    -3.31   0.001    -.4600049   -.1174929
provincedum15 |  -.1463886   .0951072    -1.54   0.124     -.332909    .0401317
          _m1 |   .4097364   .2340038     1.75   0.080    -.0491821    .8686549
          _m2 |  -1.378338   .6834128    -2.02   0.044    -2.718619   -.0380573
          _m3 |  -1.195138   .5787741    -2.06   0.039    -2.330206   -.0600706
        _cons |   6.252341   .8825058     7.08   0.000     4.521607    7.983075
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.031698          .        .       .            .           .
        rho1 |    .403393          .        .       .            .           .
        rho2 |  -1.356999          .        .       .            .           .
        rho3 |  -1.176636          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu TakeGaoKa
> o provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlye
> arning, 250, 25000)

. eststo
(est2 stored)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu TakeGaoKao provin
> cedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      2,012    8.316332    .6456594   5.521461   10.12663
        male |      2,012    .5079523     .500061          0          1
         exp |      2,012    17.89861     6.45257          1         32
      expsqr |      2,012    361.9751    235.7509          1       1024
  highvocedu |      2,012    .1187873    .3236185          0          1
-------------+---------------------------------------------------------
  highgenedu |      2,012    .0293241    .1687552          0          1
    adultedu |      2,012    .1635189    .3699304          0          1
  TakeGaoKao |      2,012    .1719682    .3774466          0          1
provincedum2 |      2,012    .0641153    .2450191          0          1
provincedum3 |      2,012    .0407555    .1977723          0          1
-------------+---------------------------------------------------------
provincedum4 |      2,012    .0710736    .2570116          0          1
provincedum5 |      2,012    .0790258    .2698462          0          1
provincedum6 |      2,012    .0452286    .2078569          0          1
provincedum7 |      2,012    .0904573     .286907          0          1
provincedum8 |      2,012     .082008     .274445          0          1
-------------+---------------------------------------------------------
provincedum9 |      2,012    .0661034    .2485245          0          1
provinced~10 |      2,012    .0680915    .2519654          0          1
provinced~11 |      2,012    .1148111    .3188731          0          1
provinced~12 |      2,012    .0581511    .2340871          0          1
provinced~13 |      2,012    .0670974    .2502528          0          1
-------------+---------------------------------------------------------
provinced~14 |      2,012    .0412525    .1989231          0          1
provinced~15 |      2,012     .028827    .1673618          0          1
          m1 |      2,012    1.126098    .1784558   .8143778    1.98121
          m2 |      2,012   -.5319673    .1432733   -.726001  -.0397592
          m3 |      2,012   -.3379441    .1880053  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning  male exp expsqr higheredu TakeGaoKao provincedum2-provinced
> um15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=ma
> le exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_re
> lative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,282
-------------+----------------------------------   F(22, 5259)     =     41.80
       Model |  400.555575        22  18.2070716   Prob > F        =    0.0000
    Residual |  2290.48337     5,259  .435535915   R-squared       =    0.1488
-------------+----------------------------------   Adj R-squared   =    0.1453
       Total |  2691.03895     5,281  .509569958   Root MSE        =    .65995

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    .201808   .0211277     9.55   0.000      .160389    .2432271
          exp |   .0938199   .0167822     5.59   0.000     .0609198    .1267201
       expsqr |  -.0024666   .0005327    -4.63   0.000     -.003511   -.0014223
    higheredu |    .305982   .0261902    11.68   0.000     .2546383    .3573257
   TakeGaoKao |   .0512647   .0247124     2.07   0.038     .0028181    .0997112
 provincedum2 |  -.7207613   .0488958   -14.74   0.000    -.8166174   -.6249051
 provincedum3 |  -.3353683   .0466942    -7.18   0.000    -.4269083   -.2438283
 provincedum4 |  -.4932179    .049597    -9.94   0.000    -.5904486   -.3959872
 provincedum5 |  -.1061414    .043952    -2.41   0.016    -.1923056   -.0199773
 provincedum6 |   -.472728   .0518615    -9.12   0.000    -.5743981   -.3710578
 provincedum7 |  -.4346741   .0493391    -8.81   0.000    -.5313992    -.337949
 provincedum8 |  -.7085173   .0477361   -14.84   0.000    -.8020998   -.6149347
 provincedum9 |  -.2287574   .0455656    -5.02   0.000    -.3180848     -.13943
provincedum10 |    -.30303   .0479706    -6.32   0.000    -.3970724   -.2089876
provincedum11 |  -.1869393   .0411206    -4.55   0.000    -.2675528   -.1063257
provincedum12 |  -.3572569   .0510899    -6.99   0.000    -.4574144   -.2570994
provincedum13 |  -.3023633   .0473361    -6.39   0.000    -.3951617   -.2095649
provincedum14 |  -.3647272   .0638906    -5.71   0.000    -.4899793   -.2394751
provincedum15 |  -.4789883   .0571191    -8.39   0.000    -.5909654   -.3670112
          _m1 |   1.528764   .3706231     4.12   0.000     .8021889    2.255339
          _m2 |  -.1417497   .1195865    -1.19   0.236    -.3761888    .0926894
          _m3 |  -.0667735   .2648862    -0.25   0.801    -.5860605    .4525135
        _cons |   8.164368      .0658   124.08   0.000     8.035373    8.293364
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.030841          .        .       .            .           .
        rho1 |   1.505722          .        .       .            .           .
        rho2 |  -.1396132          .        .       .            .           .
        rho3 |  -.0657671          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu TakeGaoKao provincedum2-provin
> cedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. eststo
(est3 stored)

. sum gen_log_monthlyearning male exp expsqr higheredu TakeGaoKao provincedum2-provincedum15 
> m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      5,282    8.478096    .7138417   5.521461   10.12663
        male |      5,282    .5382431    .4985825          0          1
         exp |      5,282    15.03465    6.949144          0         33
      expsqr |      5,282     274.322    232.0598          0       1089
   higheredu |      5,282     .766755    .4229369          0          1
-------------+---------------------------------------------------------
  TakeGaoKao |      5,282    .7552064    .4300055          0          1
provincedum2 |      5,282    .0596365    .2368346          0          1
provincedum3 |      5,282    .0630443    .2430656          0          1
provincedum4 |      5,282     .056418     .230749          0          1
provincedum5 |      5,282    .0815979     .273777          0          1
-------------+---------------------------------------------------------
provincedum6 |      5,282    .0533889     .224829          0          1
provincedum7 |      5,282    .0620977    .2413557          0          1
provincedum8 |      5,282    .0789474    .2696821          0          1
provincedum9 |      5,282    .0706172    .2562086          0          1
provinced~10 |      5,282    .0603938    .2382375          0          1
-------------+---------------------------------------------------------
provinced~11 |      5,282    .1321469    .3386825          0          1
provinced~12 |      5,282    .0518743    .2217942          0          1
provinced~13 |      5,282    .0664521    .2490943          0          1
provinced~14 |      5,282     .028209    .1655852          0          1
provinced~15 |      5,282    .0348353    .1833798          0          1
-------------+---------------------------------------------------------
          m1 |      5,282   -.2755776    .0700389  -.4284056  -.0389473
          m2 |      5,282    .4518425    .3425102   .0001547   2.301244
          m3 |      5,282   -.2509943    .1967838   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu TakeGaoKao p
> rovincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 
> 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relati
> ve ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,282
-------------+----------------------------------   F(24, 5257)     =     47.86
       Model |  482.508943        24  20.1045393   Prob > F        =    0.0000
    Residual |  2208.53001     5,257  .420112233   R-squared       =    0.1793
-------------+----------------------------------   Adj R-squared   =    0.1756
       Total |  2691.03895     5,281  .509569958   Root MSE        =    .64816

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .2087735   .0207708    10.05   0.000     .1680541     .249493
          exp |   .0838043   .0165063     5.08   0.000     .0514451    .1161635
       expsqr |   -.002273   .0005236    -4.34   0.000    -.0032995   -.0012465
   highvocedu |    .181466   .0300194     6.04   0.000     .1226156    .2403164
   highgenedu |   .4989858   .0302899    16.47   0.000     .4396051    .5583666
     adultedu |   .2636036   .0334452     7.88   0.000     .1980371      .32917
   TakeGaoKao |  -.0035514   .0259253    -0.14   0.891    -.0543757     .047273
 provincedum2 |  -.6429797   .0483441   -13.30   0.000    -.7377542   -.5482052
 provincedum3 |  -.3036993   .0459162    -6.61   0.000     -.393714   -.2136845
 provincedum4 |  -.4660303    .048751    -9.56   0.000    -.5616025   -.3704581
 provincedum5 |  -.0758843   .0432341    -1.76   0.079    -.1606411    .0088724
 provincedum6 |  -.4065536   .0511576    -7.95   0.000    -.5068437   -.3062634
 provincedum7 |  -.3746364   .0486574    -7.70   0.000     -.470025   -.2792477
 provincedum8 |  -.6339958   .0471961   -13.43   0.000    -.7265197   -.5414718
 provincedum9 |  -.1758553   .0449152    -3.92   0.000    -.2639076   -.0878029
provincedum10 |  -.2272544   .0474251    -4.79   0.000    -.3202273   -.1342816
provincedum11 |  -.1192684   .0406765    -2.93   0.003    -.1990112   -.0395255
provincedum12 |  -.2992565   .0503522    -5.94   0.000    -.3979678   -.2005453
provincedum13 |  -.2348793   .0467408    -5.03   0.000    -.3265107   -.1432479
provincedum14 |  -.3185873   .0628426    -5.07   0.000    -.4417848   -.1953898
provincedum15 |  -.4641437   .0561134    -8.27   0.000    -.5741494   -.3541381
          _m1 |   1.161676   .3650115     3.18   0.001     .4461018     1.87725
          _m2 |  -.1007215   .1175516    -0.86   0.392    -.3311714    .1297284
          _m3 |  -.1820786   .2607335    -0.70   0.485    -.6932246    .3290674
        _cons |    8.05864   .0650728   123.84   0.000      7.93107     8.18621
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .7678827          .        .       .            .           .
        rho1 |   1.325676          .        .       .            .           .
        rho2 |   -.114941          .        .       .            .           .
        rho3 |  -.2077837          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu TakeGaoKa
> o provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlye
> arning, 250, 25000)

. eststo
(est4 stored)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu TakeGaoKao provin
> cedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      5,282    8.478096    .7138417   5.521461   10.12663
        male |      5,282    .5382431    .4985825          0          1
         exp |      5,282    15.03465    6.949144          0         33
      expsqr |      5,282     274.322    232.0598          0       1089
  highvocedu |      5,282    .2527452    .4346272          0          1
-------------+---------------------------------------------------------
  highgenedu |      5,282    .4040136    .4907466          0          1
    adultedu |      5,282    .1099962    .3129147          0          1
  TakeGaoKao |      5,282    .7552064    .4300055          0          1
provincedum2 |      5,282    .0596365    .2368346          0          1
provincedum3 |      5,282    .0630443    .2430656          0          1
-------------+---------------------------------------------------------
provincedum4 |      5,282     .056418     .230749          0          1
provincedum5 |      5,282    .0815979     .273777          0          1
provincedum6 |      5,282    .0533889     .224829          0          1
provincedum7 |      5,282    .0620977    .2413557          0          1
provincedum8 |      5,282    .0789474    .2696821          0          1
-------------+---------------------------------------------------------
provincedum9 |      5,282    .0706172    .2562086          0          1
provinced~10 |      5,282    .0603938    .2382375          0          1
provinced~11 |      5,282    .1321469    .3386825          0          1
provinced~12 |      5,282    .0518743    .2217942          0          1
provinced~13 |      5,282    .0664521    .2490943          0          1
-------------+---------------------------------------------------------
provinced~14 |      5,282     .028209    .1655852          0          1
provinced~15 |      5,282    .0348353    .1833798          0          1
          m1 |      5,282   -.2755776    .0700389  -.4284056  -.0389473
          m2 |      5,282    .4518425    .3425102   .0001547   2.301244
          m3 |      5,282   -.2509943    .1967838   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. *columns 5-8
. 
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(24, 1840)     =     11.98
       Model |  105.264415        24  4.38601729   Prob > F        =    0.0000
    Residual |  673.702795     1,840  .366142824   R-squared       =    0.1351
-------------+----------------------------------   Adj R-squared   =    0.1239
       Total |  778.967211     1,864  .417900864   Root MSE        =     .6051

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1975585    .037834     5.22   0.000     .1233564    .2717606
               exp |   .0647322   .0316784     2.04   0.041     .0026028    .1268615
            expsqr |  -.0018273   .0009357    -1.95   0.051    -.0036625    7.90e-06
         higheredu |   .3283866    .032179    10.20   0.000     .2652754    .3914978
     parent_secedu |  -.0737864   .0339173    -2.18   0.030    -.1403068   -.0072659
    parent_highedu |   .0651514   .0747851     0.87   0.384    -.0815212     .211824
parent_partymember |  -.0180869    .037245    -0.49   0.627    -.0911339    .0549601
      provincedum2 |  -.3987336    .081815    -4.87   0.000    -.5591936   -.2382736
      provincedum3 |  -.3200221   .0854389    -3.75   0.000    -.4875895   -.1524546
      provincedum4 |  -.3367463   .0797054    -4.22   0.000    -.4930688   -.1804237
      provincedum5 |   .0516298   .0753099     0.69   0.493    -.0960721    .1993318
      provincedum6 |  -.1077566   .0906344    -1.19   0.235    -.2855137    .0700004
      provincedum7 |  -.1328862   .0786413    -1.69   0.091    -.2871217    .0213494
      provincedum8 |  -.2717443   .0831355    -3.27   0.001     -.434794   -.1086945
      provincedum9 |  -.0348993   .0782549    -0.45   0.656    -.1883771    .1185785
     provincedum10 |  -.1541861   .0767038    -2.01   0.045    -.3046217   -.0037505
     provincedum11 |   .0691067   .0738116     0.94   0.349    -.0756565    .2138699
     provincedum12 |  -.2536555   .0826759    -3.07   0.002     -.415804    -.091507
     provincedum13 |  -.0679669   .0814185    -0.83   0.404    -.2276493    .0917154
     provincedum14 |  -.2774067   .0894153    -3.10   0.002    -.4527728   -.1020406
     provincedum15 |  -.1385101   .0981945    -1.41   0.159    -.3310946    .0540743
               _m1 |   .4518991   .2470431     1.83   0.068    -.0326151    .9364133
               _m2 |  -1.449731   .7110605    -2.04   0.042    -2.844301   -.0551604
               _m3 |  -1.224391   .6036287    -2.03   0.043    -2.408261   -.0405222
             _cons |   6.093838   .9316689     6.54   0.000     4.266599    7.921078
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.111861          .        .       .            .           .
        rho1 |   .4285645          .        .       .            .           .
        rho2 |  -1.374871          .        .       .            .           .
        rho3 |  -1.161168          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 250, 25000)

. eststo
(est5 stored)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
   higheredu |      1,865    .3163539    .4651775          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
provincedum2 |      1,865    .0654155     .247324          0          1
provincedum3 |      1,865     .044504    .2062674          0          1
-------------+---------------------------------------------------------
provincedum4 |      1,865    .0697051    .2547177          0          1
provincedum5 |      1,865    .0756032    .2644331          0          1
provincedum6 |      1,865    .0493298    .2166137          0          1
provincedum7 |      1,865    .0900804    .2863737          0          1
provincedum8 |      1,865    .0756032    .2644331          0          1
-------------+---------------------------------------------------------
provincedum9 |      1,865    .0654155     .247324          0          1
provinced~10 |      1,865    .0702413    .2556218          0          1
provinced~11 |      1,865    .1115282    .3148695          0          1
provinced~12 |      1,865    .0595174     .236654          0          1
provinced~13 |      1,865    .0670241    .2501308          0          1
-------------+---------------------------------------------------------
provinced~14 |      1,865     .044504    .2062674          0          1
provinced~15 |      1,865    .0300268    .1707068          0          1
          m1 |      1,865    1.126717    .1777359   .8143778    1.98121
          m2 |      1,865   -.5290168    .1438865   -.726001  -.0397592
          m3 |      1,865   -.3423902     .187798  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(26, 1838)     =     11.80
       Model |  111.441128        26  4.28619724   Prob > F        =    0.0000
    Residual |  667.526082     1,838  .363180676   R-squared       =    0.1431
-------------+----------------------------------   Adj R-squared   =    0.1309
       Total |  778.967211     1,864  .417900864   Root MSE        =    .60264

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1984147   .0376864     5.26   0.000      .124502    .2723275
               exp |    .061448   .0316243     1.94   0.052    -.0005754    .1234714
            expsqr |  -.0017835   .0009332    -1.91   0.056    -.0036137    .0000467
        highvocedu |   .2221276   .0460241     4.83   0.000     .1318627    .3123926
        highgenedu |       .582   .0848764     6.86   0.000     .4155357    .7484643
          adultedu |   .3613562   .0399074     9.05   0.000     .2830876    .4396248
     parent_secedu |  -.0757025   .0337899    -2.24   0.025    -.1419731    -.009432
    parent_highedu |   .0532839   .0745557     0.71   0.475     -.092939    .1995067
parent_partymember |  -.0221974   .0371326    -0.60   0.550    -.0950239    .0506291
      provincedum2 |  -.3803934    .081607    -4.66   0.000    -.5404456   -.2203413
      provincedum3 |   -.311029   .0851623    -3.65   0.000     -.478054   -.1440039
      provincedum4 |  -.3185978   .0795479    -4.01   0.000    -.4746116    -.162584
      provincedum5 |   .0724452    .075197     0.96   0.335    -.0750354    .2199257
      provincedum6 |  -.0951918   .0903185    -1.05   0.292    -.2723294    .0819458
      provincedum7 |  -.1261686    .078522    -1.61   0.108    -.2801703    .0278331
      provincedum8 |  -.2563827   .0829188    -3.09   0.002    -.4190077   -.0937578
      provincedum9 |  -.0212492   .0780212    -0.27   0.785    -.1742687    .1317703
     provincedum10 |  -.1346285   .0765429    -1.76   0.079    -.2847487    .0154917
     provincedum11 |    .087586   .0736701     1.19   0.235       -.0569    .2320719
     provincedum12 |  -.2390743   .0824212    -2.90   0.004    -.4007233   -.0774254
     provincedum13 |  -.0519959   .0812271    -0.64   0.522     -.211303    .1073111
     provincedum14 |   -.265273   .0891407    -2.98   0.003    -.4401007   -.0904453
     provincedum15 |  -.1382613    .097798    -1.41   0.158    -.3300682    .0535455
               _m1 |   .4599875   .2460542     1.87   0.062    -.0225877    .9425627
               _m2 |  -1.487807   .7083732    -2.10   0.036    -2.877108   -.0985062
               _m3 |  -1.288951   .6014434    -2.14   0.032    -2.468535   -.1093667
             _cons |   6.073044   .9283693     6.54   0.000     4.252275    7.893814
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.163276          .        .       .            .           .
        rho1 |   .4264859          .        .       .            .           .
        rho2 |  -1.379448          .        .       .            .           .
        rho3 |  -1.195074          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. eststo
(est6 stored)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
  highvocedu |      1,865    .1179625    .3226502          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,865    .0294906    .1692226          0          1
    adultedu |      1,865    .1689008    .3747648          0          1
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
-------------+---------------------------------------------------------
provincedum2 |      1,865    .0654155     .247324          0          1
provincedum3 |      1,865     .044504    .2062674          0          1
provincedum4 |      1,865    .0697051    .2547177          0          1
provincedum5 |      1,865    .0756032    .2644331          0          1
provincedum6 |      1,865    .0493298    .2166137          0          1
-------------+---------------------------------------------------------
provincedum7 |      1,865    .0900804    .2863737          0          1
provincedum8 |      1,865    .0756032    .2644331          0          1
provincedum9 |      1,865    .0654155     .247324          0          1
provinced~10 |      1,865    .0702413    .2556218          0          1
provinced~11 |      1,865    .1115282    .3148695          0          1
-------------+---------------------------------------------------------
provinced~12 |      1,865    .0595174     .236654          0          1
provinced~13 |      1,865    .0670241    .2501308          0          1
provinced~14 |      1,865     .044504    .2062674          0          1
provinced~15 |      1,865    .0300268    .1707068          0          1
          m1 |      1,865    1.126717    .1777359   .8143778    1.98121
-------------+---------------------------------------------------------
          m2 |      1,865   -.5290168    .1438865   -.726001  -.0397592
          m3 |      1,865   -.3423902     .187798  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(24, 4812)     =     33.08
       Model |  347.787511        24  14.4911463   Prob > F        =    0.0000
    Residual |  2107.67984     4,812  .438004955   R-squared       =    0.1416
-------------+----------------------------------   Adj R-squared   =    0.1374
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .66182

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1760281   .0223397     7.88   0.000     .1322321    .2198242
               exp |   .1027927   .0176691     5.82   0.000     .0681532    .1374322
            expsqr |  -.0026868   .0005595    -4.80   0.000    -.0037838   -.0015898
         higheredu |   .3158477   .0261046    12.10   0.000     .2646707    .3670247
     parent_secedu |   .0120008   .0222969     0.54   0.590    -.0317114    .0557129
    parent_highedu |   .0758748   .0358609     2.12   0.034      .005571    .1461786
parent_partymember |   .0057444   .0240606     0.24   0.811    -.0414254    .0529142
      provincedum2 |  -.6974665   .0510823   -13.65   0.000    -.7976111   -.5973219
      provincedum3 |   -.322447   .0482267    -6.69   0.000    -.4169934   -.2279005
      provincedum4 |   -.479533   .0511776    -9.37   0.000    -.5798646   -.3792015
      provincedum5 |  -.0855365   .0462744    -1.85   0.065    -.1762556    .0051825
      provincedum6 |  -.4579412   .0544913    -8.40   0.000     -.564769   -.3511133
      provincedum7 |  -.4086414   .0513342    -7.96   0.000      -.50928   -.3080028
      provincedum8 |  -.6759279   .0505011   -13.38   0.000    -.7749332   -.5769225
      provincedum9 |  -.2012519   .0477269    -4.22   0.000    -.2948185   -.1076853
     provincedum10 |  -.2898767   .0497216    -5.83   0.000    -.3873538   -.1923996
     provincedum11 |  -.1533343   .0430841    -3.56   0.000    -.2377987   -.0688698
     provincedum12 |  -.3211027   .0537974    -5.97   0.000    -.4265702   -.2156351
     provincedum13 |   -.287361   .0495142    -5.80   0.000    -.3844315   -.1902905
     provincedum14 |  -.3521106   .0674932    -5.22   0.000    -.4844282   -.2197931
     provincedum15 |  -.4584539   .0589073    -7.78   0.000    -.5739391   -.3429687
               _m1 |   1.716711    .389855     4.40   0.000     .9524173    2.481005
               _m2 |  -.1855712   .1249656    -1.48   0.138    -.4305609    .0594186
               _m3 |  -.0965606   .2771392    -0.35   0.728    -.6398802    .4467589
             _cons |   8.177623   .0680581   120.16   0.000     8.044198    8.311048
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.192671          .        .       .            .           .
        rho1 |   1.571944          .        .       .            .           .
        rho2 |  -.1699223          .        .       .            .           .
        rho3 |  -.0884178          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 250, 25000)

. eststo
(est7 stored)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
   higheredu |      4,837    .7694852    .4212059          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
provincedum2 |      4,837    .0597478    .2370435          0          1
provincedum3 |      4,837    .0649163    .2464035          0          1
-------------+---------------------------------------------------------
provincedum4 |      4,837    .0587141    .2351131          0          1
provincedum5 |      4,837    .0793881    .2703714          0          1
provincedum6 |      4,837    .0529254    .2239077          0          1
provincedum7 |      4,837    .0632624    .2434594          0          1
provincedum8 |      4,837    .0756667    .2644915          0          1
-------------+---------------------------------------------------------
provincedum9 |      4,837    .0692578    .2539183          0          1
provinced~10 |      4,837    .0618152    .2408445          0          1
provinced~11 |      4,837     .130246    .3366087          0          1
provinced~12 |      4,837    .0504445     .218883          0          1
provinced~13 |      4,837    .0667769    .2496611          0          1
-------------+---------------------------------------------------------
provinced~14 |      4,837    .0274964    .1635416          0          1
provinced~15 |      4,837    .0361795    .1867557          0          1
          m1 |      4,837   -.2757319    .0699284  -.4284056  -.0389473
          m2 |      4,837    .4594164    .3457812   .0001547   2.301244
          m3 |      4,837   -.2558632    .1983774   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(26, 4810)     =     38.19
       Model |  420.178709        26  16.1607196   Prob > F        =    0.0000
    Residual |  2035.28865     4,810  .423136933   R-squared       =    0.1711
-------------+----------------------------------   Adj R-squared   =    0.1666
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .65049

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |    .185784   .0219949     8.45   0.000     .1426639     .228904
               exp |   .0916346   .0173917     5.27   0.000     .0575389    .1257303
            expsqr |  -.0024509   .0005504    -4.45   0.000    -.0035299    -.001372
        highvocedu |   .1766677   .0296184     5.96   0.000     .1186022    .2347333
        highgenedu |   .4883606   .0291739    16.74   0.000     .4311663    .5455549
          adultedu |   .2604128   .0349095     7.46   0.000     .1919743    .3288513
     parent_secedu |   .0029834   .0219262     0.14   0.892     -.040002    .0459687
    parent_highedu |   .0379282   .0353685     1.07   0.284    -.0314102    .1072665
parent_partymember |  -.0037483   .0236619    -0.16   0.874    -.0501363    .0426398
      provincedum2 |  -.6271756   .0505056   -12.42   0.000    -.7261897   -.5281614
      provincedum3 |  -.2893093     .04747    -6.09   0.000    -.3823722   -.1962463
      provincedum4 |  -.4528193   .0503451    -8.99   0.000    -.5515187   -.3541199
      provincedum5 |  -.0583283   .0455568    -1.28   0.200    -.1476405     .030984
      provincedum6 |   -.399695   .0537574    -7.44   0.000     -.505084    -.294306
      provincedum7 |  -.3534877    .050657    -6.98   0.000    -.4527986   -.2541767
      provincedum8 |  -.6055916   .0499372   -12.13   0.000    -.7034914   -.5076917
      provincedum9 |  -.1557699   .0470743    -3.31   0.001    -.2480571   -.0634827
     provincedum10 |  -.2263523   .0491208    -4.61   0.000    -.3226516    -.130053
     provincedum11 |   -.096579   .0425812    -2.27   0.023    -.1800576   -.0131005
     provincedum12 |   -.268727    .053029    -5.07   0.000     -.372688   -.1647659
     provincedum13 |  -.2281073   .0488799    -4.67   0.000    -.3239343   -.1322803
     provincedum14 |  -.3116139   .0664241    -4.69   0.000    -.4418356   -.1813922
     provincedum15 |  -.4489627   .0579216    -7.75   0.000    -.5625155   -.3354099
               _m1 |   1.342462   .3842629     3.49   0.000     .5891307    2.095793
               _m2 |  -.1364538   .1229386    -1.11   0.267    -.3774696     .104562
               _m3 |  -.2065646   .2730389    -0.76   0.449    -.7418457    .3287165
             _cons |    8.05762   .0676855   119.04   0.000     7.924925    8.190314
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .8894093          .        .       .            .           .
        rho1 |   1.423479          .        .       .            .           .
        rho2 |  -.1446888          .        .       .            .           .
        rho3 |  -.2190308          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. eststo
(est8 stored)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
  highvocedu |      4,837    .2464337    .4309786          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,837    .4085177    .4916106          0          1
    adultedu |      4,837    .1145338    .3184914          0          1
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
-------------+---------------------------------------------------------
provincedum2 |      4,837    .0597478    .2370435          0          1
provincedum3 |      4,837    .0649163    .2464035          0          1
provincedum4 |      4,837    .0587141    .2351131          0          1
provincedum5 |      4,837    .0793881    .2703714          0          1
provincedum6 |      4,837    .0529254    .2239077          0          1
-------------+---------------------------------------------------------
provincedum7 |      4,837    .0632624    .2434594          0          1
provincedum8 |      4,837    .0756667    .2644915          0          1
provincedum9 |      4,837    .0692578    .2539183          0          1
provinced~10 |      4,837    .0618152    .2408445          0          1
provinced~11 |      4,837     .130246    .3366087          0          1
-------------+---------------------------------------------------------
provinced~12 |      4,837    .0504445     .218883          0          1
provinced~13 |      4,837    .0667769    .2496611          0          1
provinced~14 |      4,837    .0274964    .1635416          0          1
provinced~15 |      4,837    .0361795    .1867557          0          1
          m1 |      4,837   -.2757319    .0699284  -.4284056  -.0389473
-------------+---------------------------------------------------------
          m2 |      4,837    .4594164    .3457812   .0001547   2.301244
          m3 |      4,837   -.2558632    .1983774   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. 
. 
. ***Table 4 Generation
. 
. local variablenames m1 m2 m3

. local variablelabels ""Upper secondary vocational track selection correction" "Upper second
> ary general track selection correction" "No upper secondary degree selection correction""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. local estlist est1 est2 est3 est4 est5 est6 est7 est8

. 
. outreg2 [`estlist'] using "Table 4/Table4.xls", excel replace pvalue adjr2 drop(provincedum
> *) dec(3) sortvar(male exp expsqr higheredu) title("Table 4 (TakeGaokao 1-4, Parent indicat
> ors 5-8; Sec Voc 1-2, Sec Gen 3-4; Non-specified 1 3 Specified 2 4)") ctitle(" ") addnote("
> More notes") label
Table 4/Table4.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. 
. 
. ***Table 6 with sequence: Unemployment types (A20=5 or A20=5|9) > Two_tracks > Higher_edu C
> ombined/Seperated, 2*2*2=8 columns in total.
. 
. *Prepare
. 
. drop m1 m2 m3

. local folderpath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 
> 2 4 6 8 10"

. local filename "Urban tables"

. local datapath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/20240716 Urban 
> Chip2018 and Instrumental Statistics and Inflation.dta"

. 
. 
. local xlspath "`folderpath'/`filename'.xls"

. 
. eststo clear

. 
. *Columns
. 
. selmlog voc_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bir
> thyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_e
> ntrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(21, 2279)     =      1.25
       Model |  .808013855        21   .03847685   Prob > F        =    0.1948
    Residual |  69.8760366     2,279  .030660832   R-squared       =    0.0114
-------------+----------------------------------   Adj R-squared   =    0.0023
       Total |  70.6840504     2,300  .030732196   Root MSE        =     .1751

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0121635   .0099484    -1.22   0.222    -.0316723    .0073454
          exp |  -.0023694   .0089761    -0.26   0.792    -.0199717    .0152329
       expsqr |   .0000768   .0002683     0.29   0.775    -.0004493    .0006028
    higheredu |  -.0075929   .0084588    -0.90   0.369    -.0241807    .0089949
 provincedum2 |    -.02692   .0215161    -1.25   0.211    -.0691132    .0152732
 provincedum3 |  -.0326031    .022892    -1.42   0.155    -.0774943    .0122882
 provincedum4 |   .0131552   .0208856     0.63   0.529    -.0278015    .0541119
 provincedum5 |   .0036385   .0195135     0.19   0.852    -.0346277    .0419047
 provincedum6 |  -.0167005   .0239991    -0.70   0.487    -.0637629    .0303619
 provincedum7 |  -.0100103   .0209433    -0.48   0.633    -.0510802    .0310595
 provincedum8 |  -.0241362   .0218395    -1.11   0.269    -.0669636    .0186911
 provincedum9 |  -.0183305   .0205873    -0.89   0.373    -.0587022    .0220413
provincedum10 |  -.0114584   .0207578    -0.55   0.581    -.0521646    .0292478
provincedum11 |  -.0152354    .019551    -0.78   0.436     -.053575    .0231042
provincedum12 |   -.018922   .0220141    -0.86   0.390    -.0620917    .0242477
provincedum13 |  -.0160396   .0218414    -0.73   0.463    -.0588707    .0267914
provincedum14 |    .040282    .023918     1.68   0.092    -.0066212    .0871853
provincedum15 |  -.0273524   .0270096    -1.01   0.311    -.0803184    .0256136
          _m1 |  -.0064687   .0719408    -0.09   0.928    -.1475449    .1346076
          _m2 |  -.0318016   .2053041    -0.15   0.877     -.434404    .3708009
          _m3 |  -.0460362   .1696502    -0.27   0.786    -.3787213    .2866488
        _cons |   .0396427   .2747141     0.14   0.885    -.4990732    .5783587
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0309792          .        .       .            .           .
        rho1 |  -.0367519          .        .       .            .           .
        rho2 |  -.1806814          .        .       .            .           .
        rho3 |  -.2615559          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if in
> range(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(21, 2279)     =      1.25
       Model |  .808013855        21   .03847685   Prob > F        =    0.1948
    Residual |  69.8760366     2,279  .030660832   R-squared       =    0.0114
-------------+----------------------------------   Adj R-squared   =    0.0023
       Total |  70.6840504     2,300  .030732196   Root MSE        =     .1751

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0121635   .0099484    -1.22   0.222    -.0316723    .0073454
          exp |  -.0023694   .0089761    -0.26   0.792    -.0199717    .0152329
       expsqr |   .0000768   .0002683     0.29   0.775    -.0004493    .0006028
    higheredu |  -.0075929   .0084588    -0.90   0.369    -.0241807    .0089949
 provincedum2 |    -.02692   .0215161    -1.25   0.211    -.0691132    .0152732
 provincedum3 |  -.0326031    .022892    -1.42   0.155    -.0774943    .0122882
 provincedum4 |   .0131552   .0208856     0.63   0.529    -.0278015    .0541119
 provincedum5 |   .0036385   .0195135     0.19   0.852    -.0346277    .0419047
 provincedum6 |  -.0167005   .0239991    -0.70   0.487    -.0637629    .0303619
 provincedum7 |  -.0100103   .0209433    -0.48   0.633    -.0510802    .0310595
 provincedum8 |  -.0241362   .0218395    -1.11   0.269    -.0669636    .0186911
 provincedum9 |  -.0183305   .0205873    -0.89   0.373    -.0587022    .0220413
provincedum10 |  -.0114584   .0207578    -0.55   0.581    -.0521646    .0292478
provincedum11 |  -.0152354    .019551    -0.78   0.436     -.053575    .0231042
provincedum12 |   -.018922   .0220141    -0.86   0.390    -.0620917    .0242477
provincedum13 |  -.0160396   .0218414    -0.73   0.463    -.0588707    .0267914
provincedum14 |    .040282    .023918     1.68   0.092    -.0066212    .0871853
provincedum15 |  -.0273524   .0270096    -1.01   0.311    -.0803184    .0256136
           m1 |  -.0064687   .0719408    -0.09   0.928    -.1475449    .1346076
           m2 |  -.0318016   .2053041    -0.15   0.877     -.434404    .3708009
           m3 |  -.0460362   .1696502    -0.27   0.786    -.3787213    .2866488
        _cons |   .0396427   .2747141     0.14   0.885    -.4990732    .5783587
-------------------------------------------------------------------------------

. eststo
(est1 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_re
> lative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(23, 2277)     =      1.35
       Model |  .953465161        23  .041455007   Prob > F        =    0.1212
    Residual |  69.7305853     2,277  .030623885   R-squared       =    0.0135
-------------+----------------------------------   Adj R-squared   =    0.0035
       Total |  70.6840504     2,300  .030732196   Root MSE        =      .175

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.012614   .0099457    -1.27   0.205    -.0321176    .0068895
          exp |  -.0010952   .0090026    -0.12   0.903    -.0187493    .0165589
       expsqr |   .0000495   .0002688     0.18   0.854    -.0004775    .0005766
   highvocedu |   .0110454    .012035     0.92   0.359    -.0125554    .0346462
   highgenedu |  -.0161096   .0226747    -0.71   0.477    -.0605749    .0283556
     adultedu |  -.0204795   .0108467    -1.89   0.059    -.0417499    .0007909
 provincedum2 |  -.0295645   .0215408    -1.37   0.170    -.0718062    .0126773
 provincedum3 |  -.0344292    .022902    -1.50   0.133    -.0793403    .0104818
 provincedum4 |   .0096061   .0209367     0.46   0.646     -.031451    .0506632
 provincedum5 |   .0004225   .0195579     0.02   0.983    -.0379306    .0387757
 provincedum6 |  -.0184842   .0240007    -0.77   0.441    -.0655498    .0285814
 provincedum7 |  -.0129513   .0209932    -0.62   0.537    -.0541191    .0282165
 provincedum8 |  -.0276116   .0218845    -1.26   0.207    -.0705272    .0153041
 provincedum9 |  -.0199438   .0205953    -0.97   0.333    -.0603314    .0204437
provincedum10 |   -.014009    .020782    -0.67   0.500    -.0547627    .0267446
provincedum11 |  -.0181147   .0195839    -0.92   0.355    -.0565187    .0202894
provincedum12 |  -.0211192    .022026    -0.96   0.338    -.0643123    .0220739
provincedum13 |  -.0187988    .021865    -0.86   0.390    -.0616762    .0240786
provincedum14 |   .0394927   .0239194     1.65   0.099    -.0074133    .0863988
provincedum15 |  -.0275661   .0269937    -1.02   0.307     -.080501    .0253687
          _m1 |  -.0053215   .0719373    -0.07   0.941     -.146391     .135748
          _m2 |  -.0348292   .2053445    -0.17   0.865    -.4375111    .3678528
          _m3 |  -.0434434   .1697167    -0.26   0.798     -.376259    .2893722
        _cons |   .0272986   .2749107     0.10   0.921     -.511803    .5664001
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0308929          .        .       .            .           .
        rho1 |  -.0302763          .        .       .            .           .
        rho2 |  -.1981587          .        .       .            .           .
        rho3 |   -.247169          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(23, 2277)     =      1.35
       Model |  .953465161        23  .041455007   Prob > F        =    0.1212
    Residual |  69.7305853     2,277  .030623885   R-squared       =    0.0135
-------------+----------------------------------   Adj R-squared   =    0.0035
       Total |  70.6840504     2,300  .030732196   Root MSE        =      .175

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.012614   .0099457    -1.27   0.205    -.0321176    .0068895
          exp |  -.0010952   .0090026    -0.12   0.903    -.0187493    .0165589
       expsqr |   .0000495   .0002688     0.18   0.854    -.0004775    .0005766
   highvocedu |   .0110454    .012035     0.92   0.359    -.0125554    .0346462
   highgenedu |  -.0161096   .0226747    -0.71   0.477    -.0605749    .0283556
     adultedu |  -.0204795   .0108467    -1.89   0.059    -.0417499    .0007909
 provincedum2 |  -.0295645   .0215408    -1.37   0.170    -.0718062    .0126773
 provincedum3 |  -.0344292    .022902    -1.50   0.133    -.0793403    .0104818
 provincedum4 |   .0096061   .0209367     0.46   0.646     -.031451    .0506632
 provincedum5 |   .0004225   .0195579     0.02   0.983    -.0379306    .0387757
 provincedum6 |  -.0184842   .0240007    -0.77   0.441    -.0655498    .0285814
 provincedum7 |  -.0129513   .0209932    -0.62   0.537    -.0541191    .0282165
 provincedum8 |  -.0276116   .0218845    -1.26   0.207    -.0705272    .0153041
 provincedum9 |  -.0199438   .0205953    -0.97   0.333    -.0603314    .0204437
provincedum10 |   -.014009    .020782    -0.67   0.500    -.0547627    .0267446
provincedum11 |  -.0181147   .0195839    -0.92   0.355    -.0565187    .0202894
provincedum12 |  -.0211192    .022026    -0.96   0.338    -.0643123    .0220739
provincedum13 |  -.0187988    .021865    -0.86   0.390    -.0616762    .0240786
provincedum14 |   .0394927   .0239194     1.65   0.099    -.0074133    .0863988
provincedum15 |  -.0275661   .0269937    -1.02   0.307     -.080501    .0253687
           m1 |  -.0053215   .0719373    -0.07   0.941     -.146391     .135748
           m2 |  -.0348292   .2053445    -0.17   0.865    -.4375111    .3678528
           m3 |  -.0434434   .1697167    -0.26   0.798     -.376259    .2893722
        _cons |   .0272986   .2749107     0.10   0.921     -.511803    .5664001
-------------------------------------------------------------------------------

. eststo
(est2 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bir
> thyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_e
> ntrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(21, 5767)     =      2.25
       Model |  .969053703        21  .046145414   Prob > F        =    0.0009
    Residual |  118.459863     5,767  .020540985   R-squared       =    0.0081
-------------+----------------------------------   Adj R-squared   =    0.0045
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14332

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0082103   .0043065    -1.91   0.057    -.0166525     .000232
          exp |  -.0032664    .003515    -0.93   0.353    -.0101571    .0036243
       expsqr |   .0000528   .0001109     0.48   0.634    -.0001646    .0002702
    higheredu |  -.0142382   .0050138    -2.84   0.005    -.0240671   -.0044093
 provincedum2 |    .001715   .0100262     0.17   0.864      -.01794      .02137
 provincedum3 |  -.0136138   .0097396    -1.40   0.162    -.0327071    .0054795
 provincedum4 |     .00066   .0101919     0.06   0.948    -.0193199      .02064
 provincedum5 |   .0033293   .0091114     0.37   0.715    -.0145324    .0211911
 provincedum6 |   .0134924   .0108319     1.25   0.213    -.0077422     .034727
 provincedum7 |   .0033808   .0102376     0.33   0.741    -.0166887    .0234503
 provincedum8 |   -.002839   .0097959    -0.29   0.772    -.0220425    .0163646
 provincedum9 |  -.0110235   .0094161    -1.17   0.242    -.0294826    .0074357
provincedum10 |  -.0010221   .0099996    -0.10   0.919    -.0206251     .018581
provincedum11 |  -.0090747   .0085109    -1.07   0.286    -.0257592    .0076099
provincedum12 |   .0018618   .0106702     0.17   0.861    -.0190558    .0227794
provincedum13 |   .0097171   .0097986     0.99   0.321    -.0094919    .0289261
provincedum14 |  -.0012319   .0134026    -0.09   0.927    -.0275062    .0250423
provincedum15 |    -.00818   .0120502    -0.68   0.497    -.0318029    .0154429
          _m1 |  -.0249217   .0779336    -0.32   0.749    -.1777007    .1278573
          _m2 |    .062982   .0221173     2.85   0.004     .0196238    .1063402
          _m3 |   .0671928   .0487237     1.38   0.168     -.028324    .1627097
        _cons |   .0530411   .0130621     4.06   0.000     .0274345    .0786477
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0226699          .        .       .            .           .
        rho1 |  -.1655209          .        .       .            .           .
        rho2 |   .4183034          .        .       .            .           .
        rho3 |   .4462703          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if in
> range(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(21, 5767)     =      2.25
       Model |  .969053703        21  .046145414   Prob > F        =    0.0009
    Residual |  118.459863     5,767  .020540985   R-squared       =    0.0081
-------------+----------------------------------   Adj R-squared   =    0.0045
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14332

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0082103   .0043065    -1.91   0.057    -.0166525     .000232
          exp |  -.0032664    .003515    -0.93   0.353    -.0101571    .0036243
       expsqr |   .0000528   .0001109     0.48   0.634    -.0001646    .0002702
    higheredu |  -.0142382   .0050138    -2.84   0.005    -.0240671   -.0044093
 provincedum2 |    .001715   .0100262     0.17   0.864      -.01794      .02137
 provincedum3 |  -.0136138   .0097396    -1.40   0.162    -.0327071    .0054795
 provincedum4 |     .00066   .0101919     0.06   0.948    -.0193199      .02064
 provincedum5 |   .0033293   .0091114     0.37   0.715    -.0145324    .0211911
 provincedum6 |   .0134924   .0108319     1.25   0.213    -.0077422     .034727
 provincedum7 |   .0033808   .0102376     0.33   0.741    -.0166887    .0234503
 provincedum8 |   -.002839   .0097959    -0.29   0.772    -.0220425    .0163646
 provincedum9 |  -.0110235   .0094161    -1.17   0.242    -.0294826    .0074357
provincedum10 |  -.0010221   .0099996    -0.10   0.919    -.0206251     .018581
provincedum11 |  -.0090747   .0085109    -1.07   0.286    -.0257592    .0076099
provincedum12 |   .0018618   .0106702     0.17   0.861    -.0190558    .0227794
provincedum13 |   .0097171   .0097986     0.99   0.321    -.0094919    .0289261
provincedum14 |  -.0012319   .0134026    -0.09   0.927    -.0275062    .0250423
provincedum15 |    -.00818   .0120502    -0.68   0.497    -.0318029    .0154429
           m1 |  -.0249217   .0779336    -0.32   0.749    -.1777007    .1278573
           m2 |    .062982   .0221173     2.85   0.004     .0196238    .1063402
           m3 |   .0671928   .0487237     1.38   0.168     -.028324    .1627097
        _cons |   .0530411   .0130621     4.06   0.000     .0274345    .0786477
-------------------------------------------------------------------------------

. eststo
(est3 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_re
> lative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(23, 5765)     =      2.44
       Model |  1.15062813        23   .05002731   Prob > F        =    0.0001
    Residual |  118.278289     5,765  .020516616   R-squared       =    0.0096
-------------+----------------------------------   Adj R-squared   =    0.0057
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14324

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0085794   .0043063    -1.99   0.046    -.0170214   -.0001373
          exp |  -.0027813   .0035167    -0.79   0.429    -.0096753    .0041127
       expsqr |   .0000421   .0001109     0.38   0.704    -.0001752    .0002595
   highvocedu |  -.0061158   .0057978    -1.05   0.292    -.0174817    .0052501
   highgenedu |  -.0204184   .0057162    -3.57   0.000    -.0316243   -.0092126
     adultedu |  -.0172301   .0070628    -2.44   0.015    -.0310759   -.0033844
 provincedum2 |  -.0014992   .0100808    -0.15   0.882    -.0212614     .018263
 provincedum3 |  -.0150159   .0097452    -1.54   0.123    -.0341203    .0040884
 provincedum4 |  -.0005232   .0101942    -0.05   0.959    -.0205076    .0194613
 provincedum5 |   .0018523   .0091213     0.20   0.839    -.0160288    .0197335
 provincedum6 |   .0107759   .0108647     0.99   0.321     -.010523    .0320748
 provincedum7 |   .0006025   .0102741     0.06   0.953    -.0195385    .0207435
 provincedum8 |  -.0062547   .0098595    -0.63   0.526    -.0255831    .0130737
 provincedum9 |  -.0132324   .0094403    -1.40   0.161    -.0317389    .0052741
provincedum10 |  -.0041772   .0100511    -0.42   0.678    -.0238811    .0155268
provincedum11 |  -.0118022   .0085571    -1.38   0.168    -.0285773    .0049729
provincedum12 |  -.0001494   .0106903    -0.01   0.989    -.0211063    .0208075
provincedum13 |   .0070706   .0098367     0.72   0.472     -.012213    .0263542
provincedum14 |  -.0029278   .0134142    -0.22   0.827    -.0292246     .023369
provincedum15 |   -.008793   .0120461    -0.73   0.465    -.0324079    .0148219
          _m1 |  -.0088795    .078098    -0.11   0.909    -.1619808    .1442219
          _m2 |   .0600751   .0221262     2.72   0.007     .0166995    .1034508
          _m3 |   .0678729   .0487941     1.39   0.164    -.0277819    .1635278
        _cons |   .0575963   .0132524     4.35   0.000     .0316167     .083576
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0224029          .        .       .            .           .
        rho1 |  -.0593245          .        .       .            .           .
        rho2 |   .4013676          .        .       .            .           .
        rho3 |   .4534654          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(23, 5765)     =      2.44
       Model |  1.15062813        23   .05002731   Prob > F        =    0.0001
    Residual |  118.278289     5,765  .020516616   R-squared       =    0.0096
-------------+----------------------------------   Adj R-squared   =    0.0057
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14324

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0085794   .0043063    -1.99   0.046    -.0170214   -.0001373
          exp |  -.0027813   .0035167    -0.79   0.429    -.0096753    .0041127
       expsqr |   .0000421   .0001109     0.38   0.704    -.0001752    .0002595
   highvocedu |  -.0061158   .0057978    -1.05   0.292    -.0174817    .0052501
   highgenedu |  -.0204184   .0057162    -3.57   0.000    -.0316243   -.0092126
     adultedu |  -.0172301   .0070628    -2.44   0.015    -.0310759   -.0033844
 provincedum2 |  -.0014992   .0100808    -0.15   0.882    -.0212614     .018263
 provincedum3 |  -.0150159   .0097452    -1.54   0.123    -.0341203    .0040884
 provincedum4 |  -.0005232   .0101942    -0.05   0.959    -.0205076    .0194613
 provincedum5 |   .0018523   .0091213     0.20   0.839    -.0160288    .0197335
 provincedum6 |   .0107759   .0108647     0.99   0.321     -.010523    .0320748
 provincedum7 |   .0006025   .0102741     0.06   0.953    -.0195385    .0207435
 provincedum8 |  -.0062547   .0098595    -0.63   0.526    -.0255831    .0130737
 provincedum9 |  -.0132324   .0094403    -1.40   0.161    -.0317389    .0052741
provincedum10 |  -.0041772   .0100511    -0.42   0.678    -.0238811    .0155268
provincedum11 |  -.0118022   .0085571    -1.38   0.168    -.0285773    .0049729
provincedum12 |  -.0001494   .0106903    -0.01   0.989    -.0211063    .0208075
provincedum13 |   .0070706   .0098367     0.72   0.472     -.012213    .0263542
provincedum14 |  -.0029278   .0134142    -0.22   0.827    -.0292246     .023369
provincedum15 |   -.008793   .0120461    -0.73   0.465    -.0324079    .0148219
           m1 |  -.0088795    .078098    -0.11   0.909    -.1619808    .1442219
           m2 |   .0600751   .0221262     2.72   0.007     .0166995    .1034508
           m3 |   .0678729   .0487941     1.39   0.164    -.0277819    .1635278
        _cons |   .0575963   .0132524     4.35   0.000     .0316167     .083576
-------------------------------------------------------------------------------

. eststo
(est4 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bi
> rthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_
> entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(21, 2279)     =      2.11
       Model |  2.60423066        21  .124010984   Prob > F        =    0.0023
    Residual |  134.131971     2,279  .058855626   R-squared       =    0.0190
-------------+----------------------------------   Adj R-squared   =    0.0100
       Total |  136.736202     2,300  .059450522   Root MSE        =     .2426

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0528266   .0137833    -3.83   0.000    -.0798558   -.0257974
          exp |  -.0004193   .0124363    -0.03   0.973     -.024807    .0239684
       expsqr |  -.0000893   .0003717    -0.24   0.810    -.0008181    .0006396
    higheredu |  -.0185933   .0117196    -1.59   0.113    -.0415755    .0043889
 provincedum2 |   -.016751   .0298102    -0.56   0.574     -.075209     .041707
 provincedum3 |  -.0005436   .0317165    -0.02   0.986    -.0627398    .0616526
 provincedum4 |   .0218756   .0289367     0.76   0.450    -.0348694    .0786205
 provincedum5 |   .0089768   .0270357     0.33   0.740    -.0440405     .061994
 provincedum6 |  -.0318399   .0332504    -0.96   0.338    -.0970442    .0333643
 provincedum7 |  -.0184331   .0290166    -0.64   0.525    -.0753348    .0384686
 provincedum8 |  -.0281875   .0302583    -0.93   0.352    -.0875241    .0311491
 provincedum9 |  -.0181179   .0285234    -0.64   0.525    -.0740524    .0378166
provincedum10 |   -.010814   .0287597    -0.38   0.707    -.0672119    .0455838
provincedum11 |  -.0248926   .0270876    -0.92   0.358    -.0780116    .0282264
provincedum12 |  -.0411657   .0305002    -1.35   0.177    -.1009767    .0186453
provincedum13 |  -.0182349   .0302609    -0.60   0.547    -.0775768    .0411069
provincedum14 |   .0233892    .033138     0.71   0.480    -.0415947     .088373
provincedum15 |   -.052641   .0374214    -1.41   0.160    -.1260246    .0207426
          _m1 |   .0464239   .0996729     0.47   0.641    -.1490352     .241883
          _m2 |  -.5164052   .2844459    -1.82   0.070    -1.074205    .0413947
          _m3 |  -.5155643    .235048    -2.19   0.028    -.9764946    -.054634
        _cons |  -.3555591   .3806125    -0.93   0.350    -1.101942    .3908241
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1551768          .        .       .            .           .
        rho1 |   .1178497          .        .       .            .           .
        rho2 |  -1.310923          .        .       .            .           .
        rho3 |  -1.308789          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if i
> nrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(21, 2279)     =      2.11
       Model |  2.60423066        21  .124010984   Prob > F        =    0.0023
    Residual |  134.131971     2,279  .058855626   R-squared       =    0.0190
-------------+----------------------------------   Adj R-squared   =    0.0100
       Total |  136.736202     2,300  .059450522   Root MSE        =     .2426

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0528266   .0137833    -3.83   0.000    -.0798558   -.0257974
          exp |  -.0004193   .0124363    -0.03   0.973     -.024807    .0239684
       expsqr |  -.0000893   .0003717    -0.24   0.810    -.0008181    .0006396
    higheredu |  -.0185933   .0117196    -1.59   0.113    -.0415755    .0043889
 provincedum2 |   -.016751   .0298102    -0.56   0.574     -.075209     .041707
 provincedum3 |  -.0005436   .0317165    -0.02   0.986    -.0627398    .0616526
 provincedum4 |   .0218756   .0289367     0.76   0.450    -.0348694    .0786205
 provincedum5 |   .0089768   .0270357     0.33   0.740    -.0440405     .061994
 provincedum6 |  -.0318399   .0332504    -0.96   0.338    -.0970442    .0333643
 provincedum7 |  -.0184331   .0290166    -0.64   0.525    -.0753348    .0384686
 provincedum8 |  -.0281875   .0302583    -0.93   0.352    -.0875241    .0311491
 provincedum9 |  -.0181179   .0285234    -0.64   0.525    -.0740524    .0378166
provincedum10 |   -.010814   .0287597    -0.38   0.707    -.0672119    .0455838
provincedum11 |  -.0248926   .0270876    -0.92   0.358    -.0780116    .0282264
provincedum12 |  -.0411657   .0305002    -1.35   0.177    -.1009767    .0186453
provincedum13 |  -.0182349   .0302609    -0.60   0.547    -.0775768    .0411069
provincedum14 |   .0233892    .033138     0.71   0.480    -.0415947     .088373
provincedum15 |   -.052641   .0374214    -1.41   0.160    -.1260246    .0207426
           m1 |   .0464239   .0996729     0.47   0.641    -.1490352     .241883
           m2 |  -.5164052   .2844459    -1.82   0.070    -1.074205    .0413947
           m3 |  -.5155643    .235048    -2.19   0.028    -.9764946    -.054634
        _cons |  -.3555591   .3806125    -0.93   0.350    -1.101942    .3908241
-------------------------------------------------------------------------------

. eststo
(est5 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_r
> elative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(23, 2277)     =      2.13
       Model |  2.88066673        23  .125246379   Prob > F        =    0.0014
    Residual |  133.855535     2,277  .058785918   R-squared       =    0.0211
-------------+----------------------------------   Adj R-squared   =    0.0112
       Total |  136.736202     2,300  .059450522   Root MSE        =    .24246

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0534129   .0137798    -3.88   0.000    -.0804351   -.0263907
          exp |   .0012279    .012473     0.10   0.922    -.0232318    .0256877
       expsqr |  -.0001236   .0003724    -0.33   0.740    -.0008538    .0006066
   highvocedu |   .0071397   .0166745     0.43   0.669    -.0255592    .0398386
   highgenedu |  -.0348174   .0314158    -1.11   0.268    -.0964239    .0267892
     adultedu |  -.0355804   .0150281    -2.37   0.018    -.0650506   -.0061102
 provincedum2 |   -.020472   .0298448    -0.69   0.493    -.0789979    .0380539
 provincedum3 |   -.002918   .0317308    -0.09   0.927    -.0651423    .0593062
 provincedum4 |   .0169702   .0290079     0.59   0.559    -.0399144    .0738548
 provincedum5 |   .0045299   .0270974     0.17   0.867    -.0486083    .0576682
 provincedum6 |  -.0343622    .033253    -1.03   0.302    -.0995716    .0308472
 provincedum7 |  -.0222813   .0290861    -0.77   0.444    -.0793193    .0347567
 provincedum8 |   -.032961    .030321    -1.09   0.277    -.0924206    .0264986
 provincedum9 |  -.0204548   .0285348    -0.72   0.474    -.0764118    .0355022
provincedum10 |  -.0144068   .0287935    -0.50   0.617    -.0708709    .0420574
provincedum11 |  -.0288444   .0271334    -1.06   0.288    -.0820533    .0243644
provincedum12 |   -.044253    .030517    -1.45   0.147    -.1040971     .015591
provincedum13 |  -.0220418   .0302939    -0.73   0.467    -.0814484    .0373648
provincedum14 |   .0221312   .0331403     0.67   0.504    -.0428572    .0871195
provincedum15 |  -.0529112   .0373998    -1.41   0.157    -.1262524    .0204301
          _m1 |   .0474909   .0996691     0.48   0.634    -.1479609    .2429427
          _m2 |  -.5188013   .2845048    -1.82   0.068    -1.076717    .0391145
          _m3 |  -.5103678   .2351425    -2.17   0.030    -.9714838   -.0492519
        _cons |  -.3697112   .3808887    -0.97   0.332    -1.116636     .377214
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1544299          .        .       .            .           .
        rho1 |   .1208495          .        .       .            .           .
        rho2 |  -1.320187          .        .       .            .           .
        rho3 |  -1.298726          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(23, 2277)     =      2.13
       Model |  2.88066673        23  .125246379   Prob > F        =    0.0014
    Residual |  133.855535     2,277  .058785918   R-squared       =    0.0211
-------------+----------------------------------   Adj R-squared   =    0.0112
       Total |  136.736202     2,300  .059450522   Root MSE        =    .24246

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0534129   .0137798    -3.88   0.000    -.0804351   -.0263907
          exp |   .0012279    .012473     0.10   0.922    -.0232318    .0256877
       expsqr |  -.0001236   .0003724    -0.33   0.740    -.0008538    .0006066
   highvocedu |   .0071397   .0166745     0.43   0.669    -.0255592    .0398386
   highgenedu |  -.0348174   .0314158    -1.11   0.268    -.0964239    .0267892
     adultedu |  -.0355804   .0150281    -2.37   0.018    -.0650506   -.0061102
 provincedum2 |   -.020472   .0298448    -0.69   0.493    -.0789979    .0380539
 provincedum3 |   -.002918   .0317308    -0.09   0.927    -.0651423    .0593062
 provincedum4 |   .0169702   .0290079     0.59   0.559    -.0399144    .0738548
 provincedum5 |   .0045299   .0270974     0.17   0.867    -.0486083    .0576682
 provincedum6 |  -.0343622    .033253    -1.03   0.302    -.0995716    .0308472
 provincedum7 |  -.0222813   .0290861    -0.77   0.444    -.0793193    .0347567
 provincedum8 |   -.032961    .030321    -1.09   0.277    -.0924206    .0264986
 provincedum9 |  -.0204548   .0285348    -0.72   0.474    -.0764118    .0355022
provincedum10 |  -.0144068   .0287935    -0.50   0.617    -.0708709    .0420574
provincedum11 |  -.0288444   .0271334    -1.06   0.288    -.0820533    .0243644
provincedum12 |   -.044253    .030517    -1.45   0.147    -.1040971     .015591
provincedum13 |  -.0220418   .0302939    -0.73   0.467    -.0814484    .0373648
provincedum14 |   .0221312   .0331403     0.67   0.504    -.0428572    .0871195
provincedum15 |  -.0529112   .0373998    -1.41   0.157    -.1262524    .0204301
           m1 |   .0474909   .0996691     0.48   0.634    -.1479609    .2429427
           m2 |  -.5188013   .2845048    -1.82   0.068    -1.076717    .0391145
           m3 |  -.5103678   .2351425    -2.17   0.030    -.9714838   -.0492519
        _cons |  -.3697112   .3808887    -0.97   0.332    -1.116636     .377214
-------------------------------------------------------------------------------

. eststo
(est6 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bi
> rthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_
> entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(21, 5767)     =      4.47
       Model |  4.02424945        21  .191630926   Prob > F        =    0.0000
    Residual |    247.0274     5,767  .042834645   R-squared       =    0.0160
-------------+----------------------------------   Adj R-squared   =    0.0124
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20697

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0204297   .0062188    -3.29   0.001    -.0326209   -.0082384
          exp |  -.0068726   .0050759    -1.35   0.176    -.0168232     .003078
       expsqr |   .0001271   .0001601     0.79   0.427    -.0001868    .0004411
    higheredu |  -.0334206   .0072403    -4.62   0.000    -.0476143    -.019227
 provincedum2 |   .0162509   .0144784     1.12   0.262    -.0121322    .0446341
 provincedum3 |  -.0339502   .0140646    -2.41   0.016    -.0615222   -.0063782
 provincedum4 |   .0142933   .0147177     0.97   0.332     -.014559    .0431456
 provincedum5 |   -.012051   .0131574    -0.92   0.360    -.0378445    .0137425
 provincedum6 |  -.0091322    .015642    -0.58   0.559    -.0397964     .021532
 provincedum7 |  -.0167129   .0147837    -1.13   0.258    -.0456946    .0122687
 provincedum8 |  -.0172043   .0141459    -1.22   0.224    -.0449355    .0105269
 provincedum9 |  -.0384758   .0135975    -2.83   0.005     -.065132   -.0118195
provincedum10 |  -.0213613   .0144401    -1.48   0.139    -.0496694    .0069468
provincedum11 |  -.0302853   .0122903    -2.46   0.014    -.0543789   -.0061916
provincedum12 |  -.0309107   .0154085    -2.01   0.045     -.061117   -.0007043
provincedum13 |   .0017649   .0141499     0.12   0.901    -.0259741     .029504
provincedum14 |   -.010055   .0193543    -0.52   0.603    -.0479967    .0278867
provincedum15 |  -.0304394   .0174013    -1.75   0.080    -.0645525    .0036736
          _m1 |  -.0973568   .1125412    -0.87   0.387    -.3179797    .1232662
          _m2 |    .051957   .0319388     1.63   0.104    -.0106551     .114569
          _m3 |   .0268119   .0703603     0.38   0.703    -.1111207    .1647444
        _cons |   .1202818   .0188625     6.38   0.000     .0833042    .1572594
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0460507          .        .       .            .           .
        rho1 |  -.4536783          .        .       .            .           .
        rho2 |   .2421173          .        .       .            .           .
        rho3 |   .1249422          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if i
> nrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(21, 5767)     =      4.47
       Model |  4.02424945        21  .191630926   Prob > F        =    0.0000
    Residual |    247.0274     5,767  .042834645   R-squared       =    0.0160
-------------+----------------------------------   Adj R-squared   =    0.0124
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20697

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0204297   .0062188    -3.29   0.001    -.0326209   -.0082384
          exp |  -.0068726   .0050759    -1.35   0.176    -.0168232     .003078
       expsqr |   .0001271   .0001601     0.79   0.427    -.0001868    .0004411
    higheredu |  -.0334206   .0072403    -4.62   0.000    -.0476143    -.019227
 provincedum2 |   .0162509   .0144784     1.12   0.262    -.0121322    .0446341
 provincedum3 |  -.0339502   .0140646    -2.41   0.016    -.0615222   -.0063782
 provincedum4 |   .0142933   .0147177     0.97   0.332     -.014559    .0431456
 provincedum5 |   -.012051   .0131574    -0.92   0.360    -.0378445    .0137425
 provincedum6 |  -.0091322    .015642    -0.58   0.559    -.0397964     .021532
 provincedum7 |  -.0167129   .0147837    -1.13   0.258    -.0456946    .0122687
 provincedum8 |  -.0172043   .0141459    -1.22   0.224    -.0449355    .0105269
 provincedum9 |  -.0384758   .0135975    -2.83   0.005     -.065132   -.0118195
provincedum10 |  -.0213613   .0144401    -1.48   0.139    -.0496694    .0069468
provincedum11 |  -.0302853   .0122903    -2.46   0.014    -.0543789   -.0061916
provincedum12 |  -.0309107   .0154085    -2.01   0.045     -.061117   -.0007043
provincedum13 |   .0017649   .0141499     0.12   0.901    -.0259741     .029504
provincedum14 |   -.010055   .0193543    -0.52   0.603    -.0479967    .0278867
provincedum15 |  -.0304394   .0174013    -1.75   0.080    -.0645525    .0036736
           m1 |  -.0973568   .1125412    -0.87   0.387    -.3179797    .1232662
           m2 |    .051957   .0319388     1.63   0.104    -.0106551     .114569
           m3 |   .0268119   .0703603     0.38   0.703    -.1111207    .1647444
        _cons |   .1202818   .0188625     6.38   0.000     .0833042    .1572594
-------------------------------------------------------------------------------

. eststo
(est7 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_r
> elative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(23, 5765)     =      4.76
       Model |  4.67441239        23  .203235321   Prob > F        =    0.0000
    Residual |  246.377237     5,765  .042736728   R-squared       =    0.0186
-------------+----------------------------------   Adj R-squared   =    0.0147
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20673

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0211832   .0062152    -3.41   0.001    -.0333674   -.0089991
          exp |  -.0059689   .0050755    -1.18   0.240    -.0159188    .0039811
       expsqr |   .0001071     .00016     0.67   0.504    -.0002067    .0004208
   highvocedu |  -.0173528   .0083678    -2.07   0.038    -.0337569   -.0009488
   highgenedu |  -.0434399     .00825    -5.27   0.000     -.059613   -.0272669
     adultedu |  -.0431806   .0101935    -4.24   0.000    -.0631638   -.0231974
 provincedum2 |    .010432   .0145494     0.72   0.473    -.0180902    .0389542
 provincedum3 |  -.0365702    .014065    -2.60   0.009    -.0641429   -.0089975
 provincedum4 |   .0121755    .014713     0.83   0.408    -.0166675    .0410185
 provincedum5 |  -.0149682   .0131645    -1.14   0.256    -.0407756    .0108391
 provincedum6 |  -.0141019   .0156807    -0.90   0.369     -.044842    .0166382
 provincedum7 |  -.0218961   .0148282    -1.48   0.140    -.0509651    .0071728
 provincedum8 |  -.0234079     .01423    -1.64   0.100     -.051304    .0044881
 provincedum9 |  -.0426877   .0136249    -3.13   0.002    -.0693976   -.0159779
provincedum10 |  -.0271256   .0145065    -1.87   0.062    -.0555637    .0013125
provincedum11 |  -.0352304   .0123502    -2.85   0.004    -.0594414   -.0110194
provincedum12 |  -.0343931   .0154289    -2.23   0.026    -.0646396   -.0041466
provincedum13 |  -.0029591    .014197    -0.21   0.835    -.0307906    .0248723
provincedum14 |  -.0128474   .0193603    -0.66   0.507    -.0508008     .025106
provincedum15 |  -.0317369   .0173858    -1.83   0.068    -.0658196    .0023458
          _m1 |  -.0690136   .1127165    -0.61   0.540    -.2899803    .1519531
          _m2 |   .0464021   .0319341     1.45   0.146    -.0162007    .1090048
          _m3 |   .0254331   .0704232     0.36   0.718    -.1126228    .1634889
        _cons |   .1273559   .0191268     6.66   0.000     .0898602    .1648515
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0445622          .        .       .            .           .
        rho1 |  -.3269273          .        .       .            .           .
        rho2 |   .2198133          .        .       .            .           .
        rho3 |   .1204802          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(23, 5765)     =      4.76
       Model |  4.67441239        23  .203235321   Prob > F        =    0.0000
    Residual |  246.377237     5,765  .042736728   R-squared       =    0.0186
-------------+----------------------------------   Adj R-squared   =    0.0147
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20673

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0211832   .0062152    -3.41   0.001    -.0333674   -.0089991
          exp |  -.0059689   .0050755    -1.18   0.240    -.0159188    .0039811
       expsqr |   .0001071     .00016     0.67   0.504    -.0002067    .0004208
   highvocedu |  -.0173528   .0083678    -2.07   0.038    -.0337569   -.0009488
   highgenedu |  -.0434399     .00825    -5.27   0.000     -.059613   -.0272669
     adultedu |  -.0431806   .0101935    -4.24   0.000    -.0631638   -.0231974
 provincedum2 |    .010432   .0145494     0.72   0.473    -.0180902    .0389542
 provincedum3 |  -.0365702    .014065    -2.60   0.009    -.0641429   -.0089975
 provincedum4 |   .0121755    .014713     0.83   0.408    -.0166675    .0410185
 provincedum5 |  -.0149682   .0131645    -1.14   0.256    -.0407756    .0108391
 provincedum6 |  -.0141019   .0156807    -0.90   0.369     -.044842    .0166382
 provincedum7 |  -.0218961   .0148282    -1.48   0.140    -.0509651    .0071728
 provincedum8 |  -.0234079     .01423    -1.64   0.100     -.051304    .0044881
 provincedum9 |  -.0426877   .0136249    -3.13   0.002    -.0693976   -.0159779
provincedum10 |  -.0271256   .0145065    -1.87   0.062    -.0555637    .0013125
provincedum11 |  -.0352304   .0123502    -2.85   0.004    -.0594414   -.0110194
provincedum12 |  -.0343931   .0154289    -2.23   0.026    -.0646396   -.0041466
provincedum13 |  -.0029591    .014197    -0.21   0.835    -.0307906    .0248723
provincedum14 |  -.0128474   .0193603    -0.66   0.507    -.0508008     .025106
provincedum15 |  -.0317369   .0173858    -1.83   0.068    -.0658196    .0023458
           m1 |  -.0690136   .1127165    -0.61   0.540    -.2899803    .1519531
           m2 |   .0464021   .0319341     1.45   0.146    -.0162007    .1090048
           m3 |   .0254331   .0704232     0.36   0.718    -.1126228    .1634889
        _cons |   .1273559   .0191268     6.66   0.000     .0898602    .1648515
-------------------------------------------------------------------------------

. eststo
(est8 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. 
. ***Table 6 Generation
. 
. local variablenames m1 m2 m3

. local variablelabels ""Upper secondary vocational track selection correction" "Upper second
> ary general track selection correction" "No upper secondary degree selection correction""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. 
. local estlist est1 est2 est3 est4 est5 est6 est7 est8

. 
. outreg2 [`estlist'] using "Table 6/Table6.xls", excel replace pvalue adjr2 drop(provincedum
> *) dec(3) sortvar(male exp expsqr higheredu) title("Table 6 (Unemployment A20=5 1-4 A20=5|9
>  5-8; Sec Voc 1-2 5-6, Sec Gen 3-4 7-8; Non-specified 1 3 5 7 Specified 2 4 6 8)") ctitle("
>  ") addnote("More notes") label
Table 6/Table6.xls
dir : seeout

. 
. 
. 
. 
. ***Table 8 with sequence: Occupytion or Contract > Two_tracks > Higher_edu Combined/Seperat
> ed, 2*2*2=8 columns in total.
. 
. *Prepare
. 
. drop m1 m2 m3

. local folderpath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 
> 2 4 6 8 10"

. local filename "Urban tables"

. local datapath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/20240716 Urban 
> Chip2018 and Instrumental Statistics and Inflation.dta"

. 
. 
. local xlspath "`folderpath'/`filename'.xls"

. 
. eststo clear

. 
. *Columns
. 
. selmlog voc_highocc male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entra
> nt_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(21, 2081)     =      8.25
       Model |  31.4651997        21  1.49834284   Prob > F        =    0.0000
    Residual |  378.007934     2,081  .181647253   R-squared       =    0.0768
-------------+----------------------------------   Adj R-squared   =    0.0675
       Total |  409.473134     2,102  .194801681   Root MSE        =     .4262

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1187348   .0251394     4.72   0.000     .0694337    .1680359
          exp |   .0204893   .0224756     0.91   0.362    -.0235877    .0645663
       expsqr |  -.0004127   .0006708    -0.62   0.538    -.0017281    .0009027
    higheredu |   .2152046   .0213434    10.08   0.000     .1733479    .2570612
 provincedum2 |  -.0864809   .0555338    -1.56   0.120    -.1953885    .0224266
 provincedum3 |  -.0310272   .0580032    -0.53   0.593    -.1447776    .0827233
 provincedum4 |  -.0521611   .0533763    -0.98   0.329    -.1568377    .0525154
 provincedum5 |  -.0380916   .0498515    -0.76   0.445    -.1358556    .0596724
 provincedum6 |   .0319765   .0608498     0.53   0.599    -.0873564    .1513094
 provincedum7 |  -.0243761   .0531864    -0.46   0.647    -.1286801    .0799279
 provincedum8 |  -.0259464   .0558398    -0.46   0.642    -.1354541    .0835612
 provincedum9 |   .0506814    .052362     0.97   0.333     -.052006    .1533687
provincedum10 |     .02888   .0526156     0.55   0.583    -.0743048    .1320648
provincedum11 |  -.0609817   .0497765    -1.23   0.221    -.1585987    .0366353
provincedum12 |  -.0770392   .0560774    -1.37   0.170    -.1870128    .0329344
provincedum13 |  -.0481691   .0553236    -0.87   0.384    -.1566644    .0603263
provincedum14 |  -.0669916   .0602324    -1.11   0.266    -.1851137    .0511305
provincedum15 |   .0891501   .0683785     1.30   0.192    -.0449473    .2232474
          _m1 |  -.0012958   .1804488    -0.01   0.994    -.3551747    .3525831
          _m2 |   .1722552   .5129545     0.34   0.737    -.8337022    1.178213
          _m3 |    .230328   .4238742     0.54   0.587    -.6009337     1.06159
        _cons |   .1197273   .6883306     0.17   0.862    -1.230161    1.469616
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1950207          .        .       .            .           .
        rho1 |  -.0029343          .        .       .            .           .
        rho2 |   .3900605          .        .       .            .           .
        rho3 |   .5215624          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inrang
> e(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(21, 2081)     =      8.25
       Model |  31.4651997        21  1.49834284   Prob > F        =    0.0000
    Residual |  378.007934     2,081  .181647253   R-squared       =    0.0768
-------------+----------------------------------   Adj R-squared   =    0.0675
       Total |  409.473134     2,102  .194801681   Root MSE        =     .4262

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1187348   .0251394     4.72   0.000     .0694337    .1680359
          exp |   .0204893   .0224756     0.91   0.362    -.0235877    .0645663
       expsqr |  -.0004127   .0006708    -0.62   0.538    -.0017281    .0009027
    higheredu |   .2152046   .0213434    10.08   0.000     .1733479    .2570612
 provincedum2 |  -.0864809   .0555338    -1.56   0.120    -.1953885    .0224266
 provincedum3 |  -.0310272   .0580032    -0.53   0.593    -.1447776    .0827233
 provincedum4 |  -.0521611   .0533763    -0.98   0.329    -.1568377    .0525154
 provincedum5 |  -.0380916   .0498515    -0.76   0.445    -.1358556    .0596724
 provincedum6 |   .0319765   .0608498     0.53   0.599    -.0873564    .1513094
 provincedum7 |  -.0243761   .0531864    -0.46   0.647    -.1286801    .0799279
 provincedum8 |  -.0259464   .0558398    -0.46   0.642    -.1354541    .0835612
 provincedum9 |   .0506814    .052362     0.97   0.333     -.052006    .1533687
provincedum10 |     .02888   .0526156     0.55   0.583    -.0743048    .1320648
provincedum11 |  -.0609817   .0497765    -1.23   0.221    -.1585987    .0366353
provincedum12 |  -.0770392   .0560774    -1.37   0.170    -.1870128    .0329344
provincedum13 |  -.0481691   .0553236    -0.87   0.384    -.1566644    .0603263
provincedum14 |  -.0669916   .0602324    -1.11   0.266    -.1851137    .0511305
provincedum15 |   .0891501   .0683785     1.30   0.192    -.0449473    .2232474
           m1 |  -.0012958   .1804488    -0.01   0.994    -.3551747    .3525831
           m2 |   .1722552   .5129545     0.34   0.737    -.8337022    1.178213
           m3 |    .230328   .4238742     0.54   0.587    -.6009337     1.06159
        _cons |   .1197273   .6883306     0.17   0.862    -1.230161    1.469616
-------------------------------------------------------------------------------

. eststo
(est1 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relati
> ve ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(23, 2079)     =      9.24
       Model |  37.9919857        23  1.65182547   Prob > F        =    0.0000
    Residual |  371.481148     2,079  .178682611   R-squared       =    0.0928
-------------+----------------------------------   Adj R-squared   =    0.0827
       Total |  409.473134     2,102  .194801681   Root MSE        =    .42271

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    .120937   .0249432     4.85   0.000     .0720207    .1698533
          exp |   .0158626   .0223624     0.71   0.478    -.0279924    .0597176
       expsqr |  -.0003419   .0006667    -0.51   0.608    -.0016494    .0009656
   highvocedu |   .0915568   .0305127     3.00   0.003     .0317181    .1513955
   highgenedu |   .3971929   .0565333     7.03   0.000      .286325    .5080607
     adultedu |   .2728597   .0268266    10.17   0.000     .2202499    .3254695
 provincedum2 |  -.0656012    .055188    -1.19   0.235    -.1738307    .0426282
 provincedum3 |  -.0163059   .0576049    -0.28   0.777    -.1292752    .0966634
 provincedum4 |  -.0299777   .0530818    -0.56   0.572    -.1340766    .0741213
 provincedum5 |  -.0149624    .049601    -0.30   0.763    -.1122352    .0823104
 provincedum6 |    .046643      .0604     0.77   0.440    -.0718079    .1650938
 provincedum7 |  -.0098914   .0529275    -0.19   0.852    -.1136877     .093905
 provincedum8 |  -.0060152   .0555016    -0.11   0.914    -.1148596    .1028293
 provincedum9 |   .0644786   .0519881     1.24   0.215    -.0374756    .1664327
provincedum10 |   .0487438   .0522882     0.93   0.351     -.053799    .1512865
provincedum11 |  -.0410668    .049495    -0.83   0.407    -.1381316    .0559981
provincedum12 |  -.0597294   .0556926    -1.07   0.284    -.1689485    .0494897
provincedum13 |  -.0297163   .0549674    -0.54   0.589    -.1375131    .0780806
provincedum14 |  -.0568723   .0597838    -0.95   0.342    -.1741147    .0603701
provincedum15 |   .0918087   .0678208     1.35   0.176     -.041195    .2248125
          _m1 |   .0106381    .179045     0.06   0.953     -.340488    .3617641
          _m2 |   .1344759   .5090789     0.26   0.792    -.8638817    1.132834
          _m3 |   .1647261    .420742     0.39   0.695    -.6603934    .9898455
        _cons |   .1033714   .6834123     0.15   0.880    -1.236872    1.443615
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1849765          .        .       .            .           .
        rho1 |   .0247346          .        .       .            .           .
        rho2 |   .3126701          .        .       .            .           .
        rho3 |   .3830047          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(23, 2079)     =      9.24
       Model |  37.9919857        23  1.65182547   Prob > F        =    0.0000
    Residual |  371.481148     2,079  .178682611   R-squared       =    0.0928
-------------+----------------------------------   Adj R-squared   =    0.0827
       Total |  409.473134     2,102  .194801681   Root MSE        =    .42271

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    .120937   .0249432     4.85   0.000     .0720207    .1698533
          exp |   .0158626   .0223624     0.71   0.478    -.0279924    .0597176
       expsqr |  -.0003419   .0006667    -0.51   0.608    -.0016494    .0009656
   highvocedu |   .0915568   .0305127     3.00   0.003     .0317181    .1513955
   highgenedu |   .3971929   .0565333     7.03   0.000      .286325    .5080607
     adultedu |   .2728597   .0268266    10.17   0.000     .2202499    .3254695
 provincedum2 |  -.0656012    .055188    -1.19   0.235    -.1738307    .0426282
 provincedum3 |  -.0163059   .0576049    -0.28   0.777    -.1292752    .0966634
 provincedum4 |  -.0299777   .0530818    -0.56   0.572    -.1340766    .0741213
 provincedum5 |  -.0149624    .049601    -0.30   0.763    -.1122352    .0823104
 provincedum6 |    .046643      .0604     0.77   0.440    -.0718079    .1650938
 provincedum7 |  -.0098914   .0529275    -0.19   0.852    -.1136877     .093905
 provincedum8 |  -.0060152   .0555016    -0.11   0.914    -.1148596    .1028293
 provincedum9 |   .0644786   .0519881     1.24   0.215    -.0374756    .1664327
provincedum10 |   .0487438   .0522882     0.93   0.351     -.053799    .1512865
provincedum11 |  -.0410668    .049495    -0.83   0.407    -.1381316    .0559981
provincedum12 |  -.0597294   .0556926    -1.07   0.284    -.1689485    .0494897
provincedum13 |  -.0297163   .0549674    -0.54   0.589    -.1375131    .0780806
provincedum14 |  -.0568723   .0597838    -0.95   0.342    -.1741147    .0603701
provincedum15 |   .0918087   .0678208     1.35   0.176     -.041195    .2248125
           m1 |   .0106381    .179045     0.06   0.953     -.340488    .3617641
           m2 |   .1344759   .5090789     0.26   0.792    -.8638817    1.132834
           m3 |   .1647261    .420742     0.39   0.695    -.6603934    .9898455
        _cons |   .1033714   .6834123     0.15   0.880    -1.236872    1.443615
-------------------------------------------------------------------------------

. eststo
(est2 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entra
> nt_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(21, 5394)     =     19.00
       Model |  83.2653626        21  3.96501726   Prob > F        =    0.0000
    Residual |   1125.4671     5,394  .208651668   R-squared       =    0.0689
-------------+----------------------------------   Adj R-squared   =    0.0653
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .45678

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0947939    .014234     6.66   0.000     .0668895    .1226983
          exp |   .0438703   .0116563     3.76   0.000     .0210192    .0667215
       expsqr |  -.0009757    .000368    -2.65   0.008     -.001697   -.0002543
    higheredu |   .2316793   .0167268    13.85   0.000      .198888    .2644706
 provincedum2 |  -.1226031   .0335492    -3.65   0.000    -.1883731   -.0568331
 provincedum3 |  -.0331829    .031763    -1.04   0.296    -.0954513    .0290854
 provincedum4 |   -.062145   .0337528    -1.84   0.066    -.1283141    .0040241
 provincedum5 |  -.0487184   .0299882    -1.62   0.104    -.1075074    .0100706
 provincedum6 |  -.0807208   .0356065    -2.27   0.023     -.150524   -.0109177
 provincedum7 |  -.0575185    .033825    -1.70   0.089    -.1238293    .0087922
 provincedum8 |    -.13769   .0326555    -4.22   0.000     -.201708    -.073672
 provincedum9 |   .0026536   .0311214     0.09   0.932    -.0583569     .063664
provincedum10 |  -.0386641   .0329975    -1.17   0.241    -.1033526    .0260243
provincedum11 |   -.084802   .0280836    -3.02   0.003    -.1398572   -.0297468
provincedum12 |  -.0816122   .0352035    -2.32   0.020    -.1506253   -.0125991
provincedum13 |  -.0459106   .0323909    -1.42   0.156    -.1094099    .0175886
provincedum14 |  -.0779649   .0437656    -1.78   0.075    -.1637631    .0078333
provincedum15 |  -.0808175    .039376    -2.05   0.040    -.1580104   -.0036246
          _m1 |   .8398317   .2559848     3.28   0.001     .3379982    1.341665
          _m2 |  -.1930766   .0731863    -2.64   0.008    -.3365513   -.0496019
          _m3 |   -.091523   .1613974    -0.57   0.571    -.4079272    .2248811
        _cons |   .0743711   .0439384     1.69   0.091     -.011766    .1605082
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3993097          .        .       .            .           .
        rho1 |   1.329038          .        .       .            .           .
        rho2 |  -.3055447          .        .       .            .           .
        rho3 |  -.1448357          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inrang
> e(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(21, 5394)     =     19.00
       Model |  83.2653626        21  3.96501726   Prob > F        =    0.0000
    Residual |   1125.4671     5,394  .208651668   R-squared       =    0.0689
-------------+----------------------------------   Adj R-squared   =    0.0653
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .45678

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0947939    .014234     6.66   0.000     .0668895    .1226983
          exp |   .0438703   .0116563     3.76   0.000     .0210192    .0667215
       expsqr |  -.0009757    .000368    -2.65   0.008     -.001697   -.0002543
    higheredu |   .2316793   .0167268    13.85   0.000      .198888    .2644706
 provincedum2 |  -.1226031   .0335492    -3.65   0.000    -.1883731   -.0568331
 provincedum3 |  -.0331829    .031763    -1.04   0.296    -.0954513    .0290854
 provincedum4 |   -.062145   .0337528    -1.84   0.066    -.1283141    .0040241
 provincedum5 |  -.0487184   .0299882    -1.62   0.104    -.1075074    .0100706
 provincedum6 |  -.0807208   .0356065    -2.27   0.023     -.150524   -.0109177
 provincedum7 |  -.0575185    .033825    -1.70   0.089    -.1238293    .0087922
 provincedum8 |    -.13769   .0326555    -4.22   0.000     -.201708    -.073672
 provincedum9 |   .0026536   .0311214     0.09   0.932    -.0583569     .063664
provincedum10 |  -.0386641   .0329975    -1.17   0.241    -.1033526    .0260243
provincedum11 |   -.084802   .0280836    -3.02   0.003    -.1398572   -.0297468
provincedum12 |  -.0816122   .0352035    -2.32   0.020    -.1506253   -.0125991
provincedum13 |  -.0459106   .0323909    -1.42   0.156    -.1094099    .0175886
provincedum14 |  -.0779649   .0437656    -1.78   0.075    -.1637631    .0078333
provincedum15 |  -.0808175    .039376    -2.05   0.040    -.1580104   -.0036246
           m1 |   .8398317   .2559848     3.28   0.001     .3379982    1.341665
           m2 |  -.1930766   .0731863    -2.64   0.008    -.3365513   -.0496019
           m3 |   -.091523   .1613974    -0.57   0.571    -.4079272    .2248811
        _cons |   .0743711   .0439384     1.69   0.091     -.011766    .1605082
-------------------------------------------------------------------------------

. eststo
(est3 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relati
> ve ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(23, 5392)     =     25.11
       Model |  116.921397        23  5.08353901   Prob > F        =    0.0000
    Residual |  1091.81106     5,392  .202487215   R-squared       =    0.0967
-------------+----------------------------------   Adj R-squared   =    0.0929
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .44999

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1013355   .0140403     7.22   0.000     .0738108    .1288602
          exp |    .036631   .0115005     3.19   0.001     .0140853    .0591767
       expsqr |  -.0008133   .0003628    -2.24   0.025    -.0015245   -.0001022
   highvocedu |   .1460433   .0190698     7.66   0.000     .1086589    .1834278
   highgenedu |   .3412354   .0186827    18.26   0.000     .3046097    .3778611
     adultedu |   .1810501    .022921     7.90   0.000     .1361157    .2259845
 provincedum2 |  -.0766132   .0332523    -2.30   0.021    -.1418013   -.0114252
 provincedum3 |  -.0131427   .0313334    -0.42   0.675    -.0745688    .0482834
 provincedum4 |  -.0441663   .0332818    -1.33   0.185     -.109412    .0210794
 provincedum5 |  -.0316682   .0295946    -1.07   0.285    -.0896857    .0263492
 provincedum6 |  -.0415718   .0352205    -1.18   0.238    -.1106182    .0274746
 provincedum7 |  -.0211015   .0334624    -0.63   0.528    -.0867013    .0444984
 provincedum8 |  -.0896454   .0324039    -2.77   0.006    -.1531703   -.0261206
 provincedum9 |   .0304915   .0307618     0.99   0.322    -.0298141    .0907971
provincedum10 |   .0057542   .0327008     0.18   0.860    -.0583526     .069861
provincedum11 |  -.0449363   .0278475    -1.61   0.107    -.0995287     .009656
provincedum12 |  -.0466569   .0347858    -1.34   0.180    -.1148511    .0215373
provincedum13 |  -.0042511   .0320765    -0.13   0.895     -.067134    .0586318
provincedum14 |   -.044739    .043197    -1.04   0.300    -.1294226    .0399446
provincedum15 |   -.073979    .038803    -1.91   0.057    -.1500486    .0020907
          _m1 |   .5899931   .2529427     2.33   0.020     .0941232    1.085863
          _m2 |  -.1584954   .0721691    -2.20   0.028     -.299976   -.0170148
          _m3 |  -.1578624   .1592979    -0.99   0.322    -.4701506    .1544259
        _cons |   -.014121   .0439195    -0.32   0.748    -.1002211     .071979
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .301858          .        .       .            .           .
        rho1 |   1.073855          .        .       .            .           .
        rho2 |  -.2884798          .        .       .            .           .
        rho3 |  -.2873276          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(23, 5392)     =     25.11
       Model |  116.921397        23  5.08353901   Prob > F        =    0.0000
    Residual |  1091.81106     5,392  .202487215   R-squared       =    0.0967
-------------+----------------------------------   Adj R-squared   =    0.0929
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .44999

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1013355   .0140403     7.22   0.000     .0738108    .1288602
          exp |    .036631   .0115005     3.19   0.001     .0140853    .0591767
       expsqr |  -.0008133   .0003628    -2.24   0.025    -.0015245   -.0001022
   highvocedu |   .1460433   .0190698     7.66   0.000     .1086589    .1834278
   highgenedu |   .3412354   .0186827    18.26   0.000     .3046097    .3778611
     adultedu |   .1810501    .022921     7.90   0.000     .1361157    .2259845
 provincedum2 |  -.0766132   .0332523    -2.30   0.021    -.1418013   -.0114252
 provincedum3 |  -.0131427   .0313334    -0.42   0.675    -.0745688    .0482834
 provincedum4 |  -.0441663   .0332818    -1.33   0.185     -.109412    .0210794
 provincedum5 |  -.0316682   .0295946    -1.07   0.285    -.0896857    .0263492
 provincedum6 |  -.0415718   .0352205    -1.18   0.238    -.1106182    .0274746
 provincedum7 |  -.0211015   .0334624    -0.63   0.528    -.0867013    .0444984
 provincedum8 |  -.0896454   .0324039    -2.77   0.006    -.1531703   -.0261206
 provincedum9 |   .0304915   .0307618     0.99   0.322    -.0298141    .0907971
provincedum10 |   .0057542   .0327008     0.18   0.860    -.0583526     .069861
provincedum11 |  -.0449363   .0278475    -1.61   0.107    -.0995287     .009656
provincedum12 |  -.0466569   .0347858    -1.34   0.180    -.1148511    .0215373
provincedum13 |  -.0042511   .0320765    -0.13   0.895     -.067134    .0586318
provincedum14 |   -.044739    .043197    -1.04   0.300    -.1294226    .0399446
provincedum15 |   -.073979    .038803    -1.91   0.057    -.1500486    .0020907
           m1 |   .5899931   .2529427     2.33   0.020     .0941232    1.085863
           m2 |  -.1584954   .0721691    -2.20   0.028     -.299976   -.0170148
           m3 |  -.1578624   .1592979    -0.99   0.322    -.4701506    .1544259
        _cons |   -.014121   .0439195    -0.32   0.748    -.1002211     .071979
-------------------------------------------------------------------------------

. eststo
(est4 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 if inrang
> e(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(21, 1803)     =      8.08
       Model |  38.4752656        21   1.8321555   Prob > F        =    0.0000
    Residual |  408.726926     1,803  .226692693   R-squared       =    0.0860
-------------+----------------------------------   Adj R-squared   =    0.0754
       Total |  447.202192     1,824   .24517664   Root MSE        =    .47612

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    .064749   .0296966     2.18   0.029     .0065057    .1229923
          exp |   .0338341   .0264011     1.28   0.200    -.0179458    .0856141
       expsqr |  -.0005008   .0007922    -0.63   0.527    -.0020546     .001053
    higheredu |   .2082549   .0250035     8.33   0.000      .159216    .2572938
 provincedum2 |  -.0338069   .0649549    -0.52   0.603    -.1612017    .0935879
 provincedum3 |   .0329888   .0706475     0.47   0.641    -.1055708    .1715483
 provincedum4 |  -.0992858   .0621759    -1.60   0.110    -.2212301    .0226586
 provincedum5 |   .0290508    .058113     0.50   0.617    -.0849252    .1430268
 provincedum6 |  -.0336602   .0721558    -0.47   0.641     -.175178    .1078575
 provincedum7 |   .0949516   .0626657     1.52   0.130    -.0279535    .2178567
 provincedum8 |  -.1503637   .0664303    -2.26   0.024    -.2806521   -.0200752
 provincedum9 |  -.1065163   .0618756    -1.72   0.085    -.2278717    .0148392
provincedum10 |  -.1230547   .0625254    -1.97   0.049    -.2456846   -.0004249
provincedum11 |  -.1392256   .0587528    -2.37   0.018    -.2544562   -.0239949
provincedum12 |  -.1476322   .0662146    -2.23   0.026    -.2774976   -.0177667
provincedum13 |   -.022951   .0661173    -0.35   0.729    -.1526255    .1067236
provincedum14 |  -.1373676   .0708813    -1.94   0.053    -.2763857    .0016506
provincedum15 |  -.0384683   .0801439    -0.48   0.631    -.1956529    .1187163
          _m1 |  -.0333387   .2118458    -0.16   0.875    -.4488278    .3821504
          _m2 |   .5342128    .596297     0.90   0.370     -.635293    1.703719
          _m3 |   .6446568   .4976857     1.30   0.195    -.3314445    1.620758
        _cons |   .6476085   .8048656     0.80   0.421    -.9309588    2.226176
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3508363          .        .       .            .           .
        rho1 |  -.0562855          .        .       .            .           .
        rho2 |   .9019075          .        .       .            .           .
        rho3 |   1.088369          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 
> if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(21, 1803)     =      8.08
       Model |  38.4752656        21   1.8321555   Prob > F        =    0.0000
    Residual |  408.726926     1,803  .226692693   R-squared       =    0.0860
-------------+----------------------------------   Adj R-squared   =    0.0754
       Total |  447.202192     1,824   .24517664   Root MSE        =    .47612

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    .064749   .0296966     2.18   0.029     .0065057    .1229923
          exp |   .0338341   .0264011     1.28   0.200    -.0179458    .0856141
       expsqr |  -.0005008   .0007922    -0.63   0.527    -.0020546     .001053
    higheredu |   .2082549   .0250035     8.33   0.000      .159216    .2572938
 provincedum2 |  -.0338069   .0649549    -0.52   0.603    -.1612017    .0935879
 provincedum3 |   .0329888   .0706475     0.47   0.641    -.1055708    .1715483
 provincedum4 |  -.0992858   .0621759    -1.60   0.110    -.2212301    .0226586
 provincedum5 |   .0290508    .058113     0.50   0.617    -.0849252    .1430268
 provincedum6 |  -.0336602   .0721558    -0.47   0.641     -.175178    .1078575
 provincedum7 |   .0949516   .0626657     1.52   0.130    -.0279535    .2178567
 provincedum8 |  -.1503637   .0664303    -2.26   0.024    -.2806521   -.0200752
 provincedum9 |  -.1065163   .0618756    -1.72   0.085    -.2278717    .0148392
provincedum10 |  -.1230547   .0625254    -1.97   0.049    -.2456846   -.0004249
provincedum11 |  -.1392256   .0587528    -2.37   0.018    -.2544562   -.0239949
provincedum12 |  -.1476322   .0662146    -2.23   0.026    -.2774976   -.0177667
provincedum13 |   -.022951   .0661173    -0.35   0.729    -.1526255    .1067236
provincedum14 |  -.1373676   .0708813    -1.94   0.053    -.2763857    .0016506
provincedum15 |  -.0384683   .0801439    -0.48   0.631    -.1956529    .1187163
           m1 |  -.0333387   .2118458    -0.16   0.875    -.4488278    .3821504
           m2 |   .5342128    .596297     0.90   0.370     -.635293    1.703719
           m3 |   .6446568   .4976857     1.30   0.195    -.3314445    1.620758
        _cons |   .6476085   .8048656     0.80   0.421    -.9309588    2.226176
-------------------------------------------------------------------------------

. eststo
(est5 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entra
> nt_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(23, 1801)     =      8.58
       Model |  44.1826519        23  1.92098487   Prob > F        =    0.0000
    Residual |   403.01954     1,801  .223775425   R-squared       =    0.0988
-------------+----------------------------------   Adj R-squared   =    0.0873
       Total |  447.202192     1,824   .24517664   Root MSE        =    .47305

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0675533   .0295146     2.29   0.022     .0096667    .1254398
          exp |    .024972   .0263278     0.95   0.343    -.0266643    .0766082
       expsqr |  -.0003089   .0007892    -0.39   0.696    -.0018568    .0012389
   highvocedu |   .0770315   .0360682     2.14   0.033     .0062916    .1477714
   highgenedu |   .2441243   .0646099     3.78   0.000      .117406    .3708425
     adultedu |   .2921811   .0310728     9.40   0.000     .2312386    .3531236
 provincedum2 |   -.016822   .0646428    -0.26   0.795    -.1436048    .1099609
 provincedum3 |   .0470442   .0702524     0.67   0.503    -.0907406     .184829
 provincedum4 |  -.0775883   .0619276    -1.25   0.210    -.1990458    .0438692
 provincedum5 |   .0521465   .0579293     0.90   0.368    -.0614692    .1657622
 provincedum6 |  -.0232108   .0717349    -0.32   0.746    -.1639032    .1174816
 provincedum7 |   .1157083   .0624413     1.85   0.064    -.0067568    .2381733
 provincedum8 |  -.1334657   .0660891    -2.02   0.044     -.263085   -.0038463
 provincedum9 |  -.0994466   .0615315    -1.62   0.106    -.2201273    .0212341
provincedum10 |  -.1104832   .0621967    -1.78   0.076    -.2324685    .0115022
provincedum11 |  -.1211079   .0584859    -2.07   0.039    -.2358152   -.0064006
provincedum12 |  -.1323393   .0658702    -2.01   0.045    -.2615293   -.0031492
provincedum13 |  -.0065934   .0657715    -0.10   0.920    -.1355899    .1224032
provincedum14 |  -.1369014   .0704792    -1.94   0.052     -.275131    .0013282
provincedum15 |  -.0365892   .0796276    -0.46   0.646    -.1927615     .119583
          _m1 |  -.0361555   .2106164    -0.17   0.864    -.4492337    .3769227
          _m2 |   .5395306   .5929366     0.91   0.363    -.6233854    1.702447
          _m3 |   .6209651   .4950147     1.25   0.210    -.3498983    1.591829
        _cons |   .7189538   .8007649     0.90   0.369     -.851572     2.28948
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3427666          .        .       .            .           .
        rho1 |  -.0617555          .        .       .            .           .
        rho2 |   .9215457          .        .       .            .           .
        rho3 |    1.06064          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(23, 1801)     =      8.58
       Model |  44.1826519        23  1.92098487   Prob > F        =    0.0000
    Residual |   403.01954     1,801  .223775425   R-squared       =    0.0988
-------------+----------------------------------   Adj R-squared   =    0.0873
       Total |  447.202192     1,824   .24517664   Root MSE        =    .47305

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0675533   .0295146     2.29   0.022     .0096667    .1254398
          exp |    .024972   .0263278     0.95   0.343    -.0266643    .0766082
       expsqr |  -.0003089   .0007892    -0.39   0.696    -.0018568    .0012389
   highvocedu |   .0770315   .0360682     2.14   0.033     .0062916    .1477714
   highgenedu |   .2441243   .0646099     3.78   0.000      .117406    .3708425
     adultedu |   .2921811   .0310728     9.40   0.000     .2312386    .3531236
 provincedum2 |   -.016822   .0646428    -0.26   0.795    -.1436048    .1099609
 provincedum3 |   .0470442   .0702524     0.67   0.503    -.0907406     .184829
 provincedum4 |  -.0775883   .0619276    -1.25   0.210    -.1990458    .0438692
 provincedum5 |   .0521465   .0579293     0.90   0.368    -.0614692    .1657622
 provincedum6 |  -.0232108   .0717349    -0.32   0.746    -.1639032    .1174816
 provincedum7 |   .1157083   .0624413     1.85   0.064    -.0067568    .2381733
 provincedum8 |  -.1334657   .0660891    -2.02   0.044     -.263085   -.0038463
 provincedum9 |  -.0994466   .0615315    -1.62   0.106    -.2201273    .0212341
provincedum10 |  -.1104832   .0621967    -1.78   0.076    -.2324685    .0115022
provincedum11 |  -.1211079   .0584859    -2.07   0.039    -.2358152   -.0064006
provincedum12 |  -.1323393   .0658702    -2.01   0.045    -.2615293   -.0031492
provincedum13 |  -.0065934   .0657715    -0.10   0.920    -.1355899    .1224032
provincedum14 |  -.1369014   .0704792    -1.94   0.052     -.275131    .0013282
provincedum15 |  -.0365892   .0796276    -0.46   0.646    -.1927615     .119583
           m1 |  -.0361555   .2106164    -0.17   0.864    -.4492337    .3769227
           m2 |   .5395306   .5929366     0.91   0.363    -.6233854    1.702447
           m3 |   .6209651   .4950147     1.25   0.210    -.3498983    1.591829
        _cons |   .7189538   .8007649     0.90   0.369     -.851572     2.28948
-------------------------------------------------------------------------------

. eststo
(est6 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 if inrang
> e(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(21, 4870)     =     28.11
       Model |   120.13294        21  5.72061619   Prob > F        =    0.0000
    Residual |  990.929202     4,870  .203476222   R-squared       =    0.1081
-------------+----------------------------------   Adj R-squared   =    0.1043
       Total |  1111.06214     4,891  .227164617   Root MSE        =    .45108

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0199147   .0147389     1.35   0.177    -.0089802    .0488096
          exp |   .0426722   .0120023     3.56   0.000     .0191422    .0662023
       expsqr |  -.0008164   .0003821    -2.14   0.033    -.0015655   -.0000674
    higheredu |   .3279071   .0179408    18.28   0.000     .2927349    .3630792
 provincedum2 |  -.1218551   .0341141    -3.57   0.000     -.188734   -.0549761
 provincedum3 |  -.0283619   .0327048    -0.87   0.386    -.0924781    .0357544
 provincedum4 |  -.2121394   .0349313    -6.07   0.000    -.2806206   -.1436582
 provincedum5 |  -.0065719   .0306287    -0.21   0.830    -.0666181    .0534742
 provincedum6 |  -.1021854    .037014    -2.76   0.006    -.1747496   -.0296212
 provincedum7 |  -.0945241   .0348529    -2.71   0.007    -.1628514   -.0261967
 provincedum8 |  -.1479359   .0336839    -4.39   0.000    -.2139716   -.0819002
 provincedum9 |   -.098181   .0323867    -3.03   0.002    -.1616736   -.0346884
provincedum10 |   -.161869   .0340898    -4.75   0.000    -.2287004   -.0950375
provincedum11 |  -.2258832   .0287218    -7.86   0.000     -.282191   -.1695754
provincedum12 |  -.1949624   .0359192    -5.43   0.000    -.2653803   -.1245445
provincedum13 |  -.1481496   .0335471    -4.42   0.000    -.2139169   -.0823822
provincedum14 |  -.1378454   .0456449    -3.02   0.003    -.2273299   -.0483609
provincedum15 |   -.016857   .0400045    -0.42   0.673    -.0952839    .0615698
          _m1 |   .6304316   .2637813     2.39   0.017     .1133012    1.147562
          _m2 |  -.1993421   .0771328    -2.58   0.010    -.3505572   -.0481269
          _m3 |  -.1339859   .1712457    -0.78   0.434    -.4697047     .201733
        _cons |   .3113781   .0451288     6.90   0.000     .2229053     .399851
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .318523          .        .       .            .           .
        rho1 |   1.117037          .        .       .            .           .
        rho2 |  -.3532064          .        .       .            .           .
        rho3 |  -.2374043          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 
> if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(21, 4870)     =     28.11
       Model |   120.13294        21  5.72061619   Prob > F        =    0.0000
    Residual |  990.929202     4,870  .203476222   R-squared       =    0.1081
-------------+----------------------------------   Adj R-squared   =    0.1043
       Total |  1111.06214     4,891  .227164617   Root MSE        =    .45108

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0199147   .0147389     1.35   0.177    -.0089802    .0488096
          exp |   .0426722   .0120023     3.56   0.000     .0191422    .0662023
       expsqr |  -.0008164   .0003821    -2.14   0.033    -.0015655   -.0000674
    higheredu |   .3279071   .0179408    18.28   0.000     .2927349    .3630792
 provincedum2 |  -.1218551   .0341141    -3.57   0.000     -.188734   -.0549761
 provincedum3 |  -.0283619   .0327048    -0.87   0.386    -.0924781    .0357544
 provincedum4 |  -.2121394   .0349313    -6.07   0.000    -.2806206   -.1436582
 provincedum5 |  -.0065719   .0306287    -0.21   0.830    -.0666181    .0534742
 provincedum6 |  -.1021854    .037014    -2.76   0.006    -.1747496   -.0296212
 provincedum7 |  -.0945241   .0348529    -2.71   0.007    -.1628514   -.0261967
 provincedum8 |  -.1479359   .0336839    -4.39   0.000    -.2139716   -.0819002
 provincedum9 |   -.098181   .0323867    -3.03   0.002    -.1616736   -.0346884
provincedum10 |   -.161869   .0340898    -4.75   0.000    -.2287004   -.0950375
provincedum11 |  -.2258832   .0287218    -7.86   0.000     -.282191   -.1695754
provincedum12 |  -.1949624   .0359192    -5.43   0.000    -.2653803   -.1245445
provincedum13 |  -.1481496   .0335471    -4.42   0.000    -.2139169   -.0823822
provincedum14 |  -.1378454   .0456449    -3.02   0.003    -.2273299   -.0483609
provincedum15 |   -.016857   .0400045    -0.42   0.673    -.0952839    .0615698
           m1 |   .6304316   .2637813     2.39   0.017     .1133012    1.147562
           m2 |  -.1993421   .0771328    -2.58   0.010    -.3505572   -.0481269
           m3 |  -.1339859   .1712457    -0.78   0.434    -.4697047     .201733
        _cons |   .3113781   .0451288     6.90   0.000     .2229053     .399851
-------------------------------------------------------------------------------

. eststo
(est7 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entra
> nt_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(23, 4868)     =     34.81
       Model |   156.93337        23     6.82319   Prob > F        =    0.0000
    Residual |  954.128772     4,868  .196000159   R-squared       =    0.1412
-------------+----------------------------------   Adj R-squared   =    0.1372
       Total |  1111.06214     4,891  .227164617   Root MSE        =    .44272

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0263082   .0144812     1.82   0.069    -.0020814    .0546979
          exp |   .0343519   .0117983     2.91   0.004     .0112219    .0574819
       expsqr |  -.0006321   .0003753    -1.68   0.092    -.0013678    .0001037
   highvocedu |   .2153305   .0203179    10.60   0.000     .1754982    .2551627
   highgenedu |   .4366791   .0197017    22.16   0.000     .3980549    .4753033
     adultedu |   .3111626   .0237681    13.09   0.000     .2645665    .3577588
 provincedum2 |  -.0679317   .0337128    -2.02   0.044    -.1340239   -.0018395
 provincedum3 |  -.0077273   .0321357    -0.24   0.810    -.0707278    .0552732
 provincedum4 |  -.1922341   .0343144    -5.60   0.000    -.2595058   -.1249624
 provincedum5 |   .0177183   .0301288     0.59   0.557    -.0413477    .0767843
 provincedum6 |  -.0597678   .0364623    -1.64   0.101    -.1312503    .0117148
 provincedum7 |  -.0502571   .0343682    -1.46   0.144    -.1176344    .0171201
 provincedum8 |   -.093468   .0333014    -2.81   0.005    -.1587537   -.0281823
 provincedum9 |  -.0653864   .0318858    -2.05   0.040    -.1278969   -.0028758
provincedum10 |  -.1135412   .0336451    -3.37   0.001    -.1795007   -.0475817
provincedum11 |  -.1795692   .0283917    -6.32   0.000    -.2352298   -.1239086
provincedum12 |  -.1553197   .0353732    -4.39   0.000    -.2246671   -.0859723
provincedum13 |  -.1019971   .0330968    -3.08   0.002    -.1668818   -.0371123
provincedum14 |  -.1024319   .0448835    -2.28   0.023    -.1904239   -.0144399
provincedum15 |  -.0092237   .0392752    -0.23   0.814    -.0862208    .0677734
          _m1 |   .3656885   .2596146     1.41   0.159    -.1432732    .8746502
          _m2 |  -.1570291   .0757839    -2.07   0.038    -.3055997   -.0084585
          _m3 |  -.1865872   .1684237    -1.11   0.268    -.5167737    .1435993
        _cons |   .2256938   .0449221     5.02   0.000     .1376261    .3137614
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2425973          .        .       .            .           .
        rho1 |   .7424519          .        .       .            .           .
        rho2 |  -.3188138          .        .       .            .           .
        rho3 |  -.3788252          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(23, 4868)     =     34.81
       Model |   156.93337        23     6.82319   Prob > F        =    0.0000
    Residual |  954.128772     4,868  .196000159   R-squared       =    0.1412
-------------+----------------------------------   Adj R-squared   =    0.1372
       Total |  1111.06214     4,891  .227164617   Root MSE        =    .44272

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0263082   .0144812     1.82   0.069    -.0020814    .0546979
          exp |   .0343519   .0117983     2.91   0.004     .0112219    .0574819
       expsqr |  -.0006321   .0003753    -1.68   0.092    -.0013678    .0001037
   highvocedu |   .2153305   .0203179    10.60   0.000     .1754982    .2551627
   highgenedu |   .4366791   .0197017    22.16   0.000     .3980549    .4753033
     adultedu |   .3111626   .0237681    13.09   0.000     .2645665    .3577588
 provincedum2 |  -.0679317   .0337128    -2.02   0.044    -.1340239   -.0018395
 provincedum3 |  -.0077273   .0321357    -0.24   0.810    -.0707278    .0552732
 provincedum4 |  -.1922341   .0343144    -5.60   0.000    -.2595058   -.1249624
 provincedum5 |   .0177183   .0301288     0.59   0.557    -.0413477    .0767843
 provincedum6 |  -.0597678   .0364623    -1.64   0.101    -.1312503    .0117148
 provincedum7 |  -.0502571   .0343682    -1.46   0.144    -.1176344    .0171201
 provincedum8 |   -.093468   .0333014    -2.81   0.005    -.1587537   -.0281823
 provincedum9 |  -.0653864   .0318858    -2.05   0.040    -.1278969   -.0028758
provincedum10 |  -.1135412   .0336451    -3.37   0.001    -.1795007   -.0475817
provincedum11 |  -.1795692   .0283917    -6.32   0.000    -.2352298   -.1239086
provincedum12 |  -.1553197   .0353732    -4.39   0.000    -.2246671   -.0859723
provincedum13 |  -.1019971   .0330968    -3.08   0.002    -.1668818   -.0371123
provincedum14 |  -.1024319   .0448835    -2.28   0.023    -.1904239   -.0144399
provincedum15 |  -.0092237   .0392752    -0.23   0.814    -.0862208    .0677734
           m1 |   .3656885   .2596146     1.41   0.159    -.1432732    .8746502
           m2 |  -.1570291   .0757839    -2.07   0.038    -.3055997   -.0084585
           m3 |  -.1865872   .1684237    -1.11   0.268    -.5167737    .1435993
        _cons |   .2256938   .0449221     5.02   0.000     .1376261    .3137614
-------------------------------------------------------------------------------

. eststo
(est8 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. 
. ***Table 8 Generation
. 
. local variablenames m1 m2 m3

. local variablelabels ""Upper secondary vocational track selection correction" "Upper second
> ary general track selection correction" "No upper secondary degree selection correction""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. 
. local estlist est1 est2 est3 est4 est5 est6 est7 est8

. 
. outreg2 [`estlist'] using "Table 8/Table8.xls", excel replace pvalue adjr2 drop(provincedum
> *) dec(3) sortvar(male exp expsqr higheredu) title("Table 8 (Occupation 1-4 High contract 5
> -8; Sec Voc 1-2 5-6, Sec Gen 3-4 7-8; Non-specified 1 3 5 7 Specified 2 4 6 8)") ctitle(" "
> ) addnote("More notes") label 
Table 8/Table8.xls
dir : seeout

. 
. 
. ***Table 10 with sequence: Sec Voc or Sec Gen, 2 columns.
. 
. *Prepare
. 
. drop m1 m2 m3

. local folderpath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 
> 2 4 6 8 10"

. local filename "Urban tables"

. local datapath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/20240716 Urban 
> Chip2018 and Instrumental Statistics and Inflation.dta"

. 
. 
. local xlspath "`folderpath'/`filename'.xls"

. 
. eststo clear

. 
. *Columns
. 
. selmlog voc_log_monthlyearning male exp expsqr higheredu highereduafter79 provincedum2-prov
> incedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educ
> at=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entra
> nt_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,063
-------------+----------------------------------   F(22, 2040)     =     15.08
       Model |   119.88126        22  5.44914817   Prob > F        =    0.0000
    Residual |  737.187361     2,040  .361366353   R-squared       =    0.1399
-------------+----------------------------------   Adj R-squared   =    0.1306
       Total |   857.06862     2,062  .415649185   Root MSE        =    .60114

----------------------------------------------------------------------------------
voc_log_monthl~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
            male |   .2135199   .0356883     5.98   0.000     .1435306    .2835091
             exp |   .0458333   .0295816     1.55   0.121    -.0121801    .1038466
          expsqr |   -.001304   .0008737    -1.49   0.136    -.0030174    .0004095
       higheredu |   .3869929   .0422919     9.15   0.000     .3040531    .4699327
highereduafter79 |  -.1002832    .055428    -1.81   0.071    -.2089845     .008418
    provincedum2 |  -.4096892     .07827    -5.23   0.000    -.5631867   -.2561918
    provincedum3 |  -.3403599   .0828566    -4.11   0.000    -.5028523   -.1778676
    provincedum4 |   -.367798   .0756615    -4.86   0.000    -.5161799   -.2194161
    provincedum5 |   .0300732   .0700935     0.43   0.668    -.1073891    .1675355
    provincedum6 |   -.137113   .0863544    -1.59   0.112    -.3064649     .032239
    provincedum7 |  -.1534525    .075369    -2.04   0.042    -.3012608   -.0056442
    provincedum8 |  -.3009786   .0782515    -3.85   0.000    -.4544398   -.1475175
    provincedum9 |  -.0803738   .0738542    -1.09   0.277    -.2252114    .0644638
   provincedum10 |  -.1519111   .0731967    -2.08   0.038    -.2954592    -.008363
   provincedum11 |   .0393081   .0699407     0.56   0.574    -.0978546    .1764707
   provincedum12 |   -.234204   .0792559    -2.96   0.003    -.3896348   -.0787731
   provincedum13 |  -.0362066   .0774133    -0.47   0.640    -.1880239    .1156107
   provincedum14 |  -.3030147    .085394    -3.55   0.000    -.4704831   -.1355462
   provincedum15 |  -.1554612   .0946471    -1.64   0.101    -.3410763    .0301538
             _m1 |   .3525705   .2313412     1.52   0.128     -.101119      .80626
             _m2 |  -1.280327   .6764114    -1.89   0.059    -2.606856    .0462015
             _m3 |  -1.047256   .5738539    -1.82   0.068    -2.172657    .0781444
           _cons |   6.481837   .8749647     7.41   0.000     4.765919    8.197754
----------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .9014365          .        .       .            .           .
        rho1 |   .3713456          .        .       .            .           .
        rho2 |  -1.348508          .        .       .            .           .
        rho3 |  -1.103025          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu highereduafter79 provincedum2-
> provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 250
> 00)

. eststo
(est1 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of voc_log_monthlyearning

H0: Constant variance

    chi2(1) =   0.78
Prob > chi2 = 0.3781

. local het_p = r(p)

. local het_df = r(df)

. sum voc_log_monthlyearning male exp expsqr higheredu highereduafter79 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      2,063     8.31855    .6447086   5.521461   10.12663
        male |      2,063    .5094523    .5000319          0          1
         exp |      2,063    17.87349    6.449986          1         32
      expsqr |      2,063    361.0436    235.3402          1       1024
   higheredu |      2,063    .3044111    .4602691          0          1
-------------+---------------------------------------------------------
higheredu~79 |      2,063    .1774115    .3821092          0          1
          m1 |      2,063    1.125546    .1784658   .8143778    1.98121
          m2 |      2,063   -.5321525    .1428741   -.726001  -.0397592
          m3 |      2,063   -.3377138    .1875969  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Sec Voc, All Gender, Non-specified Higheredu, Prov
> ince Dum) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning male exp expsqr higheredu highereduafter79 provincedum2-prov
> incedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educ
> at=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entra
> nt_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,294
-------------+----------------------------------   F(22, 5271)     =     41.91
       Model |  401.784531        22  18.2629332   Prob > F        =    0.0000
    Residual |  2296.74172     5,271  .435731687   R-squared       =    0.1489
-------------+----------------------------------   Adj R-squared   =    0.1453
       Total |  2698.52625     5,293  .509829256   Root MSE        =     .6601

----------------------------------------------------------------------------------
gen_log_monthl~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
            male |   .2023583   .0211152     9.58   0.000     .1609638    .2437528
             exp |   .0903951   .0168383     5.37   0.000      .057385    .1234052
          expsqr |  -.0024634   .0005324    -4.63   0.000    -.0035071   -.0014196
       higheredu |   .3636208   .0280639    12.96   0.000      .308604    .4186376
highereduafter79 |   -.093508   .0340917    -2.74   0.006    -.1603418   -.0266742
    provincedum2 |  -.7162741   .0488474   -14.66   0.000    -.8120353   -.6205129
    provincedum3 |  -.3245774   .0465367    -6.97   0.000    -.4158087   -.2333461
    provincedum4 |  -.4947098   .0496242    -9.97   0.000    -.5919938   -.3974259
    provincedum5 |  -.1020195   .0438811    -2.32   0.020    -.1880447   -.0159943
    provincedum6 |  -.4714696   .0518704    -9.09   0.000    -.5731571   -.3697821
    provincedum7 |  -.4281139   .0492316    -8.70   0.000    -.5246282   -.3315996
    provincedum8 |  -.7130814   .0478207   -14.91   0.000    -.8068298    -.619333
    provincedum9 |  -.2212063   .0454094    -4.87   0.000    -.3102275   -.1321851
   provincedum10 |  -.3007276   .0479377    -6.27   0.000    -.3947054   -.2067499
   provincedum11 |  -.1847346   .0410901    -4.50   0.000    -.2652881    -.104181
   provincedum12 |  -.3548834    .051076    -6.95   0.000    -.4550136   -.2547533
   provincedum13 |  -.3009708   .0473319    -6.36   0.000    -.3937609   -.2081807
   provincedum14 |  -.3717443   .0639038    -5.82   0.000    -.4970223   -.2464663
   provincedum15 |  -.4721801   .0570679    -8.27   0.000    -.5840568   -.3603035
             _m1 |   1.558288   .3700005     4.21   0.000     .8329341    2.283643
             _m2 |  -.0968335   .1206712    -0.80   0.422     -.333399    .1397321
             _m3 |   .0631636   .2693112     0.23   0.815    -.4647979     .591125
           _cons |   8.279473   .0730762   113.30   0.000     8.136214    8.422733
----------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.050636          .        .       .            .           .
        rho1 |   1.520273          .        .       .            .           .
        rho2 |  -.0944712          .        .       .            .           .
        rho3 |   .0616227          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu highereduafter79 provincedum2-
> provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 250
> 00)

. eststo
(est2 stored)

. estat hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of gen_log_monthlyearning

H0: Constant variance

    chi2(1) =   0.79
Prob > chi2 = 0.3754

. local het_p = r(p)

. local het_df = r(df)

. sum gen_log_monthlyearning male exp expsqr higheredu highereduafter79 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      5,294    8.479013    .7140233   5.521461   10.12663
        male |      5,294    .5379675    .4986035          0          1
         exp |      5,294    15.03589     6.94652          0         33
      expsqr |      5,294     274.323    231.9129          0       1089
   higheredu |      5,294    .7665281    .4230798          0          1
-------------+---------------------------------------------------------
higheredu~79 |      5,294    .5502456     .497516          0          1
          m1 |      5,294   -.2756862    .0701061  -.4284056  -.0389473
          m2 |      5,294    .4519296    .3422949   .0001547   2.301244
          m3 |      5,294   -.2510442     .196665   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Sec Gen, All Gender, Non-specified Higheredu, Prov
> ince Dum) pvalue addstat("Hettest: p-value", `het_p', "Hettest: df", `het_df')
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8 10/Urban tab
> les.xls
dir : seeout

. 
. ***Table 10 Generation
. 
. local variablenames m1 m2 m3

. local variablelabels ""Upper secondary vocational track selection correction" "Upper second
> ary general track selection correction" "No upper secondary degree selection correction""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. 
. local estlist est1 est2

. 
. outreg2 [`estlist'] using "Table 10/Table10.xls", excel replace pvalue adjr2 drop(provinced
> um*) dec(3) sortvar(male exp expsqr higheredu) title("Table 10") ctitle(" ") addnote("More 
> notes") label
Table 10/Table10.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Urban Tables 2 4 6 8
>  10/Urban tables.log
  log type:  text
 closed on:  24 Oct 2024, 17:44:31
---------------------------------------------------------------------------------------------
