---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Ten
> ure controlled/Urban 1979 Highgen FuzzyOption MaleTenure controlled.log
  log type:  text
 opened on:   6 Aug 2024, 17:24:09

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,431 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(33,372 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(5,190 real changes made)

. 
. *Step Two: Regressions
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06824     .04713   1.4479   0.148   -.024131       .16061
    Bias-corrected |  .02455     .04713   0.5209   0.602   -.067823      .116919
            Robust |  .02455     .07316   0.3355   0.737   -.118847      .167943
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6901     1.4166   1.1931   0.233    -1.0864      4.46667
    Bias-corrected |  3.0268     1.4166   2.1366   0.033    .250271      5.80334
            Robust |  3.0268      2.205   1.3727   0.170   -1.29494      7.34855
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02009     .02838   0.7081   0.479   -.035523      .075711
    Bias-corrected |   .0425     .02838   1.4976   0.134   -.013121      .098113
            Robust |   .0425     .04132   1.0284   0.304   -.038497      .123489
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   3.835      5.389   0.7116   0.477   -6.72729      14.3973
    Bias-corrected |  1.1293      5.389   0.2095   0.834   -9.43303      11.6916
            Robust |  1.1293     7.7533   0.1456   0.884    -14.067      16.3255
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      2379        2604            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.742      62.742
       BW bias (b) |   120.242     120.242
         rho (h/b) |     0.522       0.522
        Unique obs |       370         261

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01148     .02284   0.5026   0.615    -.03328      .056232
    Bias-corrected |  .00093     .02284   0.0408   0.967   -.043824      .045688
            Robust |  .00093     .02567   0.0363   0.971   -.049385      .051249
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.3846     6.8172   0.4965   0.620   -9.97686       16.746
    Bias-corrected |  6.1372     6.8172   0.9003   0.368   -7.22426      19.4986
            Robust |  6.1372     7.6589   0.8013   0.423   -8.87399      21.1483
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(12
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09537     .06532   1.4600   0.144   -.032657      .223406
    Bias-corrected |   .1005     .06532   1.5385   0.124   -.027531      .228532
            Robust |   .1005     .09506   1.0572   0.290   -.085814      .286814
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .77866     1.0957   0.7106   0.477    -1.3689      2.92623
    Bias-corrected |  1.1717     1.0957   1.0694   0.285   -.975862      3.31928
            Robust |  1.1717     1.6542   0.7083   0.479   -2.07054      4.41396
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(36
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02627     .04005   0.6560   0.512   -.052216      .104759
    Bias-corrected |  .04375     .04005   1.0925   0.275   -.034736      .122239
            Robust |  .04375     .05793   0.7552   0.450   -.069796      .157299
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.4836     6.6475   0.6745   0.500    -8.5453      17.5124
    Bias-corrected |  -.1912     6.6475   -0.0288  0.977   -13.2201      12.8377
            Robust |  -.1912     9.5422   -0.0200  0.984   -18.8936      18.5112
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      1791        2236            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    74.208      74.208
       BW bias (b) |   118.453     118.453
         rho (h/b) |     0.626       0.626
        Unique obs |       320         248

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02765     .02982   0.9272   0.354     -.0308       .08611
    Bias-corrected |  .00705     .02982   0.2365   0.813   -.051403      .065507
            Robust |  .00705      .0354   0.1992   0.842   -.062333      .076438
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.9857     2.4158   0.8220   0.411   -2.74914      6.72051
    Bias-corrected |   3.112     2.4158   1.2882   0.198   -1.62285      7.84679
            Robust |   3.112     2.8618   1.0874   0.277   -2.49697      8.72091
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0125     .03378   0.3699   0.711    -.05372      .078713
    Bias-corrected | -.02254     .03378   -0.6671  0.505   -.088756      .043677
            Robust | -.02254     .02589   -0.8706  0.384   -.073279        .0282
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -8.5269     27.933   -0.3053  0.760   -63.2754      46.2216
    Bias-corrected |  -33.18     27.933   -1.1878  0.235   -87.9283      21.5687
            Robust |  -33.18     28.673   -1.1572  0.247   -89.3779      23.0183
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01663     .02399   0.6931   0.488   -.030393       .06365
    Bias-corrected |   .0215     .02399   0.8963   0.370   -.025518      .068525
            Robust |   .0215     .03724   0.5775   0.564   -.051482      .094489
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.0801     12.746   0.6339   0.526   -16.9013      33.0614
    Bias-corrected | -.10615     12.746   -0.0083  0.993   -25.0875      24.8752
            Robust | -.10615     19.689   -0.0054  0.996   -38.6955      38.4832
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       587         610            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.104      71.104
       BW bias (b) |   137.677     137.677
         rho (h/b) |     0.516       0.516
        Unique obs |       236         243

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00254     .01705   -0.1490  0.882   -.035956      .030874
    Bias-corrected | -.00325     .01705   -0.1903  0.849    -.03666       .03017
            Robust | -.00325     .01936   -0.1677  0.867   -.041181      .034691
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -37.391     255.07   -0.1466  0.883    -537.31      462.527
    Bias-corrected | -28.117     255.07   -0.1102  0.912   -528.035      471.802
            Robust | -28.117      289.5   -0.0971  0.923    -595.53      539.296
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14456     .08514   1.6979   0.090   -.022315      .311425
    Bias-corrected |   .1573     .08514   1.8476   0.065   -.009566      .324174
            Robust |   .1573     .12509   1.2576   0.209    -.08786      .402469
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1381     .94757   1.2011   0.230   -.719101      2.99532
    Bias-corrected |  1.5088     .94757   1.5923   0.111   -.348406      3.36602
            Robust |  1.5088     1.4182   1.0639   0.287   -1.27072      4.28833
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02609     .05354   0.4873   0.626    -.07885      .131026
    Bias-corrected |   .0737     .05354   1.3765   0.169   -.031237      .178639
            Robust |   .0737     .07667   0.9613   0.336   -.076568       .22397
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.1083     8.2105   0.5004   0.617    -11.984      20.2006
    Bias-corrected | -3.9101     8.2105   -0.4762  0.634   -20.0024      12.1823
            Robust | -3.9101     11.624   -0.3364  0.737   -26.6925      18.8724
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |      1067        1440            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.763      68.763
       BW bias (b) |   110.615     110.615
         rho (h/b) |     0.622       0.622
        Unique obs |       315         237

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03835     .04164   0.9211   0.357   -.043255      .119957
    Bias-corrected |  .01608     .04164   0.3862   0.699   -.065525      .097687
            Robust |  .01608     .04898   0.3283   0.743    -.07991      .112072
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .94949     1.7325   0.5481   0.584   -2.44609      4.34506
    Bias-corrected |   1.014     1.7325   0.5853   0.558   -2.38155       4.4096
            Robust |   1.014       2.03   0.4995   0.617   -2.96476      4.99281
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nn
> cluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06824     .05762   1.1843   0.236   -.044696      .181174
    Bias-corrected |  .02455     .05762   0.4260   0.670   -.088387      .137483
            Robust |  .02455     .08228   0.2984   0.765   -.136709      .185805
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6901     1.6221   1.0419   0.297   -1.48921      4.86947
    Bias-corrected |  3.0268     1.6221   1.8659   0.062   -.152535      6.20614
            Robust |  3.0268     2.6379   1.1474   0.251   -2.14348      8.19709
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nn
> cluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02009      .0447   0.4496   0.653   -.067511      .107699
    Bias-corrected |   .0425      .0447   0.9507   0.342   -.045109      .130101
            Robust |   .0425     .04772   0.8906   0.373   -.051026      .136017
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   3.835     8.1823   0.4687   0.639   -12.2021      19.8721
    Bias-corrected |  1.1293     8.1823   0.1380   0.890   -14.9078      17.1664
            Robust |  1.1293     8.9636   0.1260   0.900    -16.439      18.6976
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster prov
> ince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      2969        3157            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    76.464      76.464
       BW bias (b) |   117.294     117.294
         rho (h/b) |     0.652       0.652
        Unique obs |       370         261
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02005     .03246   0.6176   0.537   -.043575      .083674
    Bias-corrected |  .00245     .03246   0.0754   0.940   -.061176      .066073
            Robust |  .00245     .03348   0.0731   0.942   -.063175      .068073
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.7507     3.5052   0.4995   0.617   -5.11927      8.62073
    Bias-corrected |  2.9467     3.5052   0.8407   0.401   -3.92329       9.8167
            Robust |  2.9467     3.5811   0.8229   0.411   -4.07206      9.96547
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(12
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09537     .07809   1.2214   0.222   -.057678      .248427
    Bias-corrected |   .1005     .07809   1.2870   0.198   -.052552      .253553
            Robust |   .1005     .10696   0.9396   0.347   -.109136      .310137
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .77866     1.3817   0.5636   0.573   -1.92938      3.48671
    Bias-corrected |  1.1717     1.3817   0.8480   0.396   -1.53634      3.87976
            Robust |  1.1717      2.144   0.5465   0.585   -3.03039      5.37381
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(36
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02627     .05959   0.4409   0.659   -.090516      .143059
    Bias-corrected |  .04375     .05959   0.7343   0.463   -.073036      .160538
            Robust |  .04375     .06219   0.7035   0.482   -.078137       .16564
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.4836     9.9361   0.4512   0.652   -14.9909       23.958
    Bias-corrected |  -.1912     9.9361   -0.0192  0.985   -19.6656      19.2832
            Robust |  -.1912     10.119   -0.0189  0.985   -20.0238      19.6414
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nn
> cluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      2109        2698            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    87.012      87.012
       BW bias (b) |   119.174     119.174
         rho (h/b) |     0.730       0.730
        Unique obs |       320         248
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04171      .0415   1.0051   0.315   -.039627      .123053
    Bias-corrected |  .01312      .0415   0.3162   0.752   -.068216      .094464
            Robust |  .01312     .04497   0.2918   0.770   -.075014      .101262
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3565      2.092   0.6484   0.517   -2.74382      5.45675
    Bias-corrected |  1.9691      2.092   0.9412   0.347   -2.13119      6.06938
            Robust |  1.9691     2.1541   0.9141   0.361   -2.25277      6.19096
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0125     .03155   0.3961   0.692   -.049342      .074334
    Bias-corrected | -.02254     .03155   -0.7144  0.475   -.084377      .039299
            Robust | -.02254     .02828   -0.7971  0.425   -.077959       .03288
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -8.5269     27.869   -0.3060  0.760   -63.1498      46.0961
    Bias-corrected |  -33.18     27.869   -1.1905  0.234   -87.8028      21.4432
            Robust |  -33.18     32.757   -1.0129  0.311   -97.3824      31.0228
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01663      .0229   0.7260   0.468   -.028262      .061519
    Bias-corrected |   .0215      .0229   0.9389   0.348   -.023386      .066394
            Robust |   .0215     .03477   0.6185   0.536   -.046637      .089644
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.0801     13.541   0.5967   0.551   -18.4595      34.6197
    Bias-corrected | -.10615     13.541   -0.0078  0.994   -26.6458      26.4335
            Robust | -.10615     17.409   -0.0061  0.995   -34.2272      34.0149
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       626         642            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    76.056      76.056
       BW bias (b) |   134.368     134.368
         rho (h/b) |     0.566       0.566
        Unique obs |       236         243
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00192     .01646   -0.1167  0.907   -.034172      .030331
    Bias-corrected | -.00359     .01646   -0.2179  0.828   -.035837      .028666
            Robust | -.00359     .01898   -0.1889  0.850   -.040784      .033613
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -44.42     389.22   -0.1141  0.909    -807.27       718.43
    Bias-corrected | -8.1099     389.22   -0.0208  0.983    -770.96       754.74
            Robust | -8.1099     451.28   -0.0180  0.986   -892.599       876.38
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14456     .09529   1.5170   0.129   -.042208      .331319
    Bias-corrected |   .1573     .09529   1.6508   0.099   -.029459      .344068
            Robust |   .1573     .14152   1.1115   0.266   -.120072       .43468
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1381     .86161   1.3209   0.187   -.550617      2.82684
    Bias-corrected |  1.5088     .86161   1.7511   0.080   -.179922      3.19753
            Robust |  1.5088     1.5735   0.9589   0.338    -1.5752      4.59281
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02609     .07165   0.3641   0.716   -.114348      .166524
    Bias-corrected |   .0737     .07165   1.0286   0.304   -.066735      .214137
            Robust |   .0737     .08011   0.9200   0.358   -.083304      .230707
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.1083      10.63   0.3865   0.699   -16.7261      24.9427
    Bias-corrected | -3.9101      10.63   -0.3678  0.713   -24.7445      16.9244
            Robust | -3.9101      11.81   -0.3311  0.741   -27.0567      19.2366
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |      1160        1578            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    73.374      73.374
       BW bias (b) |   101.053     101.053
         rho (h/b) |     0.726       0.726
        Unique obs |       315         237
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04588     .05266   0.8712   0.384   -.057339      .149101
    Bias-corrected |  .01585     .05266   0.3009   0.763   -.087371      .119068
            Robust |  .01585     .05797   0.2734   0.785   -.097779      .129475
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .88282     1.8769   0.4704   0.638    -2.7958      4.56145
    Bias-corrected |  1.0687     1.8769   0.5694   0.569   -2.60989      4.74737
            Robust |  1.0687     1.9346   0.5524   0.581   -2.72295      4.86043
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1)
>  h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07183     .05505   1.3048   0.192   -.036066      .179732
    Bias-corrected |  .01875     .05505   0.3406   0.733    -.08915      .126648
            Robust |  .01875      .1013   0.1851   0.853   -.179795      .217294
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .62399     1.3131   0.4752   0.635   -1.94968      3.19765
    Bias-corrected | -.27531     1.3131   -0.2097  0.834   -2.84897      2.29836
            Robust | -.27531     2.4044   -0.1145  0.909   -4.98793      4.43731
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1)
>  h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01315     .03005   0.4377   0.662   -.045752      .072059
    Bias-corrected |  .03912     .03005   1.3015   0.193   -.019788      .098022
            Robust |  .03912     .04645   0.8421   0.400   -.051926      .130159
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   3.624     8.4053   0.4312   0.666   -12.8501       20.098
    Bias-corrected | -3.2108     8.4053   -0.3820  0.702   -19.6849      13.2632
            Robust | -3.2108      12.93   -0.2483  0.804   -28.5526      22.1309
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      1990        2157            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.473      54.473
       BW bias (b) |   112.348     112.348
         rho (h/b) |     0.485       0.485
        Unique obs |       369         260

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00108     .02551   -0.0422  0.966   -.051077      .048923
    Bias-corrected | -.01207     .02551   -0.4730  0.636   -.062067      .037933
            Robust | -.01207     .02842   -0.4246  0.671   -.067773      .043639
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -15.953      389.8   -0.0409  0.967   -779.942      748.035
    Bias-corrected |   153.5      389.8   0.3938   0.694   -610.484      917.493
            Robust |   153.5     434.25   0.3535   0.724   -697.603      1004.61
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kern
> el(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09072     .08205   1.1057   0.269   -.070092      .251523
    Bias-corrected |   .1281     .08205   1.5613   0.118   -.032706      .288909
            Robust |   .1281     .14624   0.8760   0.381   -.158526      .414728
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.37836     1.5582   -0.2428  0.808   -3.43243      2.67571
    Bias-corrected | -1.2282     1.5582   -0.7882  0.431   -4.28225      1.82589
            Robust | -1.2282     2.7812   -0.4416  0.659   -6.67933      4.22296
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kern
> el(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01337     .04344   0.3077   0.758   -.071775      .098508
    Bias-corrected |  .02389     .04344   0.5500   0.582    -.06125      .109034
            Robust |  .02389     .06875   0.3475   0.728   -.110863      .158648
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  6.9764      22.05   0.3164   0.752   -36.2399      50.1927
    Bias-corrected | -5.9603      22.05   -0.2703  0.787   -49.1766       37.256
            Robust | -5.9603     34.842   -0.1711  0.864   -74.2503      62.3297
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(
> mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1518        1914            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.046      65.046
       BW bias (b) |   106.677     106.677
         rho (h/b) |     0.610       0.610
        Unique obs |       319         247

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01026      .0334   0.3072   0.759   -.055205      .075728
    Bias-corrected | -.01274      .0334   -0.3815  0.703   -.078208      .052724
            Robust | -.01274     .04006   -0.3181  0.750   -.091253      .065769
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |     3.7     11.961   0.3093   0.757   -19.7438      27.1438
    Bias-corrected |  10.606     11.961   0.8867   0.375   -12.8377        34.05
            Robust |  10.606     14.336   0.7399   0.459    -17.491      38.7033
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03882     .05959   0.6515   0.515   -.077972       .15561
    Bias-corrected | -.04909     .05959   -0.8238  0.410   -.165882      .067699
            Robust | -.04909     .08324   -0.5898  0.555   -.212235      .114052
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.3973     8.0055   -0.4244  0.671   -19.0877      12.2931
    Bias-corrected | -13.511     8.0055   -1.6877  0.091    -29.201      2.17985
            Robust | -13.511     13.251   -1.0196  0.308    -39.482      12.4608
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02157     .02899   0.7439   0.457   -.035254      .078387
    Bias-corrected |   .0412     .02899   1.4213   0.155   -.015616      .098026
            Robust |   .0412      .0553   0.7451   0.456   -.067178      .149588
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.2713     11.754   0.7037   0.482    -14.767      31.3097
    Bias-corrected | -3.0235     11.754   -0.2572  0.797   -26.0618      20.0149
            Robust | -3.0235     21.911   -0.1380  0.890   -45.9678      39.9209
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       581         601            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    72.723      72.723
       BW bias (b) |   141.202     141.202
         rho (h/b) |     0.515       0.515
        Unique obs |       235         242

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00121     .01914   -0.0634  0.949   -.038737      .036308
    Bias-corrected | -.00141     .01914   -0.0738  0.941   -.038936      .036109
            Robust | -.00141      .0221   -0.0639  0.949   -.044732      .041906
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -92.865     1470.7   -0.0631  0.950   -2975.39      2789.66
    Bias-corrected |  -82.18     1470.7   -0.0559  0.955   -2964.71      2800.35
            Robust |  -82.18     1697.7   -0.0484  0.961   -3409.69      3245.33
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11003     .10573   1.0406   0.298   -.097202      .317254
    Bias-corrected |  .12267     .10573   1.1602   0.246   -.084557        .3299
            Robust |  .12267     .18655   0.6576   0.511   -.242963      .488307
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05982     1.4785   -0.0405  0.968    -2.9577      2.83806
    Bias-corrected | -1.2518     1.4785   -0.8466  0.397   -4.14965      1.64611
            Robust | -1.2518     2.6246   -0.4769  0.633   -6.39584       3.8923
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00302     .05813   -0.0520  0.959   -.116947      .110902
    Bias-corrected |  .02816     .05813   0.4844   0.628   -.085768      .142081
            Robust |  .02816     .09049   0.3111   0.756   -.149205      .205517
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -14.987     296.26   -0.0506  0.960   -595.642      565.668
    Bias-corrected | -136.51     296.26   -0.4608  0.645    -717.16       444.15
            Robust | -136.51      461.8   -0.2956  0.768   -1041.61      768.602
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |       963        1306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.287      63.287
       BW bias (b) |   105.871     105.871
         rho (h/b) |     0.598       0.598
        Unique obs |       314         236

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00812     .04559   0.1782   0.859   -.081235       .09748
    Bias-corrected | -.01845     .04559   -0.4046  0.686   -.107804       .07091
            Robust | -.01845     .05396   -0.3419  0.732     -.1242      .087306
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.3946     12.956   -0.1076  0.914   -26.7877      23.9986
    Bias-corrected | -9.5103     12.956   -0.7341  0.463   -34.9035      15.8828
            Robust | -9.5103     15.297   -0.6217  0.534    -39.491      20.4703
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1)
>  h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07183     .06296   1.1409   0.254   -.051571      .195237
    Bias-corrected |  .01875     .06296   0.2978   0.766   -.104655      .142153
            Robust |  .01875     .08795   0.2132   0.831   -.153621      .191119
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .62399     1.2687   0.4918   0.623   -1.86265      3.11062
    Bias-corrected | -.27531     1.2687   -0.2170  0.828   -2.76194      2.21132
            Robust | -.27531     2.7871   -0.0988  0.921   -5.73789      5.18727
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1)
>  h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01315     .04747   0.2771   0.782   -.079876      .106184
    Bias-corrected |  .03912     .04747   0.8241   0.410   -.053913      .132147
            Robust |  .03912     .05333   0.7335   0.463   -.065412      .143646
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   3.624     12.479   0.2904   0.772   -20.8349      28.0828
    Bias-corrected | -3.2108     12.479   -0.2573  0.797   -27.6697       21.248
            Robust | -3.2108     15.467   -0.2076  0.836    -33.526      27.1043
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all v
> ce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      2558        2753            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.621      68.621
       BW bias (b) |   108.916     108.916
         rho (h/b) |     0.630       0.630
        Unique obs |       369         260
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00964     .03482   0.2769   0.782     -.0586      .077883
    Bias-corrected | -.00873     .03482   -0.2506  0.802   -.076967      .059515
            Robust | -.00873     .03734   -0.2337  0.815   -.081921      .064469
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .90944      6.276   0.1449   0.885   -11.3913      13.2102
    Bias-corrected |  1.5142      6.276   0.2413   0.809   -10.7866       13.815
            Robust |  1.5142      6.601   0.2294   0.819   -11.4234      14.4518
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kern
> el(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09072     .08583   1.0569   0.291   -.077516      .258947
    Bias-corrected |   .1281     .08583   1.4924   0.136    -.04013      .296333
            Robust |   .1281      .1219   1.0508   0.293   -.110825      .367028
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.37836     1.4931   -0.2534  0.800   -3.30476      2.54804
    Bias-corrected | -1.2282     1.4931   -0.8226  0.411   -4.15458      1.69822
            Robust | -1.2282     3.0053   -0.4087  0.683   -7.11837      4.66201
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kern
> el(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01337     .06461   0.2069   0.836   -.113271      .140004
    Bias-corrected |  .02389     .06461   0.3698   0.712   -.102745       .15053
            Robust |  .02389     .07217   0.3311   0.741   -.117557      .165342
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  6.9764     32.645   0.2137   0.831   -57.0067      70.9595
    Bias-corrected | -5.9603     32.645   -0.1826  0.855   -69.9434      58.0228
            Robust | -5.9603     37.745   -0.1579  0.875   -79.9399      68.0193
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(
> mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1570        1958            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.618      67.618
       BW bias (b) |   105.474     105.474
         rho (h/b) |     0.641       0.641
        Unique obs |       319         247
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01289     .04775   0.2699   0.787   -.080697      .106473
    Bias-corrected | -.01209     .04775   -0.2531  0.800   -.105672      .081498
            Robust | -.01209     .05369   -0.2251  0.822    -.11731      .093135
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.6288     10.192   0.2579   0.796   -17.3475       22.605
    Bias-corrected |  6.6129     10.192   0.6488   0.516   -13.3633      26.5892
            Robust |  6.6129     11.004   0.6010   0.548   -14.9539      28.1798
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03882     .05416   0.7167   0.474   -.067335      .144973
    Bias-corrected | -.04909     .05416   -0.9064  0.365   -.155246      .057063
            Robust | -.04909     .08629   -0.5689  0.569   -.218208      .120025
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.3973     5.9775   -0.5683  0.570   -15.1131      8.31847
    Bias-corrected | -13.511     5.9775   -2.2602  0.024   -25.2263     -1.79482
            Robust | -13.511     10.911   -1.2383  0.216   -34.8958      7.87459
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02157      .0274   0.7870   0.431   -.032145      .075278
    Bias-corrected |   .0412      .0274   1.5036   0.133   -.012507      .094916
            Robust |   .0412     .05174   0.7964   0.426   -.060203      .142612
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.2713     11.663   0.7092   0.478   -14.5879      31.1306
    Bias-corrected | -3.0235     11.663   -0.2592  0.795   -25.8827      19.8358
            Robust | -3.0235     20.309   -0.1489  0.882   -42.8276      36.7807
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vc
> e(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       629         650            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    79.099      79.099
       BW bias (b) |   142.508     142.508
         rho (h/b) |     0.555       0.555
        Unique obs |       235         242
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00118     .01825   0.0647   0.948   -.034587       .03695
    Bias-corrected |  .00103     .01825   0.0562   0.955   -.034743      .036794
            Robust |  .00103     .02149   0.0477   0.962   -.041085      .043136
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  86.784     1339.8   0.0648   0.948   -2539.14      2712.71
    Bias-corrected |  103.18     1339.8   0.0770   0.939   -2522.74      2729.11
            Robust |  103.18     1573.6   0.0656   0.948   -2981.04       3187.4
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11003     .10006   1.0996   0.271   -.086081      .306133
    Bias-corrected |  .12267     .10006   1.2260   0.220   -.073435      .318778
            Robust |  .12267      .1673   0.7333   0.463   -.205226       .45057
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05982     1.3095   -0.0457  0.964   -2.62647      2.50684
    Bias-corrected | -1.2518     1.3095   -0.9559  0.339   -3.81842      1.31489
            Robust | -1.2518     2.8669   -0.4366  0.662   -6.87072      4.36719
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00302     .07887   -0.0383  0.969   -.157604       .15156
    Bias-corrected |  .02816     .07887   0.3570   0.721   -.126426      .182738
            Robust |  .02816     .09508   0.2961   0.767   -.158205      .214518
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -14.987     401.15   -0.0374  0.970   -801.223       771.25
    Bias-corrected | -136.51     401.15   -0.3403  0.734   -922.742      649.731
            Robust | -136.51     475.29   -0.2872  0.774   -1068.06      795.047
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vc
> e(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |       856        1141            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.317      57.317
       BW bias (b) |    92.851      92.851
         rho (h/b) |     0.617       0.617
        Unique obs |       314         236
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00636     .06392   -0.0995  0.921   -.131643      .118929
    Bias-corrected | -.03832     .06392   -0.5994  0.549   -.163604      .086968
            Robust | -.03832     .07152   -0.5358  0.592   -.178498      .101862
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.4515     19.217   0.0755   0.940   -36.2132      39.1163
    Bias-corrected | -2.1138     19.217   -0.1100  0.912   -39.7785       35.551
            Robust | -2.1138     20.567   -0.1028  0.918   -42.4236       38.196
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1)
>  h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09211      .0696   1.3234   0.186   -.044306      .228535
    Bias-corrected |  .04314      .0696   0.6198   0.535   -.093277      .179564
            Robust |  .04314     .15472   0.2789   0.780   -.260092       .34638
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .36616     1.3916   0.2631   0.792   -2.36123      3.09355
    Bias-corrected |  -2.535     1.3916   -1.8217  0.069   -5.26239      .192402
            Robust |  -2.535     3.3546   -0.7557  0.450   -9.10992      4.03993
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1)
>  h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00968     .03258   0.2970   0.766   -.054179      .073532
    Bias-corrected |  .04277     .03258   1.3128   0.189   -.021085      .106626
            Robust |  .04277     .05485   0.7797   0.436   -.064738       .15028
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.6405     15.513   0.2991   0.765   -25.7653      35.0464
    Bias-corrected | -11.252     15.513   -0.7253  0.468   -41.6581      19.1537
            Robust | -11.252     26.134   -0.4306  0.667   -62.4744        39.97
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      1632        1819            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.401      47.401
       BW bias (b) |    95.671      95.671
         rho (h/b) |     0.495       0.495
        Unique obs |       368         259

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00562     .02936   -0.1915  0.848   -.063173      .051929
    Bias-corrected | -.01691     .02936   -0.5759  0.565    -.07446      .040642
            Robust | -.01691     .03334   -0.5072  0.612    -.08225      .048432
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -2.547       18.1   -0.1407  0.888   -38.0228      32.9289
    Bias-corrected |  3.4415       18.1   0.1901   0.849   -32.0344      38.9173
            Robust |  3.4415      20.53   0.1676   0.867   -36.7972      43.6802
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kern
> el(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07475     .10733   0.6964   0.486   -.135619      .285125
    Bias-corrected |  .12574     .10733   1.1714   0.241   -.084637      .336108
            Robust |  .12574     .25042   0.5021   0.616   -.365078      .616549
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.1383     3.1902   -0.3568  0.721     -7.391      5.11441
    Bias-corrected |  -5.869     3.1902   -1.8397  0.066   -12.1217      .383678
            Robust |  -5.869       7.43   -0.7899  0.430   -20.4317       8.6936
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kern
> el(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0026     .04722   -0.0551  0.956   -.095155      .089954
    Bias-corrected | -.01558     .04722   -0.3298  0.742    -.10813      .076979
            Robust | -.01558     .08287   -0.1880  0.851   -.177994      .146843
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -39.176      718.6   -0.0545  0.957   -1447.61      1369.26
    Bias-corrected |  204.96      718.6   0.2852   0.775   -1203.48      1613.39
            Robust |  204.96     1260.4   0.1626   0.871   -2265.36      2675.27
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(
> mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |      1437        1824            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.909      63.909
       BW bias (b) |   112.096     112.096
         rho (h/b) |     0.570       0.570
        Unique obs |       318         246

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00138     .03544   -0.0391  0.969   -.070838       .06807
    Bias-corrected | -.02822     .03544   -0.7962  0.426    -.09767      .041238
            Robust | -.02822     .04225   -0.6679  0.504   -.111018      .054586
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -28.735     746.61   -0.0385  0.969   -1492.07       1434.6
    Bias-corrected |  541.34     746.61   0.7251   0.468   -921.988      2004.68
            Robust |  541.34     890.04   0.6082   0.543    -1203.1      2285.79
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04128     .08896   0.4640   0.643   -.133075      .215635
    Bias-corrected |  -.1729     .08896   -1.9436  0.052   -.347259      .001452
            Robust |  -.1729      .2567   -0.6736  0.501   -.676029      .330222
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.8259     12.769   -0.3779  0.705   -29.8527      20.2008
    Bias-corrected | -42.387     12.769   -3.3195  0.001   -67.4133     -17.3598
            Robust | -42.387     35.561   -1.1919  0.233   -112.085      27.3118
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0221     .03236   0.6829   0.495   -.041328      .085526
    Bias-corrected |  .04197     .03236   1.2968   0.195   -.021461      .105394
            Robust |  .04197     .07194   0.5834   0.560   -.099026      .182959
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.5981     13.159   0.6534   0.513   -17.1925      34.3886
    Bias-corrected | -2.3914     13.159   -0.1817  0.856   -28.1819      23.3991
            Robust | -2.3914     28.454   -0.0840  0.933    -58.161      53.3783
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       546         574            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.669      69.669
       BW bias (b) |   133.887     133.887
         rho (h/b) |     0.520       0.520
        Unique obs |       234         241

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00244     .02091   -0.1166  0.907   -.043425      .038549
    Bias-corrected | -.00423     .02091   -0.2021  0.840   -.045212      .036762
            Robust | -.00423     .02452   -0.1723  0.863   -.052276      .043826
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -50.077      433.7   -0.1155  0.908   -900.108      799.954
    Bias-corrected | -16.849      433.7   -0.0388  0.969    -866.88      833.182
            Robust | -16.849     508.33   -0.0331  0.974   -1013.15      979.457
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13161     .14295   0.9207   0.357   -.148553      .411782
    Bias-corrected |  .22768     .14295   1.5927   0.111   -.052492      .507843
            Robust |  .22768     .32392   0.7029   0.482   -.407202      .862552
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01733     1.7331   0.0100   0.992   -3.37944       3.4141
    Bias-corrected | -2.9445     1.7331   -1.6990  0.089   -6.34127      .452267
            Robust | -2.9445     4.1192   -0.7148  0.475   -11.0181      5.12908
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01892     .06416   -0.2949  0.768   -.144672       .10683
    Bias-corrected | -.00257     .06416   -0.0401  0.968   -.128326      .123176
            Robust | -.00257     .11198   -0.0230  0.982   -.222044      .216895
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.8701     11.961   -0.2399  0.810   -26.3137      20.5736
    Bias-corrected |  1.8602     11.961   0.1555   0.876   -21.5834      25.3038
            Robust |  1.8602     20.852   0.0892   0.929   -39.0096        42.73
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       866        1158            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.254      59.254
       BW bias (b) |   104.804     104.804
         rho (h/b) |     0.565       0.565
        Unique obs |       313         235

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01219     .05054   -0.2411  0.809   -.111241      .086867
    Bias-corrected | -.04084     .05054   -0.8081  0.419   -.139895      .058213
            Robust | -.04084     .05977   -0.6832  0.494   -.157997      .076316
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .86938     6.6722   0.1303   0.896   -12.2078      13.9466
    Bias-corrected |  1.2701     6.6722   0.1904   0.849   -11.8071      14.3472
            Robust |  1.2701     7.8787   0.1612   0.872   -14.1719       16.712
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1)
>  h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09211     .08666   1.0629   0.288   -.077738      .261967
    Bias-corrected |  .04314     .08666   0.4978   0.619   -.126709      .212996
            Robust |  .04314     .12785   0.3375   0.736    -.20744      .293728
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .36616     1.1881   0.3082   0.758   -1.96243      2.69475
    Bias-corrected |  -2.535     1.1881   -2.1337  0.033   -4.86358     -.206401
            Robust |  -2.535     3.5767   -0.7088  0.478   -9.54513      4.47514
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1)
>  h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00968     .05253   0.1842   0.854   -.093277       .11263
    Bias-corrected |  .04277     .05253   0.8142   0.416   -.060183      .145724
            Robust |  .04277      .0679   0.6299   0.529   -.090303      .175845
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.6405     23.573   0.1969   0.844   -41.5607      50.8418
    Bias-corrected | -11.252     23.573   -0.4773  0.633   -57.4535       34.949
            Robust | -11.252     32.735   -0.3437  0.731   -75.4124      52.9079
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all v
> ce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      2351        2558            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.293      64.293
       BW bias (b) |    93.142      93.142
         rho (h/b) |     0.690       0.690
        Unique obs |       368         259
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00353     .03773   0.0937   0.925   -.070412      .077481
    Bias-corrected | -.01761     .03773   -0.4667  0.641   -.091554      .056339
            Robust | -.01761     .04359   -0.4039  0.686   -.103041      .067826
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.4287     19.714   0.0725   0.942   -37.2106      40.0681
    Bias-corrected |  7.3473     19.714   0.3727   0.709    -31.292      45.9867
            Robust |  7.3473     21.487   0.3419   0.732   -34.7671      49.4617
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kern
> el(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07475     .12366   0.6045   0.546   -.167615      .317121
    Bias-corrected |  .12574     .12366   1.0168   0.309   -.116633      .368103
            Robust |  .12574     .20972   0.5995   0.549    -.28531      .536781
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.1383     2.9699   -0.3833  0.702   -6.95928      4.68269
    Bias-corrected |  -5.869     2.9699   -1.9761  0.048     -11.69     -.048042
            Robust |  -5.869     7.3229   -0.8015  0.423   -20.2216      8.48352
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kern
> el(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0026     .07283   -0.0357  0.972   -.145337      .140135
    Bias-corrected | -.01558     .07283   -0.2139  0.831   -.158312       .12716
            Robust | -.01558     .09732   -0.1601  0.873   -.206311       .17516
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -39.176     1106.1   -0.0354  0.972   -2207.17      2128.82
    Bias-corrected |  204.96     1106.1   0.1853   0.853   -1963.04      2372.95
            Robust |  204.96     1469.4   0.1395   0.889   -2674.94      3084.85
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(
> mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |      1559        1952            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.126      68.126
       BW bias (b) |   115.865     115.865
         rho (h/b) |     0.588       0.588
        Unique obs |       318         246
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0042     .05108   0.0823   0.934   -.095906      .104312
    Bias-corrected | -.02446     .05108   -0.4790  0.632   -.124573      .075645
            Robust | -.02446     .05739   -0.4263  0.670   -.136952      .088023
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.7286     91.173   0.0848   0.932   -170.967      186.425
    Bias-corrected |  56.077     91.173   0.6151   0.539   -122.619      234.773
            Robust |  56.077     101.68   0.5515   0.581   -143.203      255.358
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04128     .08287   0.4982   0.618   -.121134      .203694
    Bias-corrected |  -.1729     .08287   -2.0865  0.037   -.335318     -.010489
            Robust |  -.1729     .26652   -0.6487  0.517   -.695272      .349465
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.8259     10.794   -0.4471  0.655    -25.981      16.3291
    Bias-corrected | -42.387     10.794   -3.9270  0.000   -63.5416     -21.2316
            Robust | -42.387     34.159   -1.2409  0.215   -109.336      24.5632
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0221     .03122   0.7078   0.479   -.039095      .083294
    Bias-corrected |  .04197     .03122   1.3441   0.179   -.019228      .103161
            Robust |  .04197     .06729   0.6236   0.533   -.089924      .173858
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.5981     13.147   0.6540   0.513   -17.1686      34.3648
    Bias-corrected | -2.3914     13.147   -0.1819  0.856   -28.1581      23.3753
            Robust | -2.3914     26.211   -0.0912  0.927    -53.763      48.9803
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vc
> e(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       587         607            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    74.719      74.719
       BW bias (b) |   132.918     132.918
         rho (h/b) |     0.562       0.562
        Unique obs |       234         241
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00271      .0199   -0.1359  0.892   -.041717      .036306
    Bias-corrected | -.00507      .0199   -0.2548  0.799   -.044084       .03394
            Robust | -.00507     .02366   -0.2143  0.830   -.051453      .041309
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -39.735      295.8   -0.1343  0.893   -619.494      540.024
    Bias-corrected | -8.8103      295.8   -0.0298  0.976   -588.569      570.949
            Robust | -8.8103     354.33   -0.0249  0.980   -703.275      685.654
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13161     .16073   0.8188   0.413   -.183412      .446641
    Bias-corrected |  .22768     .16073   1.4165   0.157   -.087351      .542702
            Robust |  .22768     .28856   0.7890   0.430   -.337898      .793248
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01733     1.2538   0.0138   0.989   -2.44006      2.47472
    Bias-corrected | -2.9445     1.2538   -2.3485  0.019   -5.40189     -.487114
            Robust | -2.9445      3.908   -0.7534  0.451   -10.6041       4.7151
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(uni) p(1) 
> h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01892     .09415   -0.2010  0.841   -.203455      .165613
    Bias-corrected | -.00257     .09415   -0.0273  0.978   -.187109       .18196
            Robust | -.00257     .14329   -0.0180  0.986   -.283412      .278263
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.8701     16.509   -0.1738  0.862   -35.2274      29.4873
    Bias-corrected |  1.8602     16.509   0.1127   0.910   -30.4971      34.2175
            Robust |  1.8602     22.683   0.0820   0.935   -42.5972      46.3176
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vc
> e(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       799        1068            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.630      55.630
       BW bias (b) |    98.881      98.881
         rho (h/b) |     0.563       0.563
        Unique obs |       313         235
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02216     .07538   -0.2940  0.769   -.169896      .125575
    Bias-corrected |  -.0533     .07538   -0.7072  0.479    -.20104      .094431
            Robust |  -.0533     .08591   -0.6205  0.535    -.22169       .11508
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .55797     4.9798   0.1120   0.911   -9.20228      10.3182
    Bias-corrected |  1.0137     4.9798   0.2036   0.839   -8.74656       10.774
            Robust |  1.0137      5.309   0.1909   0.849   -9.39169      11.4191
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Tenure controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male Ten
> ure controlled/Urban 1979 Highgen FuzzyOption MaleTenure controlled.log
  log type:  text
 closed on:   6 Aug 2024, 17:24:40
---------------------------------------------------------------------------------------------
