---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Fra
> me/Exp/Rural/IV Rural ATF Exp 1979 3years.log
  log type:  text
 opened on:   8 Aug 2024, 12:33:03

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,408 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. local months = 36

. 
. 
. *1)
. ivregress 2sls log_monthlyearning exp expsqr male (higheredu secgenhighedu secgenedu = t d 
> td) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & educat != 
> ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(6, 1184)    = 236.72
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5454
                                                        Adj R-squared = 0.5431
                                                        Root MSE      = 0.1673

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.4309329   .0231392   -18.62   0.000    -.4763313   -.3855345
      expsqr |   .0079913    .000531    15.05   0.000     .0069495    .0090331
        male |   .0120463   .0100555     1.20   0.231    -.0076822    .0317748
           t |  -.0038025    .000736    -5.17   0.000    -.0052465   -.0023585
           d |   .0193077   .0194556     0.99   0.321    -.0188636     .057479
          td |  -.0027628   .0009751    -2.83   0.005    -.0046759   -.0008498
       _cons |   5.717992   .2536832    22.54   0.000     5.220273    6.215711
------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(6, 1184)    = 136.71
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4093
                                                        Adj R-squared = 0.4063
                                                        Root MSE      = 0.1646

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |   -.342555   .0227597   -15.05   0.000    -.3872088   -.2979011
      expsqr |    .006476   .0005223    12.40   0.000     .0054513    .0075007
        male |   .0155839   .0098905     1.58   0.115    -.0038211    .0349888
           t |  -.0027044   .0007239    -3.74   0.000    -.0041248    -.001284
           d |   .0155959   .0191365     0.81   0.415    -.0219493    .0531412
          td |  -.0018019   .0009591    -1.88   0.061    -.0036836    .0000798
       _cons |   4.465755   .2495226    17.90   0.000       3.9762    4.955311
------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(6, 1184)    = 123.13
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.3842
                                                        Adj R-squared = 0.3811
                                                        Root MSE      = 0.2626

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1272948   .0363215    -3.50   0.000    -.1985566   -.0560331
      expsqr |   .0005274   .0008335     0.63   0.527    -.0011078    .0021627
        male |  -.0000327    .015784    -0.00   0.998    -.0310005     .030935
           t |  -.0091577   .0011553    -7.93   0.000    -.0114244    -.006891
           d |  -.0354455   .0305394    -1.16   0.246    -.0953628    .0244718
          td |   .0017064   .0015306     1.11   0.265    -.0012965    .0047093
       _cons |   2.803977   .3982056     7.04   0.000      2.02271    3.585244
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(6)    =      57.67
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     1.0789

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -5.243612   28.39066    -0.18   0.853    -60.88829    50.40107
secgenhighedu |   7.506062   41.81929     0.18   0.858    -74.45824    89.47037
    secgenedu |    .093349    .869874     0.11   0.915    -1.611573    1.798271
          exp |   .1118155   2.179552     0.05   0.959    -4.160027    4.383658
       expsqr |  -.0023036   .0461677    -0.05   0.960    -.0927907    .0881835
         male |    .420877   .3155899     1.33   0.182    -.1976678    1.039422
        _cons |   6.494974   25.32336     0.26   0.798    -43.13789    56.12784
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  1.15525  (p = 0.7638)
  Wu-Hausman F(3,1181)            =   .38222  (p = 0.7658)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.134  Chi-sq(6) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr male provincedum2-provincedum15 (higheredu sec
> genhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearni
> ng, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(20, 1170)   =  75.15
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5623
                                                        Adj R-squared = 0.5548
                                                        Root MSE      = 0.1651

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.4257225   .0233234   -18.25   0.000    -.4714828   -.3799622
       expsqr |   .0077718   .0005355    14.51   0.000     .0067211    .0088224
         male |   .0115297   .0099536     1.16   0.247    -.0079991    .0310586
 provincedum2 |   .0901288   .0417613     2.16   0.031     .0081933    .1720643
 provincedum3 |   .1304047   .0495366     2.63   0.009     .0332142    .2275952
 provincedum4 |   .0875637   .0420578     2.08   0.038     .0050467    .1700808
 provincedum5 |   .1003797   .0333985     3.01   0.003     .0348521    .1659073
 provincedum6 |   .1569889   .0354638     4.43   0.000     .0874093    .2265686
 provincedum7 |   .1038036   .0340476     3.05   0.002     .0370025    .1706048
 provincedum8 |   .1383895    .033209     4.17   0.000     .0732337    .2035453
 provincedum9 |    .056969   .0339574     1.68   0.094    -.0096551    .1235932
provincedum10 |   .0814237   .0342071     2.38   0.017     .0143096    .1485378
provincedum11 |   .0702914   .0343975     2.04   0.041     .0028038     .137779
provincedum12 |    .081362   .0400082     2.03   0.042     .0028662    .1598578
provincedum13 |    .070155   .0357965     1.96   0.050    -.0000776    .1403875
provincedum14 |   .0871634   .0353291     2.47   0.014      .017848    .1564788
provincedum15 |   .1254619   .0380029     3.30   0.001     .0509004    .2000233
            t |  -.0042454   .0007356    -5.77   0.000    -.0056887   -.0028021
            d |   .0227391   .0193359     1.18   0.240    -.0151979    .0606761
           td |   -.002775   .0009666    -2.87   0.004    -.0046715   -.0008785
        _cons |   5.619367    .253772    22.14   0.000     5.121468    6.117266
-------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(20, 1170)   =  42.54
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4210
                                                        Adj R-squared = 0.4111
                                                        Root MSE      = 0.1639

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   -.335946   .0231461   -14.51   0.000    -.3813585   -.2905335
       expsqr |   .0062636   .0005314    11.79   0.000      .005221    .0073062
         male |    .014663   .0098779     1.48   0.138    -.0047173    .0340434
 provincedum2 |   .0311791   .0414439     0.75   0.452    -.0501336    .1124918
 provincedum3 |   .0747777   .0491601     1.52   0.129     -.021674    .1712295
 provincedum4 |   .0290288   .0417381     0.70   0.487     -.052861    .1109186
 provincedum5 |   .0327358   .0331446     0.99   0.324    -.0322937    .0977653
 provincedum6 |   .0889851   .0351942     2.53   0.012     .0199343    .1580359
 provincedum7 |   .0391324   .0337888     1.16   0.247     -.027161    .1054258
 provincedum8 |   .0618671   .0329566     1.88   0.061    -.0027935    .1265276
 provincedum9 |   .0136814   .0336992     0.41   0.685    -.0524363    .0797991
provincedum10 |   .0222637   .0339471     0.66   0.512    -.0443403    .0888677
provincedum11 |   .0106131    .034136     0.31   0.756    -.0563616    .0775877
provincedum12 |   .0131492   .0397041     0.33   0.741    -.0647499    .0910484
provincedum13 |   .0069112   .0355244     0.19   0.846    -.0627875    .0766099
provincedum14 |    .030034   .0350605     0.86   0.392    -.0387546    .0988225
provincedum15 |   .0558553    .037714     1.48   0.139    -.0181393      .12985
            t |  -.0030964     .00073    -4.24   0.000    -.0045287   -.0016641
            d |   .0203345   .0191889     1.06   0.290    -.0173141    .0579831
           td |  -.0017074   .0009593    -1.78   0.075    -.0035895    .0001746
        _cons |   4.390766   .2518431    17.43   0.000     3.896651     4.88488
-------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(20, 1170)   =  40.25
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4076
                                                        Adj R-squared = 0.3975
                                                        Root MSE      = 0.2591

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1220995   .0365967    -3.34   0.001     -.193902    -.050297
       expsqr |   .0002944   .0008402     0.35   0.726    -.0013541    .0019429
         male |  -.0010509   .0156181    -0.07   0.946    -.0316936    .0295917
 provincedum2 |   .1783626   .0655277     2.72   0.007     .0497977    .3069274
 provincedum3 |   .2211436   .0777278     2.85   0.005     .0686421    .3736451
 provincedum4 |   .0589929   .0659928     0.89   0.372    -.0704845    .1884703
 provincedum5 |    .126802   .0524055     2.42   0.016     .0239828    .2296212
 provincedum6 |   .1918109   .0556461     3.45   0.001     .0826336    .3009882
 provincedum7 |   .1282696    .053424     2.40   0.017      .023452    .2330872
 provincedum8 |   .1853895   .0521082     3.56   0.000     .0831536    .2876254
 provincedum9 |   .1278768   .0532824     2.40   0.017      .023337    .2324166
provincedum10 |   .1363887   .0536743     2.54   0.011       .03108    .2416973
provincedum11 |   .0753357    .053973     1.40   0.163     -.030559    .1812304
provincedum12 |   .0336699   .0627768     0.54   0.592    -.0894977    .1568376
provincedum13 |   .0587257   .0561683     1.05   0.296     -.051476    .1689275
provincedum14 |   .0773055   .0554348     1.39   0.163    -.0314572    .1860682
provincedum15 |   .1844627   .0596303     3.09   0.002     .0674685    .3014569
            t |  -.0097543   .0011543    -8.45   0.000     -.012019   -.0074897
            d |  -.0278125     .03034    -0.92   0.359    -.0873394    .0317143
           td |   .0017556   .0015167     1.16   0.247    -.0012202    .0047314
        _cons |   2.681762   .3981934     6.73   0.000     1.900509    3.463014
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(20)   =     112.68
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .87904

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   -3.94859   11.33273    -0.35   0.728    -26.16032    18.26314
secgenhighedu |   5.226589   16.89263     0.31   0.757    -27.88235    38.33553
    secgenedu |   .1502536   .7240252     0.21   0.836     -1.26881    1.569317
          exp |  -.0860709   .9817759    -0.09   0.930    -2.010316    1.838174
       expsqr |   .0019202   .0207885     0.09   0.926    -.0388246    .0426649
         male |   .4461865   .1287552     3.47   0.001     .1938309     .698542
 provincedum2 |  -.1994075   .5505089    -0.36   0.717    -1.278385      .87957
 provincedum3 |  -.2830478   .3480771    -0.81   0.416    -.9652664    .3991707
 provincedum4 |  -.2723166   .5450704    -0.50   0.617    -1.340635    .7960017
 provincedum5 |   .0655566   .6077725     0.11   0.914    -1.125656    1.256769
 provincedum6 |   .0200696   .3446871     0.06   0.954    -.6555047    .6956439
 provincedum7 |  -.1170619   .5446021    -0.21   0.830    -1.184462    .9503386
 provincedum8 |  -.1570044    .559884    -0.28   0.779    -1.254357    .9403481
 provincedum9 |   .0117992   .4524172     0.03   0.979    -.8749223    .8985207
provincedum10 |   .0283822   .5775287     0.05   0.961    -1.103553    1.160318
provincedum11 |  -.0556075   .6341552    -0.09   0.930    -1.298529    1.187314
provincedum12 |  -.1623075   .7184757    -0.23   0.821    -1.570494    1.245879
provincedum13 |   -.062386   .6924141    -0.09   0.928    -1.419493    1.294721
provincedum14 |  -.2542686   .5104254    -0.50   0.618    -1.254684    .7461468
provincedum15 |  -.3835713   .5221752    -0.73   0.463    -1.407016    .6398733
        _cons |   8.873185   11.85765     0.75   0.454    -14.36738    32.11375
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  .492081  (p = 0.9206)
  Wu-Hausman F(3,1167)            =  .160788  (p = 0.9227)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   3.260  Chi-sq(20) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu secgenhighedu secgenedu = t d td ) 
> if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male == 1 & ed
> ucat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(5, 742)     = 158.99
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5172
                                                        Adj R-squared = 0.5140
                                                        Root MSE      = 0.1821

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.3931736   .0312059   -12.60   0.000     -.454436   -.3319112
      expsqr |   .0070506   .0007137     9.88   0.000     .0056495    .0084517
           t |  -.0044669    .000972    -4.60   0.000     -.006375   -.0025588
           d |   .0192732   .0268812     0.72   0.474    -.0334991    .0720456
          td |  -.0028646   .0013379    -2.14   0.033    -.0054912   -.0002381
       _cons |   5.368157    .343301    15.64   0.000       4.6942    6.042114
------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(5, 742)     =  96.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.3938
                                                        Adj R-squared = 0.3898
                                                        Root MSE      = 0.1800

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.3058858   .0308418    -9.92   0.000    -.3664335   -.2453382
      expsqr |   .0055064   .0007054     7.81   0.000     .0041217    .0068911
           t |  -.0036517   .0009606    -3.80   0.000    -.0055375   -.0017658
           d |   .0177963   .0265676     0.67   0.503    -.0343603    .0699529
          td |  -.0019886   .0013223    -1.50   0.133    -.0045845    .0006074
       _cons |   4.160273   .3392953    12.26   0.000      3.49418    4.826367
------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(5, 742)     = 101.63
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4065
                                                        Adj R-squared = 0.4025
                                                        Root MSE      = 0.2632

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |    -.10764   .0451156    -2.39   0.017    -.1962095   -.0190705
      expsqr |   .0000206   .0010318     0.02   0.984     -.002005    .0020462
           t |  -.0092228   .0014052    -6.56   0.000    -.0119815   -.0064642
           d |  -.0239692   .0388633    -0.62   0.538    -.1002643    .0523259
          td |   .0003757   .0019343     0.19   0.846    -.0034216    .0041731
       _cons |   2.630898   .4963238     5.30   0.000     1.656532    3.605264
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(5)    =       1.53
                                                  Prob > chi2     =     0.9091
                                                  R-squared       =          .
                                                  Root MSE        =     1.2883

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   6.719239   28.25867     0.24   0.812    -48.66674    62.10522
secgenhighedu |  -10.35757   38.41679    -0.27   0.787     -85.6531    64.93796
    secgenedu |   .6902985   1.943194     0.36   0.722    -3.118293     4.49889
          exp |  -.6472405   1.101675    -0.59   0.557    -2.806483    1.512003
       expsqr |   .0137914   .0238635     0.58   0.563    -.0329802    .0605629
        _cons |   15.79196   12.53413     1.26   0.208    -8.774482    40.35841
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  .923285  (p = 0.8198)
  Wu-Hausman F(3,739)             =  .304434  (p = 0.8222)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.080  Chi-sq(5) P-value = 0.9999

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu secgenhi
> ghedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 2
> 00, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(19, 728)    =  44.41
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5368
                                                        Adj R-squared = 0.5248
                                                        Root MSE      = 0.1801

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.3845977   .0314564   -12.23   0.000    -.4463537   -.3228417
       expsqr |   .0067522   .0007199     9.38   0.000     .0053387    .0081656
 provincedum2 |   .0752475   .0579621     1.30   0.195    -.0385453    .1890403
 provincedum3 |   .1330851   .0657623     2.02   0.043     .0039787    .2621914
 provincedum4 |   .0675023   .0558604     1.21   0.227    -.0421643    .1771689
 provincedum5 |   .0933483    .044552     2.10   0.036     .0058825    .1808141
 provincedum6 |   .1482386   .0469179     3.16   0.002     .0561281     .240349
 provincedum7 |   .0799277   .0447275     1.79   0.074    -.0078825    .1677379
 provincedum8 |   .1265555   .0440234     2.87   0.004     .0401274    .2129835
 provincedum9 |   .0345754   .0448049     0.77   0.441    -.0533869    .1225377
provincedum10 |   .0496094   .0457587     1.08   0.279    -.0402253     .139444
provincedum11 |   .0643305   .0457148     1.41   0.160     -.025418     .154079
provincedum12 |   .0832475   .0536184     1.55   0.121    -.0220177    .1885127
provincedum13 |   .0320207   .0475848     0.67   0.501    -.0613992    .1254406
provincedum14 |   .0602805   .0473552     1.27   0.203    -.0326884    .1532495
provincedum15 |    .110537   .0497362     2.22   0.027     .0128936    .2081804
            t |  -.0051754   .0009745    -5.31   0.000    -.0070886   -.0032622
            d |   .0257938   .0268926     0.96   0.338    -.0270025    .0785901
           td |  -.0025254   .0013368    -1.89   0.059    -.0051498     .000099
        _cons |   5.246012   .3429741    15.30   0.000     4.572676    5.919348
-------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(19, 728)    =  27.04
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4137
                                                        Adj R-squared = 0.3984
                                                        Root MSE      = 0.1787

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.2976128   .0312157    -9.53   0.000    -.3588964   -.2363292
       expsqr |   .0052345   .0007144     7.33   0.000     .0038319    .0066371
 provincedum2 |   .0391752   .0575187     0.68   0.496    -.0737471    .1520975
 provincedum3 |   .1041656   .0652592     1.60   0.111    -.0239531    .2322843
 provincedum4 |   .0333409    .055433     0.60   0.548    -.0754868    .1421686
 provincedum5 |   .0441657   .0442112     1.00   0.318     -.042631    .1309623
 provincedum6 |   .1171492    .046559     2.52   0.012     .0257434    .2085551
 provincedum7 |   .0423954   .0443853     0.96   0.340    -.0447431    .1295339
 provincedum8 |   .0757794   .0436867     1.73   0.083    -.0099875    .1615463
 provincedum9 |   .0147755   .0444622     0.33   0.740    -.0725139    .1020649
provincedum10 |   .0176767   .0454086     0.39   0.697    -.0714708    .1068241
provincedum11 |   .0184038    .045365     0.41   0.685    -.0706581    .1074658
provincedum12 |   .0246434   .0532083     0.46   0.643    -.0798165    .1291034
provincedum13 |  -.0098077   .0472208    -0.21   0.836     -.102513    .0828975
provincedum14 |     .03782   .0469929     0.80   0.421    -.0544378    .1300777
provincedum15 |   .0790979   .0493557     1.60   0.109    -.0177986    .1759943
            t |  -.0043158   .0009671    -4.46   0.000    -.0062144   -.0024172
            d |   .0249161   .0266869     0.93   0.351    -.0274763    .0773086
           td |  -.0016336   .0013265    -1.23   0.219    -.0042379    .0009707
        _cons |   4.067015   .3403504    11.95   0.000      3.39883      4.7352
-------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(19, 728)    =  29.50
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4350
                                                        Adj R-squared = 0.4203
                                                        Root MSE      = 0.2593

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1008506   .0452996    -2.23   0.026    -.1897841   -.0119172
       expsqr |  -.0002645   .0010368    -0.26   0.799    -.0022999     .001771
 provincedum2 |    .181243   .0834699     2.17   0.030     .0173725    .3451134
 provincedum3 |   .2129147   .0947028     2.25   0.025     .0269916    .3988378
 provincedum4 |   .0590258   .0804432     0.73   0.463    -.0989026    .2169542
 provincedum5 |   .1324231   .0641584     2.06   0.039     .0064656    .2583806
 provincedum6 |   .2000269   .0675654     2.96   0.003     .0673807    .3326731
 provincedum7 |   .1038737    .064411     1.61   0.107    -.0225798    .2303272
 provincedum8 |   .1905697   .0633972     3.01   0.003     .0661066    .3150328
 provincedum9 |   .1090272   .0645226     1.69   0.092    -.0176454    .2356997
provincedum10 |   .1239967    .065896     1.88   0.060    -.0053722    .2533656
provincedum11 |   .0520183   .0658328     0.79   0.430    -.0772264    .1812631
provincedum12 |   .0422345   .0772147     0.55   0.585    -.1093556    .1938245
provincedum13 |   .0236504   .0685258     0.35   0.730    -.1108815    .1581823
provincedum14 |   .0789807   .0681951     1.16   0.247    -.0549018    .2128632
provincedum15 |   .1800814   .0716239     2.51   0.012     .0394673    .3206955
            t |  -.0100773   .0014034    -7.18   0.000    -.0128325   -.0073221
            d |  -.0109709   .0387274    -0.28   0.777    -.0870017    .0650598
           td |    .000703    .001925     0.37   0.715    -.0030763    .0044823
        _cons |   2.501633   .4939092     5.06   0.000     1.531977     3.47129
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(19)   =      15.89
                                                  Prob > chi2     =     0.6646
                                                  R-squared       =          .
                                                  Root MSE        =     1.0327

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   3.995641    14.3877     0.28   0.781    -24.20373    32.19501
secgenhighedu |  -7.681006   19.73272    -0.39   0.697    -46.35643    30.99442
    secgenedu |    1.06869   1.620321     0.66   0.510     -2.10708    4.244461
          exp |  -.8052734   .8386935    -0.96   0.337    -2.449082    .8385357
       expsqr |   .0171712   .0180175     0.95   0.341    -.0181425    .0524849
 provincedum2 |  -.4471651   .5397725    -0.83   0.407      -1.5051    .6107695
 provincedum3 |  -.0870802   .3785912    -0.23   0.818    -.8291053    .6549448
 provincedum4 |  -.4128003   .4686373    -0.88   0.378    -1.331313     .505712
 provincedum5 |  -.1983398   .5958883    -0.33   0.739    -1.366259    .9695797
 provincedum6 |    .101816   .2855544     0.36   0.721    -.4578603    .6614923
 provincedum7 |  -.2374661   .4451142    -0.53   0.594    -1.109874    .6349417
 provincedum8 |   -.378153   .5065148    -0.75   0.455    -1.370904    .6145978
 provincedum9 |  -.1343464   .3772342    -0.36   0.722     -.873712    .6050191
provincedum10 |  -.2520813   .5191336    -0.49   0.627    -1.269564    .7654018
provincedum11 |  -.3166072   .6372613    -0.50   0.619    -1.565616    .9324021
provincedum12 |  -.5024299   .7902077    -0.64   0.525    -2.051209    1.046349
provincedum13 |  -.4978469   .7078609    -0.70   0.482    -1.885229    .8895349
provincedum14 |  -.3631721    .318008    -1.14   0.253    -.9864564    .2601121
provincedum15 |  -.5176473   .3119657    -1.66   0.097    -1.129089    .0937942
        _cons |   17.88851   9.756513     1.83   0.067    -1.233901    37.01093
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  1.53681  (p = 0.6738)
  Wu-Hausman F(3,725)             =  .497542  (p = 0.6841)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.799  Chi-sq(19) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu secgenhighedu secgenedu = t d td ) 
> if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male == 0 & ed
> ucat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(5, 437)     = 145.05
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6240
                                                        Adj R-squared = 0.6197
                                                        Root MSE      = 0.1370

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.5076082   .0322575   -15.74   0.000    -.5710073   -.4442092
      expsqr |   .0099271    .000745    13.32   0.000     .0084629    .0113914
           t |     -.0022   .0010666    -2.06   0.040    -.0042962   -.0001038
           d |   .0218116   .0262039     0.83   0.406    -.0296897     .073313
          td |  -.0030244   .0013262    -2.28   0.023     -.005631   -.0004177
       _cons |   6.439437   .3510654    18.34   0.000     5.749451    7.129424
------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(5, 437)     =  83.02
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4872
                                                        Adj R-squared = 0.4813
                                                        Root MSE      = 0.1304

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.4207974   .0307117   -13.70   0.000    -.4811583   -.3604364
      expsqr |   .0085621   .0007093    12.07   0.000      .007168    .0099561
           t |  -.0003855   .0010155    -0.38   0.704    -.0023813    .0016103
           d |   .0115707   .0249482     0.46   0.643    -.0374627    .0606041
          td |  -.0020143   .0012627    -1.60   0.111     -.004496    .0004674
       _cons |   5.143261   .3342424    15.39   0.000     4.486339    5.800183
------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(5, 437)     =  46.44
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.3470
                                                        Adj R-squared = 0.3395
                                                        Root MSE      = 0.2619

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1640382   .0616745    -2.66   0.008    -.2852537   -.0428226
      expsqr |   .0015058   .0014244     1.06   0.291    -.0012937    .0043054
           t |  -.0088535   .0020392    -4.34   0.000    -.0128614   -.0048456
           d |  -.0472661   .0501004    -0.94   0.346    -.1457339    .0512016
          td |   .0035878   .0025357     1.41   0.158     -.001396    .0085715
       _cons |   3.109852   .6712181     4.63   0.000     1.790635    4.429068
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(5)    =       0.18
                                                  Prob > chi2     =     0.9993
                                                  R-squared       =          .
                                                  Root MSE        =      4.385

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   21.18734   107.2359     0.20   0.843    -188.9911    231.3657
secgenhighedu |  -37.76739   196.5719    -0.19   0.848    -423.0413    347.5065
    secgenedu |  -2.838608   15.38734    -0.18   0.854    -32.99724    27.32003
          exp |  -5.847335   30.99509    -0.19   0.850     -66.5966    54.90193
       expsqr |   .1222933    .645894     0.19   0.850    -1.143636    1.388222
        _cons |   77.32381   369.8043     0.21   0.834    -647.4792    802.1268
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  2.84864  (p = 0.4156)
  Wu-Hausman F(3,434)             =  .936277  (p = 0.4230)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.028  Chi-sq(5) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu secgenhi
> ghedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 2
> 00, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(19, 423)    =  40.14
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6432
                                                        Adj R-squared = 0.6272
                                                        Root MSE      = 0.1356

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.5088524   .0331445   -15.35   0.000    -.5740008   -.4437039
       expsqr |   .0098519   .0007654    12.87   0.000     .0083475    .0113563
 provincedum2 |    .122429   .0573132     2.14   0.033     .0097749    .2350831
 provincedum3 |   .1281644   .0720728     1.78   0.076    -.0135009    .2698298
 provincedum4 |   .1274419   .0610746     2.09   0.038     .0073944    .2474894
 provincedum5 |   .1129493   .0486317     2.32   0.021     .0173593    .2085392
 provincedum6 |   .1705679   .0521313     3.27   0.001     .0680993    .2730365
 provincedum7 |   .1414325   .0506454     2.79   0.005     .0418845    .2409805
 provincedum8 |   .1613294   .0488611     3.30   0.001     .0652886    .2573702
 provincedum9 |   .0984903   .0499025     1.97   0.049     .0004025    .1965781
provincedum10 |   .1374573   .0495555     2.77   0.006     .0400517     .234863
provincedum11 |   .0871916   .0502784     1.73   0.084    -.0116349    .1860182
provincedum12 |   .0793812   .0575077     1.38   0.168    -.0336553    .1924177
provincedum13 |    .132191   .0522665     2.53   0.012     .0294567    .2349253
provincedum14 |   .1311155   .0512923     2.56   0.011      .030296     .231935
provincedum15 |   .1489197   .0571547     2.61   0.009      .036577    .2612623
            t |  -.0022264   .0010816    -2.06   0.040    -.0043524   -.0001004
            d |   .0138395   .0266915     0.52   0.604    -.0386249     .066304
           td |  -.0033969   .0013252    -2.56   0.011    -.0060017   -.0007921
        _cons |   6.391112    .359177    17.79   0.000     5.685118    7.097106
-------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(19, 423)    =  21.57
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4921
                                                        Adj R-squared = 0.4693
                                                        Root MSE      = 0.1319

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.4233541   .0322399   -13.13   0.000    -.4867244   -.3599837
       expsqr |   .0086011   .0007445    11.55   0.000     .0071378    .0100645
 provincedum2 |   .0089887   .0557489     0.16   0.872    -.1005906    .1185681
 provincedum3 |    .010917   .0701056     0.16   0.876    -.1268818    .1487158
 provincedum4 |   .0129653   .0594077     0.22   0.827    -.1038057    .1297363
 provincedum5 |  -.0020912   .0473044    -0.04   0.965    -.0950722    .0908897
 provincedum6 |   .0206017   .0507084     0.41   0.685    -.0790702    .1202736
 provincedum7 |   .0088881   .0492631     0.18   0.857    -.0879428    .1057191
 provincedum8 |   .0237944   .0475275     0.50   0.617    -.0696251    .1172139
 provincedum9 |    .000814   .0485405     0.02   0.987    -.0945967    .0962246
provincedum10 |   .0192232   .0482029     0.40   0.690    -.0755239    .1139703
provincedum11 |  -.0143635   .0489061    -0.29   0.769    -.1104927    .0817657
provincedum12 |  -.0222033   .0559382    -0.40   0.692    -.1321547     .087748
provincedum13 |   .0126978   .0508399     0.25   0.803    -.0872325    .1126281
provincedum14 |   .0013966   .0498924     0.03   0.978    -.0966712    .0994644
provincedum15 |  -.0082388   .0555948    -0.15   0.882    -.1175152    .1010377
            t |  -.0004649   .0010521    -0.44   0.659    -.0025328    .0016031
            d |   .0142029    .025963     0.55   0.585    -.0368296    .0652354
           td |  -.0020232    .001289    -1.57   0.117    -.0045569    .0005106
        _cons |   5.173369   .3493738    14.81   0.000     4.486644    5.860094
-------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(19, 423)    =  12.96
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.3680
                                                        Adj R-squared = 0.3396
                                                        Root MSE      = 0.2619

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1688056   .0640017    -2.64   0.009    -.2946065   -.0430046
       expsqr |   .0015043   .0014779     1.02   0.309    -.0014007    .0044092
 provincedum2 |   .1831613   .1106711     1.66   0.099    -.0343725    .4006951
 provincedum3 |   .2338816   .1391717     1.68   0.094    -.0396726    .5074358
 provincedum4 |    .060531   .1179344     0.51   0.608    -.1712794    .2923414
 provincedum5 |   .1199771   .0939073     1.28   0.202     -.064606    .3045602
 provincedum6 |   .1718582   .1006649     1.71   0.089    -.0260075     .369724
 provincedum7 |   .1684259   .0977957     1.72   0.086    -.0238002    .3606519
 provincedum8 |   .1814834   .0943503     1.92   0.055    -.0039704    .3669372
 provincedum9 |   .1651107   .0963612     1.71   0.087    -.0242957    .3545172
provincedum10 |   .1607859   .0956911     1.68   0.094    -.0273033    .3488752
provincedum11 |   .1124265   .0970869     1.16   0.248    -.0784065    .3032594
provincedum12 |   .0218716   .1110468     0.20   0.844    -.1964007    .2401438
provincedum13 |   .1170235   .1009259     1.16   0.247    -.0813553    .3154023
provincedum14 |   .0805956   .0990448     0.81   0.416    -.1140858    .2752769
provincedum15 |   .1938148   .1103651     1.76   0.080    -.0231176    .4107472
            t |  -.0091146   .0020885    -4.36   0.000    -.0132198   -.0050094
            d |  -.0444827   .0515409    -0.86   0.389     -.145791    .0568255
           td |   .0031642    .002559     1.24   0.217    -.0018657     .008194
        _cons |   3.084799   .6935667     4.45   0.000     1.721532    4.448065
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(19)   =       0.17
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =      8.657

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   -39.2246   292.9516    -0.13   0.893    -613.3991    534.9499
secgenhighedu |    74.0935   552.1993     0.13   0.893    -1008.197    1156.384
    secgenedu |   6.625676   49.75929     0.13   0.894    -90.90074    104.1521
          exp |   12.31722   93.68814     0.13   0.895    -171.3082    195.9426
       expsqr |  -.2561425   1.952327    -0.13   0.896    -4.082633    3.570348
 provincedum2 |   2.311023   21.80202     0.11   0.916    -40.42016    45.04221
 provincedum3 |   1.717095    19.9047     0.09   0.931     -37.2954    40.72959
 provincedum4 |   2.912591   27.08494     0.11   0.914    -50.17291    55.99809
 provincedum5 |   3.352389   27.94033     0.12   0.904    -51.40964    58.11442
 provincedum6 |   3.630076   29.82028     0.12   0.903     -54.8166    62.07675
 provincedum7 |   3.079471   27.92742     0.11   0.912    -51.65727    57.81621
 provincedum8 |   2.732535   24.85144     0.11   0.912    -45.97539    51.44046
 provincedum9 |   2.272225   20.05332     0.11   0.910    -37.03155      41.576
provincedum10 |   2.469156   21.37911     0.12   0.908    -39.43313    44.37144
provincedum11 |   3.181185   27.52828     0.12   0.908    -50.77326    57.13563
provincedum12 |   3.919871   33.97204     0.12   0.908     -62.6641    70.50384
provincedum13 |   3.021802   25.55782     0.12   0.906     -47.0706     53.1142
provincedum14 |   3.771328   33.17242     0.11   0.909    -61.24542    68.78808
provincedum15 |   4.422059   38.23305     0.12   0.908    -70.51334    79.35745
        _cons |    -142.52    1144.21    -0.12   0.901    -2385.131    2100.091
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  3.74368  (p = 0.2905)
  Wu-Hausman F(3,420)             =  1.19319  (p = 0.3120)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.019  Chi-sq(19) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning exp expsqr male (higheredu secgenhighedu = t d td ) if in
> range(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(6, 1184)    = 236.72
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5454
                                                        Adj R-squared = 0.5431
                                                        Root MSE      = 0.1673

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.4309329   .0231392   -18.62   0.000    -.4763313   -.3855345
      expsqr |   .0079913    .000531    15.05   0.000     .0069495    .0090331
        male |   .0120463   .0100555     1.20   0.231    -.0076822    .0317748
           t |  -.0038025    .000736    -5.17   0.000    -.0052465   -.0023585
           d |   .0193077   .0194556     0.99   0.321    -.0188636     .057479
          td |  -.0027628   .0009751    -2.83   0.005    -.0046759   -.0008498
       _cons |   5.717992   .2536832    22.54   0.000     5.220273    6.215711
------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(6, 1184)    = 136.71
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4093
                                                        Adj R-squared = 0.4063
                                                        Root MSE      = 0.1646

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |   -.342555   .0227597   -15.05   0.000    -.3872088   -.2979011
      expsqr |    .006476   .0005223    12.40   0.000     .0054513    .0075007
        male |   .0155839   .0098905     1.58   0.115    -.0038211    .0349888
           t |  -.0027044   .0007239    -3.74   0.000    -.0041248    -.001284
           d |   .0155959   .0191365     0.81   0.415    -.0219493    .0531412
          td |  -.0018019   .0009591    -1.88   0.061    -.0036836    .0000798
       _cons |   4.465755   .2495226    17.90   0.000       3.9762    4.955311
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(5)    =      51.01
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      1.147

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   -5.63955   29.92685    -0.19   0.851     -64.2951      53.016
secgenhighedu |   8.320484   43.72089     0.19   0.849    -77.37089    94.01185
          exp |   .2034396   2.131948     0.10   0.924    -3.975101    4.381981
       expsqr |  -.0042493   .0451388    -0.09   0.925    -.0927198    .0842212
         male |   .4131846   .3267421     1.26   0.206    -.2272182    1.053587
        _cons |   5.433943   24.78506     0.22   0.826    -43.14388    54.01176
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .696951  (p = 0.7058)
  Wu-Hausman F(2,1183)            =  .346338  (p = 0.7073)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .010189  (p = 0.9196)
  Basmann chi2(1)        =  .010129  (p = 0.9198)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.108  Chi-sq(6) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr male provincedum2-provincedum15 (higheredu sec
> genhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(20, 1170)   =  75.15
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5623
                                                        Adj R-squared = 0.5548
                                                        Root MSE      = 0.1651

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.4257225   .0233234   -18.25   0.000    -.4714828   -.3799622
       expsqr |   .0077718   .0005355    14.51   0.000     .0067211    .0088224
         male |   .0115297   .0099536     1.16   0.247    -.0079991    .0310586
 provincedum2 |   .0901288   .0417613     2.16   0.031     .0081933    .1720643
 provincedum3 |   .1304047   .0495366     2.63   0.009     .0332142    .2275952
 provincedum4 |   .0875637   .0420578     2.08   0.038     .0050467    .1700808
 provincedum5 |   .1003797   .0333985     3.01   0.003     .0348521    .1659073
 provincedum6 |   .1569889   .0354638     4.43   0.000     .0874093    .2265686
 provincedum7 |   .1038036   .0340476     3.05   0.002     .0370025    .1706048
 provincedum8 |   .1383895    .033209     4.17   0.000     .0732337    .2035453
 provincedum9 |    .056969   .0339574     1.68   0.094    -.0096551    .1235932
provincedum10 |   .0814237   .0342071     2.38   0.017     .0143096    .1485378
provincedum11 |   .0702914   .0343975     2.04   0.041     .0028038     .137779
provincedum12 |    .081362   .0400082     2.03   0.042     .0028662    .1598578
provincedum13 |    .070155   .0357965     1.96   0.050    -.0000776    .1403875
provincedum14 |   .0871634   .0353291     2.47   0.014      .017848    .1564788
provincedum15 |   .1254619   .0380029     3.30   0.001     .0509004    .2000233
            t |  -.0042454   .0007356    -5.77   0.000    -.0056887   -.0028021
            d |   .0227391   .0193359     1.18   0.240    -.0151979    .0606761
           td |   -.002775   .0009666    -2.87   0.004    -.0046715   -.0008785
        _cons |   5.619367    .253772    22.14   0.000     5.121468    6.117266
-------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(20, 1170)   =  42.54
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4210
                                                        Adj R-squared = 0.4111
                                                        Root MSE      = 0.1639

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   -.335946   .0231461   -14.51   0.000    -.3813585   -.2905335
       expsqr |   .0062636   .0005314    11.79   0.000      .005221    .0073062
         male |    .014663   .0098779     1.48   0.138    -.0047173    .0340434
 provincedum2 |   .0311791   .0414439     0.75   0.452    -.0501336    .1124918
 provincedum3 |   .0747777   .0491601     1.52   0.129     -.021674    .1712295
 provincedum4 |   .0290288   .0417381     0.70   0.487     -.052861    .1109186
 provincedum5 |   .0327358   .0331446     0.99   0.324    -.0322937    .0977653
 provincedum6 |   .0889851   .0351942     2.53   0.012     .0199343    .1580359
 provincedum7 |   .0391324   .0337888     1.16   0.247     -.027161    .1054258
 provincedum8 |   .0618671   .0329566     1.88   0.061    -.0027935    .1265276
 provincedum9 |   .0136814   .0336992     0.41   0.685    -.0524363    .0797991
provincedum10 |   .0222637   .0339471     0.66   0.512    -.0443403    .0888677
provincedum11 |   .0106131    .034136     0.31   0.756    -.0563616    .0775877
provincedum12 |   .0131492   .0397041     0.33   0.741    -.0647499    .0910484
provincedum13 |   .0069112   .0355244     0.19   0.846    -.0627875    .0766099
provincedum14 |    .030034   .0350605     0.86   0.392    -.0387546    .0988225
provincedum15 |   .0558553    .037714     1.48   0.139    -.0181393      .12985
            t |  -.0030964     .00073    -4.24   0.000    -.0045287   -.0016641
            d |   .0203345   .0191889     1.06   0.290    -.0173141    .0579831
           td |  -.0017074   .0009593    -1.78   0.075    -.0035895    .0001746
        _cons |   4.390766   .2518431    17.43   0.000     3.896651     4.88488
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(19)   =     102.50
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .92149

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -4.156874   11.83338    -0.35   0.725    -27.34988    19.03613
secgenhighedu |   5.904113   17.37462     0.34   0.734    -28.14952    39.95774
          exp |   .0268527   .8566527     0.03   0.975    -1.652156    1.705861
       expsqr |  -.0004781    .018115    -0.03   0.979    -.0359828    .0350267
         male |   .4388829   .1298336     3.38   0.001     .1844136    .6933521
 provincedum2 |  -.1751682   .5639579    -0.31   0.756    -1.280505    .9301689
 provincedum3 |  -.2745277   .3623411    -0.76   0.449    -.9847032    .4356478
 provincedum4 |   -.265753    .570433    -0.47   0.641    -1.383781    .8522751
 provincedum5 |   .0826521   .6312466     0.13   0.896    -1.154568    1.319873
 provincedum6 |   .0200158   .3613344     0.06   0.956    -.6881866    .7282181
 provincedum7 |  -.1032157   .5666042    -0.18   0.855    -1.213739    1.007308
 provincedum8 |     -.1426   .5823971    -0.24   0.807    -1.284077    .9988772
 provincedum9 |   .0330131   .4620027     0.07   0.943    -.8724956    .9385218
provincedum10 |   .0510497   .5944952     0.09   0.932    -1.114139    1.216239
provincedum11 |  -.0383666   .6590537    -0.06   0.954    -1.330088    1.253355
provincedum12 |  -.1494042   .7503503    -0.20   0.842    -1.620064    1.321255
provincedum13 |  -.0443542    .720118    -0.06   0.951     -1.45576    1.367051
provincedum14 |  -.2446958    .532888    -0.46   0.646    -1.289137    .7997454
provincedum15 |  -.3681407   .5418167    -0.68   0.497    -1.430082    .6938005
        _cons |   7.551404   10.48489     0.72   0.471     -12.9986     28.1014
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =   .27456  (p = 0.8717)
  Wu-Hausman F(2,1169)            =  .134775  (p = 0.8739)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =   .03919  (p = 0.8431)
  Basmann chi2(1)        =    .0385  (p = 0.8444)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   2.706  Chi-sq(20) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu secgenhighedu = t d td ) if inrange
> (t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male == 1 & educat != .,
>  first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(5, 742)     = 158.99
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5172
                                                        Adj R-squared = 0.5140
                                                        Root MSE      = 0.1821

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.3931736   .0312059   -12.60   0.000     -.454436   -.3319112
      expsqr |   .0070506   .0007137     9.88   0.000     .0056495    .0084517
           t |  -.0044669    .000972    -4.60   0.000     -.006375   -.0025588
           d |   .0192732   .0268812     0.72   0.474    -.0334991    .0720456
          td |  -.0028646   .0013379    -2.14   0.033    -.0054912   -.0002381
       _cons |   5.368157    .343301    15.64   0.000       4.6942    6.042114
------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(5, 742)     =  96.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.3938
                                                        Adj R-squared = 0.3898
                                                        Root MSE      = 0.1800

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.3058858   .0308418    -9.92   0.000    -.3664335   -.2453382
      expsqr |   .0055064   .0007054     7.81   0.000     .0041217    .0068911
           t |  -.0036517   .0009606    -3.80   0.000    -.0055375   -.0017658
           d |   .0177963   .0265676     0.67   0.503    -.0343603    .0699529
          td |  -.0019886   .0013223    -1.50   0.133    -.0045845    .0006074
       _cons |   4.160273   .3392953    12.26   0.000      3.49418    4.826367
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(4)    =       4.28
                                                  Prob > chi2     =     0.3698
                                                  R-squared       =          .
                                                  Root MSE        =     .73906

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   2.488023   14.70118     0.17   0.866    -26.32577    31.30181
secgenhighedu |  -3.424426   18.98323    -0.18   0.857    -40.63087    33.78202
          exp |  -.2774313   .2068256    -1.34   0.180    -.6828021    .1279395
       expsqr |   .0057762   .0044582     1.30   0.195    -.0029617    .0145142
        _cons |   11.59773   2.413842     4.80   0.000     6.866684    16.32877
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .048843  (p = 0.9759)
  Wu-Hausman F(2,741)             =  .024194  (p = 0.9761)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .383436  (p = 0.5358)
  Basmann chi2(1)        =  .380555  (p = 0.5373)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   2.156  Chi-sq(5) P-value = 0.8272

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu secgenhi
> ghedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667)
>  & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(19, 728)    =  44.41
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5368
                                                        Adj R-squared = 0.5248
                                                        Root MSE      = 0.1801

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.3845977   .0314564   -12.23   0.000    -.4463537   -.3228417
       expsqr |   .0067522   .0007199     9.38   0.000     .0053387    .0081656
 provincedum2 |   .0752475   .0579621     1.30   0.195    -.0385453    .1890403
 provincedum3 |   .1330851   .0657623     2.02   0.043     .0039787    .2621914
 provincedum4 |   .0675023   .0558604     1.21   0.227    -.0421643    .1771689
 provincedum5 |   .0933483    .044552     2.10   0.036     .0058825    .1808141
 provincedum6 |   .1482386   .0469179     3.16   0.002     .0561281     .240349
 provincedum7 |   .0799277   .0447275     1.79   0.074    -.0078825    .1677379
 provincedum8 |   .1265555   .0440234     2.87   0.004     .0401274    .2129835
 provincedum9 |   .0345754   .0448049     0.77   0.441    -.0533869    .1225377
provincedum10 |   .0496094   .0457587     1.08   0.279    -.0402253     .139444
provincedum11 |   .0643305   .0457148     1.41   0.160     -.025418     .154079
provincedum12 |   .0832475   .0536184     1.55   0.121    -.0220177    .1885127
provincedum13 |   .0320207   .0475848     0.67   0.501    -.0613992    .1254406
provincedum14 |   .0602805   .0473552     1.27   0.203    -.0326884    .1532495
provincedum15 |    .110537   .0497362     2.22   0.027     .0128936    .2081804
            t |  -.0051754   .0009745    -5.31   0.000    -.0070886   -.0032622
            d |   .0257938   .0268926     0.96   0.338    -.0270025    .0785901
           td |  -.0025254   .0013368    -1.89   0.059    -.0051498     .000099
        _cons |   5.246012   .3429741    15.30   0.000     4.572676    5.919348
-------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(19, 728)    =  27.04
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4137
                                                        Adj R-squared = 0.3984
                                                        Root MSE      = 0.1787

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.2976128   .0312157    -9.53   0.000    -.3588964   -.2363292
       expsqr |   .0052345   .0007144     7.33   0.000     .0038319    .0066371
 provincedum2 |   .0391752   .0575187     0.68   0.496    -.0737471    .1520975
 provincedum3 |   .1041656   .0652592     1.60   0.111    -.0239531    .2322843
 provincedum4 |   .0333409    .055433     0.60   0.548    -.0754868    .1421686
 provincedum5 |   .0441657   .0442112     1.00   0.318     -.042631    .1309623
 provincedum6 |   .1171492    .046559     2.52   0.012     .0257434    .2085551
 provincedum7 |   .0423954   .0443853     0.96   0.340    -.0447431    .1295339
 provincedum8 |   .0757794   .0436867     1.73   0.083    -.0099875    .1615463
 provincedum9 |   .0147755   .0444622     0.33   0.740    -.0725139    .1020649
provincedum10 |   .0176767   .0454086     0.39   0.697    -.0714708    .1068241
provincedum11 |   .0184038    .045365     0.41   0.685    -.0706581    .1074658
provincedum12 |   .0246434   .0532083     0.46   0.643    -.0798165    .1291034
provincedum13 |  -.0098077   .0472208    -0.21   0.836     -.102513    .0828975
provincedum14 |     .03782   .0469929     0.80   0.421    -.0544378    .1300777
provincedum15 |   .0790979   .0493557     1.60   0.109    -.0177986    .1759943
            t |  -.0043158   .0009671    -4.46   0.000    -.0062144   -.0024172
            d |   .0249161   .0266869     0.93   0.351    -.0274763    .0773086
           td |  -.0016336   .0013265    -1.23   0.219    -.0042379    .0009707
        _cons |   4.067015   .3403504    11.95   0.000      3.39883      4.7352
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(18)   =      38.97
                                                  Prob > chi2     =     0.0029
                                                  R-squared       =          .
                                                  Root MSE        =     .65034

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   1.204365   8.660215     0.14   0.889    -15.76934    18.17808
secgenhighedu |  -1.878625   11.12385    -0.17   0.866    -23.68098    19.92373
          exp |  -.2820102   .1713062    -1.65   0.100    -.6177642    .0537438
       expsqr |    .005901   .0035983     1.64   0.101    -.0011516    .0129536
 provincedum2 |  -.2736368    .296821    -0.92   0.357    -.8553953    .3081218
 provincedum3 |  -.0992628   .2381447    -0.42   0.677    -.5660179    .3674924
 provincedum4 |  -.3597615   .2907602    -1.24   0.216     -.929641     .210118
 provincedum5 |  -.0544189   .3492108    -0.16   0.876    -.7388596    .6300217
 provincedum6 |   .0439277   .1711307     0.26   0.797    -.2914822    .3793377
 provincedum7 |  -.1515096   .2680388    -0.57   0.572     -.676856    .3738367
 provincedum8 |  -.2588777   .2979682    -0.87   0.385    -.8428846    .3251291
 provincedum9 |  -.0095963   .2055537    -0.05   0.963    -.4124741    .3932815
provincedum10 |  -.0799357   .2826137    -0.28   0.777    -.6338483    .4739769
provincedum11 |  -.1979337   .3850041    -0.51   0.607    -.9525279    .5566606
provincedum12 |  -.3656209   .4802048    -0.76   0.446    -1.306805    .5755632
provincedum13 |  -.3272907   .4149839    -0.79   0.430    -1.140644    .4860629
provincedum14 |  -.3221806   .1964127    -1.64   0.101    -.7071424    .0627812
provincedum15 |  -.4754025   .1922839    -2.47   0.013     -.852272   -.0985331
        _cons |   11.81943   2.042322     5.79   0.000     7.816549     15.8223
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .094702  (p = 0.9538)
  Wu-Hausman F(2,727)             =  .046028  (p = 0.9550)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =   1.0968  (p = 0.2950)
  Basmann chi2(1)        =  1.06904  (p = 0.3012)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  14.247  Chi-sq(19) P-value = 0.7691

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu secgenhighedu = t d td ) if inrange
> (t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male == 0 & educat != .,
>  first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(5, 437)     = 145.05
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6240
                                                        Adj R-squared = 0.6197
                                                        Root MSE      = 0.1370

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.5076082   .0322575   -15.74   0.000    -.5710073   -.4442092
      expsqr |   .0099271    .000745    13.32   0.000     .0084629    .0113914
           t |     -.0022   .0010666    -2.06   0.040    -.0042962   -.0001038
           d |   .0218116   .0262039     0.83   0.406    -.0296897     .073313
          td |  -.0030244   .0013262    -2.28   0.023     -.005631   -.0004177
       _cons |   6.439437   .3510654    18.34   0.000     5.749451    7.129424
------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(5, 437)     =  83.02
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4872
                                                        Adj R-squared = 0.4813
                                                        Root MSE      = 0.1304

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.4207974   .0307117   -13.70   0.000    -.4811583   -.3604364
      expsqr |   .0085621   .0007093    12.07   0.000      .007168    .0099561
           t |  -.0003855   .0010155    -0.38   0.704    -.0023813    .0016103
           d |   .0115707   .0249482     0.46   0.643    -.0374627    .0606041
          td |  -.0020143   .0012627    -1.60   0.111     -.004496    .0004674
       _cons |   5.143261   .3342424    15.39   0.000     4.486339    5.800183
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(4)    =       5.88
                                                  Prob > chi2     =     0.2084
                                                  R-squared       =          .
                                                  Root MSE        =     .68271

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   1.753682   3.121678     0.56   0.574    -4.364695    7.872059
secgenhighedu |  -2.644649     7.6142    -0.35   0.728    -17.56821    12.27891
          exp |  -.4666645    1.63269    -0.29   0.775    -3.666678    2.733349
       expsqr |   .0102383   .0341884     0.30   0.765    -.0567696    .0772463
        _cons |   13.06995   19.34595     0.68   0.499    -24.84743    50.98732
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.47908  (p = 0.4773)
  Wu-Hausman F(2,436)             =  .730294  (p = 0.4824)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  1.40396  (p = 0.2361)
  Basmann chi2(1)        =  1.38934  (p = 0.2385)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   2.408  Chi-sq(5) P-value = 0.7903

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu secgenhi
> ghedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667)
>  & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(19, 423)    =  40.14
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6432
                                                        Adj R-squared = 0.6272
                                                        Root MSE      = 0.1356

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.5088524   .0331445   -15.35   0.000    -.5740008   -.4437039
       expsqr |   .0098519   .0007654    12.87   0.000     .0083475    .0113563
 provincedum2 |    .122429   .0573132     2.14   0.033     .0097749    .2350831
 provincedum3 |   .1281644   .0720728     1.78   0.076    -.0135009    .2698298
 provincedum4 |   .1274419   .0610746     2.09   0.038     .0073944    .2474894
 provincedum5 |   .1129493   .0486317     2.32   0.021     .0173593    .2085392
 provincedum6 |   .1705679   .0521313     3.27   0.001     .0680993    .2730365
 provincedum7 |   .1414325   .0506454     2.79   0.005     .0418845    .2409805
 provincedum8 |   .1613294   .0488611     3.30   0.001     .0652886    .2573702
 provincedum9 |   .0984903   .0499025     1.97   0.049     .0004025    .1965781
provincedum10 |   .1374573   .0495555     2.77   0.006     .0400517     .234863
provincedum11 |   .0871916   .0502784     1.73   0.084    -.0116349    .1860182
provincedum12 |   .0793812   .0575077     1.38   0.168    -.0336553    .1924177
provincedum13 |    .132191   .0522665     2.53   0.012     .0294567    .2349253
provincedum14 |   .1311155   .0512923     2.56   0.011      .030296     .231935
provincedum15 |   .1489197   .0571547     2.61   0.009      .036577    .2612623
            t |  -.0022264   .0010816    -2.06   0.040    -.0043524   -.0001004
            d |   .0138395   .0266915     0.52   0.604    -.0386249     .066304
           td |  -.0033969   .0013252    -2.56   0.011    -.0060017   -.0007921
        _cons |   6.391112    .359177    17.79   0.000     5.685118    7.097106
-------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(19, 423)    =  21.57
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4921
                                                        Adj R-squared = 0.4693
                                                        Root MSE      = 0.1319

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.4233541   .0322399   -13.13   0.000    -.4867244   -.3599837
       expsqr |   .0086011   .0007445    11.55   0.000     .0071378    .0100645
 provincedum2 |   .0089887   .0557489     0.16   0.872    -.1005906    .1185681
 provincedum3 |    .010917   .0701056     0.16   0.876    -.1268818    .1487158
 provincedum4 |   .0129653   .0594077     0.22   0.827    -.1038057    .1297363
 provincedum5 |  -.0020912   .0473044    -0.04   0.965    -.0950722    .0908897
 provincedum6 |   .0206017   .0507084     0.41   0.685    -.0790702    .1202736
 provincedum7 |   .0088881   .0492631     0.18   0.857    -.0879428    .1057191
 provincedum8 |   .0237944   .0475275     0.50   0.617    -.0696251    .1172139
 provincedum9 |    .000814   .0485405     0.02   0.987    -.0945967    .0962246
provincedum10 |   .0192232   .0482029     0.40   0.690    -.0755239    .1139703
provincedum11 |  -.0143635   .0489061    -0.29   0.769    -.1104927    .0817657
provincedum12 |  -.0222033   .0559382    -0.40   0.692    -.1321547     .087748
provincedum13 |   .0126978   .0508399     0.25   0.803    -.0872325    .1126281
provincedum14 |   .0013966   .0498924     0.03   0.978    -.0966712    .0994644
provincedum15 |  -.0082388   .0555948    -0.15   0.882    -.1175152    .1010377
            t |  -.0004649   .0010521    -0.44   0.659    -.0025328    .0016031
            d |   .0142029    .025963     0.55   0.585    -.0368296    .0652354
           td |  -.0020232    .001289    -1.57   0.117    -.0045569    .0005106
        _cons |   5.173369   .3493738    14.81   0.000     4.486644    5.860094
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(18)   =      29.34
                                                  Prob > chi2     =     0.0444
                                                  R-squared       =          .
                                                  Root MSE        =     .62852

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -.4684459   2.412208    -0.19   0.846    -5.196286    4.259394
secgenhighedu |   1.494229   6.351419     0.24   0.814    -10.95432    13.94278
          exp |   .1398536   1.476949     0.09   0.925    -2.754914    3.034621
       expsqr |  -.0024426   .0309221    -0.08   0.937    -.0630489    .0581636
 provincedum2 |  -.5222553   .3449189    -1.51   0.130    -1.198284    .1537733
 provincedum3 |  -.8280722   .4031729    -2.05   0.040    -1.618277   -.0378679
 provincedum4 |  -.6366056   .3490985    -1.82   0.068    -1.320826     .047615
 provincedum5 |  -.3139224    .344589    -0.91   0.362    -.9893044    .3614597
 provincedum6 |  -.2875906   .3526888    -0.82   0.415    -.9788478    .4036667
 provincedum7 |  -.5839142   .3483077    -1.68   0.094    -1.266585    .0987565
 provincedum8 |  -.5272245   .3103592    -1.70   0.089    -1.135517    .0810683
 provincedum9 |  -.3354354   .3132351    -1.07   0.284    -.9493648     .278494
provincedum10 |   -.322187   .3046848    -1.06   0.290    -.9193583    .2749842
provincedum11 |  -.4225626   .3653646    -1.16   0.247    -1.138664    .2935388
provincedum12 |  -.5411057    .408765    -1.32   0.186    -1.342271     .260059
provincedum13 |  -.3304795   .3195967    -1.03   0.301    -.9568775    .2959186
provincedum14 |  -.5938262   .3681311    -1.61   0.107     -1.31535    .1276975
provincedum15 |  -.5971966   .4640678    -1.29   0.198    -1.506753    .3123597
        _cons |   6.324847   17.73368     0.36   0.721    -28.43253    41.08222
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .068878  (p = 0.9661)
  Wu-Hausman F(2,422)             =  .032812  (p = 0.9677)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  3.36363  (p = 0.0667)
  Basmann chi2(1)        =  3.23635  (p = 0.0720)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  12.140  Chi-sq(19) P-value = 0.8796

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning exp expsqr male (higheredu = t d td ) if inrange(t, -`mon
> ths', `months'-1) & inrange(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(6, 1184)    = 236.72
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5454
                                                        Adj R-squared = 0.5431
                                                        Root MSE      = 0.1673

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.4309329   .0231392   -18.62   0.000    -.4763313   -.3855345
      expsqr |   .0079913    .000531    15.05   0.000     .0069495    .0090331
        male |   .0120463   .0100555     1.20   0.231    -.0076822    .0317748
           t |  -.0038025    .000736    -5.17   0.000    -.0052465   -.0023585
           d |   .0193077   .0194556     0.99   0.321    -.0188636     .057479
          td |  -.0027628   .0009751    -2.83   0.005    -.0046759   -.0008498
       _cons |   5.717992   .2536832    22.54   0.000     5.220273    6.215711
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(4)    =     168.08
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1226
                                                  Root MSE        =     .63165

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |   .0551077   .2574044     0.21   0.830    -.4493956     .559611
         exp |  -.1987943     .15378    -1.29   0.196    -.5001975    .1026089
      expsqr |   .0042695   .0032004     1.33   0.182    -.0020032    .0105423
        male |   .4739466   .0382353    12.40   0.000     .3990068    .5488865
       _cons |   10.10764   1.841569     5.49   0.000      6.49823    13.71705
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .591018  (p = 0.4420)
  Wu-Hausman F(1,1185)            =  .588332  (p = 0.4432)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .153012  (p = 0.9263)
  Basmann chi2(2)        =  .152133  (p = 0.9268)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   4.384  Chi-sq(6) P-value = 0.6248

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr male provincedum2-provincedum15 (higheredu  = 
> t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & educa
> t != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(20, 1170)   =  75.15
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5623
                                                        Adj R-squared = 0.5548
                                                        Root MSE      = 0.1651

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.4257225   .0233234   -18.25   0.000    -.4714828   -.3799622
       expsqr |   .0077718   .0005355    14.51   0.000     .0067211    .0088224
         male |   .0115297   .0099536     1.16   0.247    -.0079991    .0310586
 provincedum2 |   .0901288   .0417613     2.16   0.031     .0081933    .1720643
 provincedum3 |   .1304047   .0495366     2.63   0.009     .0332142    .2275952
 provincedum4 |   .0875637   .0420578     2.08   0.038     .0050467    .1700808
 provincedum5 |   .1003797   .0333985     3.01   0.003     .0348521    .1659073
 provincedum6 |   .1569889   .0354638     4.43   0.000     .0874093    .2265686
 provincedum7 |   .1038036   .0340476     3.05   0.002     .0370025    .1706048
 provincedum8 |   .1383895    .033209     4.17   0.000     .0732337    .2035453
 provincedum9 |    .056969   .0339574     1.68   0.094    -.0096551    .1235932
provincedum10 |   .0814237   .0342071     2.38   0.017     .0143096    .1485378
provincedum11 |   .0702914   .0343975     2.04   0.041     .0028038     .137779
provincedum12 |    .081362   .0400082     2.03   0.042     .0028662    .1598578
provincedum13 |    .070155   .0357965     1.96   0.050    -.0000776    .1403875
provincedum14 |   .0871634   .0353291     2.47   0.014      .017848    .1564788
provincedum15 |   .1254619   .0380029     3.30   0.001     .0509004    .2000233
            t |  -.0042454   .0007356    -5.77   0.000    -.0056887   -.0028021
            d |   .0227391   .0193359     1.18   0.240    -.0151979    .0606761
           td |   -.002775   .0009666    -2.87   0.004    -.0046715   -.0008785
        _cons |   5.619367    .253772    22.14   0.000     5.121468    6.117266
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(18)   =     228.01
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1614
                                                  Root MSE        =      .6175

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -.1376373   .2433578    -0.57   0.572    -.6146098    .3393352
          exp |  -.2544519   .1476706    -1.72   0.085    -.5438809    .0349771
       expsqr |   .0054769   .0030745     1.78   0.075     -.000549    .0115029
         male |   .4787012   .0374673    12.78   0.000     .4052666    .5521358
 provincedum2 |  -.3498821    .155285    -2.25   0.024    -.6542352   -.0455291
 provincedum3 |  -.3539398   .1855571    -1.91   0.056    -.7176251    .0097455
 provincedum4 |   -.442565   .1566642    -2.82   0.005    -.7496212   -.1355088
 provincedum5 |   -.122389   .1242617    -0.98   0.325    -.3659374    .1211594
 provincedum6 |  -.0826217   .1328993    -0.62   0.534    -.3430996    .1778562
 provincedum7 |  -.2849207   .1255675    -2.27   0.023    -.5310285   -.0388129
 provincedum8 |  -.3302821   .1238136    -2.67   0.008    -.5729524   -.0876118
 provincedum9 |  -.1104001   .1259578    -0.88   0.381    -.3572729    .1364727
provincedum10 |  -.1400853   .1289835    -1.09   0.277    -.3928884    .1127177
provincedum11 |  -.2527902   .1274666    -1.98   0.047    -.5026202   -.0029602
provincedum12 |  -.3929525   .1488583    -2.64   0.008    -.6847093   -.1011956
provincedum13 |   -.279619   .1327402    -2.11   0.035    -.5397851   -.0194529
provincedum14 |  -.4130333   .1315942    -3.14   0.002    -.6709531   -.1551134
provincedum15 |  -.5377748   .1411446    -3.81   0.000    -.8144131   -.2611365
        _cons |   11.00142   1.754521     6.27   0.000     7.562623    14.44022
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .002182  (p = 0.9627)
  Wu-Hausman F(1,1171)            =  .002145  (p = 0.9631)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .344431  (p = 0.8418)
  Basmann chi2(2)        =  .338455  (p = 0.8443)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  17.726  Chi-sq(20) P-value = 0.6055

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu  = t d td ) if inrange(t, -`months'
> , `months'-1) & inrange(monthlyearning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(5, 742)     = 158.99
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5172
                                                        Adj R-squared = 0.5140
                                                        Root MSE      = 0.1821

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.3931736   .0312059   -12.60   0.000     -.454436   -.3319112
      expsqr |   .0070506   .0007137     9.88   0.000     .0056495    .0084517
           t |  -.0044669    .000972    -4.60   0.000     -.006375   -.0025588
           d |   .0192732   .0268812     0.72   0.474    -.0334991    .0720456
          td |  -.0028646   .0013379    -2.14   0.033    -.0054912   -.0002381
       _cons |   5.368157    .343301    15.64   0.000       4.6942    6.042114
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(3)    =       5.75
                                                  Prob > chi2     =     0.1246
                                                  R-squared       =     0.0104
                                                  Root MSE        =     .63519

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |  -.1633088   .2790251    -0.59   0.558    -.7101879    .3835704
         exp |  -.2659422   .1691217    -1.57   0.116    -.5974147    .0655304
      expsqr |   .0054621   .0035273     1.55   0.121    -.0014512    .0123754
       _cons |   11.50521   2.027252     5.68   0.000     7.531871    15.47855
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .006979  (p = 0.9334)
  Wu-Hausman F(1,743)             =  .006932  (p = 0.9337)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .563133  (p = 0.7546)
  Basmann chi2(2)        =  .559037  (p = 0.7561)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   4.316  Chi-sq(5) P-value = 0.5048

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu  = t d t
> d ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male == 1 
> & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(19, 728)    =  44.41
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5368
                                                        Adj R-squared = 0.5248
                                                        Root MSE      = 0.1801

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.3845977   .0314564   -12.23   0.000    -.4463537   -.3228417
       expsqr |   .0067522   .0007199     9.38   0.000     .0053387    .0081656
 provincedum2 |   .0752475   .0579621     1.30   0.195    -.0385453    .1890403
 provincedum3 |   .1330851   .0657623     2.02   0.043     .0039787    .2621914
 provincedum4 |   .0675023   .0558604     1.21   0.227    -.0421643    .1771689
 provincedum5 |   .0933483    .044552     2.10   0.036     .0058825    .1808141
 provincedum6 |   .1482386   .0469179     3.16   0.002     .0561281     .240349
 provincedum7 |   .0799277   .0447275     1.79   0.074    -.0078825    .1677379
 provincedum8 |   .1265555   .0440234     2.87   0.004     .0401274    .2129835
 provincedum9 |   .0345754   .0448049     0.77   0.441    -.0533869    .1225377
provincedum10 |   .0496094   .0457587     1.08   0.279    -.0402253     .139444
provincedum11 |   .0643305   .0457148     1.41   0.160     -.025418     .154079
provincedum12 |   .0832475   .0536184     1.55   0.121    -.0220177    .1885127
provincedum13 |   .0320207   .0475848     0.67   0.501    -.0613992    .1254406
provincedum14 |   .0602805   .0473552     1.27   0.203    -.0326884    .1532495
provincedum15 |    .110537   .0497362     2.22   0.027     .0128936    .2081804
            t |  -.0051754   .0009745    -5.31   0.000    -.0070886   -.0032622
            d |   .0257938   .0268926     0.96   0.338    -.0270025    .0785901
           td |  -.0025254   .0013368    -1.89   0.059    -.0051498     .000099
        _cons |   5.246012   .3429741    15.30   0.000     4.572676    5.919348
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(17)   =      42.78
                                                  Prob > chi2     =     0.0005
                                                  R-squared       =     0.0559
                                                  Root MSE        =     .62043

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -.2574468   .2640226    -0.98   0.330    -.7749216     .260028
          exp |  -.2801078   .1630721    -1.72   0.086    -.5997233    .0395078
       expsqr |   .0058208   .0034027     1.71   0.087    -.0008485      .01249
 provincedum2 |  -.2380181   .1992478    -1.19   0.232    -.6285365    .1525003
 provincedum3 |  -.0995334   .2271846    -0.44   0.661     -.544807    .3457402
 provincedum4 |  -.3243569   .1922072    -1.69   0.092    -.7010761    .0523624
 provincedum5 |  -.0020737    .153469    -0.01   0.989    -.3028674      .29872
 provincedum6 |   .0408011   .1623002     0.25   0.802    -.2773014    .3589036
 provincedum7 |  -.1152393    .152997    -0.75   0.451     -.415108    .1846294
 provincedum8 |  -.2163133   .1516319    -1.43   0.154    -.5135064    .0808798
 provincedum9 |   .0119501   .1537538     0.08   0.938    -.2894017     .313302
provincedum10 |  -.0413212    .158464    -0.26   0.794    -.3519049    .2692625
provincedum11 |   -.139146   .1569198    -0.89   0.375    -.4467031    .1684112
provincedum12 |  -.2914039    .184672    -1.58   0.115    -.6533543    .0705465
provincedum13 |   -.263461   .1634735    -1.61   0.107    -.5838632    .0569412
provincedum14 |  -.3057459   .1627618    -1.88   0.060    -.6247532    .0132614
provincedum15 |  -.4635041   .1706812    -2.72   0.007    -.7980331    -.128975
        _cons |   11.78595   1.939173     6.08   0.000     7.985241    15.58666
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =   .07592  (p = 0.7829)
  Wu-Hausman F(1,729)             =  .073999  (p = 0.7857)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  1.23646  (p = 0.5389)
  Basmann chi2(2)        =  1.20539  (p = 0.5473)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  15.224  Chi-sq(19) P-value = 0.7083

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu  = t d td ) if inrange(t, -`months'
> , `months'-1) & inrange(monthlyearning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(5, 437)     = 145.05
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6240
                                                        Adj R-squared = 0.6197
                                                        Root MSE      = 0.1370

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.5076082   .0322575   -15.74   0.000    -.5710073   -.4442092
      expsqr |   .0099271    .000745    13.32   0.000     .0084629    .0113914
           t |     -.0022   .0010666    -2.06   0.040    -.0042962   -.0001038
           d |   .0218116   .0262039     0.83   0.406    -.0296897     .073313
          td |  -.0030244   .0013262    -2.28   0.023     -.005631   -.0004177
       _cons |   6.439437   .3510654    18.34   0.000     5.749451    7.129424
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(3)    =       6.78
                                                  Prob > chi2     =     0.0793
                                                  R-squared       =          .
                                                  Root MSE        =     .62919

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |   .6943328   .6130944     1.13   0.257    -.5073102    1.895976
         exp |   .0836034   .3637095     0.23   0.818    -.6292541    .7964609
      expsqr |  -.0012892   .0075626    -0.17   0.865    -.0161117    .0135333
       _cons |   6.553798    4.35252     1.51   0.132    -1.976985    15.08458
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  1.33768  (p = 0.2474)
  Wu-Hausman F(1,438)             =  1.32659  (p = 0.2500)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  1.79505  (p = 0.4076)
  Basmann chi2(2)        =  1.77794  (p = 0.4111)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.593  Chi-sq(5) P-value = 0.9020

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu = t d td
>  ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male == 0 &
>  educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(19, 423)    =  40.14
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6432
                                                        Adj R-squared = 0.6272
                                                        Root MSE      = 0.1356

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.5088524   .0331445   -15.35   0.000    -.5740008   -.4437039
       expsqr |   .0098519   .0007654    12.87   0.000     .0083475    .0113563
 provincedum2 |    .122429   .0573132     2.14   0.033     .0097749    .2350831
 provincedum3 |   .1281644   .0720728     1.78   0.076    -.0135009    .2698298
 provincedum4 |   .1274419   .0610746     2.09   0.038     .0073944    .2474894
 provincedum5 |   .1129493   .0486317     2.32   0.021     .0173593    .2085392
 provincedum6 |   .1705679   .0521313     3.27   0.001     .0680993    .2730365
 provincedum7 |   .1414325   .0506454     2.79   0.005     .0418845    .2409805
 provincedum8 |   .1613294   .0488611     3.30   0.001     .0652886    .2573702
 provincedum9 |   .0984903   .0499025     1.97   0.049     .0004025    .1965781
provincedum10 |   .1374573   .0495555     2.77   0.006     .0400517     .234863
provincedum11 |   .0871916   .0502784     1.73   0.084    -.0116349    .1860182
provincedum12 |   .0793812   .0575077     1.38   0.168    -.0336553    .1924177
provincedum13 |    .132191   .0522665     2.53   0.012     .0294567    .2349253
provincedum14 |   .1311155   .0512923     2.56   0.011      .030296     .231935
provincedum15 |   .1489197   .0571547     2.61   0.009      .036577    .2612623
            t |  -.0022264   .0010816    -2.06   0.040    -.0043524   -.0001004
            d |   .0138395   .0266915     0.52   0.604    -.0386249     .066304
           td |  -.0033969   .0013252    -2.56   0.011    -.0060017   -.0007921
        _cons |   6.391112    .359177    17.79   0.000     5.685118    7.097106
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(17)   =      31.64
                                                  Prob > chi2     =     0.0167
                                                  R-squared       =     0.0666
                                                  Root MSE        =     .60466

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .0821721    .561721     0.15   0.884    -1.018781    1.183125
          exp |  -.1976009   .3386176    -0.58   0.560    -.8612792    .4660773
       expsqr |   .0046252   .0070443     0.66   0.511    -.0091813    .0184317
 provincedum2 |   -.575005   .2521468    -2.28   0.023    -1.069204   -.0808063
 provincedum3 |  -.8821781   .3185718    -2.77   0.006    -1.506567   -.2577888
 provincedum4 |  -.6854173   .2700936    -2.54   0.011    -1.214791   -.1560436
 provincedum5 |  -.3762009   .2122229    -1.77   0.076    -.7921501    .0397482
 provincedum6 |  -.3483013   .2312794    -1.51   0.132    -.8016006     .104998
 provincedum7 |  -.6460102   .2186391    -2.95   0.003    -1.074535   -.2174855
 provincedum8 |  -.5778126   .2152997    -2.68   0.007    -.9997923   -.1558329
 provincedum9 |  -.3860893   .2188658    -1.76   0.078    -.8150584    .0428798
provincedum10 |   -.368153   .2249148    -1.64   0.102    -.8089779     .072672
provincedum11 |  -.4900557   .2176551    -2.25   0.024    -.9166519   -.0634595
provincedum12 |  -.6153079   .2501443    -2.46   0.014    -1.105582   -.1250341
provincedum13 |  -.3808445   .2282896    -1.67   0.095    -.8282839    .0665948
provincedum14 |  -.6606633   .2252233    -2.93   0.003    -1.102093   -.2192338
provincedum15 |   -.687348   .2518187    -2.73   0.006    -1.180904   -.1937924
        _cons |   10.37969   4.014889     2.59   0.010     2.510648    18.24872
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .005092  (p = 0.9431)
  Wu-Hausman F(1,424)             =  .004873  (p = 0.9444)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  3.69413  (p = 0.1577)
  Basmann chi2(2)        =  3.55701  (p = 0.1689)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  14.053  Chi-sq(19) P-value = 0.7806

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/Rural/
> IV Rural ATF Exp 1979 3years.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Fra
> me/Exp/Rural/IV Rural ATF Exp 1979 3years.log
  log type:  text
 closed on:   8 Aug 2024, 12:33:15
---------------------------------------------------------------------------------------------
