---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Fra
> me/Tenure/IV Urban ATF Tenure 1979 3years.log
  log type:  text
 opened on:   6 Aug 2024, 17:33:17

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,362 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. local months = 36

. 
. 
. *1)
. ivregress 2sls log_monthlyearning tenure tenuresqr male (higheredu secgenhighedu secgenedu 
> = t d td) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & educ
> at != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(6, 2704)    =  34.46
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0710
                                                        Adj R-squared = 0.0690
                                                        Root MSE      = 0.4750

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0261327   .0046989     5.56   0.000      .016919    .0353464
   tenuresqr |  -.0003826   .0002191    -1.75   0.081    -.0008122     .000047
        male |   .0079135   .0183588     0.43   0.666    -.0280852    .0439121
           t |   .0001109   .0011745     0.09   0.925    -.0021922     .002414
           d |   .0531634   .0361277     1.47   0.141    -.0176773    .1240041
          td |   .0023191   .0017236     1.35   0.179    -.0010605    .0056988
       _cons |   .1712511   .0307917     5.56   0.000     .1108735    .2316287
------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(6, 2704)    =  21.25
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0450
                                                        Adj R-squared = 0.0429
                                                        Root MSE      = 0.4617

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0313429   .0045671     6.86   0.000     .0223875    .0402982
   tenuresqr |  -.0009239    .000213    -4.34   0.000    -.0013415   -.0005063
        male |   .0202243    .017844     1.13   0.257    -.0147649    .0552136
           t |   .0011827   .0011416     1.04   0.300    -.0010558    .0034211
           d |   .0267981   .0351146     0.76   0.445    -.0420561    .0956524
          td |   .0003658   .0016752     0.22   0.827    -.0029191    .0036507
       _cons |    .140544   .0299283     4.70   0.000     .0818595    .1992286
------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(6, 2704)    =  15.63
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0335
                                                        Adj R-squared = 0.0314
                                                        Root MSE      = 0.4890

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0336256    .004837     6.95   0.000     .0241409    .0431103
   tenuresqr |  -.0011711   .0002255    -5.19   0.000    -.0016134   -.0007289
        male |   .0355251   .0188987     1.88   0.060    -.0015322    .0725824
           t |    .001384   .0012091     1.14   0.252    -.0009868    .0037548
           d |   .0023181   .0371901     0.06   0.950    -.0706059     .075242
          td |    .000405   .0017743     0.23   0.819     -.003074    .0038841
       _cons |   .2637742   .0316972     8.32   0.000      .201621    .3259274
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(6)    =     105.18
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     1.0774

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   -1.49122   1.991922    -0.75   0.454    -5.395315    2.412875
secgenhighedu |   4.257188   5.393687     0.79   0.430    -6.314245    14.82862
    secgenedu |  -2.255441   4.502642    -0.50   0.616    -11.08046    6.569576
       tenure |   .0319304   .0397985     0.80   0.422    -.0460731    .1099339
    tenuresqr |   -.000851   .0020044    -0.42   0.671    -.0047795    .0030775
         male |   .2996661   .0864755     3.47   0.001     .1301772    .4691549
        _cons |    8.21625     .64675    12.70   0.000     6.948644    9.483857
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  2.27057  (p = 0.5182)
  Wu-Hausman F(3,2701)            =  .754698  (p = 0.5195)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.400  Chi-sq(6) P-value = 0.9659

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr male provincedum2-provincedum15 (highere
> du secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthl
> yearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(20, 2690)   =  14.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0968
                                                        Adj R-squared = 0.0901
                                                        Root MSE      = 0.4696

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0250685    .004668     5.37   0.000     .0159153    .0342217
    tenuresqr |  -.0003555   .0002174    -1.64   0.102    -.0007818    .0000707
         male |   .0084826   .0181929     0.47   0.641    -.0271908     .044156
 provincedum2 |  -.2557793   .0491752    -5.20   0.000    -.3522043   -.1593544
 provincedum3 |  -.1798255   .0538031    -3.34   0.001     -.285325    -.074326
 provincedum4 |  -.2492551    .048273    -5.16   0.000    -.3439112   -.1545991
 provincedum5 |  -.2763858   .0450762    -6.13   0.000    -.3647733   -.1879983
 provincedum6 |  -.2896455   .0519854    -5.57   0.000    -.3915809   -.1877101
 provincedum7 |  -.2313754   .0467433    -4.95   0.000    -.3230319    -.139719
 provincedum8 |  -.2300903   .0472902    -4.87   0.000    -.3228192   -.1373615
 provincedum9 |  -.2818598    .048006    -5.87   0.000    -.3759923   -.1877273
provincedum10 |  -.2754803   .0474232    -5.81   0.000      -.36847   -.1824906
provincedum11 |  -.3404545   .0421515    -8.08   0.000    -.4231071   -.2578019
provincedum12 |  -.2471565   .0535184    -4.62   0.000    -.3520978   -.1422151
provincedum13 |  -.3039048   .0491976    -6.18   0.000    -.4003736   -.2074359
provincedum14 |  -.2577197   .0583798    -4.41   0.000    -.3721936   -.1432458
provincedum15 |  -.2561593   .0585109    -4.38   0.000    -.3708903   -.1414284
            t |   .0001061   .0011637     0.09   0.927    -.0021758    .0023879
            d |   .0482818   .0358526     1.35   0.178    -.0220195    .1185832
           td |   .0021909   .0017069     1.28   0.199    -.0011561     .005538
        _cons |   .4307992   .0456254     9.44   0.000     .3413349    .5202635
-------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(20, 2690)   =   9.59
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0665
                                                        Adj R-squared = 0.0596
                                                        Root MSE      = 0.4576

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0301946   .0045493     6.64   0.000     .0212741    .0391151
    tenuresqr |  -.0008805   .0002119    -4.16   0.000    -.0012959   -.0004651
         male |   .0196532   .0177304     1.11   0.268    -.0151133    .0544197
 provincedum2 |  -.2797333    .047925    -5.84   0.000     -.373707   -.1857597
 provincedum3 |  -.1814298   .0524353    -3.46   0.001    -.2842473   -.0786123
 provincedum4 |  -.1866588   .0470459    -3.97   0.000    -.2789084   -.0944091
 provincedum5 |  -.2076846   .0439303    -4.73   0.000    -.2938251    -.121544
 provincedum6 |  -.2468125   .0506638    -4.87   0.000    -.3461566   -.1474685
 provincedum7 |  -.1740109    .045555    -3.82   0.000    -.2633373   -.0846845
 provincedum8 |  -.1868961    .046088    -4.06   0.000    -.2772676   -.0965246
 provincedum9 |  -.1935108   .0467856    -4.14   0.000    -.2852502   -.1017714
provincedum10 |  -.2625754   .0462176    -5.68   0.000    -.3532011   -.1719497
provincedum11 |  -.2700681   .0410799    -6.57   0.000    -.3506195   -.1895167
provincedum12 |  -.2066989   .0521579    -3.96   0.000    -.3089725   -.1044254
provincedum13 |  -.2666612   .0479469    -5.56   0.000    -.3606776   -.1726447
provincedum14 |  -.2709112   .0568957    -4.76   0.000     -.382475   -.1593475
provincedum15 |  -.2345497   .0570235    -4.11   0.000     -.346364   -.1227355
            t |   .0012116   .0011341     1.07   0.285    -.0010123    .0034355
            d |   .0188207   .0349411     0.54   0.590    -.0496934    .0873349
           td |   .0003321   .0016635     0.20   0.842    -.0029299    .0035941
        _cons |   .3604572   .0444655     8.11   0.000     .2732673    .4476471
-------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(20, 2690)   =   6.84
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0484
                                                        Adj R-squared = 0.0413
                                                        Root MSE      = 0.4865

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0323035   .0048358     6.68   0.000     .0228213    .0417857
    tenuresqr |  -.0011129   .0002252    -4.94   0.000    -.0015544   -.0006713
         male |   .0345035   .0188468     1.83   0.067    -.0024522    .0714592
 provincedum2 |   -.257149   .0509428    -5.05   0.000    -.3570399    -.157258
 provincedum3 |  -.1614492    .055737    -2.90   0.004    -.2707409   -.0521575
 provincedum4 |  -.1817522   .0500082    -3.63   0.000    -.2798106   -.0836937
 provincedum5 |  -.1657545   .0466965    -3.55   0.000    -.2573191   -.0741899
 provincedum6 |  -.2208201    .053854    -4.10   0.000    -.3264196   -.1152206
 provincedum7 |  -.1552677   .0484235    -3.21   0.001    -.2502188   -.0603166
 provincedum8 |  -.1513162   .0489901    -3.09   0.002    -.2473782   -.0552542
 provincedum9 |  -.1778668   .0497316    -3.58   0.000    -.2753829   -.0803507
provincedum10 |  -.2500927   .0491279    -5.09   0.000    -.3464249   -.1537605
provincedum11 |  -.1936598   .0436666    -4.43   0.000    -.2792834   -.1080362
provincedum12 |  -.1772134   .0554421    -3.20   0.001    -.2859269   -.0684999
provincedum13 |  -.1965368    .050966    -3.86   0.000    -.2964733   -.0966004
provincedum14 |  -.2763511   .0604783    -4.57   0.000    -.3949398   -.1577624
provincedum15 |  -.2002323   .0606141    -3.30   0.001    -.3190873   -.0813774
            t |   .0015015   .0012056     1.25   0.213    -.0008624    .0038654
            d |  -.0088556   .0371413    -0.24   0.812    -.0816839    .0639728
           td |     .00035   .0017683     0.20   0.843    -.0031174    .0038174
        _cons |   .4546992   .0472654     9.62   0.000     .3620191    .5473793
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(20)   =     195.50
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .95649

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -1.295601   1.880021    -0.69   0.491    -4.980375    2.389172
secgenhighedu |   3.573585   4.795069     0.75   0.456    -5.824577    12.97175
    secgenedu |  -1.835205   3.589316    -0.51   0.609    -8.870135    5.199726
       tenure |   .0298832   .0316212     0.95   0.345    -.0320932    .0918595
    tenuresqr |  -.0007083   .0015308    -0.46   0.644    -.0037087    .0022921
         male |   .2923998   .0661117     4.42   0.000     .1628232    .4219763
 provincedum2 |  -.3188591   .2424495    -1.32   0.188    -.7940514    .1563332
 provincedum3 |  -.2087145    .169909    -1.23   0.219      -.54173     .124301
 provincedum4 |  -.3423251   .1764799    -1.94   0.052    -.6882193    .0035691
 provincedum5 |   .0321056    .143859     0.22   0.823    -.2498528     .314064
 provincedum6 |  -.0987465   .1779828    -0.55   0.579    -.4475863    .2500933
 provincedum7 |  -.2524385   .1424786    -1.77   0.076    -.5316914    .0268143
 provincedum8 |  -.3392669   .1421222    -2.39   0.017    -.6178213   -.0607124
 provincedum9 |   -.171127   .1780933    -0.96   0.337    -.5201834    .1779293
provincedum10 |  -.0843607   .2008535    -0.42   0.674    -.4780263     .309305
provincedum11 |    .086108   .1999345     0.43   0.667    -.3057564    .4779724
provincedum12 |  -.1512455   .1557834    -0.97   0.332    -.4565754    .1540843
provincedum13 |   .0074295   .2236079     0.03   0.973    -.4308339     .445693
provincedum14 |  -.1601865   .2502955    -0.64   0.522    -.6507566    .3303837
provincedum15 |  -.2578633   .1864947    -1.38   0.167    -.6233862    .1076595
        _cons |   8.311865   .5594013    14.86   0.000     7.215459    9.408271
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =   1.7428  (p = 0.6275)
  Wu-Hausman F(3,2687)            =  .576161  (p = 0.6307)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.968  Chi-sq(20) P-value = 0.9687

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu secgenedu = t d
>  td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & male == 
> 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(5, 1440)    =  13.86
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0459
                                                        Adj R-squared = 0.0426
                                                        Root MSE      = 0.4837

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0261546   .0067484     3.88   0.000     .0129168    .0393924
   tenuresqr |  -.0005659   .0003118    -1.81   0.070    -.0011775    .0000458
           t |  -.0000197   .0016252    -0.01   0.990    -.0032077    .0031683
           d |   .0256106   .0497917     0.51   0.607    -.0720614    .1232826
          td |   .0032521   .0023758     1.37   0.171    -.0014083    .0079125
       _cons |   .2090639   .0430956     4.85   0.000     .1245271    .2936008
------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(5, 1440)    =   9.87
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0331
                                                        Adj R-squared = 0.0298
                                                        Root MSE      = 0.4702

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0312321   .0065597     4.76   0.000     .0183646    .0440996
   tenuresqr |  -.0010386   .0003031    -3.43   0.001    -.0016332   -.0004441
           t |   .0009856   .0015797     0.62   0.533    -.0021133    .0040844
           d |   .0201507   .0483989     0.42   0.677    -.0747892    .1150905
          td |   .0011259   .0023093     0.49   0.626    -.0034041    .0056559
       _cons |   .1737641   .0418901     4.15   0.000      .091592    .2559362
------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(5, 1440)    =   6.88
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0233
                                                        Adj R-squared = 0.0199
                                                        Root MSE      = 0.4940

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0314099   .0068918     4.56   0.000     .0178909    .0449289
   tenuresqr |  -.0012001   .0003184    -3.77   0.000    -.0018247   -.0005754
           t |    .001402   .0016597     0.84   0.398    -.0018537    .0046578
           d |  -.0034765   .0508493    -0.07   0.946    -.1032232    .0962702
          td |   .0007703   .0024263     0.32   0.751    -.0039891    .0055297
       _cons |   .3237314    .044011     7.36   0.000     .2373989    .4100639
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(5)    =      15.62
                                                  Prob > chi2     =     0.0080
                                                  R-squared       =          .
                                                  Root MSE        =     .83323

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -1.608877   2.166818    -0.74   0.458    -5.855763    2.638009
secgenhighedu |   2.328776   5.064191     0.46   0.646    -7.596855    12.25441
    secgenedu |  -.5471541   4.217641    -0.13   0.897    -8.813579     7.71927
       tenure |   .0274186   .0324914     0.84   0.399    -.0362633    .0911005
    tenuresqr |  -.0007435    .001785    -0.42   0.677    -.0042421     .002755
        _cons |   8.475093   .7282879    11.64   0.000     7.047675    9.902511
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =   1.7955  (p = 0.6159)
  Wu-Hausman F(3,1437)            =  .595514  (p = 0.6180)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.084  Chi-sq(5) P-value = 0.9555

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu se
> cgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearn
> ing, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(19, 1426)   =   6.60
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0808
                                                        Adj R-squared = 0.0685
                                                        Root MSE      = 0.4771

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0255062   .0066892     3.81   0.000     .0123845     .038628
    tenuresqr |  -.0005589   .0003084    -1.81   0.070    -.0011638    .0000461
 provincedum2 |  -.3138946   .0670668    -4.68   0.000    -.4454548   -.1823344
 provincedum3 |  -.2395948   .0731064    -3.28   0.001    -.3830023   -.0961872
 provincedum4 |   -.303859   .0659313    -4.61   0.000    -.4331918   -.1745262
 provincedum5 |  -.2901394   .0616139    -4.71   0.000    -.4110031   -.1692757
 provincedum6 |  -.3604392   .0711169    -5.07   0.000    -.4999442   -.2209342
 provincedum7 |  -.2537423   .0655909    -3.87   0.000    -.3824073   -.1250773
 provincedum8 |  -.2178664    .065713    -3.32   0.001     -.346771   -.0889617
 provincedum9 |  -.3101175   .0648537    -4.78   0.000    -.4373364   -.1828986
provincedum10 |  -.2426944   .0663191    -3.66   0.000    -.3727879   -.1126009
provincedum11 |  -.3750174   .0574568    -6.53   0.000    -.4877263   -.2623084
provincedum12 |  -.1924749   .0782689    -2.46   0.014    -.3460094   -.0389403
provincedum13 |   -.296438   .0681546    -4.35   0.000     -.430132    -.162744
provincedum14 |  -.2457407   .0831333    -2.96   0.003    -.4088173   -.0826641
provincedum15 |  -.1841513   .0843363    -2.18   0.029    -.3495878   -.0187148
            t |   .0000573   .0016116     0.04   0.972    -.0031041    .0032187
            d |   .0102263   .0494005     0.21   0.836    -.0866792    .1071317
           td |   .0033874   .0023533     1.44   0.150     -.001229    .0080038
        _cons |   .4863779   .0630541     7.71   0.000     .3626892    .6100667
-------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(19, 1426)   =   5.11
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0638
                                                        Adj R-squared = 0.0513
                                                        Root MSE      = 0.4649

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0306385   .0065184     4.70   0.000     .0178518    .0434253
    tenuresqr |  -.0010252   .0003005    -3.41   0.001    -.0016147   -.0004357
 provincedum2 |  -.3474736   .0653544    -5.32   0.000    -.4756747   -.2192726
 provincedum3 |  -.2209132   .0712397    -3.10   0.002    -.3606592   -.0811673
 provincedum4 |  -.2373099   .0642479    -3.69   0.000    -.3633405   -.1112794
 provincedum5 |  -.1972163   .0600407    -3.28   0.001    -.3149939   -.0794386
 provincedum6 |  -.3184772   .0693011    -4.60   0.000    -.4544202   -.1825342
 provincedum7 |  -.1815978   .0639162    -2.84   0.005    -.3069776    -.056218
 provincedum8 |  -.1451614   .0640352    -2.27   0.024    -.2707747   -.0195481
 provincedum9 |  -.2221021   .0631978    -3.51   0.000    -.3460727   -.0981315
provincedum10 |  -.2250134   .0646258    -3.48   0.001    -.3517852   -.0982416
provincedum11 |  -.2939932   .0559898    -5.25   0.000    -.4038244   -.1841621
provincedum12 |  -.1530439   .0762705    -2.01   0.045    -.3026583   -.0034296
provincedum13 |  -.2552752   .0664144    -3.84   0.000    -.3855556   -.1249949
provincedum14 |  -.2952313   .0810106    -3.64   0.000    -.4541441   -.1363185
provincedum15 |  -.1802783   .0821829    -2.19   0.028    -.3414906   -.0190659
            t |   .0010521   .0015705     0.67   0.503    -.0020286    .0041327
            d |   .0007809   .0481391     0.02   0.987    -.0936502    .0952121
           td |   .0014583   .0022933     0.64   0.525    -.0030403    .0059568
        _cons |   .4036155   .0614441     6.57   0.000     .2830849    .5241461
-------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(19, 1426)   =   3.78
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0479
                                                        Adj R-squared = 0.0353
                                                        Root MSE      = 0.4901

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0307834   .0068714     4.48   0.000     .0173043    .0442625
    tenuresqr |    -.00118   .0003168    -3.73   0.000    -.0018015   -.0005586
 provincedum2 |  -.3476534   .0688931    -5.05   0.000    -.4827961   -.2125107
 provincedum3 |  -.2106045   .0750971    -2.80   0.005    -.3579172   -.0632918
 provincedum4 |  -.2484509   .0677267    -3.67   0.000    -.3813055   -.1155962
 provincedum5 |  -.1651616   .0632918    -2.61   0.009    -.2893165   -.0410066
 provincedum6 |  -.2992099   .0730535    -4.10   0.000    -.4425138    -.155906
 provincedum7 |  -.1890298    .067377    -2.81   0.005    -.3211985   -.0568611
 provincedum8 |   -.144276   .0675025    -2.14   0.033    -.2766908   -.0118611
 provincedum9 |  -.2024488   .0666197    -3.04   0.002    -.3331321   -.0717656
provincedum10 |  -.1941864   .0681251    -2.85   0.004    -.3278226   -.0605503
provincedum11 |  -.2180308   .0590214    -3.69   0.000     -.333809   -.1022526
provincedum12 |  -.1659034   .0804003    -2.06   0.039    -.3236189   -.0081879
provincedum13 |  -.1880869   .0700105    -2.69   0.007    -.3254215   -.0507523
provincedum14 |  -.3306627   .0853971    -3.87   0.000    -.4981801   -.1631453
provincedum15 |  -.1787175   .0866328    -2.06   0.039     -.348659    -.008776
            t |   .0015971   .0016555     0.96   0.335    -.0016504    .0048445
            d |  -.0252993   .0507457    -0.50   0.618    -.1248436     .074245
           td |   .0009661   .0024174     0.40   0.689     -.003776    .0057082
        _cons |   .5357862   .0647711     8.27   0.000     .4087293    .6628432
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(19)   =      62.48
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      .7967

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   -1.48483    2.51223    -0.59   0.554    -6.408711    3.439051
secgenhighedu |   1.900812   5.240377     0.36   0.717    -8.370138    12.17176
    secgenedu |  -.2589171   3.566422    -0.07   0.942    -7.248975    6.731141
       tenure |    .025229   .0310153     0.81   0.416    -.0355599    .0860179
    tenuresqr |  -.0006301   .0016366    -0.38   0.700    -.0038377    .0025775
 provincedum2 |  -.3091266   .2979069    -1.04   0.299    -.8930135    .2747602
 provincedum3 |   -.175539   .1867962    -0.94   0.347    -.5416528    .1905747
 provincedum4 |  -.3817604   .2734616    -1.40   0.163    -.9177354    .1542146
 provincedum5 |  -.0615857    .216514    -0.28   0.776    -.4859453     .362774
 provincedum6 |  -.1104335   .2362627    -0.47   0.640    -.5734998    .3526329
 provincedum7 |  -.2527411   .2513206    -1.01   0.315    -.7453205    .2398383
 provincedum8 |  -.4494377   .2223937    -2.02   0.043    -.8853214   -.0135541
 provincedum9 |  -.1569065   .2332024    -0.67   0.501    -.6139748    .3001619
provincedum10 |  -.0505983   .1772922    -0.29   0.775    -.3980847     .296888
provincedum11 |  -.0780124    .220265    -0.35   0.723    -.5097239    .3536991
provincedum12 |  -.2189182   .2175119    -1.01   0.314    -.6452338    .2073973
provincedum13 |  -.1306972   .2168095    -0.60   0.547     -.555636    .2942415
provincedum14 |   -.153876   .3280432    -0.47   0.639    -.7968289    .4890769
provincedum15 |  -.3243687   .1892996    -1.71   0.087    -.6953891    .0466518
        _cons |   8.620517    .729172    11.82   0.000     7.191366    10.04967
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  1.71859  (p = 0.6328)
  Wu-Hausman F(3,1423)            =  .564422  (p = 0.6385)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  11.329  Chi-sq(19) P-value = 0.9123

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu secgenedu = t d
>  td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & male == 
> 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(5, 1259)    =  30.07
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1067
                                                        Adj R-squared = 0.1031
                                                        Root MSE      = 0.4638

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |    .025506   .0065246     3.91   0.000     .0127058    .0383062
   tenuresqr |  -.0001484   .0003075    -0.48   0.629    -.0007517    .0004548
           t |   .0001273   .0016975     0.07   0.940    -.0032029    .0034575
           d |   .0857794    .052379     1.64   0.102    -.0169804    .1885393
          td |   .0013305    .002505     0.53   0.595     -.003584    .0062451
       _cons |   .1414392    .041007     3.45   0.001     .0609896    .2218888
------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(5, 1259)    =  16.19
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0604
                                                        Adj R-squared = 0.0567
                                                        Root MSE      = 0.4518

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0310098   .0063556     4.88   0.000     .0185411    .0434785
   tenuresqr |  -.0007722   .0002995    -2.58   0.010    -.0013598   -.0001845
           t |    .001305   .0016535     0.79   0.430    -.0019389    .0045489
           d |   .0350749   .0510223     0.69   0.492    -.0650233    .1351731
          td |  -.0004095   .0024402    -0.17   0.867    -.0051967    .0043778
       _cons |   .1283101   .0399449     3.21   0.001     .0499442    .2066759
------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(5, 1259)    =  11.70
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0444
                                                        Adj R-squared = 0.0406
                                                        Root MSE      = 0.4832

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0353066   .0067972     5.19   0.000     .0219716    .0486417
   tenuresqr |  -.0011011   .0003203    -3.44   0.001    -.0017295   -.0004726
           t |   .0012853   .0017684     0.73   0.467     -.002184    .0047546
           d |   .0094848   .0545676     0.17   0.862    -.0975687    .1165384
          td |   .0000432   .0026097     0.02   0.987    -.0050766    .0051631
       _cons |   .2410323   .0427205     5.64   0.000     .1572212    .3248434
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(5)    =      53.29
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     1.0389

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -.6636108     2.2076    -0.30   0.764    -4.990428    3.663207
secgenhighedu |   3.769109    7.04744     0.53   0.593    -10.04362    17.58184
    secgenedu |  -2.328235   6.439238    -0.36   0.718    -14.94891    10.29244
       tenure |   .0406723   .0730475     0.56   0.578    -.1024982    .1838429
    tenuresqr |  -.0011676   .0032666    -0.36   0.721    -.0075699    .0052347
        _cons |   8.034666   .8593022     9.35   0.000     6.350465    9.718867
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  1.48719  (p = 0.6852)
  Wu-Hausman F(3,1256)            =  .492784  (p = 0.6873)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.657  Chi-sq(5) P-value = 0.8943

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu se
> cgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearn
> ing, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(19, 1245)   =  10.30
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1358
                                                        Adj R-squared = 0.1226
                                                        Root MSE      = 0.4588

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0237539   .0065116     3.65   0.000      .010979    .0365289
    tenuresqr |  -.0000695   .0003069    -0.23   0.821    -.0006716    .0005325
 provincedum2 |  -.1923318   .0722329    -2.66   0.008    -.3340436   -.0506201
 provincedum3 |  -.0974934   .0792148    -1.23   0.219    -.2529026    .0579158
 provincedum4 |  -.1833498   .0706361    -2.60   0.010    -.3219287   -.0447709
 provincedum5 |  -.2630623   .0659694    -3.99   0.000    -.3924857   -.1336388
 provincedum6 |  -.2040287   .0760021    -2.68   0.007    -.3531351   -.0549223
 provincedum7 |  -.2112246   .0665895    -3.17   0.002    -.3418647   -.0805844
 provincedum8 |  -.2425775   .0679358    -3.57   0.000    -.3758588   -.1092962
 provincedum9 |  -.2538427   .0714213    -3.55   0.000    -.3939621   -.1137234
provincedum10 |    -.31664   .0676788    -4.68   0.000    -.4494171   -.1838629
provincedum11 |  -.2957779   .0618178    -4.78   0.000    -.4170565   -.1744994
provincedum12 |  -.2895454   .0734574    -3.94   0.000    -.4336594   -.1454314
provincedum13 |  -.3151382   .0708513    -4.45   0.000    -.4541393   -.1761371
provincedum14 |  -.2763166   .0819007    -3.37   0.001    -.4369953   -.1156379
provincedum15 |  -.3187777   .0811069    -3.93   0.000    -.4778989   -.1596565
            t |   .0001216   .0016856     0.07   0.943    -.0031854    .0034285
            d |   .0879894   .0521632     1.69   0.092    -.0143481     .190327
           td |   .0010975   .0024892     0.44   0.659     -.003786     .005981
        _cons |   .3825715   .0638589     5.99   0.000     .2572885    .5078544
-------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(19, 1245)   =   6.23
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0868
                                                        Adj R-squared = 0.0729
                                                        Root MSE      = 0.4479

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0291389   .0063576     4.58   0.000      .016666    .0416118
    tenuresqr |  -.0006774   .0002996    -2.26   0.024    -.0012652   -.0000896
 provincedum2 |  -.2007471    .070525    -2.85   0.004    -.3391081   -.0623862
 provincedum3 |  -.1273237   .0773417    -1.65   0.100    -.2790582    .0244108
 provincedum4 |  -.1243795   .0689659    -1.80   0.072    -.2596817    .0109227
 provincedum5 |  -.2227461   .0644095    -3.46   0.001    -.3491093   -.0963828
 provincedum6 |  -.1592924    .074205    -2.15   0.032    -.3048732   -.0137117
 provincedum7 |  -.1685131    .065015    -2.59   0.010    -.2960642    -.040962
 provincedum8 |  -.2309328   .0663294    -3.48   0.001    -.3610627    -.100803
 provincedum9 |  -.1594988   .0697325    -2.29   0.022     -.296305   -.0226926
provincedum10 |  -.3059735   .0660785    -4.63   0.000    -.4356111   -.1763359
provincedum11 |  -.2389133   .0603561    -3.96   0.000    -.3573243   -.1205024
provincedum12 |  -.2484817   .0717205    -3.46   0.001    -.3891882   -.1077753
provincedum13 |  -.2812015    .069176    -4.07   0.000    -.4169158   -.1454871
provincedum14 |  -.2525191   .0799642    -3.16   0.002    -.4093985   -.0956397
provincedum15 |  -.2805788   .0791891    -3.54   0.000    -.4359376   -.1252201
            t |   .0014328   .0016458     0.87   0.384    -.0017959    .0046616
            d |   .0334058   .0509298     0.66   0.512    -.0665119    .1333236
           td |  -.0007532   .0024303    -0.31   0.757    -.0055212    .0040148
        _cons |   .3384975    .062349     5.43   0.000     .2161769    .4608181
-------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(19, 1245)   =   4.41
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0631
                                                        Adj R-squared = 0.0488
                                                        Root MSE      = 0.4811

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0335611   .0068293     4.91   0.000     .0201629    .0469592
    tenuresqr |   -.001001   .0003219    -3.11   0.002    -.0016324   -.0003695
 provincedum2 |  -.1481318   .0757567    -1.96   0.051    -.2967566     .000493
 provincedum3 |   -.094017   .0830791    -1.13   0.258    -.2570075    .0689734
 provincedum4 |  -.0990615   .0740819    -1.34   0.181    -.2444006    .0462776
 provincedum5 |  -.1671782   .0691875    -2.42   0.016    -.3029153   -.0314412
 provincedum6 |  -.1220646   .0797097    -1.53   0.126    -.2784447    .0343156
 provincedum7 |  -.1193564    .069838    -1.71   0.088    -.2563694    .0176567
 provincedum8 |  -.1550535   .0712499    -2.18   0.030    -.2948365   -.0152704
 provincedum9 |  -.1522929   .0749054    -2.03   0.042    -.2992477   -.0053382
provincedum10 |  -.3088996   .0709804    -4.35   0.000    -.4481539   -.1696452
provincedum11 |    -.16137   .0648334    -2.49   0.013    -.2885648   -.0341751
provincedum12 |  -.1797347   .0770409    -2.33   0.020     -.330879   -.0285905
provincedum13 |     -.2046   .0743076    -2.75   0.006    -.3503819   -.0588182
provincedum14 |  -.2241783   .0858961    -2.61   0.009    -.3926953   -.0556613
provincedum15 |  -.2124615   .0850635    -2.50   0.013    -.3793451    -.045578
            t |   .0014952   .0017678     0.85   0.398    -.0019731    .0049635
            d |   .0021443   .0547079     0.04   0.969    -.1051855    .1094742
           td |  -.0001433   .0026106    -0.05   0.956     -.005265    .0049785
        _cons |   .4054226   .0669741     6.05   0.000     .2740281    .5368172
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(19)   =     123.09
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .85833

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -.3181076   1.624245    -0.20   0.845     -3.50157    2.865355
secgenhighedu |   2.672322   4.755593     0.56   0.574    -6.648469    11.99311
    secgenedu |  -1.757972   4.058593    -0.43   0.665    -9.712668    6.196725
       tenure |   .0403888    .048448     0.83   0.404    -.0545675    .1353451
    tenuresqr |  -.0010426    .002085    -0.50   0.617    -.0051291    .0030439
 provincedum2 |  -.4364501   .2726785    -1.60   0.109    -.9708902    .0979899
 provincedum3 |   -.344827    .237941    -1.45   0.147    -.8111828    .1215287
 provincedum4 |  -.2996025   .1591961    -1.88   0.060    -.6116211    .0124162
 provincedum5 |   .0655802   .2336431     0.28   0.779    -.3923517    .5235122
 provincedum6 |  -.1653814    .190444    -0.87   0.385    -.5386448     .207882
 provincedum7 |  -.2540693   .1972157    -1.29   0.198     -.640605    .1324665
 provincedum8 |  -.2478372   .3092693    -0.80   0.423    -.8539939    .3583196
 provincedum9 |  -.2496092   .2066583    -1.21   0.227    -.6546521    .1554336
provincedum10 |  -.2124878    .362877    -0.59   0.558    -.9237136    .4987381
provincedum11 |   .1121908   .2650683     0.42   0.672    -.4073334    .6317151
provincedum12 |   -.085348   .2751396    -0.31   0.756    -.6246117    .4539157
provincedum13 |   .0146693    .309474     0.05   0.962    -.5918887    .6212272
provincedum14 |  -.1530748   .2764552    -0.55   0.580    -.6949171    .3887675
provincedum15 |  -.1944793   .3014169    -0.65   0.519    -.7852455     .396287
        _cons |   8.134069   .5524362    14.72   0.000     7.051314    9.216824
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  .850532  (p = 0.8373)
  Wu-Hausman F(3,1242)            =  .278543  (p = 0.8409)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   8.809  Chi-sq(19) P-value = 0.9765

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning tenure tenuresqr male (higheredu secgenhighedu = t d td )
>  if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & educat != ., 
> first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(6, 2704)    =  34.46
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0710
                                                        Adj R-squared = 0.0690
                                                        Root MSE      = 0.4750

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0261327   .0046989     5.56   0.000      .016919    .0353464
   tenuresqr |  -.0003826   .0002191    -1.75   0.081    -.0008122     .000047
        male |   .0079135   .0183588     0.43   0.666    -.0280852    .0439121
           t |   .0001109   .0011745     0.09   0.925    -.0021922     .002414
           d |   .0531634   .0361277     1.47   0.141    -.0176773    .1240041
          td |   .0023191   .0017236     1.35   0.179    -.0010605    .0056988
       _cons |   .1712511   .0307917     5.56   0.000     .1108735    .2316287
------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(6, 2704)    =  21.25
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0450
                                                        Adj R-squared = 0.0429
                                                        Root MSE      = 0.4617

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0313429   .0045671     6.86   0.000     .0223875    .0402982
   tenuresqr |  -.0009239    .000213    -4.34   0.000    -.0013415   -.0005063
        male |   .0202243    .017844     1.13   0.257    -.0147649    .0552136
           t |   .0011827   .0011416     1.04   0.300    -.0010558    .0034211
           d |   .0267981   .0351146     0.76   0.445    -.0420561    .0956524
          td |   .0003658   .0016752     0.22   0.827    -.0029191    .0036507
       _cons |    .140544   .0299283     4.70   0.000     .0818595    .1992286
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(5)    =     190.97
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .79866

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -1.056635   1.329112    -0.79   0.427    -3.661648    1.548377
secgenhighedu |   1.827763    1.74936     1.04   0.296     -1.60092    5.256446
       tenure |   .0208921   .0245658     0.85   0.395     -.027256    .0690402
    tenuresqr |  -.0002858   .0012279    -0.23   0.816    -.0026925     .002121
         male |   .2655627   .0395224     6.72   0.000     .1881003    .3430251
        _cons |   7.896178   .0741135   106.54   0.000     7.750918    8.041438
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.57334  (p = 0.4554)
  Wu-Hausman F(2,2703)            =  .784802  (p = 0.4563)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =   .45666  (p = 0.4992)
  Basmann chi2(1)        =  .455558  (p = 0.4997)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   3.246  Chi-sq(6) P-value = 0.7774

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr male provincedum2-provincedum15 (highere
> du secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 
> 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(20, 2690)   =  14.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0968
                                                        Adj R-squared = 0.0901
                                                        Root MSE      = 0.4696

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0250685    .004668     5.37   0.000     .0159153    .0342217
    tenuresqr |  -.0003555   .0002174    -1.64   0.102    -.0007818    .0000707
         male |   .0084826   .0181929     0.47   0.641    -.0271908     .044156
 provincedum2 |  -.2557793   .0491752    -5.20   0.000    -.3522043   -.1593544
 provincedum3 |  -.1798255   .0538031    -3.34   0.001     -.285325    -.074326
 provincedum4 |  -.2492551    .048273    -5.16   0.000    -.3439112   -.1545991
 provincedum5 |  -.2763858   .0450762    -6.13   0.000    -.3647733   -.1879983
 provincedum6 |  -.2896455   .0519854    -5.57   0.000    -.3915809   -.1877101
 provincedum7 |  -.2313754   .0467433    -4.95   0.000    -.3230319    -.139719
 provincedum8 |  -.2300903   .0472902    -4.87   0.000    -.3228192   -.1373615
 provincedum9 |  -.2818598    .048006    -5.87   0.000    -.3759923   -.1877273
provincedum10 |  -.2754803   .0474232    -5.81   0.000      -.36847   -.1824906
provincedum11 |  -.3404545   .0421515    -8.08   0.000    -.4231071   -.2578019
provincedum12 |  -.2471565   .0535184    -4.62   0.000    -.3520978   -.1422151
provincedum13 |  -.3039048   .0491976    -6.18   0.000    -.4003736   -.2074359
provincedum14 |  -.2577197   .0583798    -4.41   0.000    -.3721936   -.1432458
provincedum15 |  -.2561593   .0585109    -4.38   0.000    -.3708903   -.1414284
            t |   .0001061   .0011637     0.09   0.927    -.0021758    .0023879
            d |   .0482818   .0358526     1.35   0.178    -.0220195    .1185832
           td |   .0021909   .0017069     1.28   0.199    -.0011561     .005538
        _cons |   .4307992   .0456254     9.44   0.000     .3413349    .5202635
-------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(20, 2690)   =   9.59
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0665
                                                        Adj R-squared = 0.0596
                                                        Root MSE      = 0.4576

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0301946   .0045493     6.64   0.000     .0212741    .0391151
    tenuresqr |  -.0008805   .0002119    -4.16   0.000    -.0012959   -.0004651
         male |   .0196532   .0177304     1.11   0.268    -.0151133    .0544197
 provincedum2 |  -.2797333    .047925    -5.84   0.000     -.373707   -.1857597
 provincedum3 |  -.1814298   .0524353    -3.46   0.001    -.2842473   -.0786123
 provincedum4 |  -.1866588   .0470459    -3.97   0.000    -.2789084   -.0944091
 provincedum5 |  -.2076846   .0439303    -4.73   0.000    -.2938251    -.121544
 provincedum6 |  -.2468125   .0506638    -4.87   0.000    -.3461566   -.1474685
 provincedum7 |  -.1740109    .045555    -3.82   0.000    -.2633373   -.0846845
 provincedum8 |  -.1868961    .046088    -4.06   0.000    -.2772676   -.0965246
 provincedum9 |  -.1935108   .0467856    -4.14   0.000    -.2852502   -.1017714
provincedum10 |  -.2625754   .0462176    -5.68   0.000    -.3532011   -.1719497
provincedum11 |  -.2700681   .0410799    -6.57   0.000    -.3506195   -.1895167
provincedum12 |  -.2066989   .0521579    -3.96   0.000    -.3089725   -.1044254
provincedum13 |  -.2666612   .0479469    -5.56   0.000    -.3606776   -.1726447
provincedum14 |  -.2709112   .0568957    -4.76   0.000     -.382475   -.1593475
provincedum15 |  -.2345497   .0570235    -4.11   0.000     -.346364   -.1227355
            t |   .0012116   .0011341     1.07   0.285    -.0010123    .0034355
            d |   .0188207   .0349411     0.54   0.590    -.0496934    .0873349
           td |   .0003321   .0016635     0.20   0.842    -.0029299    .0035941
        _cons |   .3604572   .0444655     8.11   0.000     .2732673    .4476471
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(19)   =     337.63
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .72736

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -.7553208   1.182457    -0.64   0.523    -3.072895    1.562253
secgenhighedu |   1.363552   1.578622     0.86   0.388    -1.730491    4.457595
       tenure |   .0238475   .0223077     1.07   0.285    -.0198748    .0675697
    tenuresqr |  -.0004207   .0010827    -0.39   0.698    -.0025427    .0017013
         male |   .2681946   .0350927     7.64   0.000     .1994142    .3369749
 provincedum2 |  -.3278102    .183888    -1.78   0.075     -.688224    .0326037
 provincedum3 |  -.2185666   .1283727    -1.70   0.089    -.4701725    .0330393
 provincedum4 |  -.2876709   .1067847    -2.69   0.007    -.4969651   -.0783767
 provincedum5 |   .0264611   .1090741     0.24   0.808    -.1873202    .2402424
 provincedum6 |  -.0823553   .1331323    -0.62   0.536    -.3432899    .1785792
 provincedum7 |  -.2264869   .1012388    -2.24   0.025    -.4249113   -.0280624
 provincedum8 |   -.350297   .1068237    -3.28   0.001    -.5596676   -.1409264
 provincedum9 |  -.1211981   .1132561    -1.07   0.285    -.3431759    .1007797
provincedum10 |  -.0583483   .1477569    -0.39   0.693    -.3479464    .2312499
provincedum11 |   .0284072   .1255037     0.23   0.821    -.2175756      .27439
provincedum12 |  -.1501201   .1184527    -1.27   0.205    -.3822832     .082043
provincedum13 |  -.0575067    .139952    -0.41   0.681    -.3318077    .2167942
provincedum14 |  -.1141649   .1776025    -0.64   0.520    -.4622595    .2339297
provincedum15 |   -.271016   .1404631    -1.93   0.054    -.5463187    .0042867
        _cons |   8.046732   .1595775    50.43   0.000     7.733966    8.359499
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.14713  (p = 0.5635)
  Wu-Hausman F(2,2689)            =  .569151  (p = 0.5661)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .452076  (p = 0.5014)
  Basmann chi2(1)        =  .448649  (p = 0.5030)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  15.636  Chi-sq(20) P-value = 0.7389

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu = t d td ) if i
> nrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & male == 1 & educat
>  != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(5, 1440)    =  13.86
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0459
                                                        Adj R-squared = 0.0426
                                                        Root MSE      = 0.4837

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0261546   .0067484     3.88   0.000     .0129168    .0393924
   tenuresqr |  -.0005659   .0003118    -1.81   0.070    -.0011775    .0000458
           t |  -.0000197   .0016252    -0.01   0.990    -.0032077    .0031683
           d |   .0256106   .0497917     0.51   0.607    -.0720614    .1232826
          td |   .0032521   .0023758     1.37   0.171    -.0014083    .0079125
       _cons |   .2090639   .0430956     4.85   0.000     .1245271    .2936008
------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(5, 1440)    =   9.87
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0331
                                                        Adj R-squared = 0.0298
                                                        Root MSE      = 0.4702

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0312321   .0065597     4.76   0.000     .0183646    .0440996
   tenuresqr |  -.0010386   .0003031    -3.43   0.001    -.0016332   -.0004441
           t |   .0009856   .0015797     0.62   0.533    -.0021133    .0040844
           d |   .0201507   .0483989     0.42   0.677    -.0747892    .1150905
          td |   .0011259   .0023093     0.49   0.626    -.0034041    .0056559
       _cons |   .1737641   .0418901     4.15   0.000      .091592    .2559362
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(4)    =      16.36
                                                  Prob > chi2     =     0.0026
                                                  R-squared       =          .
                                                  Root MSE        =     .81385

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -1.507842    1.97499    -0.76   0.445    -5.378752    2.363068
secgenhighedu |   1.748045   2.312895     0.76   0.450    -2.785146    6.281235
       tenure |   .0257191   .0290419     0.89   0.376     -.031202    .0826402
    tenuresqr |  -.0006318    .001527    -0.41   0.679    -.0036246    .0023611
        _cons |   8.382168   .1285227    65.22   0.000     8.130268    8.634068
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.75838  (p = 0.4151)
  Wu-Hausman F(2,1439)            =  .876002  (p = 0.4167)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .017641  (p = 0.8943)
  Basmann chi2(1)        =  .017568  (p = 0.8946)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.170  Chi-sq(5) P-value = 0.9477

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu se
> cgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 
> 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(19, 1426)   =   6.60
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0808
                                                        Adj R-squared = 0.0685
                                                        Root MSE      = 0.4771

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0255062   .0066892     3.81   0.000     .0123845     .038628
    tenuresqr |  -.0005589   .0003084    -1.81   0.070    -.0011638    .0000461
 provincedum2 |  -.3138946   .0670668    -4.68   0.000    -.4454548   -.1823344
 provincedum3 |  -.2395948   .0731064    -3.28   0.001    -.3830023   -.0961872
 provincedum4 |   -.303859   .0659313    -4.61   0.000    -.4331918   -.1745262
 provincedum5 |  -.2901394   .0616139    -4.71   0.000    -.4110031   -.1692757
 provincedum6 |  -.3604392   .0711169    -5.07   0.000    -.4999442   -.2209342
 provincedum7 |  -.2537423   .0655909    -3.87   0.000    -.3824073   -.1250773
 provincedum8 |  -.2178664    .065713    -3.32   0.001     -.346771   -.0889617
 provincedum9 |  -.3101175   .0648537    -4.78   0.000    -.4373364   -.1828986
provincedum10 |  -.2426944   .0663191    -3.66   0.000    -.3727879   -.1126009
provincedum11 |  -.3750174   .0574568    -6.53   0.000    -.4877263   -.2623084
provincedum12 |  -.1924749   .0782689    -2.46   0.014    -.3460094   -.0389403
provincedum13 |   -.296438   .0681546    -4.35   0.000     -.430132    -.162744
provincedum14 |  -.2457407   .0831333    -2.96   0.003    -.4088173   -.0826641
provincedum15 |  -.1841513   .0843363    -2.18   0.029    -.3495878   -.0187148
            t |   .0000573   .0016116     0.04   0.972    -.0031041    .0032187
            d |   .0102263   .0494005     0.21   0.836    -.0866792    .1071317
           td |   .0033874   .0023533     1.44   0.150     -.001229    .0080038
        _cons |   .4863779   .0630541     7.71   0.000     .3626892    .6100667
-------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(19, 1426)   =   5.11
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0638
                                                        Adj R-squared = 0.0513
                                                        Root MSE      = 0.4649

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0306385   .0065184     4.70   0.000     .0178518    .0434253
    tenuresqr |  -.0010252   .0003005    -3.41   0.001    -.0016147   -.0004357
 provincedum2 |  -.3474736   .0653544    -5.32   0.000    -.4756747   -.2192726
 provincedum3 |  -.2209132   .0712397    -3.10   0.002    -.3606592   -.0811673
 provincedum4 |  -.2373099   .0642479    -3.69   0.000    -.3633405   -.1112794
 provincedum5 |  -.1972163   .0600407    -3.28   0.001    -.3149939   -.0794386
 provincedum6 |  -.3184772   .0693011    -4.60   0.000    -.4544202   -.1825342
 provincedum7 |  -.1815978   .0639162    -2.84   0.005    -.3069776    -.056218
 provincedum8 |  -.1451614   .0640352    -2.27   0.024    -.2707747   -.0195481
 provincedum9 |  -.2221021   .0631978    -3.51   0.000    -.3460727   -.0981315
provincedum10 |  -.2250134   .0646258    -3.48   0.001    -.3517852   -.0982416
provincedum11 |  -.2939932   .0559898    -5.25   0.000    -.4038244   -.1841621
provincedum12 |  -.1530439   .0762705    -2.01   0.045    -.3026583   -.0034296
provincedum13 |  -.2552752   .0664144    -3.84   0.000    -.3855556   -.1249949
provincedum14 |  -.2952313   .0810106    -3.64   0.000    -.4541441   -.1363185
provincedum15 |  -.1802783   .0821829    -2.19   0.028    -.3414906   -.0190659
            t |   .0010521   .0015705     0.67   0.503    -.0020286    .0041327
            d |   .0007809   .0481391     0.02   0.987    -.0936502    .0952121
           td |   .0014583   .0022933     0.64   0.525    -.0030403    .0059568
        _cons |   .4036155   .0614441     6.57   0.000     .2830849    .5241461
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(18)   =      64.25
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .78558

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -1.387286   2.093127    -0.66   0.507     -5.48974    2.715167
secgenhighedu |   1.566909   2.476523     0.63   0.527    -3.286986    6.420804
       tenure |   .0250257   .0304577     0.82   0.411    -.0346703    .0847216
    tenuresqr |  -.0006134   .0015978    -0.38   0.701     -.003745    .0025182
 provincedum2 |  -.3050072   .2883732    -1.06   0.290    -.8702084     .260194
 provincedum3 |  -.1717972   .1770397    -0.97   0.332    -.5187886    .1751943
 provincedum4 |  -.3673985   .1861683    -1.97   0.048    -.7322818   -.0025153
 provincedum5 |  -.0567184   .2030002    -0.28   0.780    -.4545914    .3411546
 provincedum6 |  -.1044654   .2184094    -0.48   0.632    -.5325399    .3236091
 provincedum7 |  -.2398754   .1757165    -1.37   0.172    -.5842733    .1045226
 provincedum8 |  -.4395433   .1732869    -2.54   0.011    -.7791794   -.0999072
 provincedum9 |  -.1488041   .2019062    -0.74   0.461    -.5445331    .2469248
provincedum10 |  -.0522804   .1733196    -0.30   0.763    -.3919806    .2874197
provincedum11 |  -.0833533   .2047196    -0.41   0.684    -.4845964    .3178897
provincedum12 |  -.2083916   .1598714    -1.30   0.192    -.5217339    .1049506
provincedum13 |  -.1386344   .1846135    -0.75   0.453    -.5004702    .2232014
provincedum14 |  -.1435849   .2917078    -0.49   0.623    -.7153217    .4281518
provincedum15 |  -.3206048   .1795218    -1.79   0.074     -.672461    .0312515
        _cons |   8.571334   .2659308    32.23   0.000     8.050119    9.092549
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.71041  (p = 0.4252)
  Wu-Hausman F(2,1425)            =  .843783  (p = 0.4303)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .005421  (p = 0.9413)
  Basmann chi2(1)        =  .005346  (p = 0.9417)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  12.039  Chi-sq(19) P-value = 0.8840

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu = t d td ) if i
> nrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & male == 0 & educat
>  != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(5, 1259)    =  30.07
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1067
                                                        Adj R-squared = 0.1031
                                                        Root MSE      = 0.4638

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |    .025506   .0065246     3.91   0.000     .0127058    .0383062
   tenuresqr |  -.0001484   .0003075    -0.48   0.629    -.0007517    .0004548
           t |   .0001273   .0016975     0.07   0.940    -.0032029    .0034575
           d |   .0857794    .052379     1.64   0.102    -.0169804    .1885393
          td |   .0013305    .002505     0.53   0.595     -.003584    .0062451
       _cons |   .1414392    .041007     3.45   0.001     .0609896    .2218888
------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(5, 1259)    =  16.19
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0604
                                                        Adj R-squared = 0.0567
                                                        Root MSE      = 0.4518

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0310098   .0063556     4.88   0.000     .0185411    .0434785
   tenuresqr |  -.0007722   .0002995    -2.58   0.010    -.0013598   -.0001845
           t |    .001305   .0016535     0.79   0.430    -.0019389    .0045489
           d |   .0350749   .0510223     0.69   0.492    -.0650233    .1351731
          td |  -.0004095   .0024402    -0.17   0.867    -.0051967    .0043778
       _cons |   .1283101   .0399449     3.21   0.001     .0499442    .2066759
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(4)    =      97.84
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .76579

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -.3656883   1.509675    -0.24   0.809    -3.324596    2.593219
secgenhighedu |   1.481629   2.288826     0.65   0.517    -3.004387    5.967646
       tenure |   .0216547   .0373646     0.58   0.562    -.0515786     .094888
    tenuresqr |  -.0003153   .0016669    -0.19   0.850    -.0035823    .0029517
        _cons |   7.727383   .0936466    82.52   0.000     7.543839    7.910927
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.12439  (p = 0.5700)
  Wu-Hausman F(2,1258)            =  .559584  (p = 0.5716)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .240606  (p = 0.6238)
  Basmann chi2(1)        =   .23951  (p = 0.6246)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   3.148  Chi-sq(5) P-value = 0.6772

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu se
> cgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 
> 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(19, 1245)   =  10.30
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1358
                                                        Adj R-squared = 0.1226
                                                        Root MSE      = 0.4588

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0237539   .0065116     3.65   0.000      .010979    .0365289
    tenuresqr |  -.0000695   .0003069    -0.23   0.821    -.0006716    .0005325
 provincedum2 |  -.1923318   .0722329    -2.66   0.008    -.3340436   -.0506201
 provincedum3 |  -.0974934   .0792148    -1.23   0.219    -.2529026    .0579158
 provincedum4 |  -.1833498   .0706361    -2.60   0.010    -.3219287   -.0447709
 provincedum5 |  -.2630623   .0659694    -3.99   0.000    -.3924857   -.1336388
 provincedum6 |  -.2040287   .0760021    -2.68   0.007    -.3531351   -.0549223
 provincedum7 |  -.2112246   .0665895    -3.17   0.002    -.3418647   -.0805844
 provincedum8 |  -.2425775   .0679358    -3.57   0.000    -.3758588   -.1092962
 provincedum9 |  -.2538427   .0714213    -3.55   0.000    -.3939621   -.1137234
provincedum10 |    -.31664   .0676788    -4.68   0.000    -.4494171   -.1838629
provincedum11 |  -.2957779   .0618178    -4.78   0.000    -.4170565   -.1744994
provincedum12 |  -.2895454   .0734574    -3.94   0.000    -.4336594   -.1454314
provincedum13 |  -.3151382   .0708513    -4.45   0.000    -.4541393   -.1761371
provincedum14 |  -.2763166   .0819007    -3.37   0.001    -.4369953   -.1156379
provincedum15 |  -.3187777   .0811069    -3.93   0.000    -.4778989   -.1596565
            t |   .0001216   .0016856     0.07   0.943    -.0031854    .0034285
            d |   .0879894   .0521632     1.69   0.092    -.0143481     .190327
           td |   .0010975   .0024892     0.44   0.659     -.003786     .005981
        _cons |   .3825715   .0638589     5.99   0.000     .2572885    .5078544
-------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(19, 1245)   =   6.23
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0868
                                                        Adj R-squared = 0.0729
                                                        Root MSE      = 0.4479

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0291389   .0063576     4.58   0.000      .016666    .0416118
    tenuresqr |  -.0006774   .0002996    -2.26   0.024    -.0012652   -.0000896
 provincedum2 |  -.2007471    .070525    -2.85   0.004    -.3391081   -.0623862
 provincedum3 |  -.1273237   .0773417    -1.65   0.100    -.2790582    .0244108
 provincedum4 |  -.1243795   .0689659    -1.80   0.072    -.2596817    .0109227
 provincedum5 |  -.2227461   .0644095    -3.46   0.001    -.3491093   -.0963828
 provincedum6 |  -.1592924    .074205    -2.15   0.032    -.3048732   -.0137117
 provincedum7 |  -.1685131    .065015    -2.59   0.010    -.2960642    -.040962
 provincedum8 |  -.2309328   .0663294    -3.48   0.001    -.3610627    -.100803
 provincedum9 |  -.1594988   .0697325    -2.29   0.022     -.296305   -.0226926
provincedum10 |  -.3059735   .0660785    -4.63   0.000    -.4356111   -.1763359
provincedum11 |  -.2389133   .0603561    -3.96   0.000    -.3573243   -.1205024
provincedum12 |  -.2484817   .0717205    -3.46   0.001    -.3891882   -.1077753
provincedum13 |  -.2812015    .069176    -4.07   0.000    -.4169158   -.1454871
provincedum14 |  -.2525191   .0799642    -3.16   0.002    -.4093985   -.0956397
provincedum15 |  -.2805788   .0791891    -3.54   0.000    -.4359376   -.1252201
            t |   .0014328   .0016458     0.87   0.384    -.0017959    .0046616
            d |   .0334058   .0509298     0.66   0.512    -.0665119    .1333236
           td |  -.0007532   .0024303    -0.31   0.757    -.0055212    .0040148
        _cons |   .3384975    .062349     5.43   0.000     .2161769    .4608181
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(18)   =     204.29
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0665
                                                  Root MSE        =     .66575

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -.0493173   1.164253    -0.04   0.966    -2.331211    2.232576
secgenhighedu |   .8738595   1.798398     0.49   0.627    -2.650936    4.398655
       tenure |    .027265   .0293227     0.93   0.352    -.0302065    .0847364
    tenuresqr |  -.0004713   .0012525    -0.38   0.707    -.0029261    .0019836
 provincedum2 |  -.4831359   .1942756    -2.49   0.013    -.8639091   -.1023628
 provincedum3 |    -.38451   .1703269    -2.26   0.024    -.7183446   -.0506754
 provincedum4 |  -.3001895   .1234738    -2.43   0.015    -.5421937   -.0581853
 provincedum5 |   .0312031   .1704462     0.18   0.855    -.3028653    .3652716
 provincedum6 |  -.1799585   .1453906    -1.24   0.216    -.4649188    .1050019
 provincedum7 |  -.2875571   .1407236    -2.04   0.041    -.5633703   -.0117439
 provincedum8 |  -.3233971   .1980789    -1.63   0.103    -.7116246    .0648303
 provincedum9 |  -.2010374   .1346416    -1.49   0.135    -.4649301    .0628553
provincedum10 |  -.1349612   .2448413    -0.55   0.581    -.6148413    .3449189
provincedum11 |   .0470039   .1692455     0.28   0.781    -.2847113     .378719
provincedum12 |  -.1394233    .190175    -0.73   0.463    -.5121596    .2333129
provincedum13 |  -.0449573   .2149845    -0.21   0.834    -.4663193    .3764046
provincedum14 |   -.138415   .2128157    -0.65   0.515    -.5555262    .2786962
provincedum15 |  -.2403707   .2188711    -1.10   0.272    -.6693501    .1886087
        _cons |   7.929199   .2213994    35.81   0.000     7.495265    8.363134
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .460009  (p = 0.7945)
  Wu-Hausman F(2,1244)            =  .226269  (p = 0.7975)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .311858  (p = 0.5765)
  Basmann chi2(1)        =  .307003  (p = 0.5795)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  12.502  Chi-sq(19) P-value = 0.8631

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning tenure tenuresqr male (higheredu = t d td ) if inrange(t,
>  -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(6, 2704)    =  34.46
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0710
                                                        Adj R-squared = 0.0690
                                                        Root MSE      = 0.4750

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0261327   .0046989     5.56   0.000      .016919    .0353464
   tenuresqr |  -.0003826   .0002191    -1.75   0.081    -.0008122     .000047
        male |   .0079135   .0183588     0.43   0.666    -.0280852    .0439121
           t |   .0001109   .0011745     0.09   0.925    -.0021922     .002414
           d |   .0531634   .0361277     1.47   0.141    -.0176773    .1240041
          td |   .0023191   .0017236     1.35   0.179    -.0010605    .0056988
       _cons |   .1712511   .0307917     5.56   0.000     .1108735    .2316287
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(4)    =     277.18
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1394
                                                  Root MSE        =     .66102

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |   .2978303   .2426865     1.23   0.220    -.1778266    .7734871
      tenure |   .0435253   .0095888     4.54   0.000     .0247316     .062319
   tenuresqr |   -.001499   .0003306    -4.53   0.000    -.0021469   -.0008511
        male |   .2912816    .025592    11.38   0.000     .2411223     .341441
       _cons |   7.887128   .0609209   129.47   0.000     7.767725     8.00653
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .035079  (p = 0.8514)
  Wu-Hausman F(1,2705)            =  .035002  (p = 0.8516)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  2.26019  (p = 0.3230)
  Basmann chi2(2)        =  2.25623  (p = 0.3236)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   5.549  Chi-sq(6) P-value = 0.4756

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr male provincedum2-provincedum15 (highere
> du  = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) &
>  educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(20, 2690)   =  14.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0968
                                                        Adj R-squared = 0.0901
                                                        Root MSE      = 0.4696

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0250685    .004668     5.37   0.000     .0159153    .0342217
    tenuresqr |  -.0003555   .0002174    -1.64   0.102    -.0007818    .0000707
         male |   .0084826   .0181929     0.47   0.641    -.0271908     .044156
 provincedum2 |  -.2557793   .0491752    -5.20   0.000    -.3522043   -.1593544
 provincedum3 |  -.1798255   .0538031    -3.34   0.001     -.285325    -.074326
 provincedum4 |  -.2492551    .048273    -5.16   0.000    -.3439112   -.1545991
 provincedum5 |  -.2763858   .0450762    -6.13   0.000    -.3647733   -.1879983
 provincedum6 |  -.2896455   .0519854    -5.57   0.000    -.3915809   -.1877101
 provincedum7 |  -.2313754   .0467433    -4.95   0.000    -.3230319    -.139719
 provincedum8 |  -.2300903   .0472902    -4.87   0.000    -.3228192   -.1373615
 provincedum9 |  -.2818598    .048006    -5.87   0.000    -.3759923   -.1877273
provincedum10 |  -.2754803   .0474232    -5.81   0.000      -.36847   -.1824906
provincedum11 |  -.3404545   .0421515    -8.08   0.000    -.4231071   -.2578019
provincedum12 |  -.2471565   .0535184    -4.62   0.000    -.3520978   -.1422151
provincedum13 |  -.3039048   .0491976    -6.18   0.000    -.4003736   -.2074359
provincedum14 |  -.2577197   .0583798    -4.41   0.000    -.3721936   -.1432458
provincedum15 |  -.2561593   .0585109    -4.38   0.000    -.3708903   -.1414284
            t |   .0001061   .0011637     0.09   0.927    -.0021758    .0023879
            d |   .0482818   .0358526     1.35   0.178    -.0220195    .1185832
           td |   .0021909   .0017069     1.28   0.199    -.0011561     .005538
        _cons |   .4307992   .0456254     9.44   0.000     .3413349    .5202635
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(18)   =     426.17
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1763
                                                  Root MSE        =     .64669

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .2350452   .2570272     0.91   0.360    -.2687188    .7388092
       tenure |   .0407337   .0095528     4.26   0.000     .0220106    .0594568
    tenuresqr |  -.0013013   .0003242    -4.01   0.000    -.0019366   -.0006659
         male |   .2861775   .0251167    11.39   0.000     .2369497    .3354053
 provincedum2 |  -.4566494   .0956172    -4.78   0.000    -.6440557   -.2692431
 provincedum3 |  -.2883299   .0887146    -3.25   0.001    -.4622073   -.1144524
 provincedum4 |  -.2949681   .0946439    -3.12   0.002    -.4804669   -.1094694
 provincedum5 |   .0181238   .0965966     0.19   0.851     -.171202    .2074495
 provincedum6 |  -.1323089   .1066155    -1.24   0.215    -.3412715    .0766537
 provincedum7 |  -.2351354   .0895694    -2.63   0.009    -.4106882   -.0595826
 provincedum8 |  -.3783182   .0904906    -4.18   0.000    -.5556766   -.2009598
 provincedum9 |   -.106052   .0994809    -1.07   0.286    -.3010311     .088927
provincedum10 |  -.1421986   .0990386    -1.44   0.151    -.3363107    .0519134
provincedum11 |  -.0031522   .1067512    -0.03   0.976    -.2123808    .2060763
provincedum12 |  -.1872312   .0981435    -1.91   0.056     -.379589    .0051266
provincedum13 |  -.1210887   .1058284    -1.14   0.253    -.3285085    .0863311
provincedum14 |  -.2267204   .1072908    -2.11   0.035    -.4370065   -.0164343
provincedum15 |  -.3365442   .1051033    -3.20   0.001    -.5425429   -.1305454
        _cons |    8.08516   .1362541    59.34   0.000     7.818107    8.352213
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .194301  (p = 0.6594)
  Wu-Hausman F(1,2691)            =  .192881  (p = 0.6606)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  1.51572  (p = 0.4687)
  Basmann chi2(2)        =  1.50482  (p = 0.4712)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  24.672  Chi-sq(20) P-value = 0.2143

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu  = t d td ) if inrange(t, -`m
> onths', `months'-1) & inrange(monthlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(5, 1440)    =  13.86
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0459
                                                        Adj R-squared = 0.0426
                                                        Root MSE      = 0.4837

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0261546   .0067484     3.88   0.000     .0129168    .0393924
   tenuresqr |  -.0005659   .0003118    -1.81   0.070    -.0011775    .0000458
           t |  -.0000197   .0016252    -0.01   0.990    -.0032077    .0031683
           d |   .0256106   .0497917     0.51   0.607    -.0720614    .1232826
          td |   .0032521   .0023758     1.37   0.171    -.0014083    .0079125
       _cons |   .2090639   .0430956     4.85   0.000     .1245271    .2936008
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(3)    =      21.29
                                                  Prob > chi2     =     0.0001
                                                  R-squared       =          .
                                                  Root MSE        =     .70078

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |  -.0540621   .3856277    -0.14   0.889    -.8098786    .7017544
      tenure |   .0434852   .0146852     2.96   0.003     .0147027    .0722676
   tenuresqr |  -.0016898   .0005251    -3.22   0.001     -.002719   -.0006607
       _cons |   8.353906    .105879    78.90   0.000     8.146387    8.561425
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .983967  (p = 0.3212)
  Wu-Hausman F(1,1441)            =  .981232  (p = 0.3221)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .794198  (p = 0.6723)
  Basmann chi2(2)        =  .791338  (p = 0.6732)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.965  Chi-sq(5) P-value = 0.8539

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu  =
>  t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & male
>  == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(19, 1426)   =   6.60
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0808
                                                        Adj R-squared = 0.0685
                                                        Root MSE      = 0.4771

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0255062   .0066892     3.81   0.000     .0123845     .038628
    tenuresqr |  -.0005589   .0003084    -1.81   0.070    -.0011638    .0000461
 provincedum2 |  -.3138946   .0670668    -4.68   0.000    -.4454548   -.1823344
 provincedum3 |  -.2395948   .0731064    -3.28   0.001    -.3830023   -.0961872
 provincedum4 |   -.303859   .0659313    -4.61   0.000    -.4331918   -.1745262
 provincedum5 |  -.2901394   .0616139    -4.71   0.000    -.4110031   -.1692757
 provincedum6 |  -.3604392   .0711169    -5.07   0.000    -.4999442   -.2209342
 provincedum7 |  -.2537423   .0655909    -3.87   0.000    -.3824073   -.1250773
 provincedum8 |  -.2178664    .065713    -3.32   0.001     -.346771   -.0889617
 provincedum9 |  -.3101175   .0648537    -4.78   0.000    -.4373364   -.1828986
provincedum10 |  -.2426944   .0663191    -3.66   0.000    -.3727879   -.1126009
provincedum11 |  -.3750174   .0574568    -6.53   0.000    -.4877263   -.2623084
provincedum12 |  -.1924749   .0782689    -2.46   0.014    -.3460094   -.0389403
provincedum13 |   -.296438   .0681546    -4.35   0.000     -.430132    -.162744
provincedum14 |  -.2457407   .0831333    -2.96   0.003    -.4088173   -.0826641
provincedum15 |  -.1841513   .0843363    -2.18   0.029    -.3495878   -.0187148
            t |   .0000573   .0016116     0.04   0.972    -.0031041    .0032187
            d |   .0102263   .0494005     0.21   0.836    -.0866792    .1071317
           td |   .0033874   .0023533     1.44   0.150     -.001229    .0080038
        _cons |   .4863779   .0630541     7.71   0.000     .3626892    .6100667
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(17)   =      82.31
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0223
                                                  Root MSE        =     .69191

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   -.096427   .4118676    -0.23   0.815    -.9036727    .7108187
       tenure |   .0410485    .014904     2.75   0.006     .0118371    .0702599
    tenuresqr |   -.001551   .0005263    -2.95   0.003    -.0025825   -.0005194
 provincedum2 |   -.445311   .1623682    -2.74   0.006    -.7635468   -.1270751
 provincedum3 |  -.2104752   .1463385    -1.44   0.150    -.4972934    .0763429
 provincedum4 |  -.3460965   .1612656    -2.15   0.032    -.6621711   -.0300218
 provincedum5 |   .0102625   .1525564     0.07   0.946    -.2887425    .3092675
 provincedum6 |  -.1391606    .186204    -0.75   0.455    -.5041138    .2257925
 provincedum7 |  -.1974013   .1430241    -1.38   0.168    -.4777235    .0829208
 provincedum8 |  -.3865578   .1336178    -2.89   0.004    -.6484439   -.1246717
 provincedum9 |  -.0951779   .1614032    -0.59   0.555    -.4115223    .2211666
provincedum10 |  -.0911251   .1427545    -0.64   0.523    -.3709187    .1886685
provincedum11 |   -.060512   .1774827    -0.34   0.733    -.4083718    .2873477
provincedum12 |  -.2005634   .1403857    -1.43   0.153    -.4757143    .0745875
provincedum13 |  -.1589088   .1601317    -0.99   0.321    -.4727611    .1549435
provincedum14 |  -.2871277   .1615003    -1.78   0.075    -.6036625     .029407
provincedum15 |  -.3636129   .1463423    -2.48   0.013    -.6504386   -.0767871
        _cons |   8.549859   .2323051    36.80   0.000     8.094549    9.005169
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  1.15738  (p = 0.2820)
  Wu-Hausman F(1,1427)            =  1.14308  (p = 0.2852)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .523036  (p = 0.7699)
  Basmann chi2(2)        =  .515988  (p = 0.7726)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  21.438  Chi-sq(19) P-value = 0.3131

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu  = t d td ) if inrange(t, -`m
> onths', `months'-1) & inrange(monthlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(5, 1259)    =  30.07
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1067
                                                        Adj R-squared = 0.1031
                                                        Root MSE      = 0.4638

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |    .025506   .0065246     3.91   0.000     .0127058    .0383062
   tenuresqr |  -.0001484   .0003075    -0.48   0.629    -.0007517    .0004548
           t |   .0001273   .0016975     0.07   0.940    -.0032029    .0034575
           d |   .0857794    .052379     1.64   0.102    -.0169804    .1885393
          td |   .0013305    .002505     0.53   0.595     -.003584    .0062451
       _cons |   .1414392    .041007     3.45   0.001     .0609896    .2218888
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(3)    =     138.46
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1309
                                                  Root MSE        =     .64237

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |   .5814552   .3119632     1.86   0.062    -.0299814    1.192892
      tenure |   .0437872   .0126422     3.46   0.001     .0190088    .0685655
   tenuresqr |  -.0013412   .0004335    -3.09   0.002    -.0021908   -.0004915
       _cons |   7.752911   .0712495   108.81   0.000     7.613264    7.892557
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .514099  (p = 0.4734)
  Wu-Hausman F(1,1260)            =  .512276  (p = 0.4743)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .937456  (p = 0.6258)
  Basmann chi2(2)        =  .933702  (p = 0.6270)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   4.582  Chi-sq(5) P-value = 0.4690

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu = 
> t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & male 
> == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(19, 1245)   =  10.30
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1358
                                                        Adj R-squared = 0.1226
                                                        Root MSE      = 0.4588

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0237539   .0065116     3.65   0.000      .010979    .0365289
    tenuresqr |  -.0000695   .0003069    -0.23   0.821    -.0006716    .0005325
 provincedum2 |  -.1923318   .0722329    -2.66   0.008    -.3340436   -.0506201
 provincedum3 |  -.0974934   .0792148    -1.23   0.219    -.2529026    .0579158
 provincedum4 |  -.1833498   .0706361    -2.60   0.010    -.3219287   -.0447709
 provincedum5 |  -.2630623   .0659694    -3.99   0.000    -.3924857   -.1336388
 provincedum6 |  -.2040287   .0760021    -2.68   0.007    -.3531351   -.0549223
 provincedum7 |  -.2112246   .0665895    -3.17   0.002    -.3418647   -.0805844
 provincedum8 |  -.2425775   .0679358    -3.57   0.000    -.3758588   -.1092962
 provincedum9 |  -.2538427   .0714213    -3.55   0.000    -.3939621   -.1137234
provincedum10 |    -.31664   .0676788    -4.68   0.000    -.4494171   -.1838629
provincedum11 |  -.2957779   .0618178    -4.78   0.000    -.4170565   -.1744994
provincedum12 |  -.2895454   .0734574    -3.94   0.000    -.4336594   -.1454314
provincedum13 |  -.3151382   .0708513    -4.45   0.000    -.4541393   -.1761371
provincedum14 |  -.2763166   .0819007    -3.37   0.001    -.4369953   -.1156379
provincedum15 |  -.3187777   .0811069    -3.93   0.000    -.4778989   -.1596565
            t |   .0001216   .0016856     0.07   0.943    -.0031854    .0034285
            d |   .0879894   .0521632     1.69   0.092    -.0143481     .190327
           td |   .0010975   .0024892     0.44   0.659     -.003786     .005981
        _cons |   .3825715   .0638589     5.99   0.000     .2572885    .5078544
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(17)   =     238.09
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1999
                                                  Root MSE        =     .61633

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .4927106   .3086662     1.60   0.110     -.112264    1.097685
       tenure |   .0400671    .011916     3.36   0.001     .0167121     .063422
    tenuresqr |  -.0010397   .0004143    -2.51   0.012    -.0018518   -.0002276
 provincedum2 |   -.555764   .1148934    -4.84   0.000    -.7809509   -.3305772
 provincedum3 |  -.4428149   .1119124    -3.96   0.000    -.6621591   -.2234707
 provincedum4 |  -.3104176    .112635    -2.76   0.006    -.5311782   -.0896571
 provincedum5 |  -.0210671   .1223986    -0.17   0.863     -.260964    .2188298
 provincedum6 |  -.2091311   .1225867    -1.71   0.088    -.4493965    .0311344
 provincedum7 |  -.3214249   .1131754    -2.84   0.005    -.5432446   -.0996052
 provincedum8 |  -.3954639   .1215493    -3.25   0.001    -.6336962   -.1572315
 provincedum9 |  -.2051664   .1243986    -1.65   0.099    -.4489833    .0386504
provincedum10 |  -.2299577   .1364564    -1.69   0.092    -.4974074    .0374919
provincedum11 |  -.0022213   .1255138    -0.02   0.986    -.2482238    .2437813
provincedum12 |  -.1995931   .1336221    -1.49   0.135    -.4614875    .0623013
provincedum13 |  -.1198924   .1386672    -0.86   0.387    -.3916752    .1518904
provincedum14 |  -.2095579   .1429832    -1.47   0.143    -.4897999    .0706841
provincedum15 |  -.3136212   .1469008    -2.13   0.033    -.6015416   -.0257008
        _cons |   7.998311   .1570756    50.92   0.000     7.690448    8.306174
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .180829  (p = 0.6707)
  Wu-Hausman F(1,1246)            =  .178139  (p = 0.6731)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .639363  (p = 0.7264)
  Basmann chi2(2)        =  .629573  (p = 0.7299)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  15.073  Chi-sq(19) P-value = 0.7180

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1979 3years.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Fra
> me/Tenure/IV Urban ATF Tenure 1979 3years.log
  log type:  text
 closed on:   6 Aug 2024, 17:33:32
---------------------------------------------------------------------------------------------
