---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male con
> trolled/Rural/Rural 1979 Highgen FuzzyOption Male controlled.log
  log type:  text
 opened on:   8 Aug 2024, 12:51:41

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(27,895 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,455 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(34,426 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(2,298 real changes made)

. 
. *Step Two: Regressions
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01679     .01697   -0.9897  0.322   -.050047      .016463
    Bias-corrected | -.00058     .01697   -0.0342  0.973   -.033836      .032675
            Robust | -.00058     .00777   -0.0747  0.940   -.015805      .014644
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.8972      11.66   0.7630   0.445   -13.9563      31.7506
    Bias-corrected |  28.587      11.66   2.4517   0.014    5.73391      51.4408
            Robust |  28.587     13.387   2.1354   0.033    2.34894      54.8257
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01323     .01184   1.1173   0.264   -.009976      .036433
    Bias-corrected | -.00336     .01184   -0.2841  0.776   -.026568      .019841
            Robust | -.00336     .01561   -0.2155  0.829    -.03395      .027222
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.6112     6.1686   -0.4233  0.672   -14.7014      9.47897
    Bias-corrected | -8.1222     6.1686   -1.3167  0.188   -20.2124      3.96795
            Robust | -8.1222      9.161   -0.8866  0.375   -26.0774      9.83292
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs(ma
> le) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |      2021        2573            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   113.436     113.436
       BW bias (b) |   231.876     231.876
         rho (h/b) |     0.489       0.489
        Unique obs |       388         283

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00241     .00719   0.3349   0.738   -.011677      .016491
    Bias-corrected |  .00122     .00719   0.1704   0.865   -.012859      .015309
            Robust |  .00122     .00823   0.1488   0.882   -.014907      .017356
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -15.778     50.849   -0.3103  0.756   -115.441      83.8854
    Bias-corrected | -21.378     50.849   -0.4204  0.674   -121.041      78.2853
            Robust | -21.378     58.135   -0.3677  0.713    -135.32      92.5646
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06509     .07067   -0.9211  0.357   -.203605      .073419
    Bias-corrected | -.01797     .07067   -0.2542  0.799    -.15648      .120544
            Robust | -.01797      .0331   -0.5429  0.587   -.082838      .046902
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.6834     4.2456   -0.6321  0.527   -11.0046      5.63772
    Bias-corrected | -.63519     4.2456   -0.1496  0.881   -8.95633      7.68595
            Robust | -.63519     5.5635   -0.1142  0.909   -11.5394      10.2691
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05897     .05003   1.1787   0.239   -.039083      .157022
    Bias-corrected | -.01627     .05003   -0.3251  0.745   -.114319      .081787
            Robust | -.01627     .06543   -0.2486  0.804   -.144512       .11198
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.32438     2.5726   -0.1261  0.900   -5.36651      4.71775
    Bias-corrected |  4.0692     2.5726   1.5818   0.114   -.972897      9.11136
            Robust |  4.0692     3.3494   1.2149   0.224   -2.49538      10.6338
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       407        1038            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   127.882     127.882
       BW bias (b) |   204.713     204.713
         rho (h/b) |     0.625       0.625
        Unique obs |       306         261

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04836     .02782   1.7386   0.082   -.006159      .102888
    Bias-corrected |  .04972     .02782   1.7872   0.074   -.004807       .10424
            Robust |  .04972     .03333   1.4915   0.136   -.015613      .115047
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .89779     1.8319   0.4901   0.624   -2.69265      4.48822
    Bias-corrected |  .46976     1.8319   0.2564   0.798   -3.12067       4.0602
            Robust |  .46976     2.1557   0.2179   0.827   -3.75526      4.69479
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13182     .11865   -1.1110  0.267    -.36437      .100734
    Bias-corrected | -.06535     .11865   -0.5508  0.582   -.297905        .1672
            Robust | -.06535     .08206   -0.7964  0.426    -.22619      .095485
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .93762     2.6771   0.3502   0.726   -4.30946       6.1847
    Bias-corrected | -1.6745     2.6771   -0.6255  0.532   -6.92161      3.57256
            Robust | -1.6745     6.5918   -0.2540  0.799   -14.5942      11.2451
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02559     .06137   -0.4170  0.677   -.145882      .094699
    Bias-corrected | -.08128     .06137   -1.3244  0.185   -.201572      .039009
            Robust | -.08128     .09989   -0.8137  0.416   -.277065      .114502
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.3616     10.276   -0.2298  0.818   -22.5017      17.7784
    Bias-corrected |  3.2771     10.276   0.3189   0.750    -16.863      23.4172
            Robust |  3.2771     15.717   0.2085   0.835   -27.5285      34.0826
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(mal
> e) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |       117         261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   108.382     108.382
       BW bias (b) |   151.137     151.137
         rho (h/b) |     0.717       0.717
        Unique obs |       132         235

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00109     .03612   0.0301   0.976   -.069708      .071886
    Bias-corrected | -.00647     .03612   -0.1792  0.858   -.077269      .064325
            Robust | -.00647     .04627   -0.1399  0.889   -.097163      .084219
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  61.114     2021.6   0.0302   0.976    -3901.1      4023.33
    Bias-corrected |  459.81     2021.6   0.2275   0.820   -3502.41      4422.03
            Robust |  459.81     2588.8   0.1776   0.859   -4614.14      5533.76
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02601     .12852   0.2024   0.840   -.225877      .277896
    Bias-corrected |  .08307     .12852   0.6463   0.518    -.16882      .334952
            Robust |  .08307     .07353   1.1296   0.259   -.061056      .227188
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  17.886     89.984   0.1988   0.842   -158.479      194.252
    Bias-corrected | -49.712     89.984   -0.5525  0.581   -226.077      126.653
            Robust | -49.712     54.576   -0.9109  0.362   -156.678      57.2543
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17701     .09225   1.9189   0.055   -.003784      .357813
    Bias-corrected |  .10141     .09225   1.0993   0.272    -.07939      .282208
            Robust |  .10141     .11747   0.8633   0.388   -.128825      .331643
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.79254     1.3521   -0.5862  0.558   -3.44259      1.85752
    Bias-corrected |  1.7115     1.3521   1.2658   0.206   -.938576      4.36154
            Robust |  1.7115      1.731   0.9887   0.323   -1.68121      5.10417
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(mal
> e) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |       126         179            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.768      67.768
       BW bias (b) |   134.203     134.203
         rho (h/b) |     0.505       0.505
        Unique obs |       286         247

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13197     .06411   2.0585   0.040    .006319      .257627
    Bias-corrected |  .13941     .06411   2.1746   0.030    .013758      .265065
            Robust |  .13941     .07132   1.9546   0.051    -.00038      .279203
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.40464      1.249   -0.3240  0.746   -2.85272      2.04344
    Bias-corrected | -.55306      1.249   -0.4428  0.658   -3.00114      1.89502
            Robust | -.55306     1.3945   -0.3966  0.692   -3.28614      2.18003
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_
> code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01679     .01587   -1.0582  0.290   -.047895      .014311
    Bias-corrected | -.00058     .01587   -0.0366  0.971   -.031683      .030522
            Robust | -.00058     .00796   -0.0729  0.942   -.016182      .015021
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.8972     10.776   0.8256   0.409   -12.2238      30.0181
    Bias-corrected |  28.587     10.776   2.6528   0.008    7.46642      49.7082
            Robust |  28.587     15.216   1.8788   0.060   -1.23526      58.4099
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_
> code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01323     .01145   1.1552   0.248   -.009215      .035672
    Bias-corrected | -.00336     .01145   -0.2937  0.769   -.025807       .01908
            Robust | -.00336     .01264   -0.2661  0.790   -.028139      .021412
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.6112      8.633   -0.3025  0.762   -19.5317      14.3092
    Bias-corrected | -8.1222      8.633   -0.9408  0.347   -25.0427      8.79822
            Robust | -8.1222     11.357   -0.7152  0.474   -30.3812      14.1367
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs(ma
> le) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |      1459        1688            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    85.806      85.806
       BW bias (b) |   266.383     266.383
         rho (h/b) |     0.322       0.322
        Unique obs |       388         283
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00682     .00811   0.8409   0.400    -.00908      .022726
    Bias-corrected |  .00335     .00811   0.4134   0.679   -.012549      .019258
            Robust |  .00335      .0085   0.3947   0.693   -.013304      .020013
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -7.6005      14.85   -0.5118  0.609   -36.7068      21.5057
    Bias-corrected | -11.235      14.85   -0.7565  0.449   -40.3409      17.8716
            Robust | -11.235      15.35   -0.7319  0.464   -41.3196      18.8503
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06509     .06513   -0.9994  0.318   -.192753      .062566
    Bias-corrected | -.01797     .06513   -0.2759  0.783   -.145628      .109692
            Robust | -.01797     .03144   -0.5715  0.568   -.079584      .043649
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.6834     4.8396   -0.5545  0.579   -12.1688      6.80196
    Bias-corrected | -.63519     4.8396   -0.1312  0.896   -10.1206      8.85018
            Robust | -.63519     6.1852   -0.1027  0.918    -12.758      11.4877
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05897     .04879   1.2087   0.227   -.036654      .154593
    Bias-corrected | -.01627     .04879   -0.3334  0.739    -.11189      .079358
            Robust | -.01627     .05345   -0.3043  0.761   -.121033        .0885
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.32438     2.5688   -0.1263  0.900   -5.35907      4.71031
    Bias-corrected |  4.0692     2.5688   1.5841   0.113   -.965456      9.10392
            Robust |  4.0692     3.6886   1.1032   0.270   -3.16027      11.2987
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       361         825            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   114.785     114.785
       BW bias (b) |   236.879     236.879
         rho (h/b) |     0.485       0.485
        Unique obs |       306         261
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04537     .03225   1.4070   0.159   -.017831      .108571
    Bias-corrected |   .0332     .03225   1.0296   0.303       -.03      .096402
            Robust |   .0332     .03445   0.9639   0.335   -.034312      .100714
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .6098     1.7145   0.3557   0.722   -2.75058      3.97019
    Bias-corrected |  .52058     1.7145   0.3036   0.761   -2.83981      3.88097
            Robust |  .52058     1.8188   0.2862   0.775   -3.04416      4.08532
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_c
> ode)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13182     .12165   -1.0836  0.279   -.370243      .106607
    Bias-corrected | -.06535     .12165   -0.5372  0.591   -.303778      .173072
            Robust | -.06535      .0968   -0.6751  0.500   -.255083      .124378
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .93762      3.883   0.2415   0.809   -6.67283      8.54808
    Bias-corrected | -1.6745      3.883   -0.4313  0.666   -9.28498      5.93593
            Robust | -1.6745     6.1225   -0.2735  0.784   -13.6745      10.3254
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_c
> ode)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02559     .06092   -0.4201  0.674   -.144989      .093806
    Bias-corrected | -.08128     .06092   -1.3343  0.182   -.200679      .038116
            Robust | -.08128     .09844   -0.8257  0.409   -.274229      .111666
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.3616     8.9413   -0.2641  0.792   -19.8862      15.1629
    Bias-corrected |  3.2771     8.9413   0.3665   0.714   -14.2475      20.8016
            Robust |  3.2771     17.385   0.1885   0.850    -30.797      37.3511
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(mal
> e) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |       127         330            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   121.444     121.444
       BW bias (b) |   158.037     158.037
         rho (h/b) |     0.768       0.768
        Unique obs |       132         235
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00728     .02854   0.2552   0.799   -.048647      .063209
    Bias-corrected |   .0014     .02854   0.0490   0.961   -.054531      .057325
            Robust |   .0014     .03509   0.0398   0.968    -.06738      .070174
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  11.229     48.896   0.2297   0.818   -84.6049      107.063
    Bias-corrected |  14.722     48.896   0.3011   0.763    -81.112      110.556
            Robust |  14.722     61.568   0.2391   0.811   -105.949      135.393
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_c
> ode)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10          10

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02601     .11216   0.2319   0.817   -.193824      .245843
    Bias-corrected |  .08307     .11216   0.7406   0.459   -.136768        .3029
            Robust |  .08307     .08248   1.0071   0.314   -.078587      .244719
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  17.886     79.815   0.2241   0.823   -138.549      174.322
    Bias-corrected | -49.712     79.815   -0.6228  0.533   -206.147      106.723
            Robust | -49.712      63.66   -0.7809  0.435   -174.484      75.0604
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_c
> ode)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17701     .07451   2.3758   0.018    .030986      .323043
    Bias-corrected |  .10141     .07451   1.3611   0.173    -.04462      .247438
            Robust |  .10141     .07344   1.3809   0.167   -.042529      .245347
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.79254     1.2149   -0.6524  0.514   -3.17361      1.58854
    Bias-corrected |  1.7115     1.2149   1.4088   0.159   -.669598      4.09256
            Robust |  1.7115     1.0593   1.6157   0.106   -.364667      3.78763
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(mal
> e) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |       151         231            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.497      77.497
       BW bias (b) |   136.893     136.893
         rho (h/b) |     0.566       0.566
        Unique obs |       286         247
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14157     .04919   2.8779   0.004    .045153       .23798
    Bias-corrected |  .15173     .04919   3.0845   0.002    .055317      .248145
            Robust |  .15173     .05197   2.9195   0.004    .049869      .253593
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.26623     1.2686   -0.2099  0.834   -2.75264      2.22019
    Bias-corrected | -.47271     1.2686   -0.3726  0.709   -2.95913      2.01371
            Robust | -.47271     1.4829   -0.3188  0.750   -3.37911       2.4337
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02182     .02409   -0.9058  0.365    -.06904      .025397
    Bias-corrected |   .0018     .02409   0.0747   0.940    -.04542      .049017
            Robust |   .0018     .02097   0.0858   0.932   -.039312      .042909
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.4927     10.775   0.6954   0.487   -13.6256       28.611
    Bias-corrected |   34.19     10.775   3.1731   0.002    13.0715      55.3081
            Robust |   34.19     15.554   2.1981   0.028    3.70413      64.6754
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01575     .01344   1.1722   0.241   -.010584      .042084
    Bias-corrected | -.00133     .01344   -0.0993  0.921   -.027669      .024999
            Robust | -.00133     .02002   -0.0667  0.947   -.040573      .037903
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.4566     5.2656   -0.2766  0.782   -11.7769      8.86373
    Bias-corrected | -4.0848     5.2656   -0.7758  0.438   -14.4051      6.23555
            Robust | -4.0848     8.5811   -0.4760  0.634   -20.9034      12.7339
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |      1311        1439            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.503      77.503
       BW bias (b) |   192.675     192.675
         rho (h/b) |     0.402       0.402
        Unique obs |       387         282

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00785     .00896   0.8761   0.381   -.009715      .025419
    Bias-corrected |   .0114     .00896   1.2724   0.203   -.006163      .028971
            Robust |   .0114     .00963   1.1841   0.236   -.007473      .030281
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.5538     8.8721   -0.5133  0.608   -21.9427      12.8351
    Bias-corrected | -2.3599     8.8721   -0.2660  0.790   -19.7488       15.029
            Robust | -2.3599      9.512   -0.2481  0.804   -21.0031      16.2833
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.11513      .1313   -0.8769  0.381   -.372467      .142205
    Bias-corrected | -.09204      .1313   -0.7010  0.483   -.349376      .165296
            Robust | -.09204     .16098   -0.5717  0.567   -.407559      .223478
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.7543     3.0938   -0.5670  0.571   -7.81805      4.30952
    Bias-corrected |  5.6508     3.0938   1.8265   0.068   -.412954      11.7146
            Robust |  5.6508     6.8458   0.8254   0.409   -7.76672      19.0684
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07246     .06045   1.1987   0.231   -.046014      .190933
    Bias-corrected | -.01175     .06045   -0.1944  0.846   -.130228       .10672
            Robust | -.01175     .10084   -0.1166  0.907   -.209394      .185887
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.75787     2.4168   -0.3136  0.754   -5.49466      3.97892
    Bias-corrected |     3.6     2.4168   1.4896   0.136    -1.1368      8.33678
            Robust |     3.6     3.7006   0.9728   0.331   -3.65315      10.8531
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       217         309            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.131      70.131
       BW bias (b) |   119.854     119.854
         rho (h/b) |     0.585       0.585
        Unique obs |       305         260

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04015     .04154   0.9665   0.334   -.041264      .121558
    Bias-corrected |  .03736     .04154   0.8994   0.368   -.044052       .11877
            Robust |  .03736     .04952   0.7544   0.451   -.059708      .134426
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.20643     3.0908   -0.0668  0.947   -6.26437       5.8515
    Bias-corrected |  -.7322     3.0908   -0.2369  0.813   -6.79014      5.32574
            Robust |  -.7322     3.6532   -0.2004  0.841   -7.89238      6.42798
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17729     .14649   -1.2103  0.226     -.4644      .109816
    Bias-corrected | -.14985     .14649   -1.0230  0.306   -.436962      .137254
            Robust | -.14985      .1602   -0.9354  0.350   -.463833      .164125
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   1.601      2.157   0.7422   0.458   -2.62667      5.82874
    Bias-corrected |   2.415      2.157   1.1196   0.263   -1.81271       6.6427
            Robust |   2.415     5.5123   0.4381   0.661   -8.38884      13.2188
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02331     .06742   -0.3458  0.730   -.155461      .108833
    Bias-corrected | -.09009     .06742   -1.3362  0.181   -.222237      .042057
            Robust | -.09009     .11629   -0.7747  0.439   -.318023      .137844
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.2531      9.962   -0.1258  0.900   -20.7783      18.2722
    Bias-corrected |  4.5072      9.962   0.4524   0.651   -15.0181      24.0324
            Robust |  4.5072     14.922   0.3020   0.763   -24.7396      33.7539
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |       114         248            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   106.296     106.296
       BW bias (b) |   151.886     151.886
         rho (h/b) |     0.700       0.700
        Unique obs |       131         234

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00018      .0382   0.0048   0.996   -.074687      .075052
    Bias-corrected | -.00663      .0382   -0.1736  0.862   -.081501      .068238
            Robust | -.00663     .04901   -0.1353  0.892   -.102696      .089433
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  234.23      48901   0.0048   0.996   -95609.8      96078.3
    Bias-corrected |  8778.1      48901   0.1795   0.858     -87066       104622
            Robust |  8778.1      62742   0.1399   0.889    -114194       131750
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00993     .32738   -0.0303  0.976   -.651586      .631733
    Bias-corrected |  .64837     .32738   1.9805   0.048    .006713      1.29003
            Robust |  .64837     .95746   0.6772   0.498   -1.22821      2.52496
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -129.37       4262   -0.0304  0.976   -8482.65       8223.9
    Bias-corrected | -8500.2       4262   -1.9944  0.046   -16853.5     -146.934
            Robust | -8500.2      12462   -0.6821  0.495   -32925.8      15925.4
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21231      .1138   1.8657   0.062   -.010727      .435345
    Bias-corrected |  .16224      .1138   1.4257   0.154   -.060795      .385278
            Robust |  .16224     .21184   0.7659   0.444   -.252948      .577431
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.86545     1.4105   -0.6136  0.539   -3.62998      1.89909
    Bias-corrected |  2.6301     1.4105   1.8647   0.062   -.134404      5.39467
            Robust |  2.6301     2.5135   1.0464   0.295   -2.29618      7.55645
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       122         171            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.653      66.653
       BW bias (b) |   133.040     133.040
         rho (h/b) |     0.501       0.501
        Unique obs |       285         246

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14428     .07328   1.9688   0.049    .000645      .287905
    Bias-corrected |  .15415     .07328   2.1035   0.035     .01052      .297779
            Robust |  .15415     .08251   1.8683   0.062    -.00756      .315858
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.43827     1.3227   -0.3313  0.740   -3.03067      2.15414
    Bias-corrected | -.58394     1.3227   -0.4415  0.659   -3.17634      2.00847
            Robust | -.58394     1.5015   -0.3889  0.697   -3.52685      2.35897
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nn
> cluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02182     .02288   -0.9538  0.340   -.066662      .023019
    Bias-corrected |   .0018     .02288   0.0786   0.937   -.043042      .046639
            Robust |   .0018     .02226   0.0808   0.936   -.041824      .045421
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.4927      9.142   0.8196   0.412   -10.4253      25.4108
    Bias-corrected |   34.19      9.142   3.7398   0.000    16.2717      52.1078
            Robust |   34.19     16.285   2.0995   0.036     2.2722      66.1074
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nn
> cluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01575     .01294   1.2168   0.224    -.00962      .041119
    Bias-corrected | -.00133     .01294   -0.1031  0.918   -.026704      .024035
            Robust | -.00133     .01622   -0.0823  0.934   -.033121      .030452
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.4566     7.2379   -0.2012  0.841   -15.6426      12.7295
    Bias-corrected | -4.0848     7.2379   -0.5644  0.573   -18.2708      10.1013
            Robust | -4.0848     9.2968   -0.4394  0.660   -22.3062      14.1366
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster prov
> ince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |      2009        2550            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   113.236     113.236
       BW bias (b) |   226.742     226.742
         rho (h/b) |     0.499       0.499
        Unique obs |       387         282
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0027     .00871   0.3099   0.757   -.014375      .019776
    Bias-corrected |  .00254     .00871   0.2920   0.770   -.014532       .01962
            Robust |  .00254     .00941   0.2705   0.787   -.015893      .020981
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -12.646     47.956   -0.2637  0.792   -106.638       81.347
    Bias-corrected | -11.079     47.956   -0.2310  0.817   -105.072      82.9134
            Robust | -11.079     50.923   -0.2176  0.828   -110.886      88.7273
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.11513     .12045   -0.9559  0.339   -.351204      .120942
    Bias-corrected | -.09204     .12045   -0.7642  0.445   -.328113      .144033
            Robust | -.09204     .15468   -0.5950  0.552   -.395213      .211133
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.7543      3.099   -0.5661  0.571   -7.82826      4.31974
    Bias-corrected |  5.6508      3.099   1.8234   0.068   -.423168      11.7248
            Robust |  5.6508     7.7023   0.7337   0.463   -9.44544      20.7471
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07246     .05894   1.2293   0.219   -.043066      .187986
    Bias-corrected | -.01175     .05894   -0.1994  0.842    -.12728      .103772
            Robust | -.01175     .08254   -0.1424  0.887   -.173528       .15002
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.75787     2.3846   -0.3178  0.751   -5.43153      3.91578
    Bias-corrected |     3.6     2.3846   1.5097   0.131   -1.07367      8.27364
            Robust |     3.6     3.4435   1.0454   0.296   -3.14925      10.3492
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nn
> cluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       194         257            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.545      61.545
       BW bias (b) |   116.125     116.125
         rho (h/b) |     0.530       0.530
        Unique obs |       305         260
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04104     .03861   1.0629   0.288   -.034636      .116718
    Bias-corrected |  .03919     .03861   1.0149   0.310   -.036489      .114865
            Robust |  .03919     .04578   0.8561   0.392    -.05053      .128906
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.34048     3.5622   -0.0956  0.924   -7.32235       6.6414
    Bias-corrected | -.71734     3.5622   -0.2014  0.840   -7.69921      6.26454
            Robust | -.71734     4.1394   -0.1733  0.862   -8.83038      7.39571
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17729     .15058   -1.1774  0.239   -.472421      .117838
    Bias-corrected | -.14985     .15058   -0.9952  0.320   -.444983      .145276
            Robust | -.14985      .1841   -0.8140  0.416   -.510679      .210972
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   1.601     3.2746   0.4889   0.625   -4.81706      8.01913
    Bias-corrected |   2.415     3.2746   0.7375   0.461    -4.0031      8.83309
            Robust |   2.415     5.5478   0.4353   0.663   -8.45844      13.2884
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02331     .06701   -0.3479  0.728   -.154647      .108019
    Bias-corrected | -.09009     .06701   -1.3445  0.179   -.221423      .041244
            Robust | -.09009     .11445   -0.7872  0.431   -.314401      .134222
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.2531      8.703   -0.1440  0.886   -18.3106      15.8045
    Bias-corrected |  4.5072      8.703   0.5179   0.605   -12.5504      21.5647
            Robust |  4.5072     17.105   0.2635   0.792   -29.0183      38.0326
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |       111         232            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   102.608     102.608
       BW bias (b) |   145.363     145.363
         rho (h/b) |     0.706       0.706
        Unique obs |       131         234
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00413     .03374   -0.1224  0.903    -.07025      .061992
    Bias-corrected | -.01355     .03374   -0.4017  0.688   -.079673      .052568
            Robust | -.01355     .04267   -0.3176  0.751   -.097186      .070081
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -9.2031     73.403   -0.1254  0.900    -153.07      134.664
    Bias-corrected |  18.144     73.403   0.2472   0.805   -125.724      162.011
            Robust |  18.144     91.549   0.1982   0.843   -161.288      197.576
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00993     .28732   -0.0345  0.972   -.573067      .553214
    Bias-corrected |  .64837     .28732   2.2566   0.024    .085233      1.21151
            Robust |  .64837     1.1931   0.5434   0.587   -1.69001      2.98675
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -129.37     3744.2   -0.0346  0.972   -7467.78      7209.03
    Bias-corrected | -8500.2     3744.2   -2.2703  0.023   -15838.6      -1161.8
            Robust | -8500.2      15572   -0.5459  0.585   -39021.3      22020.9
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21231     .09406   2.2571   0.024    .027952      .396665
    Bias-corrected |  .16224     .09406   1.7249   0.085   -.022115      .346598
            Robust |  .16224     .12981   1.2498   0.211   -.092189      .416672
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.86545     1.3377   -0.6470  0.518   -3.48734      1.75645
    Bias-corrected |  2.6301     1.3377   1.9661   0.049    .008239      5.25203
            Robust |  2.6301     1.3152   1.9998   0.046    .052332      5.20793
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       149         238            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    78.933      78.933
       BW bias (b) |   138.127     138.127
         rho (h/b) |     0.571       0.571
        Unique obs |       285         246
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15327     .05405   2.8358   0.005    .047338        .2592
    Bias-corrected |  .16689     .05405   3.0879   0.002    .060961      .272823
            Robust |  .16689     .05813   2.8712   0.004    .052966      .280819
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.28846     1.3476   -0.2141  0.831   -2.92975      2.35283
    Bias-corrected | -.51883     1.3476   -0.3850  0.700   -3.16012      2.12246
            Robust | -.51883     1.6249   -0.3193  0.750   -3.70364      2.66598
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03032     .03453   -0.8779  0.380   -.098001      .037369
    Bias-corrected | -.00664     .03453   -0.1923  0.848   -.074326      .061045
            Robust | -.00664      .0495   -0.1341  0.893   -.103661      .090381
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.4025     11.429   0.7352   0.462   -13.9972      30.8022
    Bias-corrected |  47.336     11.429   4.1418   0.000     24.936      69.7355
            Robust |  47.336     20.933   2.2612   0.024    6.30686      88.3646
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01744     .01502   1.1614   0.245   -.011995      .046884
    Bias-corrected | -.00125     .01502   -0.0834  0.934   -.030693      .028186
            Robust | -.00125     .02576   -0.0487  0.961   -.051743      .049237
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.8201     5.2168   -0.3489  0.727    -12.045      8.40472
    Bias-corrected | -5.8051     5.2168   -1.1128  0.266     -16.03      4.41972
            Robust | -5.8051     9.4066   -0.6171  0.537   -24.2418      12.6316
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1129        1216            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.451      69.451
       BW bias (b) |   137.285     137.285
         rho (h/b) |     0.506       0.506
        Unique obs |       386         281

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00644     .01036   0.6211   0.535   -.013876       .02675
    Bias-corrected |  .00899     .01036   0.8672   0.386   -.011326        .0293
            Robust |  .00899     .01184   0.7592   0.448   -.014213      .032188
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.2259      11.09   -0.2909  0.771    -24.962      18.5103
    Bias-corrected | -3.3598      11.09   -0.3030  0.762    -25.096      18.3764
            Robust | -3.3598     12.566   -0.2674  0.789   -27.9896        21.27
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12426     .15986   -0.7773  0.437   -.437569      .189052
    Bias-corrected | -.04628     .15986   -0.2895  0.772   -.359593      .267028
            Robust | -.04628     .30751   -0.1505  0.880   -.648992      .556428
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.6136     4.1495   -0.6299  0.529   -10.7465       5.5193
    Bias-corrected |  3.5041     4.1495   0.8445   0.398   -4.62875       11.637
            Robust |  3.5041     9.8824   0.3546   0.723    -15.865      22.8733
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07806     .06368   1.2258   0.220   -.046751       .20287
    Bias-corrected | -.00087     .06368   -0.0137  0.989   -.125682      .123939
            Robust | -.00087     .11416   -0.0076  0.994   -.224629      .222885
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.56332     2.2957   -0.2454  0.806   -5.06273      3.93608
    Bias-corrected |  4.5942     2.2957   2.0012   0.045    .094776      9.09359
            Robust |  4.5942     3.6587   1.2557   0.209   -2.57682      11.7652
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       216         307            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.233      70.233
       BW bias (b) |   120.691     120.691
         rho (h/b) |     0.582       0.582
        Unique obs |       304         259

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04264      .0429   0.9939   0.320   -.041448      .126727
    Bias-corrected |  .04017      .0429   0.9364   0.349   -.043913      .124261
            Robust |  .04017     .05128   0.7834   0.433   -.060331      .140679
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00495     2.9648   -0.0017  0.999   -5.81577      5.80586
    Bias-corrected | -.46915     2.9648   -0.1582  0.874   -6.27996      5.34166
            Robust | -.46915     3.5093   -0.1337  0.894   -7.34716      6.40885
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.22112     .17963   -1.2310  0.218   -.573179      .130949
    Bias-corrected | -.31575     .17963   -1.7578  0.079   -.667819      .036309
            Robust | -.31575     .29402   -1.0739  0.283   -.892026      .260516
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .7725     1.8134   0.4260   0.670   -2.78165      4.32664
    Bias-corrected | -.65554     1.8134   -0.3615  0.718   -4.20969       2.8986
            Robust | -.65554      5.823   -0.1126  0.910   -12.0683      10.7573
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02263     .07341   -0.3082  0.758   -.166509      .121254
    Bias-corrected | -.09725     .07341   -1.3248  0.185   -.241133       .04663
            Robust | -.09725     .13566   -0.7169  0.473    -.36314      .168637
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.9903     14.379   -0.2080  0.835   -31.1725       25.192
    Bias-corrected |   5.972     14.379   0.4153   0.678   -22.2103      34.1543
            Robust |   5.972     25.025   0.2386   0.811   -43.0763      55.0203
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |       120         298            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   116.431     116.431
       BW bias (b) |   163.749     163.749
         rho (h/b) |     0.711       0.711
        Unique obs |       130         233

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00768     .03801   0.2022   0.840   -.066804      .082174
    Bias-corrected |   .0043     .03801   0.1131   0.910   -.070192      .078786
            Robust |   .0043      .0497   0.0865   0.931   -.093113      .101708
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  9.4243     49.029   0.1922   0.848   -86.6716       105.52
    Bias-corrected |  7.4701     49.029   0.1524   0.879   -88.6258      103.566
            Robust |  7.4701     63.717   0.1172   0.907   -117.413      132.353
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00993     .32738   -0.0303  0.976   -.651586      .631733
    Bias-corrected |  .64837     .32738   1.9805   0.048    .006713      1.29003
            Robust |  .64837     .95746   0.6772   0.498   -1.22821      2.52496
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -129.37       4262   -0.0304  0.976   -8482.65       8223.9
    Bias-corrected | -8500.2       4262   -1.9944  0.046   -16853.5     -146.934
            Robust | -8500.2      12462   -0.6821  0.495   -32925.8      15925.4
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21231      .1138   1.8657   0.062   -.010727      .435345
    Bias-corrected |  .16224      .1138   1.4257   0.154   -.060795      .385278
            Robust |  .16224     .21184   0.7659   0.444   -.252948      .577431
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.86545     1.4105   -0.6136  0.539   -3.62998      1.89909
    Bias-corrected |  2.6301     1.4105   1.8647   0.062   -.134404      5.39467
            Robust |  2.6301     2.5135   1.0464   0.295   -2.29618      7.55645
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       122         171            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.653      66.653
       BW bias (b) |   133.040     133.040
         rho (h/b) |     0.501       0.501
        Unique obs |       285         246

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14428     .07328   1.9688   0.049    .000645      .287905
    Bias-corrected |  .15415     .07328   2.1035   0.035     .01052      .297779
            Robust |  .15415     .08251   1.8683   0.062    -.00756      .315858
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.43827     1.3227   -0.3313  0.740   -3.03067      2.15414
    Bias-corrected | -.58394     1.3227   -0.4415  0.659   -3.17634      2.00847
            Robust | -.58394     1.5015   -0.3889  0.697   -3.52685      2.35897
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nn
> cluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03032     .03251   -0.9324  0.351   -.094039      .033407
    Bias-corrected | -.00664     .03251   -0.2042  0.838   -.070364      .057083
            Robust | -.00664     .04927   -0.1348  0.893   -.103206      .089926
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.4025     9.8402   0.8539   0.393    -10.884       27.689
    Bias-corrected |  47.336     9.8402   4.8104   0.000    28.0493      66.6222
            Robust |  47.336     23.264   2.0347   0.042    1.73954      92.9319
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nn
> cluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01744     .01441   1.2109   0.226   -.010792      .045681
    Bias-corrected | -.00125     .01441   -0.0870  0.931    -.02949      .026984
            Robust | -.00125     .02086   -0.0601  0.952   -.042131      .039625
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.8201     7.2796   -0.2500  0.803   -16.0879      12.4476
    Bias-corrected | -5.8051     7.2796   -0.7975  0.425   -20.0729      8.46263
            Robust | -5.8051     10.801   -0.5374  0.591   -26.9754      15.3652
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster prov
> ince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1174        1260            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.958      71.958
       BW bias (b) |   146.577     146.577
         rho (h/b) |     0.491       0.491
        Unique obs |       386         281
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00726     .01001   0.7251   0.468    -.01236      .026875
    Bias-corrected |  .01032     .01001   1.0306   0.303   -.009302      .029933
            Robust |  .01032     .01056   0.9765   0.329    -.01039      .031022
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.5982      12.75   -0.2822  0.778   -28.5873      21.3909
    Bias-corrected | -3.3351      12.75   -0.2616  0.794   -28.3242       21.654
            Robust | -3.3351     13.481   -0.2474  0.805    -29.757      23.0868
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12426     .14819   -0.8385  0.402   -.414702      .166186
    Bias-corrected | -.04628     .14819   -0.3123  0.755   -.336726      .244162
            Robust | -.04628     .31013   -0.1492  0.881    -.65413      .561565
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.6136     3.7024   -0.7059  0.480   -9.87024      4.64307
    Bias-corrected |  3.5041     3.7024   0.9464   0.344   -3.75252      10.7608
            Robust |  3.5041     10.377   0.3377   0.736   -16.8349      23.8431
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07806     .06207   1.2576   0.209   -.043596      .199715
    Bias-corrected | -.00087     .06207   -0.0140  0.989   -.122527      .120784
            Robust | -.00087     .09395   -0.0093  0.993   -.185016      .183272
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.56332     2.2401   -0.2515  0.801    -4.9538      3.82715
    Bias-corrected |  4.5942     2.2401   2.0509   0.040    .203709      8.98466
            Robust |  4.5942     3.1966   1.4372   0.151   -1.67108      10.8594
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nn
> cluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       194         261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.696      62.696
       BW bias (b) |   117.978     117.978
         rho (h/b) |     0.531       0.531
        Unique obs |       304         259
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04222     .03978   1.0613   0.289   -.035749      .120185
    Bias-corrected |   .0402     .03978   1.0105   0.312   -.037768      .118166
            Robust |   .0402     .04703   0.8548   0.393   -.051974      .132373
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13222     3.5117   -0.0376  0.970   -7.01511      6.75068
    Bias-corrected | -.49077     3.5117   -0.1398  0.889   -7.37366      6.39212
            Robust | -.49077     4.1065   -0.1195  0.905   -8.53931      7.55777
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.22112     .18884   -1.1709  0.242   -.591235      .149005
    Bias-corrected | -.31575     .18884   -1.6721  0.095   -.685875      .054365
            Robust | -.31575      .3367   -0.9378  0.348   -.975684      .344175
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .7725     2.4276   0.3182   0.750   -3.98553      5.53053
    Bias-corrected | -.65554     2.4276   -0.2700  0.787   -5.41357      4.10249
            Robust | -.65554     4.7551   -0.1379  0.890   -9.97536      8.66428
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02263     .07403   -0.3057  0.760   -.167717      .122462
    Bias-corrected | -.09725     .07403   -1.3137  0.189   -.242341      .047838
            Robust | -.09725      .1361   -0.7146  0.475   -.363993      .169491
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.9903     12.371   -0.2417  0.809   -27.2362      21.2557
    Bias-corrected |   5.972     12.371   0.4828   0.629    -18.274      30.2179
            Robust |   5.972     26.077   0.2290   0.819   -45.1374      57.0813
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |       131         373            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   129.536     129.536
       BW bias (b) |   171.323     171.323
         rho (h/b) |     0.756       0.756
        Unique obs |       130         233
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00744     .03118   0.2387   0.811   -.053675      .068564
    Bias-corrected |  .00576     .03118   0.1848   0.853   -.055355      .066883
            Robust |  .00576     .03857   0.1494   0.881    -.06983      .081358
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  10.593     48.136   0.2201   0.826   -83.7511      104.938
    Bias-corrected |  4.0875     48.136   0.0849   0.932   -90.2571      98.4321
            Robust |  4.0875     60.954   0.0671   0.947    -115.38      123.555
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00993     .28732   -0.0345  0.972   -.573067      .553214
    Bias-corrected |  .64837     .28732   2.2566   0.024    .085233      1.21151
            Robust |  .64837     1.1931   0.5434   0.587   -1.69001      2.98675
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -129.37     3744.2   -0.0346  0.972   -7467.78      7209.03
    Bias-corrected | -8500.2     3744.2   -2.2703  0.023   -15838.6      -1161.8
            Robust | -8500.2      15572   -0.5459  0.585   -39021.3      22020.9
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21231     .09406   2.2571   0.024    .027952      .396665
    Bias-corrected |  .16224     .09406   1.7249   0.085   -.022115      .346598
            Robust |  .16224     .12981   1.2498   0.211   -.092189      .416672
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.86545     1.3377   -0.6470  0.518   -3.48734      1.75645
    Bias-corrected |  2.6301     1.3377   1.9661   0.049    .008239      5.25203
            Robust |  2.6301     1.3152   1.9998   0.046    .052332      5.20793
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       149         238            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    78.933      78.933
       BW bias (b) |   138.127     138.127
         rho (h/b) |     0.571       0.571
        Unique obs |       285         246
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15327     .05405   2.8358   0.005    .047338        .2592
    Bias-corrected |  .16689     .05405   3.0879   0.002    .060961      .272823
            Robust |  .16689     .05813   2.8712   0.004    .052966      .280819
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.28846     1.3476   -0.2141  0.831   -2.92975      2.35283
    Bias-corrected | -.51883     1.3476   -0.3850  0.700   -3.16012      2.12246
            Robust | -.51883     1.6249   -0.3193  0.750   -3.70364      2.66598
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Rural
> /Earning Sheet 6 results.xls
dir : seeout

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male con
> trolled/Rural/Rural 1979 Highgen FuzzyOption Male controlled.log
  log type:  text
 closed on:   8 Aug 2024, 12:52:08
---------------------------------------------------------------------------------------------
