---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male 
> Exp controlled/Rural/Rural 1979 Highgen ManualD MaleExp controlled.log
  log type:  text
 opened on:   8 Aug 2024, 12:55:42

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(27,895 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,455 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(34,426 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(2,298 real changes made)

. 
. *Step Two: Regressions (Three parts Ideally: Firstly rdrobust from birthmonth to earning; S
> econdly rdrobust from birthmonth to higheredu; Thirdly rdrobust*2 or rdrobust+OLS or ivregr
> ess from higheredu to earning. Each part has 6 sheets)
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.11761     .12772   -0.9208  0.357    -.36794       .13273
    Bias-corrected | -.32162     .12772   -2.5181  0.012   -.571953     -.071283
            Robust | -.32162     .20892   -1.5394  0.124   -.731101      .087865
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1191
-------------------+----------------------            BW type       =     Manual
     Number of obs |       551         640            Kernel        =    Uniform
Eff. Number of obs |       551         640            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03267     .07584   -0.4308  0.667    -.18131      .115972
    Bias-corrected | -.06863     .07584   -0.9049  0.366   -.217266      .080015
            Robust | -.06863     .11328   -0.6058  0.545   -.290653      .153402
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs(ma
> le exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10362
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5648            Kernel        = Epanechnikov
Eff. Number of obs |      1078        1194            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.593      66.593
       BW bias (b) |   103.267     103.267
         rho (h/b) |     0.645       0.645
        Unique obs |       388         283

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01208     .05887   -0.2052  0.837   -.127475      .103308
    Bias-corrected | -.00712     .05887   -0.1209  0.904   -.122509      .108274
            Robust | -.00712     .07053   -0.1009  0.920    -.14535      .131116
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17843     .19588   0.9109   0.362    -.20549      .562358
    Bias-corrected | -.08071     .19588   -0.4120  0.680   -.464633      .303215
            Robust | -.08071     .35157   -0.2296  0.818   -.769776      .608357
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        274
-------------------+----------------------            BW type       =     Manual
     Number of obs |       131         143            Kernel        =    Uniform
Eff. Number of obs |       131         143            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01876      .1519   -0.1235  0.902   -.316474      .278947
    Bias-corrected |  .24688      .1519   1.6253   0.104   -.050834      .544587
            Robust |  .24688     .19549   1.2629   0.207   -.136277       .63003
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3372
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2367            Kernel        = Epanechnikov
Eff. Number of obs |       368         847            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   116.977     116.977
       BW bias (b) |   184.720     184.720
         rho (h/b) |     0.633       0.633
        Unique obs |       305         261

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05057     .08894   0.5686   0.570   -.123758      .224898
    Bias-corrected |   .0143     .08894   0.1607   0.872   -.160031      .188624
            Robust |   .0143     .10521   0.1359   0.892   -.191909      .220502
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07769     .34668   -0.2241  0.823   -.757169      .601788
    Bias-corrected |  .33953     .34668   0.9794   0.327   -.339946      1.01901
            Robust |  .33953     .88098   0.3854   0.700   -1.38715      2.06622
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        122
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          69            Kernel        =    Uniform
Eff. Number of obs |        53          69            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05582     .20253   0.2756   0.783   -.341126      .452762
    Bias-corrected |  .06356     .20253   0.3138   0.754   -.333384      .460504
            Robust |  .06356     .29068   0.2187   0.827   -.506162      .633282
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1021
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         822            Kernel        = Epanechnikov
Eff. Number of obs |        94         145            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    78.825      78.825
       BW bias (b) |   131.544     131.544
         rho (h/b) |     0.599       0.599
        Unique obs |       132         235

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04986     .16368   0.3046   0.761   -.270937      .370663
    Bias-corrected |  .03516     .16368   0.2148   0.830   -.285636      .355965
            Robust |  .03516     .19318   0.1820   0.856   -.343456      .413785
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .53107     .25083   2.1172   0.034    .039444      1.02269
    Bias-corrected | -.18757     .25083   -0.7478  0.455   -.679191      .304056
            Robust | -.18757     .33306   -0.5632  0.573   -.840343      .465209
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        152
-------------------+----------------------            BW type       =     Manual
     Number of obs |        78          74            Kernel        =    Uniform
Eff. Number of obs |        78          74            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.1554     .23796   -0.6531  0.514   -.621794      .310986
    Bias-corrected |  .29538     .23796   1.2413   0.214   -.171008      .761772
            Robust |  .29538     .28949   1.0203   0.308    -.27201      .862775
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2351
-------------------+----------------------            BW type       =      mserd
     Number of obs |       806        1545            Kernel        = Epanechnikov
Eff. Number of obs |       207         430            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   104.497     104.497
       BW bias (b) |   163.474     163.474
         rho (h/b) |     0.639       0.639
        Unique obs |       284         247

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03389      .1318   -0.2571  0.797   -.292205      .224426
    Bias-corrected | -.10508      .1318   -0.7973  0.425   -.363391       .15324
            Robust | -.10508     .15677   -0.6703  0.503   -.412339      .202188
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.25504     .15481   -1.6474  0.099   -.558467      .048394
    Bias-corrected | -.38277     .15481   -2.4725  0.013   -.686204     -.079344
            Robust | -.38277     .26019   -1.4711  0.141   -.892732      .127184
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        917
-------------------+----------------------            BW type       =     Manual
     Number of obs |       420         497            Kernel        =    Uniform
Eff. Number of obs |       420         497            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03058     .08823   -0.3466  0.729   -.203508      .142344
    Bias-corrected |  -.1526     .08823   -1.7296  0.084   -.325526      .020326
            Robust |  -.1526     .13432   -1.1361  0.256   -.415854      .110654
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6990
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3281            Kernel        = Epanechnikov
Eff. Number of obs |       834         863            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.628      63.628
       BW bias (b) |    98.857      98.857
         rho (h/b) |     0.644       0.644
        Unique obs |       381         281

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01721     .07092   -0.2426  0.808     -.1562      .121789
    Bias-corrected |  -.0052     .07092   -0.0733  0.942   -.144196      .133793
            Robust |  -.0052      .0848   -0.0613  0.951   -.171409      .161007
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code
> )

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.11761     .14985   -0.7848  0.433   -.411307      .176097
    Bias-corrected | -.32162     .14985   -2.1463  0.032    -.61532     -.027916
            Robust | -.32162     .23216   -1.3853  0.166   -.776648      .133412
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code
> )

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1191
-------------------+----------------------            BW type       =     Manual
     Number of obs |       551         640            Kernel        =    Uniform
Eff. Number of obs |       551         640            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03267     .10726   -0.3046  0.761   -.242901      .177563
    Bias-corrected | -.06863     .10726   -0.6398  0.522   -.278858      .141607
            Robust | -.06863     .13301   -0.5159  0.606   -.329324      .192073
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs(ma
> le exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10362
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5648            Kernel        = Epanechnikov
Eff. Number of obs |      1196        1294            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.438      71.438
       BW bias (b) |   105.368     105.368
         rho (h/b) |     0.678       0.678
        Unique obs |       388         283
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02046     .07551   -0.2710  0.786    -.16845      .127525
    Bias-corrected | -.01839     .07551   -0.2435  0.808   -.166373      .129602
            Robust | -.01839       .091   -0.2020  0.840   -.196736      .159965
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster p
> rovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17843     .23724   0.7521   0.452   -.286541      .643409
    Bias-corrected | -.08071     .23724   -0.3402  0.734   -.545684      .384266
            Robust | -.08071     .36575   -0.2207  0.825   -.797559       .63614
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster p
> rovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        274
-------------------+----------------------            BW type       =     Manual
     Number of obs |       131         143            Kernel        =    Uniform
Eff. Number of obs |       131         143            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01876     .15539   -0.1208  0.904   -.323315      .285788
    Bias-corrected |  .24688     .15539   1.5888   0.112   -.057675      .551428
            Robust |  .24688     .21082   1.1710   0.242   -.166329      .660081
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code
> )
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3372
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2367            Kernel        = Epanechnikov
Eff. Number of obs |       397        1003            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   125.482     125.482
       BW bias (b) |   181.339     181.339
         rho (h/b) |     0.692       0.692
        Unique obs |       305         261
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06135     .06939   0.8841   0.377   -.074651      .197343
    Bias-corrected |  .01473     .06939   0.2123   0.832   -.121264      .150729
            Robust |  .01473     .08487   0.1736   0.862   -.151615      .181081
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07769     .48319   -0.1608  0.872   -1.02473      .869354
    Bias-corrected |  .33953     .48319   0.7027   0.482   -.607511      1.28658
            Robust |  .33953     .75564   0.4493   0.653   -1.14149      1.82056
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        122
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          69            Kernel        =    Uniform
Eff. Number of obs |        53          69            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05582     .19723   0.2830   0.777   -.330752      .442388
    Bias-corrected |  .06356     .19723   0.3223   0.747    -.32301       .45013
            Robust |  .06356     .36902   0.1722   0.863   -.659706      .786826
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1021
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         822            Kernel        = Epanechnikov
Eff. Number of obs |        99         171            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    86.159      86.159
       BW bias (b) |   150.897     150.897
         rho (h/b) |     0.571       0.571
        Unique obs |       132         235
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06629     .13074   0.5070   0.612   -.189952      .322524
    Bias-corrected |  .04565     .13074   0.3492   0.727   -.210585      .301891
            Robust |  .04565     .14757   0.3094   0.757   -.243578      .334883
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10          10

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .53107     .27029   1.9648   0.049    .001302      1.06083
    Bias-corrected | -.18757     .27029   -0.6939  0.488   -.717333      .342198
            Robust | -.18757     .39377   -0.4763  0.634    -.95935      .584216
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        152
-------------------+----------------------            BW type       =     Manual
     Number of obs |        78          74            Kernel        =    Uniform
Eff. Number of obs |        78          74            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.1554     .23081   -0.6733  0.501   -.607777      .296969
    Bias-corrected |  .29538     .23081   1.2798   0.201   -.156991      .747755
            Robust |  .29538     .19539   1.5118   0.131   -.087568      .678333
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2351
-------------------+----------------------            BW type       =      mserd
     Number of obs |       806        1545            Kernel        = Epanechnikov
Eff. Number of obs |       261         619            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   123.806     123.806
       BW bias (b) |   175.955     175.955
         rho (h/b) |     0.704       0.704
        Unique obs |       284         247
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00157     .11462   -0.0137  0.989   -.226231      .223087
    Bias-corrected | -.06627     .11462   -0.5781  0.563   -.290929       .15839
            Robust | -.06627     .14643   -0.4526  0.651   -.353271      .220732
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.25504     .16153   -1.5789  0.114    -.57163      .061557
    Bias-corrected | -.38277     .16153   -2.3697  0.018   -.699368     -.066181
            Robust | -.38277     .26412   -1.4493  0.147   -.900435      .134886
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        917
-------------------+----------------------            BW type       =     Manual
     Number of obs |       420         497            Kernel        =    Uniform
Eff. Number of obs |       420         497            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03058     .12287   -0.2489  0.803    -.27141      .210245
    Bias-corrected |  -.1526     .12287   -1.2419  0.214   -.393428      .088227
            Robust |  -.1526     .14605   -1.0449  0.296   -.438849      .133648
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6990
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3281            Kernel        = Epanechnikov
Eff. Number of obs |       856         892            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.304      65.304
       BW bias (b) |    95.646      95.646
         rho (h/b) |     0.683       0.683
        Unique obs |       381         281
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01951     .09765   -0.1998  0.842   -.210899      .171883
    Bias-corrected |  .00217     .09765   0.0222   0.982   -.189225      .193557
            Robust |  .00217     .11813   0.0183   0.985   -.229356      .233688
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13282     .15458   -0.8592  0.390    -.43579      .170152
    Bias-corrected | -.55323     .15458   -3.5789  0.000   -.856198     -.250256
            Robust | -.55323     .29253   -1.8912  0.059   -1.12657      .020113
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1156
-------------------+----------------------            BW type       =     Manual
     Number of obs |       539         617            Kernel        =    Uniform
Eff. Number of obs |       539         617            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02011     .08075   -0.2490  0.803   -.178383      .138164
    Bias-corrected | -.04351     .08075   -0.5388  0.590   -.201784      .114763
            Robust | -.04351     .13097   -0.3322  0.740   -.300214      .213194
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10327
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4702        5625            Kernel        = Epanechnikov
Eff. Number of obs |      1066        1171            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.437      66.437
       BW bias (b) |   105.466     105.466
         rho (h/b) |     0.630       0.630
        Unique obs |       387         282

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00282     .06128   -0.0459  0.963   -.122923      .117292
    Bias-corrected | -.00043     .06128   -0.0069  0.994   -.120533      .119682
            Robust | -.00043     .07389   -0.0058  0.995   -.145239      .144389
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2088     .26613   0.7846   0.433   -.312803      .730409
    Bias-corrected | -.69154     .26613   -2.5985  0.009   -1.21314     -.169933
            Robust | -.69154     .73041   -0.9468  0.344   -2.12312      .740041
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       126         136            Kernel        =    Uniform
Eff. Number of obs |       126         136            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05186     .17263   -0.3004  0.764   -.390202      .286489
    Bias-corrected |  .30695     .17263   1.7781   0.075   -.031399      .645292
            Robust |  .30695     .25423   1.2074   0.227   -.191331      .805225
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3360
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1000        2360            Kernel        = Epanechnikov
Eff. Number of obs |       350         797            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   113.104     113.104
       BW bias (b) |   186.335     186.335
         rho (h/b) |     0.607       0.607
        Unique obs |       304         260

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03901     .09481   0.4115   0.681   -.146822      .224845
    Bias-corrected |   .0021     .09481   0.0222   0.982   -.183732      .187935
            Robust |   .0021     .11198   0.0188   0.985   -.217384      .221588
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.2672     .33851   -0.7893  0.430   -.930672      .396276
    Bias-corrected | -.30415     .33851   -0.8985  0.369   -.967626      .359322
            Robust | -.30415       .949   -0.3205  0.749   -2.16416      1.55586
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        117
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          65            Kernel        =    Uniform
Eff. Number of obs |        52          65            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02495     .20362   0.1225   0.902   -.374135      .424031
    Bias-corrected |  .00211     .20362   0.0104   0.992   -.396973      .401192
            Robust |  .00211     .28513   0.0074   0.994    -.55674       .56096
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1016
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         818            Kernel        = Epanechnikov
Eff. Number of obs |        93         141            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    78.140      78.140
       BW bias (b) |   134.822     134.822
         rho (h/b) |     0.580       0.580
        Unique obs |       131         234

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0238     .16615   0.1433   0.886   -.301845      .349447
    Bias-corrected |  .00279     .16615   0.0168   0.987   -.322854      .328438
            Robust |  .00279     .19548   0.0143   0.989   -.380339      .385922
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3758     .55244   2.4903   0.013    .293004      2.45853
    Bias-corrected | -.41371     .55244   -0.7489  0.454   -1.49647      .669058
            Robust | -.41371     1.5278   -0.2708  0.787   -3.40808      2.58067
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        74          71            Kernel        =    Uniform
Eff. Number of obs |        74          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   -.191     .29687   -0.6434  0.520   -.772844      .390848
    Bias-corrected |  .51946     .29687   1.7498   0.080   -.062388       1.1013
            Robust |  .51946     .49624   1.0468   0.295   -.453164      1.49208
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2344
-------------------+----------------------            BW type       =      mserd
     Number of obs |       802        1542            Kernel        = Epanechnikov
Eff. Number of obs |       167         290            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    87.195      87.195
       BW bias (b) |   141.131     141.131
         rho (h/b) |     0.618       0.618
        Unique obs |       283         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04498     .15836   -0.2841  0.776   -.355365      .265396
    Bias-corrected | -.10095     .15836   -0.6375  0.524   -.411328      .209433
            Robust | -.10095      .1922   -0.5252  0.599    -.47765      .275754
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.26562     .17728   -1.4983  0.134   -.613086      .081836
    Bias-corrected | -.48544     .17728   -2.7383  0.006   -.832897     -.137975
            Robust | -.48544      .3202   -1.5161  0.130   -1.11301      .142138
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        894
-------------------+----------------------            BW type       =     Manual
     Number of obs |       413         481            Kernel        =    Uniform
Eff. Number of obs |       413         481            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00525     .09236   -0.0568  0.955   -.186274      .175783
    Bias-corrected | -.12072     .09236   -1.3070  0.191   -.301748      .060308
            Robust | -.12072     .14952   -0.8074  0.419   -.413769      .172329
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6967
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        3265            Kernel        = Epanechnikov
Eff. Number of obs |       827         847            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.118      63.118
       BW bias (b) |   102.057     102.057
         rho (h/b) |     0.618       0.618
        Unique obs |       380         280

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00154     .07337   0.0210   0.983   -.142273       .14535
    Bias-corrected |  .01194     .07337   0.1627   0.871   -.131873      .155749
            Robust |  .01194     .08758   0.1363   0.892   -.159711      .183588
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13282     .14064   -0.9444  0.345   -.408464      .142826
    Bias-corrected | -.55323     .14064   -3.9337  0.000   -.828872     -.277582
            Robust | -.55323     .28193   -1.9623  0.050   -1.10579     -.000662
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1156
-------------------+----------------------            BW type       =     Manual
     Number of obs |       539         617            Kernel        =    Uniform
Eff. Number of obs |       539         617            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02011     .11157   -0.1802  0.857   -.238781      .198563
    Bias-corrected | -.04351     .11157   -0.3900  0.697   -.262182      .175161
            Robust | -.04351     .13429   -0.3240  0.746   -.306716      .219696
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province
> _code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10327
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4702        5625            Kernel        = Epanechnikov
Eff. Number of obs |      1184        1271            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.040      71.040
       BW bias (b) |   109.746     109.746
         rho (h/b) |     0.647       0.647
        Unique obs |       387         282
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01181     .07733   -0.1528  0.879    -.16338      .139754
    Bias-corrected | -.01661     .07733   -0.2148  0.830   -.168174       .13496
            Robust | -.01661     .09305   -0.1785  0.858   -.198978      .165764
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2088     .29711   0.7028   0.482   -.373526      .791132
    Bias-corrected | -.69154     .29711   -2.3275  0.020   -1.27387     -.109209
            Robust | -.69154     .77432   -0.8931  0.372   -2.20918      .826103
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       126         136            Kernel        =    Uniform
Eff. Number of obs |       126         136            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05186     .18351   -0.2826  0.778   -.411537      .307824
    Bias-corrected |  .30695     .18351   1.6726   0.094   -.052734      .666627
            Robust |  .30695     .23934   1.2825   0.200   -.162144      .776037
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nnclus
> ter province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3360
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1000        2360            Kernel        = Epanechnikov
Eff. Number of obs |       383         936            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   122.646     122.646
       BW bias (b) |   184.625     184.625
         rho (h/b) |     0.664       0.664
        Unique obs |       304         260
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05296     .07948   0.6664   0.505   -.102813      .208738
    Bias-corrected |  .00858     .07948   0.1080   0.914    -.14719       .16436
            Robust |  .00858     .09706   0.0885   0.930   -.181644      .198814
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.2672     .51868   -0.5151  0.606    -1.2838        .7494
    Bias-corrected | -.30415     .51868   -0.5864  0.558   -1.32075      .712446
            Robust | -.30415     .84526   -0.3598  0.719   -1.96084      1.35253
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        117
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          65            Kernel        =    Uniform
Eff. Number of obs |        52          65            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02495     .19161   0.1302   0.896   -.350607      .400503
    Bias-corrected |  .00211     .19161   0.0110   0.991   -.373445      .377665
            Robust |  .00211     .35454   0.0060   0.995   -.692772      .696991
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1016
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         818            Kernel        = Epanechnikov
Eff. Number of obs |        96         147            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.657      80.657
       BW bias (b) |   147.248     147.248
         rho (h/b) |     0.548       0.548
        Unique obs |       131         234
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0291     .13663   0.2130   0.831   -.238693      .296893
    Bias-corrected |  .00673     .13663   0.0492   0.961   -.261068      .274518
            Robust |  .00673      .1558   0.0432   0.966   -.298641      .312092
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3758     .46707   2.9456   0.003    .460335       2.2912
    Bias-corrected | -.41371     .46707   -0.8858  0.376   -1.32914      .501727
            Robust | -.41371     1.5636   -0.2646  0.791   -3.47838      2.65097
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        74          71            Kernel        =    Uniform
Eff. Number of obs |        74          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   -.191      .3057   -0.6248  0.532    -.79016      .408165
    Bias-corrected |  .51946      .3057   1.6992   0.089   -.079704      1.11862
            Robust |  .51946     .27541   1.8861   0.059   -.020337      1.05925
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2344
-------------------+----------------------            BW type       =      mserd
     Number of obs |       802        1542            Kernel        = Epanechnikov
Eff. Number of obs |       169         304            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    90.763      90.763
       BW bias (b) |   146.828     146.828
         rho (h/b) |     0.618       0.618
        Unique obs |       283         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04982     .18467   -0.2698  0.787   -.411766      .312121
    Bias-corrected | -.11089     .18467   -0.6005  0.548   -.472833      .251054
            Robust | -.11089     .23026   -0.4816  0.630   -.562181      .340402
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.26562     .15831   -1.6778  0.093   -.575913      .044663
    Bias-corrected | -.48544     .15831   -3.0663  0.002   -.795724     -.175148
            Robust | -.48544     .31352   -1.5483  0.122   -1.09993      .129058
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        894
-------------------+----------------------            BW type       =     Manual
     Number of obs |       413         481            Kernel        =    Uniform
Eff. Number of obs |       413         481            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00525     .12621   -0.0416  0.967   -.252606      .242115
    Bias-corrected | -.12072     .12621   -0.9565  0.339   -.368081      .126641
            Robust | -.12072     .14641   -0.8245  0.410   -.407681      .166241
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6967
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        3265            Kernel        = Epanechnikov
Eff. Number of obs |       837         865            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.489      64.489
       BW bias (b) |    98.909      98.909
         rho (h/b) |     0.652       0.652
        Unique obs |       380         280
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0011     .09813   -0.0112  0.991   -.193423      .191228
    Bias-corrected |   .0162     .09813   0.1651   0.869   -.176122      .208529
            Robust |   .0162     .11868   0.1365   0.891   -.216403       .24881
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.21093     .19785   -1.0661  0.286   -.598711      .176848
    Bias-corrected | -1.1812     .19785   -5.9700  0.000   -1.56895      -.79339
            Robust | -1.1812     .46708   -2.5289  0.011   -2.09662     -.265714
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1124
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         601            Kernel        =    Uniform
Eff. Number of obs |       523         601            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02819     .08711   -0.3236  0.746   -.198922      .142544
    Bias-corrected |   -.071     .08711   -0.8151  0.415   -.241733      .099733
            Robust |   -.071     .15561   -0.4563  0.648   -.375994      .233995
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10295
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4686        5609            Kernel        = Epanechnikov
Eff. Number of obs |      1004        1097            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.627      63.627
       BW bias (b) |   103.301     103.301
         rho (h/b) |     0.616       0.616
        Unique obs |       386         281

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00194     .06607   -0.0293  0.977   -.131434      .127558
    Bias-corrected |  .00317     .06607   0.0480   0.962   -.126327      .132665
            Robust |  .00317     .08019   0.0395   0.968   -.153999      .160336
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .34241     .30012   1.1409   0.254   -.245802      .930629
    Bias-corrected | -.53992     .30012   -1.7991  0.072   -1.12814      .048293
            Robust | -.53992     .96723   -0.5582  0.577   -2.43565       1.3558
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        259
-------------------+----------------------            BW type       =     Manual
     Number of obs |       125         134            Kernel        =    Uniform
Eff. Number of obs |       125         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0414     .17825   -0.2323  0.816   -.390763      .307962
    Bias-corrected |  .38209     .17825   2.1436   0.032     .03273      .731455
            Robust |  .38209       .274   1.3945   0.163   -.154946      .919131
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3357
-------------------+----------------------            BW type       =      mserd
     Number of obs |       999        2358            Kernel        = Epanechnikov
Eff. Number of obs |       347         782            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   112.250     112.250
       BW bias (b) |   185.899     185.899
         rho (h/b) |     0.604       0.604
        Unique obs |       303         259

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04401     .09635   0.4568   0.648   -.144833      .232861
    Bias-corrected |  .00777     .09635   0.0807   0.936   -.181072      .196622
            Robust |  .00777     .11393   0.0682   0.946    -.21552       .23107
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.11425     .37184   -0.3072  0.759    -.84305      .614555
    Bias-corrected |  .48986     .37184   1.3174   0.188   -.238943      1.21866
            Robust |  .48986     1.2112   0.4044   0.686   -1.88411      2.86383
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        114
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          63            Kernel        =    Uniform
Eff. Number of obs |        51          63            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0627     .21327   0.2940   0.769   -.355294      .480693
    Bias-corrected |  .11657     .21327   0.5466   0.585   -.301427      .534559
            Robust |  .11657     .31999   0.3643   0.716   -.510598       .74373
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1013
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         816            Kernel        = Epanechnikov
Eff. Number of obs |        90         132            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    74.253      74.253
       BW bias (b) |   129.505     129.505
         rho (h/b) |     0.573       0.573
        Unique obs |       130         233

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04519     .17616   0.2565   0.798    -.30007       .39045
    Bias-corrected |  .02734     .17616   0.1552   0.877   -.317918      .372602
            Robust |  .02734     .20801   0.1314   0.895   -.380354      .435039
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3758     .55244   2.4903   0.013    .293004      2.45853
    Bias-corrected | -.41371     .55244   -0.7489  0.454   -1.49647      .669058
            Robust | -.41371     1.5278   -0.2708  0.787   -3.40808      2.58067
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        74          71            Kernel        =    Uniform
Eff. Number of obs |        74          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   -.191     .29687   -0.6434  0.520   -.772844      .390848
    Bias-corrected |  .51946     .29687   1.7498   0.080   -.062388       1.1013
            Robust |  .51946     .49624   1.0468   0.295   -.453164      1.49208
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2344
-------------------+----------------------            BW type       =      mserd
     Number of obs |       802        1542            Kernel        = Epanechnikov
Eff. Number of obs |       167         290            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    87.195      87.195
       BW bias (b) |   141.131     141.131
         rho (h/b) |     0.618       0.618
        Unique obs |       283         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04498     .15836   -0.2841  0.776   -.355365      .265396
    Bias-corrected | -.10095     .15836   -0.6375  0.524   -.411328      .209433
            Robust | -.10095      .1922   -0.5252  0.599    -.47765      .275754
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.41256     .23438   -1.7602  0.078   -.871939      .046819
    Bias-corrected | -1.2151     .23438   -5.1844  0.000    -1.6745     -.755747
            Robust | -1.2151     .51554   -2.3570  0.018   -2.22557     -.204682
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        865
-------------------+----------------------            BW type       =     Manual
     Number of obs |       398         467            Kernel        =    Uniform
Eff. Number of obs |       398         467            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01632      .1008   -0.1619  0.871   -.213878      .181233
    Bias-corrected | -.18535      .1008   -1.8389  0.066    -.38291      .012201
            Robust | -.18535     .18161   -1.0206  0.307   -.541308      .170598
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6938
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3687        3251            Kernel        = Epanechnikov
Eff. Number of obs |       786         802            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.302      61.302
       BW bias (b) |    99.997      99.997
         rho (h/b) |     0.613       0.613
        Unique obs |       379         279

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00394     .07944   -0.0496  0.960   -.159633      .151756
    Bias-corrected |  .00818     .07944   0.1030   0.918   -.147511      .163878
            Robust |  .00818     .09602   0.0852   0.932   -.180015      .196381
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.21093     .19554   -1.0787  0.281   -.594178      .172315
    Bias-corrected | -1.1812     .19554   -6.0406  0.000   -1.56442     -.797922
            Robust | -1.1812     .49013   -2.4099  0.016   -2.14181     -.220528
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1124
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         601            Kernel        =    Uniform
Eff. Number of obs |       523         601            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02819     .12439   -0.2266  0.821   -.271991      .215613
    Bias-corrected |   -.071     .12439   -0.5708  0.568   -.314802      .172802
            Robust |   -.071     .16991   -0.4179  0.676   -.404014      .262015
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province
> _code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10295
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4686        5609            Kernel        = Epanechnikov
Eff. Number of obs |      1100        1194            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.150      68.150
       BW bias (b) |   109.262     109.262
         rho (h/b) |     0.624       0.624
        Unique obs |       386         281
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00965     .08525   -0.1132  0.910   -.176735      .157435
    Bias-corrected | -.01532     .08525   -0.1797  0.857   -.182405      .151764
            Robust | -.01532     .10307   -0.1486  0.882   -.217336      .186695
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .34241     .27321   1.2533   0.210    -.19306      .877887
    Bias-corrected | -.53992     .27321   -1.9763  0.048    -1.0754     -.004449
            Robust | -.53992     .89428   -0.6038  0.546   -2.29267      1.21283
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        259
-------------------+----------------------            BW type       =     Manual
     Number of obs |       125         134            Kernel        =    Uniform
Eff. Number of obs |       125         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0414     .18432   -0.2246  0.822   -.402652      .319851
    Bias-corrected |  .38209     .18432   2.0730   0.038    .020841      .743344
            Robust |  .38209     .24056   1.5884   0.112   -.089394      .853578
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nnclus
> ter province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3357
-------------------+----------------------            BW type       =      mserd
     Number of obs |       999        2358            Kernel        = Epanechnikov
Eff. Number of obs |       380         922            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   121.130     121.130
       BW bias (b) |   184.527     184.527
         rho (h/b) |     0.656       0.656
        Unique obs |       303         259
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05638     .08015   0.7034   0.482   -.100713      .213476
    Bias-corrected |  .01386     .08015   0.1729   0.863   -.143233      .170956
            Robust |  .01386     .09758   0.1421   0.887   -.177383      .205106
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.11425     .50713   -0.2253  0.822   -1.10821       .87971
    Bias-corrected |  .48986     .50713   0.9659   0.334   -.504099      1.48382
            Robust |  .48986     .97212   0.5039   0.614   -1.41547      2.39518
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        114
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          63            Kernel        =    Uniform
Eff. Number of obs |        51          63            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0627      .1838   0.3411   0.733   -.297543      .422942
    Bias-corrected |  .11657      .1838   0.6342   0.526   -.243677      .476809
            Robust |  .11657       .343   0.3398   0.734   -.555709      .788841
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1013
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         816            Kernel        = Epanechnikov
Eff. Number of obs |        90         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    75.296      75.296
       BW bias (b) |   141.585     141.585
         rho (h/b) |     0.532       0.532
        Unique obs |       130         233
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04559     .13696   0.3328   0.739   -.222857      .314031
    Bias-corrected |  .03109     .13696   0.2270   0.820   -.237352      .299537
            Robust |  .03109     .15488   0.2008   0.841   -.272463      .334648
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3758     .46707   2.9456   0.003    .460335       2.2912
    Bias-corrected | -.41371     .46707   -0.8858  0.376   -1.32914      .501727
            Robust | -.41371     1.5636   -0.2646  0.791   -3.47838      2.65097
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        74          71            Kernel        =    Uniform
Eff. Number of obs |        74          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   -.191      .3057   -0.6248  0.532    -.79016      .408165
    Bias-corrected |  .51946      .3057   1.6992   0.089   -.079704      1.11862
            Robust |  .51946     .27541   1.8861   0.059   -.020337      1.05925
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2344
-------------------+----------------------            BW type       =      mserd
     Number of obs |       802        1542            Kernel        = Epanechnikov
Eff. Number of obs |       169         304            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    90.763      90.763
       BW bias (b) |   146.828     146.828
         rho (h/b) |     0.618       0.618
        Unique obs |       283         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04982     .18467   -0.2698  0.787   -.411766      .312121
    Bias-corrected | -.11089     .18467   -0.6005  0.548   -.472833      .251054
            Robust | -.11089     .23026   -0.4816  0.630   -.562181      .340402
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.41256     .22133   -1.8640  0.062   -.846362      .021242
    Bias-corrected | -1.2151     .22133   -5.4901  0.000   -1.64893     -.781324
            Robust | -1.2151     .50378   -2.4120  0.016   -2.20252     -.227731
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        865
-------------------+----------------------            BW type       =     Manual
     Number of obs |       398         467            Kernel        =    Uniform
Eff. Number of obs |       398         467            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01632      .1418   -0.1151  0.908   -.294236       .26159
    Bias-corrected | -.18535      .1418   -1.3072  0.191   -.463268      .092559
            Robust | -.18535     .19581   -0.9466  0.344   -.569131      .198422
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6938
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3687        3251            Kernel        = Epanechnikov
Eff. Number of obs |       786         802            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.934      61.934
       BW bias (b) |    99.314      99.314
         rho (h/b) |     0.624       0.624
        Unique obs |       379         279
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00455     .10846   -0.0420  0.967   -.217122      .208021
    Bias-corrected |  .00926     .10846   0.0854   0.932   -.203311      .221832
            Robust |  .00926     .13205   0.0701   0.944   -.249551      .268072
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *2_2) RDD Higheredu t
. 
. *2_2_1) rdrobust on higheredu, sheet 1, no province no omitting local variables
. 
. **2_2_1_1 Pooled 
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat !=
>  ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03282     .01389   -2.3624  0.018   -.060053     -.005592
    Bias-corrected | -.01688     .01389   -1.2149  0.224   -.044109      .010352
            Robust | -.01688     .01359   -1.2419  0.214   -.043517       .00976
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", replace ctitle(no province no 
> local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat !=
>  ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1191
-------------------+----------------------            BW type       =     Manual
     Number of obs |       551         640            Kernel        =    Uniform
Eff. Number of obs |       551         640            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01668     .01056   1.5800   0.114   -.004012      .037374
    Bias-corrected | -.00556     .01056   -0.5266  0.598   -.026253      .015133
            Robust | -.00556     .01438   -0.3866  0.699   -.033749      .022629
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat != ., covs(male exp exps
> qr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10362
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5648            Kernel        = Epanechnikov
Eff. Number of obs |       593         704            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    38.697      38.697
       BW bias (b) |    69.142      69.142
         rho (h/b) |     0.560       0.560
        Unique obs |       388         283

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01058     .00995   1.0636   0.288   -.008921      .030091
    Bias-corrected |  .01152     .00995   1.1572   0.247   -.007989      .031023
            Robust |  .01152     .01144   1.0071   0.314   -.010897       .03393
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & (educat==
> 1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06418     .05755   -1.1152  0.265   -.176983      .048617
    Bias-corrected | -.04807     .05755   -0.8352  0.404   -.160866      .064733
            Robust | -.04807     .04744   -1.0132  0.311   -.141044       .04491
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & (educat==
> 1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        274
-------------------+----------------------            BW type       =     Manual
     Number of obs |       131         143            Kernel        =    Uniform
Eff. Number of obs |       131         143            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07028      .0435   1.6157   0.106   -.014975      .155544
    Bias-corrected | -.01573      .0435   -0.3615  0.718   -.100986      .069532
            Robust | -.01573     .05927   -0.2653  0.791   -.131902      .100448
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat==2), covs(m
> ale exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3372
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2367            Kernel        = Epanechnikov
Eff. Number of obs |       152         190            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.342      47.342
       BW bias (b) |    84.809      84.809
         rho (h/b) |     0.558       0.558
        Unique obs |       305         261

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05716     .03909   1.4623   0.144   -.019456      .133781
    Bias-corrected |  .05669     .03909   1.4503   0.147   -.019924      .133313
            Robust |  .05669      .0451   1.2570   0.209   -.031706      .145094
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_3 SecVoc
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02708     .10138   -0.2671  0.789   -.225772      .171617
    Bias-corrected |  .02996     .10138   0.2955   0.768   -.168735      .228654
            Robust |  .02996     .10607   0.2825   0.778   -.177927      .237847
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        122
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          69            Kernel        =    Uniform
Eff. Number of obs |        53          69            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01409       .058   -0.2429  0.808   -.127759      .099587
    Bias-corrected | -.06921       .058   -1.1933  0.233   -.182879      .044467
            Robust | -.06921     .09438   -0.7333  0.463   -.254178      .115766
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1021
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         822            Kernel        = Epanechnikov
Eff. Number of obs |        94         142            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.131      77.131
       BW bias (b) |   122.841     122.841
         rho (h/b) |     0.628       0.628
        Unique obs |       132         235

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02333     .04259   -0.5478  0.584   -.106806      .060142
    Bias-corrected |  -.0408     .04259   -0.9581  0.338   -.124279      .042669
            Robust |  -.0408     .05212   -0.7828  0.434   -.142964      .061355
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_4 SecGen
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06922     .09772   -0.7084  0.479   -.260748      .122301
    Bias-corrected | -.04925     .09772   -0.5040  0.614    -.24077      .142278
            Robust | -.04925     .08036   -0.6128  0.540   -.206747      .108255
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        152
-------------------+----------------------            BW type       =     Manual
     Number of obs |        78          74            Kernel        =    Uniform
Eff. Number of obs |        78          74            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1557     .07579   2.0545   0.040    .007165      .304244
    Bias-corrected |  .04482     .07579   0.5914   0.554   -.103719       .19336
            Robust |  .04482     .10342   0.4334   0.665   -.157885      .247526
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2351
-------------------+----------------------            BW type       =      mserd
     Number of obs |       806        1545            Kernel        = Epanechnikov
Eff. Number of obs |        88         102            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.057      47.057
       BW bias (b) |    86.090      86.090
         rho (h/b) |     0.547       0.547
        Unique obs |       284         247

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13167     .06637   1.9839   0.047    .001588      .261746
    Bias-corrected |  .13034     .06637   1.9638   0.050    .000257      .260415
            Robust |  .13034     .07617   1.7112   0.087   -.018947      .279619
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_5 SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        917
-------------------+----------------------            BW type       =     Manual
     Number of obs |       420         497            Kernel        =    Uniform
Eff. Number of obs |       420         497            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6990
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3281            Kernel        = Epanechnikov
Eff. Number of obs |      3708        3281            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       381         281

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *2_2_2) rdrobust on higheredu, sheet 2, province-clustered no omitting local variables
. 
. **2_2_2_1 Pooled 
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat !=
>  ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03282     .01391   -2.3598  0.018   -.060083     -.005562
    Bias-corrected | -.01688     .01391   -1.2135  0.225    -.04414      .010382
            Robust | -.01688     .01509   -1.1182  0.263   -.046463      .012706
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", replace ctitle(province-cluste
> red no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat !=
>  ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1191
-------------------+----------------------            BW type       =     Manual
     Number of obs |       551         640            Kernel        =    Uniform
Eff. Number of obs |       551         640            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01668     .01105   1.5090   0.131   -.004986      .038347
    Bias-corrected | -.00556     .01105   -0.5029  0.615   -.027226      .016107
            Robust | -.00556     .01274   -0.4365  0.662   -.030524      .019404
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat != ., covs(male exp exps
> qr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10362
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5648            Kernel        = Epanechnikov
Eff. Number of obs |       593         704            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    38.121      38.121
       BW bias (b) |    71.239      71.239
         rho (h/b) |     0.535       0.535
        Unique obs |       388         283
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01064     .01032   1.0315   0.302   -.009581      .030871
    Bias-corrected |  .01117     .01032   1.0828   0.279   -.009052      .031401
            Robust |  .01117     .01172   0.9534   0.340   -.011798      .034146
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & (educat==
> 1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06418     .06386   -1.0051  0.315   -.189341      .060975
    Bias-corrected | -.04807     .06386   -0.7527  0.452   -.173225      .077092
            Robust | -.04807     .04739   -1.0144  0.310   -.140942      .044809
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & (educat==
> 1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        274
-------------------+----------------------            BW type       =     Manual
     Number of obs |       131         143            Kernel        =    Uniform
Eff. Number of obs |       131         143            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07028     .04129   1.7022   0.089   -.010644      .151213
    Bias-corrected | -.01573     .04129   -0.3809  0.703   -.096655      .065201
            Robust | -.01573     .05435   -0.2893  0.772   -.122261      .090807
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat==2), covs(m
> ale exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3372
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2367            Kernel        = Epanechnikov
Eff. Number of obs |       145         181            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    45.803      45.803
       BW bias (b) |    82.634      82.634
         rho (h/b) |     0.554       0.554
        Unique obs |       305         261
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05731     .03886   1.4749   0.140    -.01885      .133465
    Bias-corrected |  .05715     .03886   1.4707   0.141   -.019012      .133303
            Robust |  .05715     .04518   1.2648   0.206   -.031412      .145703
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_3 SecVoc
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02708     .08981   -0.3015  0.763   -.203106       .14895
    Bias-corrected |  .02996     .08981   0.3336   0.739   -.146068      .205988
            Robust |  .02996     .10752   0.2786   0.781   -.180783      .240702
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        122
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          69            Kernel        =    Uniform
Eff. Number of obs |        53          69            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01409     .05776   -0.2439  0.807   -.127296      .099124
    Bias-corrected | -.06921     .05776   -1.1981  0.231   -.182416      .044004
            Robust | -.06921     .09379   -0.7379  0.461   -.253027      .114615
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1021
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         822            Kernel        = Epanechnikov
Eff. Number of obs |        80         109            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.069      64.069
       BW bias (b) |   117.619     117.619
         rho (h/b) |     0.545       0.545
        Unique obs |       132         235
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01812     .04507   -0.4020  0.688   -.106444      .070209
    Bias-corrected | -.03333     .04507   -0.7396  0.460   -.121656      .054997
            Robust | -.03333     .05538   -0.6018  0.547   -.141876      .075217
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_4 SecGen
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10          10

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06922     .12201   -0.5674  0.570   -.308362      .169915
    Bias-corrected | -.04925     .12201   -0.4036  0.686   -.288384      .189892
            Robust | -.04925     .09622   -0.5118  0.609   -.237828      .139336
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        152
-------------------+----------------------            BW type       =     Manual
     Number of obs |        78          74            Kernel        =    Uniform
Eff. Number of obs |        78          74            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1557     .06022   2.5856   0.010    .037674      .273736
    Bias-corrected |  .04482     .06022   0.7443   0.457   -.073211      .162852
            Robust |  .04482     .09003   0.4978   0.619   -.131639       .22128
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2351
-------------------+----------------------            BW type       =      mserd
     Number of obs |       806        1545            Kernel        = Epanechnikov
Eff. Number of obs |        87          97            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.699      46.699
       BW bias (b) |    86.764      86.764
         rho (h/b) |     0.538       0.538
        Unique obs |       284         247
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13176     .05353   2.4613   0.014    .026837      .236685
    Bias-corrected |  .13058     .05353   2.4392   0.015    .025657      .235505
            Robust |  .13058     .06393   2.0425   0.041    .005279      .255883
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_5 SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        917
-------------------+----------------------            BW type       =     Manual
     Number of obs |       420         497            Kernel        =    Uniform
Eff. Number of obs |       420         497            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6990
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3281            Kernel        = Epanechnikov
Eff. Number of obs |      3708        3281            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       381         281
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *2_2_3) rdrobust on higheredu, sheet 3, no province no Aug-Sep
. 
. **2_2_3_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03279     .01807   -1.8145  0.070   -.068201      .002628
    Bias-corrected | -.00947     .01807   -0.5240  0.600   -.044883      .025947
            Robust | -.00947     .02176   -0.4351  0.663   -.052116       .03318
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", replace ctitle(no province no 
> Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1156
-------------------+----------------------            BW type       =     Manual
     Number of obs |       539         617            Kernel        =    Uniform
Eff. Number of obs |       539         617            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02047     .01188   1.7237   0.085   -.002806      .043751
    Bias-corrected | -.00309     .01188   -0.2604  0.795   -.026372      .020186
            Robust | -.00309     .01815   -0.1704  0.865   -.038676       .03249
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat != ., c
> ovs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10327
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4702        5625            Kernel        = Epanechnikov
Eff. Number of obs |       581         681            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    38.620      38.620
       BW bias (b) |    68.612      68.612
         rho (h/b) |     0.563       0.563
        Unique obs |       387         282

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01448     .01137   1.2733   0.203   -.007806      .036759
    Bias-corrected |  .01583     .01137   1.3924   0.164   -.006452      .038113
            Robust |  .01583     .01338   1.1830   0.237   -.010397      .042057
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07089     .09695   -0.7312  0.465   -.260909      .119124
    Bias-corrected | -.00724     .09695   -0.0746  0.940   -.197253       .18278
            Robust | -.00724     .14458   -0.0501  0.960     -.2906      .276127
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       126         136            Kernel        =    Uniform
Eff. Number of obs |       126         136            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09143     .05213   1.7539   0.079   -.010743      .193594
    Bias-corrected |  .00261     .05213   0.0500   0.960    -.09956      .104778
            Robust |  .00261     .08992   0.0290   0.977   -.173639      .178857
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (educat==1 | e
> ducat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3360
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1000        2360            Kernel        = Epanechnikov
Eff. Number of obs |       147         183            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.334      47.334
       BW bias (b) |    86.496      86.496
         rho (h/b) |     0.547       0.547
        Unique obs |       304         260

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07535     .04671   1.6132   0.107   -.016199      .166908
    Bias-corrected |  .07707     .04671   1.6500   0.099   -.014479      .168628
            Robust |  .07707     .05506   1.3998   0.162   -.030847      .184996
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04735     .12401   -0.3818  0.703   -.290396      .195698
    Bias-corrected |  .03898     .12401   0.3143   0.753   -.204071      .282023
            Robust |  .03898     .19353   0.2014   0.840   -.340337      .418289
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        117
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          65            Kernel        =    Uniform
Eff. Number of obs |        52          65            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00955     .06369   -0.1500  0.881   -.134389      .115282
    Bias-corrected | -.07243     .06369   -1.1371  0.255   -.197262      .052409
            Robust | -.07243     .10993   -0.6589  0.510   -.287876      .143023
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==1, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1016
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         818            Kernel        = Epanechnikov
Eff. Number of obs |        93         138            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.997      77.997
       BW bias (b) |   125.792     125.792
         rho (h/b) |     0.620       0.620
        Unique obs |       131         234

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0231     .04505   -0.5127  0.608   -.111402      .065207
    Bias-corrected | -.04036     .04505   -0.8958  0.370   -.128663      .047946
            Robust | -.04036     .05541   -0.7283  0.466   -.148967       .06825
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09718      .2238   -0.4342  0.664   -.535829      .341469
    Bias-corrected |  .23416      .2238   1.0463   0.295   -.204491      .672808
            Robust |  .23416     .55171   0.4244   0.671   -.847177      1.31549
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        74          71            Kernel        =    Uniform
Eff. Number of obs |        74          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2014     .09314   2.1624   0.031    .018858      .383944
    Bias-corrected |  .10791     .09314   1.1587   0.247    -.07463      .290455
            Robust |  .10791     .18322   0.5890   0.556   -.251195       .46702
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==2, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2344
-------------------+----------------------            BW type       =      mserd
     Number of obs |       802        1542            Kernel        = Epanechnikov
Eff. Number of obs |        83          94            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.114      46.114
       BW bias (b) |    86.499      86.499
         rho (h/b) |     0.533       0.533
        Unique obs |       283         246

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17224     .08167   2.1089   0.035    .012168      .332314
    Bias-corrected |  .17873     .08167   2.1884   0.029     .01866      .338807
            Robust |  .17873     .09596   1.8625   0.063   -.009351      .366818
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        894
-------------------+----------------------            BW type       =     Manual
     Number of obs |       413         481            Kernel        =    Uniform
Eff. Number of obs |       413         481            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==3, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6967
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        3265            Kernel        = Epanechnikov
Eff. Number of obs |      3701        3265            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       380         280

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *2_2_4) rdrobust on higheredu, sheet 4, province-clustered no Aug-Sep
. 
. **2_2_4_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03279     .01668   -1.9654  0.049   -.065482     -.000091
    Bias-corrected | -.00947     .01668   -0.5676  0.570   -.042163      .023227
            Robust | -.00947     .01814   -0.5221  0.602   -.045014      .026078
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", replace ctitle(province-cluste
> red no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1156
-------------------+----------------------            BW type       =     Manual
     Number of obs |       539         617            Kernel        =    Uniform
Eff. Number of obs |       539         617            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02047     .01227   1.6686   0.095   -.003574      .044519
    Bias-corrected | -.00309     .01227   -0.2521  0.801   -.027139      .020954
            Robust | -.00309     .01551   -0.1995  0.842   -.033482      .027297
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat != ., c
> ovs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10327
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4702        5625            Kernel        = Epanechnikov
Eff. Number of obs |       595         696            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    39.036      39.036
       BW bias (b) |    69.816      69.816
         rho (h/b) |     0.559       0.559
        Unique obs |       387         282
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01437     .01153   1.2467   0.212   -.008223      .036973
    Bias-corrected |  .01558     .01153   1.3513   0.177   -.007018      .038179
            Robust |  .01558      .0134   1.1629   0.245   -.010679      .041839
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07089     .10311   -0.6876  0.492    -.27298      .131195
    Bias-corrected | -.00724     .10311   -0.0702  0.944   -.209324      .194851
            Robust | -.00724     .11469   -0.0631  0.950   -.232027      .217554
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       126         136            Kernel        =    Uniform
Eff. Number of obs |       126         136            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09143      .0491   1.8619   0.063   -.004816      .187666
    Bias-corrected |  .00261      .0491   0.0531   0.958   -.093632       .09885
            Robust |  .00261     .07985   0.0327   0.974   -.153893      .159111
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (educat==1 | e
> ducat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provinc
> e_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3360
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1000        2360            Kernel        = Epanechnikov
Eff. Number of obs |       140         174            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    45.967      45.967
       BW bias (b) |    83.567      83.567
         rho (h/b) |     0.550       0.550
        Unique obs |       304         260
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07632      .0456   1.6737   0.094   -.013053      .165686
    Bias-corrected |  .07777      .0456   1.7055   0.088   -.011601      .167138
            Robust |  .07777     .05405   1.4387   0.150   -.028174      .183712
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04735      .1084   -0.4368  0.662   -.259811      .165112
    Bias-corrected |  .03898      .1084   0.3596   0.719   -.173485      .251437
            Robust |  .03898     .17427   0.2237   0.823   -.302581      .380533
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        117
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          65            Kernel        =    Uniform
Eff. Number of obs |        52          65            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00955     .06352   -0.1504  0.880   -.134055      .114947
    Bias-corrected | -.07243     .06352   -1.1402  0.254   -.196928      .052075
            Robust | -.07243     .10918   -0.6634  0.507   -.286418      .141565
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==1, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1016
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         818            Kernel        = Epanechnikov
Eff. Number of obs |        87         121            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.476      70.476
       BW bias (b) |   124.560     124.560
         rho (h/b) |     0.566       0.566
        Unique obs |       131         234
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02274     .04441   -0.5120  0.609   -.109785      .064305
    Bias-corrected | -.03708     .04441   -0.8348  0.404    -.12412       .04997
            Robust | -.03708     .05434   -0.6823  0.495   -.143571       .06942
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09718     .24782   -0.3921  0.695   -.582907      .388547
    Bias-corrected |  .23416     .24782   0.9449   0.345   -.251568      .719885
            Robust |  .23416     .55984   0.4183   0.676   -.863112      1.33143
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        74          71            Kernel        =    Uniform
Eff. Number of obs |        74          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2014     .07585   2.6553   0.008    .052742       .35006
    Bias-corrected |  .10791     .07585   1.4228   0.155   -.040746      .256571
            Robust |  .10791      .1505   0.7170   0.473   -.187054      .402879
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==2, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2344
-------------------+----------------------            BW type       =      mserd
     Number of obs |       802        1542            Kernel        = Epanechnikov
Eff. Number of obs |        83          94            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.749      46.749
       BW bias (b) |    85.844      85.844
         rho (h/b) |     0.545       0.545
        Unique obs |       283         246
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17151     .06628   2.5875   0.010    .041594      .301423
    Bias-corrected |  .17803     .06628   2.6859   0.007     .04812      .307949
            Robust |  .17803     .08127   2.1908   0.028    .018757      .337311
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        894
-------------------+----------------------            BW type       =     Manual
     Number of obs |       413         481            Kernel        =    Uniform
Eff. Number of obs |       413         481            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==3, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6967
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        3265            Kernel        = Epanechnikov
Eff. Number of obs |      3701        3265            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       380         280
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *2_2_5) rdrobust on higheredu, sheet 5, no province no July-Oct
. 
. **2_2_5_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04118     .02588   -1.5911  0.112   -.091904      .009547
    Bias-corrected | -.01624     .02588   -0.6274  0.530   -.066963      .034488
            Robust | -.01624     .04464   -0.3637  0.716   -.103734      .071259
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", replace ctitle(no province no 
> July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1124
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         601            Kernel        =    Uniform
Eff. Number of obs |       523         601            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02305     .01327   1.7363   0.083   -.002969      .049061
    Bias-corrected | -.00249     .01327   -0.1874  0.851   -.028503      .023527
            Robust | -.00249     .02329   -0.1068  0.915   -.048136       .04316
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat != ., c
> ovs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10295
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4686        5609            Kernel        = Epanechnikov
Eff. Number of obs |       565         665            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    38.043      38.043
       BW bias (b) |    68.653      68.653
         rho (h/b) |     0.554       0.554
        Unique obs |       386         281

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01706     .01312   1.3010   0.193   -.008643       .04277
    Bias-corrected |    .019     .01312   1.4483   0.148   -.006711      .044702
            Robust |    .019     .01568   1.2111   0.226   -.011746      .049737
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.08674     .11573   -0.7495  0.454   -.313571      .140084
    Bias-corrected |  .06599     .11573   0.5702   0.569   -.160833      .292822
            Robust |  .06599     .23512   0.2807   0.779   -.394826      .526815
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        259
-------------------+----------------------            BW type       =     Manual
     Number of obs |       125         134            Kernel        =    Uniform
Eff. Number of obs |       125         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09678     .05481   1.7659   0.077   -.010639      .204204
    Bias-corrected |  .01136     .05481   0.2074   0.836   -.096057      .118786
            Robust |  .01136     .10137   0.1121   0.911   -.187326      .210056
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (educat==1 | e
> ducat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3357
-------------------+----------------------            BW type       =      mserd
     Number of obs |       999        2358            Kernel        = Epanechnikov
Eff. Number of obs |       143         176            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.948      46.948
       BW bias (b) |    86.783      86.783
         rho (h/b) |     0.541       0.541
        Unique obs |       303         259

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08044     .04934   1.6305   0.103   -.016254      .177138
    Bias-corrected |  .08234     .04934   1.6689   0.095   -.014359      .179034
            Robust |  .08234     .05829   1.4126   0.158   -.031905      .196579
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07008     .15001   -0.4672  0.640   -.364092      .223922
    Bias-corrected |   .0413     .15001   0.2754   0.783   -.252702      .335312
            Robust |   .0413     .32967   0.1253   0.900   -.604843      .687453
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        114
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          63            Kernel        =    Uniform
Eff. Number of obs |        51          63            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00816     .06948   -0.1175  0.906   -.144337      .128016
    Bias-corrected | -.07639     .06948   -1.0995  0.272   -.212569      .059783
            Robust | -.07639     .12866   -0.5938  0.553   -.328555      .175768
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==1, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1013
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         816            Kernel        = Epanechnikov
Eff. Number of obs |        92         139            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    78.528      78.528
       BW bias (b) |   128.375     128.375
         rho (h/b) |     0.612       0.612
        Unique obs |       130         233

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02384     .04751   -0.5018  0.616   -.116961      .069282
    Bias-corrected | -.04012     .04751   -0.8443  0.398   -.133237      .053006
            Robust | -.04012     .05853   -0.6854  0.493   -.154829      .074599
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09718      .2238   -0.4342  0.664   -.535829      .341469
    Bias-corrected |  .23416      .2238   1.0463   0.295   -.204491      .672808
            Robust |  .23416     .55171   0.4244   0.671   -.847177      1.31549
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        74          71            Kernel        =    Uniform
Eff. Number of obs |        74          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2014     .09314   2.1624   0.031    .018858      .383944
    Bias-corrected |  .10791     .09314   1.1587   0.247    -.07463      .290455
            Robust |  .10791     .18322   0.5890   0.556   -.251195       .46702
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==2, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2344
-------------------+----------------------            BW type       =      mserd
     Number of obs |       802        1542            Kernel        = Epanechnikov
Eff. Number of obs |        83          94            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.114      46.114
       BW bias (b) |    86.499      86.499
         rho (h/b) |     0.533       0.533
        Unique obs |       283         246

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17224     .08167   2.1089   0.035    .012168      .332314
    Bias-corrected |  .17873     .08167   2.1884   0.029     .01866      .338807
            Robust |  .17873     .09596   1.8625   0.063   -.009351      .366818
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        865
-------------------+----------------------            BW type       =     Manual
     Number of obs |       398         467            Kernel        =    Uniform
Eff. Number of obs |       398         467            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==3, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6938
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3687        3251            Kernel        = Epanechnikov
Eff. Number of obs |      3686        3251            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       379         279

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *2_2_6) rdrobust on higheredu, sheet 6, province-clustered no July-Oct
. 
. **2_2_6_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04118     .02433   -1.6927  0.091   -.088859      .006502
    Bias-corrected | -.01624     .02433   -0.6675  0.504   -.063918      .031443
            Robust | -.01624     .03408   -0.4765  0.634    -.08303      .050555
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", replace ctitle(province-cluste
> red no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1124
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         601            Kernel        =    Uniform
Eff. Number of obs |       523         601            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02305     .01362   1.6924   0.091   -.003644      .049737
    Bias-corrected | -.00249     .01362   -0.1827  0.855   -.029178      .024203
            Robust | -.00249     .01958   -0.1270  0.899   -.040871      .035896
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat != ., c
> ovs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10295
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4686        5609            Kernel        = Epanechnikov
Eff. Number of obs |       565         665            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    38.393      38.393
       BW bias (b) |    68.579      68.579
         rho (h/b) |     0.560       0.560
        Unique obs |       386         281
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01692      .0132   1.2824   0.200   -.008941      .042784
    Bias-corrected |  .01892      .0132   1.4337   0.152   -.006944      .044781
            Robust |  .01892     .01566   1.2081   0.227   -.011774       .04961
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.08674     .12772   -0.6791  0.497   -.337078      .163591
    Bias-corrected |  .06599     .12772   0.5167   0.605    -.18434      .316329
            Robust |  .06599     .21585   0.3057   0.760   -.357071       .48906
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        259
-------------------+----------------------            BW type       =     Manual
     Number of obs |       125         134            Kernel        =    Uniform
Eff. Number of obs |       125         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09678      .0515   1.8792   0.060   -.004157      .197723
    Bias-corrected |  .01136      .0515   0.2207   0.825   -.089575      .112305
            Robust |  .01136     .09107   0.1248   0.901   -.167121       .18985
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (educat==1 | e
> ducat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provinc
> e_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3357
-------------------+----------------------            BW type       =      mserd
     Number of obs |       999        2358            Kernel        = Epanechnikov
Eff. Number of obs |       139         172            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    45.526      45.526
       BW bias (b) |    83.925      83.925
         rho (h/b) |     0.542       0.542
        Unique obs |       303         259
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08063     .04818   1.6734   0.094   -.013809       .17507
    Bias-corrected |  .08223     .04818   1.7065   0.088   -.012211      .176668
            Robust |  .08223     .05724   1.4366   0.151   -.029957      .194414
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07008     .14303   -0.4900  0.624    -.35042      .210251
    Bias-corrected |   .0413     .14303   0.2888   0.773   -.239031      .321641
            Robust |   .0413     .36023   0.1147   0.909    -.66474       .74735
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        114
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          63            Kernel        =    Uniform
Eff. Number of obs |        51          63            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00816     .07024   -0.1162  0.908   -.145822        .1295
    Bias-corrected | -.07639     .07024   -1.0877  0.277   -.214054      .061268
            Robust | -.07639     .13024   -0.5865  0.558   -.331665      .178879
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==1, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1013
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         816            Kernel        = Epanechnikov
Eff. Number of obs |        90         131            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    73.389      73.389
       BW bias (b) |   129.329     129.329
         rho (h/b) |     0.567       0.567
        Unique obs |       130         233
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02451     .04623   -0.5302  0.596   -.115129        .0661
    Bias-corrected | -.03766     .04623   -0.8146  0.415   -.128277      .052951
            Robust | -.03766     .05651   -0.6665  0.505   -.148419      .073093
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09718     .24782   -0.3921  0.695   -.582907      .388547
    Bias-corrected |  .23416     .24782   0.9449   0.345   -.251568      .719885
            Robust |  .23416     .55984   0.4183   0.676   -.863112      1.33143
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        74          71            Kernel        =    Uniform
Eff. Number of obs |        74          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2014     .07585   2.6553   0.008    .052742       .35006
    Bias-corrected |  .10791     .07585   1.4228   0.155   -.040746      .256571
            Robust |  .10791      .1505   0.7170   0.473   -.187054      .402879
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==2, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2344
-------------------+----------------------            BW type       =      mserd
     Number of obs |       802        1542            Kernel        = Epanechnikov
Eff. Number of obs |        83          94            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.749      46.749
       BW bias (b) |    85.844      85.844
         rho (h/b) |     0.545       0.545
        Unique obs |       283         246
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17151     .06628   2.5875   0.010    .041594      .301423
    Bias-corrected |  .17803     .06628   2.6859   0.007     .04812      .307949
            Robust |  .17803     .08127   2.1908   0.028    .018757      .337311
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        865
-------------------+----------------------            BW type       =     Manual
     Number of obs |       398         467            Kernel        =    Uniform
Eff. Number of obs |       398         467            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==3, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6938
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3687        3251            Kernel        = Epanechnikov
Eff. Number of obs |      3686        3251            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       379         279
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Rural/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male 
> Exp controlled/Rural/Rural 1979 Highgen ManualD MaleExp controlled.log
  log type:  text
 closed on:   8 Aug 2024, 12:56:47
---------------------------------------------------------------------------------------------
