---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/
> Selmlog #Job & Wages/Selmlog Urban (1) #Jobs (2) Start Wage (3) Wage Growth.log
  log type:  text
 opened on:   6 Aug 2024, 17:45:58

. use "`datapath'", clear

. ****Because the instrumental variables take too much time to run, I combine the #Jobs, Curr
> ent Job Start Wage, and Wage Growth regressions all into this .do file. If you wish to run 
> one seperately, simply delete or nullify the other two parts of regressions. Search *1) #Jo
> bs, *2) Start Wage, or *3) Wage Growth in this file to jump to the regressions!
. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. 
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *6) Instrument
. 
. gen yearat15 = birthyear+15

. local obsnum = _N

. 
. forval i =  1/`obsnum' {
  2.         
.         *extract the observation's year at age 15
.         qui sum yearat15  in `i'
  3.         local yearvalue = round(mod(r(mean),100))
  4.         
.         *get the variables' names for this observation
.         *graduates of mid and sec schools
.         if inrange(`yearvalue', 0, 9) {
  5.                 local czgrad_year = "czgrad0`yearvalue'"
  6.                 local gzgrad_year = "gzgrad0`yearvalue'"
  7.         }
  8.         else {
  9.                 local czgrad_year = "czgrad`yearvalue'"
 10.                 local gzgrad_year = "gzgrad`yearvalue'"
 11.         }
 12.         *entrants of sec and universities
.         if inrange(`yearvalue'+1, 0, 9) {
 13.                 local gzentrant_year = "gzentrant0`=`yearvalue'+1'"
 14.                 local gxentrant_year = "gxentrant0`=`yearvalue'+1'"
 15.                 local vsentrant_year = "vsentrant0`=`yearvalue'+1'"
 16.                 local tsentrant_year = "tsentrant0`=`yearvalue'+1'"
 17.         }
 18.         else{
 19.                 if `yearvalue' == 99 {
 20.                 local gzentrant_year = "gzentrant00"
 21.                 local gxentrant_year = "gxentrant00"
 22.                 local vsentrant_year = "vsentrant00"
 23.                 local tsentrant_year = "tsentrant00"
 24.                 }
 25.         else {
 26.                 local gzentrant_year = "gzentrant`=`yearvalue'+1'"
 27.                 local gxentrant_year = "gxentrant`=`yearvalue'+1'"
 28.                 local vsentrant_year = "vsentrant`=`yearvalue'+1'"
 29.                 local tsentrant_year = "tsentrant`=`yearvalue'+1'"
 30.         }
 31.         }
 32.         
.         
.         *For Ins 1 & 2: check whether the variable names exist (whether we have those years
> ' or not)
.         capture ds `czgrad_year' `gzgrad_year' `gzentrant_year' `gxentrant_year'
 33.         if _rc == 0 {
 34.                 *generate/replace the instrument
.                 capture ds ins1_secgen_entrant_relative ins2_highedu_entrant_relative
 35.                 if _rc!=0 {
 36.                         qui gen ins1_secgen_entrant_relative = `gzentrant_year'/`czgrad_
> year' if _n == `i'
 37.                         qui gen ins2_highedu_entrant_relative = `gxentrant_year'/`gzgrad
> _year' if _n == `i'
 38.                 
.                 }
 39.                 else {
 40.                         qui replace ins1_secgen_entrant_relative = `gzentrant_year'/`czg
> rad_year' if _n == `i'
 41.                         qui replace ins2_highedu_entrant_relative = `gxentrant_year'/`gz
> grad_year' if _n == `i'
 42.                 }
 43.         }
 44.         
.         *For Ins 3
.         capture ds `czgrad_year' `vsentrant_year'
 45.         if _rc == 0 {
 46.                 *generate/replace the instrument
.                 capture ds ins3_vs_entrant_relative
 47.                 if _rc!=0 {
 48.                         qui gen ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_year
> ' if _n == `i'
 49.                 }
 50.                 else {
 51.                         qui replace ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_
> year' if _n == `i'
 52.                 }
 53.         }
 54. }

. 
. 
. sum ins1_secgen_entrant_relative, d

                ins1_secgen_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1551793       .0699308
 5%     .1673149       .0699308
10%      .186534       .0699308       Obs              14,600
25%      .212766       .0699308       Sum of wgt.      14,600

50%     .2705238                      Mean           .3109947
                        Largest       Std. dev.      .1165706
75%     .4141782       .6448125
90%     .4786784       .6448125       Variance       .0135887
95%     .5186297       .6448125       Skewness       .6285488
99%     .5868049       .6448125       Kurtosis       2.318413

. sum ins2_highedu_entrant_relative, d

                ins2_highedu_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .152784       .0821429
 5%     .1734805       .0886667
10%     .2178154       .0925698       Obs              14,600
25%     .2949015       .1380375       Sum of wgt.      14,600

50%      .563901                      Mean           .6110964
                        Largest       Std. dev.      .4193773
75%     .8148931       2.985416
90%     1.023507       2.985416       Variance       .1758773
95%     1.167059       2.985416       Skewness       2.172976
99%     2.425508       2.985416       Kurtosis       10.34083

. sum ins3_vs_entrant_relative, d

                  ins3_vs_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1185751       .0849628
 5%     .1372715       .0849628
10%     .1456793       .0852398       Obs              14,942
25%      .184019       .0852398       Sum of wgt.      14,942

50%     .2320418                      Mean            .249079
                        Largest       Std. dev.      .0890765
75%     .3028006       .6566039
90%     .3705537       .6566039       Variance       .0079346
95%     .4302979       .6566039       Skewness       .9809564
99%     .5072184       .6566039       Kurtosis       4.050356

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. *The specific two; Do that for rural after special care.
. replace province_code = 51 if province_code==.
(2 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.00
         44 |      4,331       11.94       79.95
         50 |      2,115        5.83       85.78
         51 |      2,798        7.72       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,362 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. *9) Tenure
. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. replace tenure = 0 if tenure == -1
(49 real changes made)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *10) Dependent variables: Current Job Condition
. 
. *number of jobs
. gen jobs = C05_3 if C05_3 >= 1
(17,473 missing values generated)

. gen voc_jobs = jobs if secvocedu == 1
(33,442 missing values generated)

. gen gen_jobs = jobs if secgenedu == 1
(28,182 missing values generated)

. 
. sum jobs, d

                            jobs
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              18,786
25%            1              1       Sum of wgt.      18,786

50%            2                      Mean           2.192643
                        Largest       Std. dev.      1.604157
75%            3             24
90%            4             24       Variance        2.57332
95%            5             26       Skewness       3.661285
99%            8             30       Kurtosis       32.38108

. 
. *start exp
. gen startexp = exp - tenure
(17,647 missing values generated)

. replace startexp = 0 if startexp<0
(1,019 real changes made)

. gen startexpsqr = startexp * startexp
(17,647 missing values generated)

. **********PROBLEM HERE: NEGATIVE & EXTREME VALUES
. 
. 
. *start wage & wage growth
. gen age_yearstart = yearstart - birthyear
(17,464 missing values generated)

.         *the outlier of age_yearstart will be corrected in the following calculation.
. gen startwage = C05_2 if C05_2 != -88 & C05_2 != -99
(17,496 missing values generated)

. gen startwage2018 = .
(36,259 missing values generated)

. foreach i of num 1987/2018 {
  2.         replace startwage2018 = startwage / inflation`i' * 100 if yearstart == `i' & sta
> rtwage > 0 & monthlyearning > 0 & age_yearstart >= 16
  3. }
(111 real changes made)
(138 real changes made)
(174 real changes made)
(198 real changes made)
(149 real changes made)
(162 real changes made)
(166 real changes made)
(172 real changes made)
(203 real changes made)
(219 real changes made)
(213 real changes made)
(268 real changes made)
(245 real changes made)
(469 real changes made)
(208 real changes made)
(258 real changes made)
(300 real changes made)
(351 real changes made)
(396 real changes made)
(416 real changes made)
(428 real changes made)
(647 real changes made)
(688 real changes made)
(869 real changes made)
(635 real changes made)
(760 real changes made)
(888 real changes made)
(1,087 real changes made)
(1,271 real changes made)
(1,473 real changes made)
(2,054 real changes made)
(1,997 real changes made)

. gen logstartwage2018 = ln(startwage2018)
(18,646 missing values generated)

. gen voc_logstartwage2018 = logstartwage2018 if secvocedu == 1
(33,561 missing values generated)

. gen gen_logstartwage2018 = logstartwage2018 if secgenedu == 1
(28,696 missing values generated)

. 
. gen wagegrowth = (monthlyearning / startwage2018)^(1 / tenure) - 1
(20,679 missing values generated)

. gen voc_wagegrowth = wagegrowth if secvocedu == 1
(33,876 missing values generated)

. gen gen_wagegrowth = wagegrowth if secgenedu == 1
(29,460 missing values generated)

. 
. sum startwage, d

                          startwage
-------------------------------------------------------------
      Percentiles      Smallest
 1%           26         -14000
 5%          100         -14000
10%          300          -2000       Obs              18,763
25%         1000              0       Sum of wgt.      18,763

50%         2000                      Mean           2785.699
                        Largest       Std. dev.      4579.708
75%         3000         110000
90%         5000         120000       Variance       2.10e+07
95%         6500         120000       Skewness       19.00673
99%        16000         270000       Kurtosis       762.3491

. sum startwage2018, d

                        startwage2018
-------------------------------------------------------------
      Percentiles      Smallest
 1%     171.7156              2
 5%     427.3731       15.48821
10%     722.2792        15.5601       Obs              17,613
25%         1500        15.5601       Sum of wgt.      17,613

50%       2542.5                      Mean           3499.233
                        Largest       Std. dev.      6230.059
75%     3918.959       147978.8
90%     6047.431       240318.1       Variance       3.88e+07
95%     8512.662       282052.8       Skewness       21.78213
99%     21651.58       326256.7       Kurtosis       838.5146

. sum logstartwage2018, d

                      logstartwage2018
-------------------------------------------------------------
      Percentiles      Smallest
 1%      5.14584       .6931472
 5%     6.057657       2.740079
10%     6.582412        2.74471       Obs              17,613
25%     7.313221        2.74471       Sum of wgt.      17,613

50%     7.840903                      Mean           7.746507
                        Largest       Std. dev.      .9082772
75%     8.273582       11.90482
90%     8.707389       12.38972       Variance       .8249675
95%      9.04931       12.54985       Skewness      -.5024036
99%     9.982834       12.69544       Kurtosis       5.276696

. sum wagegrowth, d

                         wagegrowth
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -.507226      -.9770567
 5%    -.0928903      -.9486358
10%    -.0279279      -.9180596       Obs              15,580
25%    -.0017983      -.9180596       Sum of wgt.      15,580

50%      .063345                      Mean           .1678574
                        Largest       Std. dev.      1.864802
75%     .1409269       28.46955
90%      .299744       103.5963       Variance       3.477486
95%     .5550246       114.2286       Skewness       62.03958
99%     1.705617       153.3643       Kurtosis       4437.231

. 
. *Step Two: Regressions
. 
. *1) #Jobs
. 
. *With Outliners
. selmlog voc_jobs male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear, 1971,
>  1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relati
> ve ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,097
-------------+----------------------------------   F(9, 2087)      =      5.59
       Model |  143.548113         9  15.9497904   Prob > F        =    0.0000
    Residual |  5959.55441     2,087  2.85556033   R-squared       =    0.0235
-------------+----------------------------------   Adj R-squared   =    0.0193
       Total |  6103.10253     2,096  2.91178556   Root MSE        =    1.6898

------------------------------------------------------------------------------
    voc_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0527989   .0937326    -0.56   0.573    -.2366181    .1310202
         exp |   .0753581   .0808001     0.93   0.351    -.0830992    .2338153
      expsqr |  -.0027956   .0024438    -1.14   0.253    -.0075882     .001997
  highvocedu |  -.0301232   .1203823    -0.25   0.802    -.2662051    .2059587
  highgenedu |  -.2634623   .2240056    -1.18   0.240    -.7027599    .1758353
    adultedu |  -.6057817   .1046741    -5.79   0.000    -.8110582   -.4005053
         _m1 |   .0059356   .6445394     0.01   0.993    -1.258071    1.269943
         _m2 |  -1.475916    1.77674    -0.83   0.406    -4.960284    2.008452
         _m3 |  -1.862028   1.544473    -1.21   0.228    -4.890895     1.16684
       _cons |   .7104496     2.4514     0.29   0.772    -4.096994    5.517893
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   3.875574          .        .       .            .           .
        rho1 |   .0030151          .        .       .            .           .
        rho2 |  -.7497105          .        .       .            .           .
        rho3 |  -.9458411          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_jobs male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(bir
> thyear, 1971, 1992)

. sum voc_jobs male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    voc_jobs |      2,097    2.343825    1.706395          1         24
        male |      2,097    .5088221    .5000414          0          1
         exp |      2,097    17.87172     6.42464          1         32
      expsqr |      2,097    360.6547    234.4305          1       1024
  highvocedu |      2,097    .1163567    .3207287          0          1
-------------+---------------------------------------------------------
  highgenedu |      2,097    .0286123     .166754          0          1
    adultedu |      2,097    .1578445    .3646821          0          1
          m1 |      2,097    1.131021    .1850989   .8161486   2.152648
          m2 |      2,097   -.5239812    .1456451  -.7260021  -.0301977
          m3 |      2,097   -.3481793    .1896601  -.7259521  -.0050685

. outreg2 using "`xlspath1_1'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum15 
> if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative 
> ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,097
-------------+----------------------------------   F(23, 2073)     =      6.30
       Model |   398.66888        23  17.3334296   Prob > F        =    0.0000
    Residual |  5704.43365     2,073  2.75177696   R-squared       =    0.0653
-------------+----------------------------------   Adj R-squared   =    0.0550
       Total |  6103.10253     2,096  2.91178556   Root MSE        =    1.6588

-------------------------------------------------------------------------------
     voc_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0591098   .0981153    -0.60   0.547    -.2515246    .1333051
          exp |   .0681305    .087734     0.78   0.438    -.1039254    .2401865
       expsqr |  -.0024416   .0026163    -0.93   0.351    -.0075725    .0026892
   highvocedu |   .0259631   .1195041     0.22   0.828    -.2083973    .2603236
   highgenedu |  -.1728192   .2218867    -0.78   0.436    -.6079632    .2623248
     adultedu |  -.5660844   .1053052    -5.38   0.000    -.7725994   -.3595695
 provincedum2 |  -.6672707   .2165849    -3.08   0.002    -1.092017   -.2425241
 provincedum3 |  -.7831796   .2260673    -3.46   0.001    -1.226522   -.3398371
 provincedum4 |   -.244874   .2086537    -1.17   0.241    -.6540668    .1643187
 provincedum5 |  -.5488555   .1942876    -2.82   0.005    -.9298747   -.1678363
 provincedum6 |  -.5862084   .2370588    -2.47   0.013    -1.051107   -.1213102
 provincedum7 |  -.5760669    .208386    -2.76   0.006    -.9847344   -.1673993
 provincedum8 |   -.558782   .2178214    -2.57   0.010    -.9859536   -.1316105
 provincedum9 |  -.3821498   .2043769    -1.87   0.062    -.7829552    .0186556
provincedum10 |  -.1350731   .2052131    -0.66   0.510    -.5375184    .2673721
provincedum11 |   .3274102   .1945842     1.68   0.093    -.0541907     .709011
provincedum12 |   .2020644    .218571     0.92   0.355    -.2265772    .6307059
provincedum13 |  -.1250269   .2153461    -0.58   0.562     -.547344    .2972902
provincedum14 |  -.1918762    .235268    -0.82   0.415    -.6532623    .2695099
provincedum15 |  -.9426759    .266171    -3.54   0.000    -1.464666   -.4206855
          _m1 |   -.018735   .7030309    -0.03   0.979    -1.397455    1.359985
          _m2 |  -2.310881   1.999596    -1.16   0.248    -6.232307    1.610545
          _m3 |   -2.38173    1.65291    -1.44   0.150    -5.623267    .8598076
        _cons |   .3979695   2.683564     0.15   0.882    -4.864793    5.660732
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   4.688414          .        .       .            .           .
        rho1 |  -.0086525          .        .       .            .           .
        rho2 |  -1.067246          .        .       .            .           .
        rho3 |  -1.099967          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedu
> m15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum voc_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum15 m1 m
> 2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    voc_jobs |      2,097    2.343825    1.706395          1         24
        male |      2,097    .5088221    .5000414          0          1
         exp |      2,097    17.87172     6.42464          1         32
      expsqr |      2,097    360.6547    234.4305          1       1024
  highvocedu |      2,097    .1163567    .3207287          0          1
-------------+---------------------------------------------------------
  highgenedu |      2,097    .0286123     .166754          0          1
    adultedu |      2,097    .1578445    .3646821          0          1
provincedum2 |      2,097    .0624702    .2420653          0          1
provincedum3 |      2,097    .0414878    .1994632          0          1
provincedum4 |      2,097    .0691464    .2537634          0          1
-------------+---------------------------------------------------------
provincedum5 |      2,097    .0791607    .2700538          0          1
provincedum6 |      2,097    .0486409    .2151675          0          1
provincedum7 |      2,097    .0896519    .2857505          0          1
provincedum8 |      2,097    .0805913    .2722714          0          1
provincedum9 |      2,097    .0672389     .250495          0          1
-------------+---------------------------------------------------------
provinced~10 |      2,097    .0696233    .2545718          0          1
provinced~11 |      2,097    .1168336    .3212985          0          1
provinced~12 |      2,097    .0567477    .2314151          0          1
provinced~13 |      2,097    .0658083    .2480058          0          1
provinced~14 |      2,097    .0438722    .2048596          0          1
-------------+---------------------------------------------------------
provinced~15 |      2,097    .0286123     .166754          0          1
          m1 |      2,097    1.131021    .1850989   .8161486   2.152648
          m2 |      2,097   -.5239812    .1456451  -.7260021  -.0301977
          m3 |      2,097   -.3481793    .1896601  -.7259521  -.0050685

. outreg2 using "`xlspath1_1'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_jobs male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(educat=ma
> le exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_re
> lative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,097
-------------+----------------------------------   F(7, 2089)      =      4.91
       Model |  98.7665134         7  14.1095019   Prob > F        =    0.0000
    Residual |  6004.33601     2,089  2.87426329   R-squared       =    0.0162
-------------+----------------------------------   Adj R-squared   =    0.0129
       Total |  6103.10253     2,096  2.91178556   Root MSE        =    1.6954

------------------------------------------------------------------------------
    voc_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0483469   .0940273    -0.51   0.607    -.2327439    .1360501
         exp |   .0522462   .0808001     0.65   0.518    -.1062109    .2107033
      expsqr |  -.0022747   .0024463    -0.93   0.353    -.0070721    .0025228
   higheredu |   -.356891    .082615    -4.32   0.000    -.5189072   -.1948748
         _m1 |   .0143136   .6463005     0.02   0.982    -1.253146    1.281774
         _m2 |  -1.613053   1.780744    -0.91   0.365    -5.105271    1.879165
         _m3 |  -1.992258   1.547688    -1.29   0.198     -5.02743    1.042914
       _cons |   .8080736   2.457194     0.33   0.742    -4.010731    5.626878
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   4.063537          .        .       .            .           .
        rho1 |   .0071007          .        .       .            .           .
        rho2 |  -.8001962          .        .       .            .           .
        rho3 |  -.9883106          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_jobs male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum voc_jobs male exp expsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    voc_jobs |      2,097    2.343825    1.706395          1         24
        male |      2,097    .5088221    .5000414          0          1
         exp |      2,097    17.87172     6.42464          1         32
      expsqr |      2,097    360.6547    234.4305          1       1024
   higheredu |      2,097    .3028135    .4595848          0          1
-------------+---------------------------------------------------------
    adultedu |      2,097    .1578445    .3646821          0          1
          m1 |      2,097    1.131021    .1850989   .8161486   2.152648
          m2 |      2,097   -.5239812    .1456451  -.7260021  -.0301977
          m3 |      2,097   -.3481793    .1896601  -.7259521  -.0050685

. outreg2 using "`xlspath1_1'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_jobs male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthyear,
>  1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_
> relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,097
-------------+----------------------------------   F(21, 2075)     =      6.04
       Model |  351.538483        21  16.7399277   Prob > F        =    0.0000
    Residual |  5751.56404     2,075  2.77183809   R-squared       =    0.0576
-------------+----------------------------------   Adj R-squared   =    0.0481
       Total |  6103.10253     2,096  2.91178556   Root MSE        =    1.6649

-------------------------------------------------------------------------------
     voc_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0480718   .0984335    -0.49   0.625    -.2411105     .144967
          exp |   .0405298   .0877659     0.46   0.644    -.1315886    .2126482
       expsqr |  -.0018137     .00262    -0.69   0.489    -.0069518    .0033244
    higheredu |  -.3027988   .0833502    -3.63   0.000    -.4662575   -.1393401
 provincedum2 |  -.6232003   .2169443    -2.87   0.004    -1.048651   -.1977491
 provincedum3 |   -.735572    .226589    -3.25   0.001    -1.179937   -.2912066
 provincedum4 |  -.1875274   .2088543    -0.90   0.369    -.5971133    .2220585
 provincedum5 |  -.4902209   .1943131    -2.52   0.012    -.8712899   -.1091519
 provincedum6 |  -.5571254   .2377305    -2.34   0.019    -1.023341   -.0909102
 provincedum7 |   -.507047   .2084379    -2.43   0.015    -.9158162   -.0982778
 provincedum8 |  -.5029739   .2181454    -2.31   0.021    -.9307806   -.0751672
 provincedum9 |  -.3637805   .2049037    -1.78   0.076    -.7656189    .0380578
provincedum10 |  -.0944287   .2055497    -0.46   0.646    -.4975339    .3086765
provincedum11 |   .3802051   .1947983     1.95   0.051    -.0018153    .7622255
provincedum12 |   .2393186    .219073     1.09   0.275    -.1903071    .6689443
provincedum13 |  -.0761819   .2157459    -0.35   0.724    -.4992829     .346919
provincedum14 |  -.1907093   .2359458    -0.81   0.419    -.6534244    .2720058
provincedum15 |  -.9329011    .267129    -3.49   0.000     -1.45677   -.4090324
          _m1 |   -.051617   .7053003    -0.07   0.942    -1.434787    1.331553
          _m2 |  -2.188841   2.005599    -1.09   0.275    -6.122037    1.744355
          _m3 |  -2.359622   1.657614    -1.42   0.155    -5.610382    .8911379
        _cons |   .7270674   2.690487     0.27   0.787    -4.549268    6.003403
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   4.605682          .        .       .            .           .
        rho1 |  -.0240517          .        .       .            .           .
        rho2 |  -1.019923          .        .       .            .           .
        rho3 |  -1.099501          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_jobs male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inran
> ge(birthyear, 1971, 1992)

. sum voc_jobs male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    voc_jobs |      2,097    2.343825    1.706395          1         24
        male |      2,097    .5088221    .5000414          0          1
         exp |      2,097    17.87172     6.42464          1         32
      expsqr |      2,097    360.6547    234.4305          1       1024
   higheredu |      2,097    .3028135    .4595848          0          1
-------------+---------------------------------------------------------
provincedum2 |      2,097    .0624702    .2420653          0          1
provincedum3 |      2,097    .0414878    .1994632          0          1
provincedum4 |      2,097    .0691464    .2537634          0          1
provincedum5 |      2,097    .0791607    .2700538          0          1
provincedum6 |      2,097    .0486409    .2151675          0          1
-------------+---------------------------------------------------------
provincedum7 |      2,097    .0896519    .2857505          0          1
provincedum8 |      2,097    .0805913    .2722714          0          1
provincedum9 |      2,097    .0672389     .250495          0          1
provinced~10 |      2,097    .0696233    .2545718          0          1
provinced~11 |      2,097    .1168336    .3212985          0          1
-------------+---------------------------------------------------------
provinced~12 |      2,097    .0567477    .2314151          0          1
provinced~13 |      2,097    .0658083    .2480058          0          1
provinced~14 |      2,097    .0438722    .2048596          0          1
provinced~15 |      2,097    .0286123     .166754          0          1
          m1 |      2,097    1.131021    .1850989   .8161486   2.152648
-------------+---------------------------------------------------------
          m2 |      2,097   -.5239812    .1456451  -.7260021  -.0301977
          m3 |      2,097   -.3481793    .1896601  -.7259521  -.0050685

. outreg2 using "`xlspath1_1'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_jobs male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear, 1971,
>  1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relati
> ve ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,388
-------------+----------------------------------   F(9, 5378)      =     20.68
       Model |  363.642317         9  40.4047019   Prob > F        =    0.0000
    Residual |  10507.6331     5,378  1.95381798   R-squared       =    0.0334
-------------+----------------------------------   Adj R-squared   =    0.0318
       Total |  10871.2754     5,387  2.01805744   Root MSE        =    1.3978

------------------------------------------------------------------------------
    gen_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0624691   .0428736     1.46   0.145    -.0215805    .1465186
         exp |   .0821074   .0338566     2.43   0.015     .0157348      .14848
      expsqr |  -.0021152   .0010854    -1.95   0.051    -.0042431    .0000127
  highvocedu |  -.3029276   .0589923    -5.14   0.000    -.4185764   -.1872787
  highgenedu |  -.6487152   .0564351   -11.49   0.000    -.7593509   -.5380795
    adultedu |   -.312457   .0705931    -4.43   0.000    -.4508482   -.1740658
         _m1 |   .1293261   .7371106     0.18   0.861    -1.315709    1.574361
         _m2 |   .2300743   .2128605     1.08   0.280    -.1872185    .6473672
         _m3 |   1.120212   .4835375     2.32   0.021     .1722827    2.068142
       _cons |   2.009406   .1148012    17.50   0.000     1.784349    2.234463
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   2.188523          .        .       .            .           .
        rho1 |     .08742          .        .       .            .           .
        rho2 |   .1555223          .        .       .            .           .
        rho3 |   .7572247          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_jobs male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(bir
> thyear, 1971, 1992)

. sum gen_jobs male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    gen_jobs |      5,388    2.106162    1.420583          1         21
        male |      5,388    .5402747    .4984216          0          1
         exp |      5,388    15.05549    6.945202          0         33
      expsqr |      5,388    274.8948    231.8546          0       1089
  highvocedu |      5,388    .2529696     .434754          0          1
-------------+---------------------------------------------------------
  highgenedu |      5,388    .4055308      .49104          0          1
    adultedu |      5,388    .1100594    .3129928          0          1
          m1 |      5,388   -.2759206    .0704062  -.4278784  -.0382729
          m2 |      5,388    .4659551    .3527702  -.0001836   2.421548
          m3 |      5,388   -.2581092    .2004268  -.7259181   -.001114

. outreg2 using "`xlspath1_1'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum15 
> if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative 
> ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,388
-------------+----------------------------------   F(23, 5364)     =     16.59
       Model |  721.960493        23  31.3895866   Prob > F        =    0.0000
    Residual |  10149.3149     5,364  1.89211688   R-squared       =    0.0664
-------------+----------------------------------   Adj R-squared   =    0.0624
       Total |  10871.2754     5,387  2.01805744   Root MSE        =    1.3755

-------------------------------------------------------------------------------
     gen_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0421266    .043007     0.98   0.327    -.0421847    .1264378
          exp |    .095289   .0352058     2.71   0.007     .0262714    .1643066
       expsqr |  -.0020588   .0011109    -1.85   0.064    -.0042365     .000119
   highvocedu |  -.2747852   .0585463    -4.69   0.000    -.3895598   -.1600107
   highgenedu |  -.6345075   .0573006   -11.07   0.000      -.74684   -.5221751
     adultedu |  -.3087447   .0702718    -4.39   0.000    -.4465059   -.1709834
 provincedum2 |  -.5647288   .1019078    -5.54   0.000    -.7645094   -.3649482
 provincedum3 |  -.5098183   .0959766    -5.31   0.000    -.6979715   -.3216652
 provincedum4 |  -.1956659   .1022315    -1.91   0.056    -.3960812    .0047494
 provincedum5 |  -.3719106   .0905382    -4.11   0.000    -.5494023   -.1944188
 provincedum6 |  -.5805034   .1075619    -5.40   0.000    -.7913684   -.3696384
 provincedum7 |  -.5464564   .1023893    -5.34   0.000    -.7471811   -.3457317
 provincedum8 |  -.6273821   .0991141    -6.33   0.000     -.821686   -.4330781
 provincedum9 |  -.2766912   .0942654    -2.94   0.003    -.4614897   -.0918928
provincedum10 |  -.0150416   .1002414    -0.15   0.881    -.2115554    .1814722
provincedum11 |    .112172   .0852468     1.32   0.188    -.0549463    .2792904
provincedum12 |  -.1638174   .1064446    -1.54   0.124     -.372492    .0448572
provincedum13 |  -.2300332   .0982308    -2.34   0.019    -.4226055   -.0374609
provincedum14 |  -.4871421   .1326329    -3.67   0.000    -.7471564   -.2271278
provincedum15 |   -.692956   .1184472    -5.85   0.000    -.9251607   -.4607513
          _m1 |   .3879233   .7737364     0.50   0.616    -1.128914    1.904761
          _m2 |   .0885905   .2206311     0.40   0.688    -.3439361    .5211171
          _m3 |   1.323679    .487437     2.72   0.007     .3681043    2.279253
        _cons |   2.271265   .1343198    16.91   0.000     2.007944    2.534587
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   2.227341          .        .       .            .           .
        rho1 |   .2599277          .        .       .            .           .
        rho2 |     .05936          .        .       .            .           .
        rho3 |   .8869298          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedu
> m15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum gen_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum15 m1 m
> 2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    gen_jobs |      5,388    2.106162    1.420583          1         21
        male |      5,388    .5402747    .4984216          0          1
         exp |      5,388    15.05549    6.945202          0         33
      expsqr |      5,388    274.8948    231.8546          0       1089
  highvocedu |      5,388    .2529696     .434754          0          1
-------------+---------------------------------------------------------
  highgenedu |      5,388    .4055308      .49104          0          1
    adultedu |      5,388    .1100594    .3129928          0          1
provincedum2 |      5,388    .0584633    .2346391          0          1
provincedum3 |      5,388    .0629176    .2428372          0          1
provincedum4 |      5,388    .0566073    .2311121          0          1
-------------+---------------------------------------------------------
provincedum5 |      5,388    .0822197    .2747247          0          1
provincedum6 |      5,388    .0530809    .2242157          0          1
provincedum7 |      5,388    .0616184    .2404835          0          1
provincedum8 |      5,388     .079807    .2710193          0          1
provincedum9 |      5,388    .0707127    .2563681          0          1
-------------+---------------------------------------------------------
provinced~10 |      5,388     .059948    .2374126          0          1
provinced~11 |      5,388    .1336303    .3402862          0          1
provinced~12 |      5,388    .0506682    .2193395          0          1
provinced~13 |      5,388    .0666295    .2494025          0          1
provinced~14 |      5,388    .0282108    .1655901          0          1
-------------+---------------------------------------------------------
provinced~15 |      5,388    .0348924    .1835242          0          1
          m1 |      5,388   -.2759206    .0704062  -.4278784  -.0382729
          m2 |      5,388    .4659551    .3527702  -.0001836   2.421548
          m3 |      5,388   -.2581092    .2004268  -.7259181   -.001114

. outreg2 using "`xlspath1_1'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_jobs male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(educat=ma
> le exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_re
> lative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,388
-------------+----------------------------------   F(7, 5380)      =     17.88
       Model |  247.203454         7  35.3147791   Prob > F        =    0.0000
    Residual |   10624.072     5,380  1.97473457   R-squared       =    0.0227
-------------+----------------------------------   Adj R-squared   =    0.0215
       Total |  10871.2754     5,387  2.01805744   Root MSE        =    1.4053

------------------------------------------------------------------------------
    gen_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0659518   .0430694     1.53   0.126    -.0184816    .1503853
         exp |   .0789159   .0340225     2.32   0.020      .012218    .1456137
      expsqr |  -.0020358   .0010909    -1.87   0.062    -.0041744    .0001029
   higheredu |  -.4542621   .0505209    -8.99   0.000    -.5533036   -.3552206
         _m1 |  -.0946603   .7403801    -0.13   0.898    -1.546105    1.356784
         _m2 |   .2336179   .2139581     1.09   0.275    -.1858267    .6530625
         _m3 |   .9708857   .4851605     2.00   0.045     .0197746    1.921997
       _cons |   1.906786   .1141634    16.70   0.000     1.682979    2.130593
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   2.154677          .        .       .            .           .
        rho1 |  -.0644877          .        .       .            .           .
        rho2 |   .1591531          .        .       .            .           .
        rho3 |   .6614196          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_jobs male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum gen_jobs male exp expsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    gen_jobs |      5,388    2.106162    1.420583          1         21
        male |      5,388    .5402747    .4984216          0          1
         exp |      5,388    15.05549    6.945202          0         33
      expsqr |      5,388    274.8948    231.8546          0       1089
   higheredu |      5,388    .7685598    .4217922          0          1
-------------+---------------------------------------------------------
    adultedu |      5,388    .1100594    .3129928          0          1
          m1 |      5,388   -.2759206    .0704062  -.4278784  -.0382729
          m2 |      5,388    .4659551    .3527702  -.0001836   2.421548
          m3 |      5,388   -.2581092    .2004268  -.7259181   -.001114

. outreg2 using "`xlspath1_1'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_jobs male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthyear,
>  1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_
> relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,388
-------------+----------------------------------   F(21, 5366)     =     15.02
       Model |  603.568964        21  28.7413792   Prob > F        =    0.0000
    Residual |  10267.7065     5,366  1.91347493   R-squared       =    0.0555
-------------+----------------------------------   Adj R-squared   =    0.0518
       Total |  10871.2754     5,387  2.01805744   Root MSE        =    1.3833

-------------------------------------------------------------------------------
     gen_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0535101   .0431913     1.24   0.215    -.0311623    .1381825
          exp |   .0820416   .0353476     2.32   0.020     .0127459    .1513374
       expsqr |   -.001763   .0011162    -1.58   0.114    -.0039512    .0004251
    higheredu |  -.4259902   .0508609    -8.38   0.000    -.5256982   -.3262822
 provincedum2 |  -.4805481   .1018733    -4.72   0.000    -.6802612    -.280835
 provincedum3 |  -.4728567   .0963829    -4.91   0.000    -.6618064    -.283907
 provincedum4 |  -.1632062   .1027128    -1.59   0.112    -.3645651    .0381527
 provincedum5 |  -.3407074   .0908774    -3.75   0.000     -.518864   -.1625508
 provincedum6 |  -.5081652   .1077177    -4.72   0.000    -.7193356   -.2969949
 provincedum7 |  -.4791117   .1025196    -4.67   0.000    -.6800919   -.2781316
 provincedum8 |  -.5381805   .0989345    -5.44   0.000    -.7321322   -.3442288
 provincedum9 |  -.2253014   .0944643    -2.39   0.017    -.4104897    -.040113
provincedum10 |   .0674671   .1002016     0.67   0.501    -.1289686    .2639029
provincedum11 |   .1862587   .0851587     2.19   0.029     .0193131    .3532043
provincedum12 |  -.0978693   .1067095    -0.92   0.359    -.3070632    .1113246
provincedum13 |  -.1529448   .0982667    -1.56   0.120    -.3455874    .0396978
provincedum14 |  -.4257714   .1331391    -3.20   0.001    -.6867781   -.1647647
provincedum15 |  -.6817905   .1190717    -5.73   0.000    -.9152193   -.4483617
          _m1 |  -.0763821   .7757087    -0.10   0.922    -1.597086    1.444322
          _m2 |   .1511784   .2216454     0.68   0.495    -.2833367    .5856935
          _m3 |   1.185574   .4892378     2.42   0.015     .2264691    2.144679
        _cons |   2.101105   .1331107    15.78   0.000     1.840154    2.362056
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   2.157658          .        .       .            .           .
        rho1 |  -.0519996          .        .       .            .           .
        rho2 |   .1029197          .        .       .            .           .
        rho3 |   .8071185          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_jobs male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inran
> ge(birthyear, 1971, 1992)

. sum gen_jobs male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    gen_jobs |      5,388    2.106162    1.420583          1         21
        male |      5,388    .5402747    .4984216          0          1
         exp |      5,388    15.05549    6.945202          0         33
      expsqr |      5,388    274.8948    231.8546          0       1089
   higheredu |      5,388    .7685598    .4217922          0          1
-------------+---------------------------------------------------------
provincedum2 |      5,388    .0584633    .2346391          0          1
provincedum3 |      5,388    .0629176    .2428372          0          1
provincedum4 |      5,388    .0566073    .2311121          0          1
provincedum5 |      5,388    .0822197    .2747247          0          1
provincedum6 |      5,388    .0530809    .2242157          0          1
-------------+---------------------------------------------------------
provincedum7 |      5,388    .0616184    .2404835          0          1
provincedum8 |      5,388     .079807    .2710193          0          1
provincedum9 |      5,388    .0707127    .2563681          0          1
provinced~10 |      5,388     .059948    .2374126          0          1
provinced~11 |      5,388    .1336303    .3402862          0          1
-------------+---------------------------------------------------------
provinced~12 |      5,388    .0506682    .2193395          0          1
provinced~13 |      5,388    .0666295    .2494025          0          1
provinced~14 |      5,388    .0282108    .1655901          0          1
provinced~15 |      5,388    .0348924    .1835242          0          1
          m1 |      5,388   -.2759206    .0704062  -.4278784  -.0382729
-------------+---------------------------------------------------------
          m2 |      5,388    .4659551    .3527702  -.0001836   2.421548
          m3 |      5,388   -.2581092    .2004268  -.7259181   -.001114

. outreg2 using "`xlspath1_1'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs.xls
dir : seeout

. drop m1 m2 m3

. 
. *Without Outliers (99%)
. selmlog voc_jobs male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear, 1971,
>  1992) & inrange(jobs, 1, 8), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_
> highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10863.642
Iteration 1:  Log likelihood = -9225.8496
Iteration 2:  Log likelihood = -9099.8402
Iteration 3:  Log likelihood = -9087.4248
Iteration 4:  Log likelihood = -9087.2106
Iteration 5:  Log likelihood = -9087.2105

Multinomial logistic regression                   Number of obs   =      10601
                                                  LR chi2(12)     =    3552.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -9087.2105                       Pseudo R2       =     0.1635

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1580559   .0530916    -2.98   0.003    -.2621136   -.0539982
         exp |     .34396   .0239447    14.36   0.000     .2970293    .3908907
      expsqr |  -.0067518   .0006099   -11.07   0.000    -.0079472   -.0055564
ins1_secge~e |   3.356455   .4094372     8.20   0.000     2.553972    4.158937
ins2_highe~e |   .1315308   .0853387     1.54   0.123    -.0357299    .2987915
ins3_vs_en~e |   .7444647   .3913272     1.90   0.057    -.0225225    1.511452
       _cons |  -5.673362   .3013212   -18.83   0.000    -6.263941   -5.082784
-------------+----------------------------------------------------------------
3            |
        male |   -.039199   .0533887    -0.73   0.463    -.1438389     .065441
         exp |   .5968383   .0301868    19.77   0.000     .5376732    .6560034
      expsqr |  -.0080132   .0006834   -11.73   0.000    -.0093526   -.0066739
ins1_secge~e |   9.080616   .4453618    20.39   0.000     8.207723    9.953509
ins2_highe~e |   .4611287   .0901919     5.11   0.000     .2843559    .6379016
ins3_vs_en~e |  -.5775947   .4310972    -1.34   0.180     -1.42253    .2673403
       _cons |  -11.43922   .4004393   -28.57   0.000    -12.22406   -10.65437
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,080
-------------+----------------------------------   F(9, 2070)      =      7.88
       Model |  135.238174         9  15.0264638   Prob > F        =    0.0000
    Residual |  3947.43683     2,070  1.90697431   R-squared       =    0.0331
-------------+----------------------------------   Adj R-squared   =    0.0289
       Total |    4082.675     2,079  1.96376864   Root MSE        =    1.3809

------------------------------------------------------------------------------
    voc_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.1270069   .0822868    -1.54   0.123    -.2883804    .0343666
         exp |   .1215603   .0662041     1.84   0.066    -.0082733    .2513939
      expsqr |  -.0043028   .0019961    -2.16   0.031    -.0082173   -.0003883
  highvocedu |  -.0687375   .0988513    -0.70   0.487    -.2625959    .1251209
  highgenedu |  -.5699308   .1845839    -3.09   0.002    -.9319203   -.2079414
    adultedu |  -.5579193   .0856454    -6.51   0.000    -.7258794   -.3899593
         _m1 |   .5193849   .5185811     1.00   0.317      -.49761     1.53638
         _m2 |  -2.306933   1.490628    -1.55   0.122    -5.230219    .6163541
         _m3 |  -2.517491   1.315316    -1.91   0.056    -5.096971    .0619881
       _cons |  -.8397288   2.001761    -0.42   0.675    -4.765404    3.085946
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   4.139057          .        .       .            .           .
        rho1 |   .2552928          .        .       .            .           .
        rho2 |  -1.133925          .        .       .            .           .
        rho3 |  -1.237421          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_jobs male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(bir
> thyear, 1971, 1992) & inrange(jobs, 1, 8)

. sum voc_jobs male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    voc_jobs |      2,080      2.2625    1.401345          1          8
        male |      2,080    .5081731    .5000534          0          1
         exp |      2,080       17.85    6.426975          1         32
      expsqr |      2,080    359.9087    234.3675          1       1024
  highvocedu |      2,080    .1163462    .3207167          0          1
-------------+---------------------------------------------------------
  highgenedu |      2,080    .0283654    .1660543          0          1
    adultedu |      2,080    .1586538    .3654408          0          1
          m1 |      2,080    1.124592    .1805785    .824306   2.028872
          m2 |      2,080   -.5346087    .1421245  -.7260012  -.0368199
          m3 |      2,080   -.3339892    .1872216  -.7254235  -.0051933

. outreg2 using "`xlspath1_2'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum15 
> if inrange(birthyear, 1971, 1992) & inrange(jobs, 1, 8), sel(educat=male exp expsqr ins1_se
> cgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showml
> ogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10863.642
Iteration 1:  Log likelihood = -9225.8496
Iteration 2:  Log likelihood = -9099.8402
Iteration 3:  Log likelihood = -9087.4248
Iteration 4:  Log likelihood = -9087.2106
Iteration 5:  Log likelihood = -9087.2105

Multinomial logistic regression                   Number of obs   =      10601
                                                  LR chi2(12)     =    3552.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -9087.2105                       Pseudo R2       =     0.1635

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1580559   .0530916    -2.98   0.003    -.2621136   -.0539982
         exp |     .34396   .0239447    14.36   0.000     .2970293    .3908907
      expsqr |  -.0067518   .0006099   -11.07   0.000    -.0079472   -.0055564
ins1_secge~e |   3.356455   .4094372     8.20   0.000     2.553972    4.158937
ins2_highe~e |   .1315308   .0853387     1.54   0.123    -.0357299    .2987915
ins3_vs_en~e |   .7444647   .3913272     1.90   0.057    -.0225225    1.511452
       _cons |  -5.673362   .3013212   -18.83   0.000    -6.263941   -5.082784
-------------+----------------------------------------------------------------
3            |
        male |   -.039199   .0533887    -0.73   0.463    -.1438389     .065441
         exp |   .5968383   .0301868    19.77   0.000     .5376732    .6560034
      expsqr |  -.0080132   .0006834   -11.73   0.000    -.0093526   -.0066739
ins1_secge~e |   9.080616   .4453618    20.39   0.000     8.207723    9.953509
ins2_highe~e |   .4611287   .0901919     5.11   0.000     .2843559    .6379016
ins3_vs_en~e |  -.5775947   .4310972    -1.34   0.180     -1.42253    .2673403
       _cons |  -11.43922   .4004393   -28.57   0.000    -12.22406   -10.65437
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,080
-------------+----------------------------------   F(23, 2056)     =      7.91
       Model |  331.910415        23  14.4308876   Prob > F        =    0.0000
    Residual |  3750.76458     2,056  1.82430184   R-squared       =    0.0813
-------------+----------------------------------   Adj R-squared   =    0.0710
       Total |    4082.675     2,079  1.96376864   Root MSE        =    1.3507

-------------------------------------------------------------------------------
     voc_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.1026993   .0841229    -1.22   0.222    -.2676742    .0622756
          exp |   .0885316    .070475     1.26   0.209    -.0496782    .2267413
       expsqr |  -.0029418   .0020985    -1.40   0.161    -.0070572    .0011737
   highvocedu |  -.0283637   .0978173    -0.29   0.772     -.220195    .1634676
   highgenedu |  -.5173308   .1823179    -2.84   0.005    -.8748779   -.1597837
     adultedu |   -.541578   .0857888    -6.31   0.000    -.7098199   -.3733361
 provincedum2 |  -.6650296   .1740504    -3.82   0.000    -1.006363   -.3236962
 provincedum3 |  -.7033559   .1842737    -3.82   0.000    -1.064738   -.3419733
 provincedum4 |  -.3057062   .1686417    -1.81   0.070    -.6364325    .0250201
 provincedum5 |  -.5100175   .1570278    -3.25   0.001    -.8179676   -.2020674
 provincedum6 |  -.6601937   .1920625    -3.44   0.001    -1.036851   -.2835364
 provincedum7 |   -.627648    .166658    -3.77   0.000    -.9544841   -.3008119
 provincedum8 |  -.6746926   .1739899    -3.88   0.000    -1.015907   -.3334778
 provincedum9 |  -.3482909   .1635739    -2.13   0.033    -.6690786   -.0275032
provincedum10 |   -.353217    .163159    -2.16   0.031    -.6731911   -.0332428
provincedum11 |   .2120824   .1548606     1.37   0.171    -.0916177    .5157825
provincedum12 |  -.0664016   .1771164    -0.37   0.708    -.4137479    .2809447
provincedum13 |  -.0996194   .1719295    -0.58   0.562    -.4367936    .2375547
provincedum14 |  -.2959692    .190028    -1.56   0.120    -.6686367    .0766983
provincedum15 |  -.8867152    .209525    -4.23   0.000    -1.297618    -.475812
          _m1 |   .2145944   .5529348     0.39   0.698    -.8697764    1.298965
          _m2 |   -2.42391   1.602904    -1.51   0.131    -5.567395    .7195753
          _m3 |  -2.123863   1.357362    -1.56   0.118    -4.785811    .5380857
        _cons |  -.0018701   2.126991    -0.00   0.999    -4.173151     4.16941
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   3.623291          .        .       .            .           .
        rho1 |   .1127371          .        .       .            .           .
        rho2 |    -1.2734          .        .       .            .           .
        rho3 |   -1.11577          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedu
> m15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(jobs, 1, 8)

. sum voc_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum15 m1 m
> 2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    voc_jobs |      2,080      2.2625    1.401345          1          8
        male |      2,080    .5081731    .5000534          0          1
         exp |      2,080       17.85    6.426975          1         32
      expsqr |      2,080    359.9087    234.3675          1       1024
  highvocedu |      2,080    .1163462    .3207167          0          1
-------------+---------------------------------------------------------
  highgenedu |      2,080    .0283654    .1660543          0          1
    adultedu |      2,080    .1586538    .3654408          0          1
provincedum2 |      2,080    .0629808    .2429868          0          1
provincedum3 |      2,080    .0418269    .2002416          0          1
provincedum4 |      2,080    .0692308    .2539072          0          1
-------------+---------------------------------------------------------
provincedum5 |      2,080    .0798077    .2710604          0          1
provincedum6 |      2,080    .0485577    .2149932          0          1
provincedum7 |      2,080    .0894231    .2854221          0          1
provincedum8 |      2,080    .0802885    .2718046          0          1
provincedum9 |      2,080    .0677885     .251443          0          1
-------------+---------------------------------------------------------
provinced~10 |      2,080      .06875    .2530894          0          1
provinced~11 |      2,080    .1163462    .3207167          0          1
provinced~12 |      2,080    .0557692    .2295307          0          1
provinced~13 |      2,080    .0663462    .2489461          0          1
provinced~14 |      2,080      .04375    .2045875          0          1
-------------+---------------------------------------------------------
provinced~15 |      2,080    .0288462    .1674142          0          1
          m1 |      2,080    1.124592    .1805785    .824306   2.028872
          m2 |      2,080   -.5346087    .1421245  -.7260012  -.0368199
          m3 |      2,080   -.3339892    .1872216  -.7254235  -.0051933

. outreg2 using "`xlspath1_2'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_jobs male exp expsqr higheredu if inrange(birthyear, 1971, 1992) & inrange(jobs
> , 1, 8), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relat
> ive ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10863.642
Iteration 1:  Log likelihood = -9225.8496
Iteration 2:  Log likelihood = -9099.8402
Iteration 3:  Log likelihood = -9087.4248
Iteration 4:  Log likelihood = -9087.2106
Iteration 5:  Log likelihood = -9087.2105

Multinomial logistic regression                   Number of obs   =      10601
                                                  LR chi2(12)     =    3552.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -9087.2105                       Pseudo R2       =     0.1635

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1580559   .0530916    -2.98   0.003    -.2621136   -.0539982
         exp |     .34396   .0239447    14.36   0.000     .2970293    .3908907
      expsqr |  -.0067518   .0006099   -11.07   0.000    -.0079472   -.0055564
ins1_secge~e |   3.356455   .4094372     8.20   0.000     2.553972    4.158937
ins2_highe~e |   .1315308   .0853387     1.54   0.123    -.0357299    .2987915
ins3_vs_en~e |   .7444647   .3913272     1.90   0.057    -.0225225    1.511452
       _cons |  -5.673362   .3013212   -18.83   0.000    -6.263941   -5.082784
-------------+----------------------------------------------------------------
3            |
        male |   -.039199   .0533887    -0.73   0.463    -.1438389     .065441
         exp |   .5968383   .0301868    19.77   0.000     .5376732    .6560034
      expsqr |  -.0080132   .0006834   -11.73   0.000    -.0093526   -.0066739
ins1_secge~e |   9.080616   .4453618    20.39   0.000     8.207723    9.953509
ins2_highe~e |   .4611287   .0901919     5.11   0.000     .2843559    .6379016
ins3_vs_en~e |  -.5775947   .4310972    -1.34   0.180     -1.42253    .2673403
       _cons |  -11.43922   .4004393   -28.57   0.000    -12.22406   -10.65437
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,080
-------------+----------------------------------   F(7, 2072)      =      7.49
       Model |  100.810067         7  14.4014381   Prob > F        =    0.0000
    Residual |  3981.86493     2,072  1.92174949   R-squared       =    0.0247
-------------+----------------------------------   Adj R-squared   =    0.0214
       Total |    4082.675     2,079  1.96376864   Root MSE        =    1.3863

------------------------------------------------------------------------------
    voc_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.1264793   .0825978    -1.53   0.126    -.2884626    .0355041
         exp |   .1059315    .066267     1.60   0.110    -.0240253    .2358883
      expsqr |  -.0039851   .0019999    -1.99   0.046    -.0079072   -.0000629
   higheredu |  -.3753562    .067762    -5.54   0.000     -.508245   -.2424675
         _m1 |   .5476712   .5204541     1.05   0.293    -.4729962    1.568339
         _m2 |  -2.515471   1.495114    -1.68   0.093    -5.447554    .4166117
         _m3 |  -2.707995    1.31913    -2.05   0.040    -5.294954   -.1210368
       _cons |  -.8811144   2.008293    -0.44   0.661    -4.819597    3.057368
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   4.525738          .        .       .            .           .
        rho1 |   .2574395          .        .       .            .           .
        rho2 |  -1.182428          .        .       .            .           .
        rho3 |  -1.272926          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_jobs male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992) &
>  inrange(jobs, 1, 8)

. sum voc_jobs male exp expsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    voc_jobs |      2,080      2.2625    1.401345          1          8
        male |      2,080    .5081731    .5000534          0          1
         exp |      2,080       17.85    6.426975          1         32
      expsqr |      2,080    359.9087    234.3675          1       1024
   higheredu |      2,080    .3033654    .4598222          0          1
-------------+---------------------------------------------------------
    adultedu |      2,080    .1586538    .3654408          0          1
          m1 |      2,080    1.124592    .1805785    .824306   2.028872
          m2 |      2,080   -.5346087    .1421245  -.7260012  -.0368199
          m3 |      2,080   -.3339892    .1872216  -.7254235  -.0051933

. outreg2 using "`xlspath1_2'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_jobs male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthyear,
>  1971, 1992) & inrange(jobs, 1, 8), sel(educat=male exp expsqr ins1_secgen_entrant_relative
>  ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10863.642
Iteration 1:  Log likelihood = -9225.8496
Iteration 2:  Log likelihood = -9099.8402
Iteration 3:  Log likelihood = -9087.4248
Iteration 4:  Log likelihood = -9087.2106
Iteration 5:  Log likelihood = -9087.2105

Multinomial logistic regression                   Number of obs   =      10601
                                                  LR chi2(12)     =    3552.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -9087.2105                       Pseudo R2       =     0.1635

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1580559   .0530916    -2.98   0.003    -.2621136   -.0539982
         exp |     .34396   .0239447    14.36   0.000     .2970293    .3908907
      expsqr |  -.0067518   .0006099   -11.07   0.000    -.0079472   -.0055564
ins1_secge~e |   3.356455   .4094372     8.20   0.000     2.553972    4.158937
ins2_highe~e |   .1315308   .0853387     1.54   0.123    -.0357299    .2987915
ins3_vs_en~e |   .7444647   .3913272     1.90   0.057    -.0225225    1.511452
       _cons |  -5.673362   .3013212   -18.83   0.000    -6.263941   -5.082784
-------------+----------------------------------------------------------------
3            |
        male |   -.039199   .0533887    -0.73   0.463    -.1438389     .065441
         exp |   .5968383   .0301868    19.77   0.000     .5376732    .6560034
      expsqr |  -.0080132   .0006834   -11.73   0.000    -.0093526   -.0066739
ins1_secge~e |   9.080616   .4453618    20.39   0.000     8.207723    9.953509
ins2_highe~e |   .4611287   .0901919     5.11   0.000     .2843559    .6379016
ins3_vs_en~e |  -.5775947   .4310972    -1.34   0.180     -1.42253    .2673403
       _cons |  -11.43922   .4004393   -28.57   0.000    -12.22406   -10.65437
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,080
-------------+----------------------------------   F(21, 2058)     =      7.64
       Model |  295.380191        21  14.0657234   Prob > F        =    0.0000
    Residual |  3787.29481     2,058   1.8402793   R-squared       =    0.0723
-------------+----------------------------------   Adj R-squared   =    0.0629
       Total |    4082.675     2,079  1.96376864   Root MSE        =    1.3566

-------------------------------------------------------------------------------
     voc_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0999909   .0844781    -1.18   0.237    -.2656624    .0656806
          exp |   .0721693   .0706136     1.02   0.307    -.0663123    .2106509
       expsqr |   -.002636   .0021045    -1.25   0.211    -.0067632    .0014912
    higheredu |  -.3437734   .0681201    -5.05   0.000    -.4773649   -.2101819
 provincedum2 |  -.6157144    .174413    -3.53   0.000    -.9577588   -.2736699
 provincedum3 |  -.6581116   .1847957    -3.56   0.000    -1.020518   -.2957055
 provincedum4 |  -.2482602    .168883    -1.47   0.142    -.5794595    .0829391
 provincedum5 |   -.448422   .1570882    -2.85   0.004    -.7564904   -.1403537
 provincedum6 |  -.6262025   .1927189    -3.25   0.001    -1.004147   -.2482582
 provincedum7 |  -.5752138   .1668152    -3.45   0.001     -.902358   -.2480695
 provincedum8 |  -.6221943   .1743518    -3.57   0.000    -.9641186   -.2802699
 provincedum9 |  -.3198076    .164061    -1.95   0.051    -.6415506    .0019353
provincedum10 |   -.305931   .1634269    -1.87   0.061    -.6264304    .0145684
provincedum11 |   .2622295   .1551253     1.69   0.091    -.0419893    .5664484
provincedum12 |  -.0247032   .1776148    -0.14   0.889    -.3730267    .3236203
provincedum13 |  -.0513929   .1723376    -0.30   0.766    -.3893672    .2865814
provincedum14 |  -.2788246   .1906672    -1.46   0.144    -.6527453    .0950962
provincedum15 |   -.877114   .2104285    -4.17   0.000    -1.289789    -.464439
          _m1 |   .2376907   .5552337     0.43   0.669    -.8511878    1.326569
          _m2 |  -2.479208   1.609088    -1.54   0.124    -5.634819     .676403
          _m3 |  -2.251542   1.362222    -1.65   0.099    -4.923019    .4199338
        _cons |   .0389609   2.134814     0.02   0.985     -4.14766    4.225581
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   3.801122          .        .       .            .           .
        rho1 |   .1219148          .        .       .            .           .
        rho2 |  -1.271619          .        .       .            .           .
        rho3 |  -1.154846          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_jobs male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inran
> ge(birthyear, 1971, 1992) & inrange(jobs, 1, 8)

. sum voc_jobs male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    voc_jobs |      2,080      2.2625    1.401345          1          8
        male |      2,080    .5081731    .5000534          0          1
         exp |      2,080       17.85    6.426975          1         32
      expsqr |      2,080    359.9087    234.3675          1       1024
   higheredu |      2,080    .3033654    .4598222          0          1
-------------+---------------------------------------------------------
provincedum2 |      2,080    .0629808    .2429868          0          1
provincedum3 |      2,080    .0418269    .2002416          0          1
provincedum4 |      2,080    .0692308    .2539072          0          1
provincedum5 |      2,080    .0798077    .2710604          0          1
provincedum6 |      2,080    .0485577    .2149932          0          1
-------------+---------------------------------------------------------
provincedum7 |      2,080    .0894231    .2854221          0          1
provincedum8 |      2,080    .0802885    .2718046          0          1
provincedum9 |      2,080    .0677885     .251443          0          1
provinced~10 |      2,080      .06875    .2530894          0          1
provinced~11 |      2,080    .1163462    .3207167          0          1
-------------+---------------------------------------------------------
provinced~12 |      2,080    .0557692    .2295307          0          1
provinced~13 |      2,080    .0663462    .2489461          0          1
provinced~14 |      2,080      .04375    .2045875          0          1
provinced~15 |      2,080    .0288462    .1674142          0          1
          m1 |      2,080    1.124592    .1805785    .824306   2.028872
-------------+---------------------------------------------------------
          m2 |      2,080   -.5346087    .1421245  -.7260012  -.0368199
          m3 |      2,080   -.3339892    .1872216  -.7254235  -.0051933

. outreg2 using "`xlspath1_2'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_jobs male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear, 1971,
>  1992) & inrange(jobs, 1, 8), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_
> highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10863.642
Iteration 1:  Log likelihood = -9225.8496
Iteration 2:  Log likelihood = -9099.8402
Iteration 3:  Log likelihood = -9087.4248
Iteration 4:  Log likelihood = -9087.2106
Iteration 5:  Log likelihood = -9087.2105

Multinomial logistic regression                   Number of obs   =      10601
                                                  LR chi2(12)     =    3552.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -9087.2105                       Pseudo R2       =     0.1635

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1580559   .0530916    -2.98   0.003    -.2621136   -.0539982
         exp |     .34396   .0239447    14.36   0.000     .2970293    .3908907
      expsqr |  -.0067518   .0006099   -11.07   0.000    -.0079472   -.0055564
ins1_secge~e |   3.356455   .4094372     8.20   0.000     2.553972    4.158937
ins2_highe~e |   .1315308   .0853387     1.54   0.123    -.0357299    .2987915
ins3_vs_en~e |   .7444647   .3913272     1.90   0.057    -.0225225    1.511452
       _cons |  -5.673362   .3013212   -18.83   0.000    -6.263941   -5.082784
-------------+----------------------------------------------------------------
3            |
        male |   -.039199   .0533887    -0.73   0.463    -.1438389     .065441
         exp |   .5968383   .0301868    19.77   0.000     .5376732    .6560034
      expsqr |  -.0080132   .0006834   -11.73   0.000    -.0093526   -.0066739
ins1_secge~e |   9.080616   .4453618    20.39   0.000     8.207723    9.953509
ins2_highe~e |   .4611287   .0901919     5.11   0.000     .2843559    .6379016
ins3_vs_en~e |  -.5775947   .4310972    -1.34   0.180     -1.42253    .2673403
       _cons |  -11.43922   .4004393   -28.57   0.000    -12.22406   -10.65437
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,368
-------------+----------------------------------   F(9, 5358)      =     24.31
       Model |  335.505558         9  37.2783953   Prob > F        =    0.0000
    Residual |  8216.40335     5,358  1.53348327   R-squared       =    0.0392
-------------+----------------------------------   Adj R-squared   =    0.0376
       Total |   8551.9089     5,367  1.59342443   Root MSE        =    1.2383

------------------------------------------------------------------------------
    gen_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |    .028059   .0393957     0.71   0.476    -.0491726    .1052906
         exp |   .0936447   .0306353     3.06   0.002      .033587    .1537023
      expsqr |  -.0027084   .0009851    -2.75   0.006    -.0046395   -.0007773
  highvocedu |  -.2863064   .0523206    -5.47   0.000    -.3888761   -.1837367
  highgenedu |  -.6423745   .0500479   -12.84   0.000    -.7404888   -.5442602
    adultedu |  -.3010135   .0626987    -4.80   0.000    -.4239284   -.1780987
         _m1 |   .6444806   .6637192     0.97   0.332    -.6566791     1.94564
         _m2 |   .1594007   .2111751     0.75   0.450    -.2545884    .5733898
         _m3 |   .7497648   .4832554     1.55   0.121    -.1976123    1.697142
       _cons |   2.046945   .1021666    20.04   0.000     1.846657    2.247233
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.741841          .        .       .            .           .
        rho1 |   .4883212          .        .       .            .           .
        rho2 |   .1207774          .        .       .            .           .
        rho3 |   .5680947          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_jobs male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(bir
> thyear, 1971, 1992) & inrange(jobs, 1, 8)

. sum gen_jobs male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    gen_jobs |      5,368    2.068368    1.262309          1          8
        male |      5,368    .5394933    .4984843          0          1
         exp |      5,368     15.0408    6.943624          0         33
      expsqr |      5,368    274.4305     231.684          0       1089
  highvocedu |      5,368    .2533532     .434972          0          1
-------------+---------------------------------------------------------
  highgenedu |      5,368     .405924    .4911157          0          1
    adultedu |      5,368    .1099106    .3128074          0          1
          m1 |      5,368   -.2757852    .0706762  -.4208845  -.0381225
          m2 |      5,368    .4484471    .3405509  -.0002166   2.335464
          m3 |      5,368   -.2484833    .1958944  -.7259895  -.0012409

. outreg2 using "`xlspath1_2'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum15 
> if inrange(birthyear, 1971, 1992) & inrange(jobs, 1, 8), sel(educat=male exp expsqr ins1_se
> cgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showml
> ogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10863.642
Iteration 1:  Log likelihood = -9225.8496
Iteration 2:  Log likelihood = -9099.8402
Iteration 3:  Log likelihood = -9087.4248
Iteration 4:  Log likelihood = -9087.2106
Iteration 5:  Log likelihood = -9087.2105

Multinomial logistic regression                   Number of obs   =      10601
                                                  LR chi2(12)     =    3552.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -9087.2105                       Pseudo R2       =     0.1635

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1580559   .0530916    -2.98   0.003    -.2621136   -.0539982
         exp |     .34396   .0239447    14.36   0.000     .2970293    .3908907
      expsqr |  -.0067518   .0006099   -11.07   0.000    -.0079472   -.0055564
ins1_secge~e |   3.356455   .4094372     8.20   0.000     2.553972    4.158937
ins2_highe~e |   .1315308   .0853387     1.54   0.123    -.0357299    .2987915
ins3_vs_en~e |   .7444647   .3913272     1.90   0.057    -.0225225    1.511452
       _cons |  -5.673362   .3013212   -18.83   0.000    -6.263941   -5.082784
-------------+----------------------------------------------------------------
3            |
        male |   -.039199   .0533887    -0.73   0.463    -.1438389     .065441
         exp |   .5968383   .0301868    19.77   0.000     .5376732    .6560034
      expsqr |  -.0080132   .0006834   -11.73   0.000    -.0093526   -.0066739
ins1_secge~e |   9.080616   .4453618    20.39   0.000     8.207723    9.953509
ins2_highe~e |   .4611287   .0901919     5.11   0.000     .2843559    .6379016
ins3_vs_en~e |  -.5775947   .4310972    -1.34   0.180     -1.42253    .2673403
       _cons |  -11.43922   .4004393   -28.57   0.000    -12.22406   -10.65437
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,368
-------------+----------------------------------   F(23, 5344)     =     19.40
       Model |  659.129756        23  28.6578155   Prob > F        =    0.0000
    Residual |  7892.77915     5,344  1.47694221   R-squared       =    0.0771
-------------+----------------------------------   Adj R-squared   =    0.0731
       Total |   8551.9089     5,367  1.59342443   Root MSE        =    1.2153

-------------------------------------------------------------------------------
     gen_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    .038051    .039283     0.97   0.333    -.0389596    .1150616
          exp |   .0790439   .0317948     2.49   0.013     .0167132    .1413747
       expsqr |  -.0017837   .0010073    -1.77   0.077    -.0037584     .000191
   highvocedu |  -.2557387   .0517798    -4.94   0.000    -.3572482   -.1542291
   highgenedu |  -.6269365   .0506706   -12.37   0.000    -.7262716   -.5276014
     adultedu |  -.2924552   .0622337    -4.70   0.000    -.4144587   -.1704517
 provincedum2 |  -.6021175   .0902545    -6.67   0.000    -.7790531   -.4251819
 provincedum3 |  -.4982358   .0853531    -5.84   0.000    -.6655627   -.3309089
 provincedum4 |  -.1374417   .0903423    -1.52   0.128    -.3145495     .039666
 provincedum5 |  -.3750973   .0801465    -4.68   0.000    -.5322172   -.2179775
 provincedum6 |  -.5171459   .0949173    -5.45   0.000    -.7032225   -.3310692
 provincedum7 |  -.4833229   .0903324    -5.35   0.000    -.6604112   -.3062346
 provincedum8 |   -.592084   .0871503    -6.79   0.000    -.7629343   -.4212338
 provincedum9 |  -.2279981   .0830251    -2.75   0.006    -.3907612    -.065235
provincedum10 |  -.0997766   .0881448    -1.13   0.258    -.2725764    .0730232
provincedum11 |   .1082878   .0749965     1.44   0.149     -.038736    .2553116
provincedum12 |  -.1067057   .0938964    -1.14   0.256    -.2907809    .0773695
provincedum13 |  -.1956761   .0865643    -2.26   0.024    -.3653774   -.0259749
provincedum14 |  -.4700955   .1167591    -4.03   0.000     -.698991   -.2412001
provincedum15 |  -.6502822    .103726    -6.27   0.000    -.8536274    -.446937
          _m1 |   .2712021   .6960334     0.39   0.697    -1.093307    1.635712
          _m2 |   .2133068   .2162971     0.99   0.324    -.2107239    .6373374
          _m3 |   1.397847   .4845774     2.88   0.004     .4478777    2.347817
        _cons |   2.298386   .1189387    19.32   0.000     2.065218    2.531555
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.845245          .        .       .            .           .
        rho1 |   .1996485          .        .       .            .           .
        rho2 |   .1570282          .        .       .            .           .
        rho3 |   1.029041          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedu
> m15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(jobs, 1, 8)

. sum gen_jobs male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum15 m1 m
> 2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    gen_jobs |      5,368    2.068368    1.262309          1          8
        male |      5,368    .5394933    .4984843          0          1
         exp |      5,368     15.0408    6.943624          0         33
      expsqr |      5,368    274.4305     231.684          0       1089
  highvocedu |      5,368    .2533532     .434972          0          1
-------------+---------------------------------------------------------
  highgenedu |      5,368     .405924    .4911157          0          1
    adultedu |      5,368    .1099106    .3128074          0          1
provincedum2 |      5,368    .0583085    .2343477          0          1
provincedum3 |      5,368    .0629657    .2429239          0          1
provincedum4 |      5,368    .0568182    .2315164          0          1
-------------+---------------------------------------------------------
provincedum5 |      5,368    .0821535     .274624          0          1
provincedum6 |      5,368    .0532787    .2246096          0          1
provincedum7 |      5,368     .061848    .2409017          0          1
provincedum8 |      5,368     .079918    .2711915          0          1
provincedum9 |      5,368    .0709762    .2568089          0          1
-------------+---------------------------------------------------------
provinced~10 |      5,368    .0594262    .2364427          0          1
provinced~11 |      5,368    .1331967    .3398189          0          1
provinced~12 |      5,368    .0508569     .219726          0          1
provinced~13 |      5,368    .0666915    .2495102          0          1
provinced~14 |      5,368    .0281297    .1653586          0          1
-------------+---------------------------------------------------------
provinced~15 |      5,368    .0350224    .1838534          0          1
          m1 |      5,368   -.2757852    .0706762  -.4208845  -.0381225
          m2 |      5,368    .4484471    .3405509  -.0002166   2.335464
          m3 |      5,368   -.2484833    .1958944  -.7259895  -.0012409

. outreg2 using "`xlspath1_2'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_jobs male exp expsqr higheredu if inrange(birthyear, 1971, 1992) & inrange(jobs
> , 1, 8), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relat
> ive ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10863.642
Iteration 1:  Log likelihood = -9225.8496
Iteration 2:  Log likelihood = -9099.8402
Iteration 3:  Log likelihood = -9087.4248
Iteration 4:  Log likelihood = -9087.2106
Iteration 5:  Log likelihood = -9087.2105

Multinomial logistic regression                   Number of obs   =      10601
                                                  LR chi2(12)     =    3552.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -9087.2105                       Pseudo R2       =     0.1635

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1580559   .0530916    -2.98   0.003    -.2621136   -.0539982
         exp |     .34396   .0239447    14.36   0.000     .2970293    .3908907
      expsqr |  -.0067518   .0006099   -11.07   0.000    -.0079472   -.0055564
ins1_secge~e |   3.356455   .4094372     8.20   0.000     2.553972    4.158937
ins2_highe~e |   .1315308   .0853387     1.54   0.123    -.0357299    .2987915
ins3_vs_en~e |   .7444647   .3913272     1.90   0.057    -.0225225    1.511452
       _cons |  -5.673362   .3013212   -18.83   0.000    -6.263941   -5.082784
-------------+----------------------------------------------------------------
3            |
        male |   -.039199   .0533887    -0.73   0.463    -.1438389     .065441
         exp |   .5968383   .0301868    19.77   0.000     .5376732    .6560034
      expsqr |  -.0080132   .0006834   -11.73   0.000    -.0093526   -.0066739
ins1_secge~e |   9.080616   .4453618    20.39   0.000     8.207723    9.953509
ins2_highe~e |   .4611287   .0901919     5.11   0.000     .2843559    .6379016
ins3_vs_en~e |  -.5775947   .4310972    -1.34   0.180     -1.42253    .2673403
       _cons |  -11.43922   .4004393   -28.57   0.000    -12.22406   -10.65437
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,368
-------------+----------------------------------   F(7, 5360)      =     19.59
       Model |  213.297169         7  30.4710241   Prob > F        =    0.0000
    Residual |  8338.61174     5,360  1.55571114   R-squared       =    0.0249
-------------+----------------------------------   Adj R-squared   =    0.0237
       Total |   8551.9089     5,367  1.59342443   Root MSE        =    1.2473

------------------------------------------------------------------------------
    gen_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |    .029917   .0396347     0.75   0.450    -.0477831    .1076171
         exp |   .0891118    .030837     2.89   0.004     .0286588    .1495649
      expsqr |  -.0025858   .0009917    -2.61   0.009      -.00453   -.0006416
   higheredu |  -.4434711      .0449    -9.88   0.000    -.5314935   -.3554488
         _m1 |   .3744541     .66769     0.56   0.575    -.9344897    1.683398
         _m2 |   .1598845   .2126301     0.75   0.452    -.2569569    .5767259
         _m3 |   .6039408   .4857931     1.24   0.214    -.3484113    1.556293
       _cons |   1.944298   .1018177    19.10   0.000     1.744694    2.143902
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.660657          .        .       .            .           .
        rho1 |   .2905753          .        .       .            .           .
        rho2 |   .1240699          .        .       .            .           .
        rho3 |   .4686562          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_jobs male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992) &
>  inrange(jobs, 1, 8)

. sum gen_jobs male exp expsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    gen_jobs |      5,368    2.068368    1.262309          1          8
        male |      5,368    .5394933    .4984843          0          1
         exp |      5,368     15.0408    6.943624          0         33
      expsqr |      5,368    274.4305     231.684          0       1089
   higheredu |      5,368    .7691878    .4213918          0          1
-------------+---------------------------------------------------------
    adultedu |      5,368    .1099106    .3128074          0          1
          m1 |      5,368   -.2757852    .0706762  -.4208845  -.0381225
          m2 |      5,368    .4484471    .3405509  -.0002166   2.335464
          m3 |      5,368   -.2484833    .1958944  -.7259895  -.0012409

. outreg2 using "`xlspath1_2'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_jobs male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthyear,
>  1971, 1992) & inrange(jobs, 1, 8), sel(educat=male exp expsqr ins1_secgen_entrant_relative
>  ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10863.642
Iteration 1:  Log likelihood = -9225.8496
Iteration 2:  Log likelihood = -9099.8402
Iteration 3:  Log likelihood = -9087.4248
Iteration 4:  Log likelihood = -9087.2106
Iteration 5:  Log likelihood = -9087.2105

Multinomial logistic regression                   Number of obs   =      10601
                                                  LR chi2(12)     =    3552.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -9087.2105                       Pseudo R2       =     0.1635

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1580559   .0530916    -2.98   0.003    -.2621136   -.0539982
         exp |     .34396   .0239447    14.36   0.000     .2970293    .3908907
      expsqr |  -.0067518   .0006099   -11.07   0.000    -.0079472   -.0055564
ins1_secge~e |   3.356455   .4094372     8.20   0.000     2.553972    4.158937
ins2_highe~e |   .1315308   .0853387     1.54   0.123    -.0357299    .2987915
ins3_vs_en~e |   .7444647   .3913272     1.90   0.057    -.0225225    1.511452
       _cons |  -5.673362   .3013212   -18.83   0.000    -6.263941   -5.082784
-------------+----------------------------------------------------------------
3            |
        male |   -.039199   .0533887    -0.73   0.463    -.1438389     .065441
         exp |   .5968383   .0301868    19.77   0.000     .5376732    .6560034
      expsqr |  -.0080132   .0006834   -11.73   0.000    -.0093526   -.0066739
ins1_secge~e |   9.080616   .4453618    20.39   0.000     8.207723    9.953509
ins2_highe~e |   .4611287   .0901919     5.11   0.000     .2843559    .6379016
ins3_vs_en~e |  -.5775947   .4310972    -1.34   0.180     -1.42253    .2673403
       _cons |  -11.43922   .4004393   -28.57   0.000    -12.22406   -10.65437
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,368
-------------+----------------------------------   F(21, 5346)     =     16.95
       Model |  533.720161        21  25.4152458   Prob > F        =    0.0000
    Residual |  8018.18874     5,346  1.49984825   R-squared       =    0.0624
-------------+----------------------------------   Adj R-squared   =    0.0587
       Total |   8551.9089     5,367  1.59342443   Root MSE        =    1.2247

-------------------------------------------------------------------------------
     gen_jobs | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0458192   .0395346     1.16   0.247    -.0316846    .1233231
          exp |   .0654791   .0319906     2.05   0.041     .0027644    .1281937
       expsqr |  -.0014868   .0010143    -1.47   0.143    -.0034752    .0005016
    higheredu |  -.4124227   .0450818    -9.15   0.000    -.5008014    -.324044
 provincedum2 |  -.5165453    .090435    -5.71   0.000    -.6938347   -.3392558
 provincedum3 |  -.4640336   .0859217    -5.40   0.000    -.6324751    -.295592
 provincedum4 |  -.1043859   .0909607    -1.15   0.251     -.282706    .0739342
 provincedum5 |  -.3443669   .0806281    -4.27   0.000    -.5024308    -.186303
 provincedum6 |  -.4437946   .0952685    -4.66   0.000    -.6305598   -.2570294
 provincedum7 |  -.4148843   .0906515    -4.58   0.000    -.5925983   -.2371704
 provincedum8 |  -.5007935   .0871824    -5.74   0.000    -.6717065   -.3298805
 provincedum9 |  -.1760729   .0833912    -2.11   0.035    -.3395536   -.0125922
provincedum10 |  -.0149164   .0882949    -0.17   0.866    -.1880104    .1581775
provincedum11 |   .1838608   .0750863     2.45   0.014      .036661    .3310607
provincedum12 |  -.0393058   .0943311    -0.42   0.677    -.2242332    .1456215
provincedum13 |  -.1170366   .0867871    -1.35   0.178    -.2871747    .0531015
provincedum14 |  -.4075681   .1174479    -3.47   0.001    -.6378138   -.1773224
provincedum15 |    -.64036   .1044983    -6.13   0.000    -.8452193   -.4355006
          _m1 |  -.2204133   .6992211    -0.32   0.753    -1.591172    1.150345
          _m2 |   .2694514   .2177771     1.24   0.216    -.1574806    .6963833
          _m3 |   1.242941   .4873932     2.55   0.011      .287452    2.198431
        _cons |   2.126752   .1181672    18.00   0.000     1.895096    2.358408
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.799201          .        .       .            .           .
        rho1 |  -.1643228          .        .       .            .           .
        rho2 |   .2008818          .        .       .            .           .
        rho3 |   .9266396          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_jobs male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inran
> ge(birthyear, 1971, 1992) & inrange(jobs, 1, 8)

. sum gen_jobs male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    gen_jobs |      5,368    2.068368    1.262309          1          8
        male |      5,368    .5394933    .4984843          0          1
         exp |      5,368     15.0408    6.943624          0         33
      expsqr |      5,368    274.4305     231.684          0       1089
   higheredu |      5,368    .7691878    .4213918          0          1
-------------+---------------------------------------------------------
provincedum2 |      5,368    .0583085    .2343477          0          1
provincedum3 |      5,368    .0629657    .2429239          0          1
provincedum4 |      5,368    .0568182    .2315164          0          1
provincedum5 |      5,368    .0821535     .274624          0          1
provincedum6 |      5,368    .0532787    .2246096          0          1
-------------+---------------------------------------------------------
provincedum7 |      5,368     .061848    .2409017          0          1
provincedum8 |      5,368     .079918    .2711915          0          1
provincedum9 |      5,368    .0709762    .2568089          0          1
provinced~10 |      5,368    .0594262    .2364427          0          1
provinced~11 |      5,368    .1331967    .3398189          0          1
-------------+---------------------------------------------------------
provinced~12 |      5,368    .0508569     .219726          0          1
provinced~13 |      5,368    .0666915    .2495102          0          1
provinced~14 |      5,368    .0281297    .1653586          0          1
provinced~15 |      5,368    .0350224    .1838534          0          1
          m1 |      5,368   -.2757852    .0706762  -.4208845  -.0381225
-------------+---------------------------------------------------------
          m2 |      5,368    .4484471    .3405509  -.0002166   2.335464
          m3 |      5,368   -.2484833    .1958944  -.7259895  -.0012409

. outreg2 using "`xlspath1_2'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban #Jobs NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) Start Wage
. 
. ************PROBLRM HERE: SEL(EDUCAT: EXP)
. 
. *With Outliners
. selmlog voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu if in
> range(birthyear, 1971, 1992), sel(educat=male startexp startexpsqr ins1_secgen_entrant_rela
> tive ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -10987.42
Iteration 1:  Log likelihood = -9475.4388
Iteration 2:  Log likelihood = -9391.6845
Iteration 3:  Log likelihood = -9388.1951
Iteration 4:  Log likelihood = -9388.1869

Multinomial logistic regression                   Number of obs   =      10708
                                                  LR chi2(12)     =    3198.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -9388.1869                       Pseudo R2       =     0.1456

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   -.111746   .0522022    -2.14   0.032    -.2140603   -.0094316
    startexp |    .074688   .0108559     6.88   0.000     .0534108    .0959651
 startexpsqr |  -.0014101   .0004497    -3.14   0.002    -.0022915   -.0005287
ins1_secge~e |  -1.178045   .3222505    -3.66   0.000    -1.809644   -.5464451
ins2_highe~e |  -.0359531   .0795078    -0.45   0.651    -.1917855    .1198793
ins3_vs_en~e |   1.062574   .3729216     2.85   0.004     .3316615    1.793487
       _cons |  -1.204933   .1210453    -9.95   0.000    -1.442178   -.9676889
-------------+----------------------------------------------------------------
3            |
        male |   .1547483   .0526886     2.94   0.003     .0514806    .2580161
    startexp |   .2617597   .0123158    21.25   0.000     .2376213    .2858982
 startexpsqr |  -.0034297   .0004257    -8.06   0.000    -.0042642   -.0025952
ins1_secge~e |   1.797912   .3441895     5.22   0.000     1.123313    2.472511
ins2_highe~e |  -.4166966   .0947687    -4.40   0.000    -.6024398   -.2309535
ins3_vs_en~e |    -1.0243   .3953164    -2.59   0.010    -1.799106   -.2494939
       _cons |  -3.022214   .1451768   -20.82   0.000    -3.306755   -2.737672
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,065
-------------+----------------------------------   F(9, 2055)      =     54.57
       Model |  347.768213         9  38.6409125   Prob > F        =    0.0000
    Residual |  1455.14405     2,055  .708099295   R-squared       =    0.1929
-------------+----------------------------------   Adj R-squared   =    0.1894
       Total |  1802.91226     2,064  .873504004   Root MSE        =    .84149

------------------------------------------------------------------------------
voc_log~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1776979    .041685     4.26   0.000     .0959487    .2594471
    startexp |   .3942209   .0361709    10.90   0.000     .3232854    .4651564
 startexpsqr |  -.0098506   .0011201    -8.79   0.000    -.0120473   -.0076539
  highvocedu |   .0429238   .0596751     0.72   0.472    -.0741061    .1599537
  highgenedu |  -.0037449   .1132953    -0.03   0.974    -.2259305    .2184406
    adultedu |  -.1769948   .0550958    -3.21   0.001    -.2850441   -.0689455
         _m1 |   3.441332    .451655     7.62   0.000     2.555582    4.327081
         _m2 |   .5356032   1.553605     0.34   0.730    -2.511202    3.582408
         _m3 |   6.702811   1.337003     5.01   0.000      4.08079    9.324833
       _cons |   3.835423   .9646822     3.98   0.000     1.943566     5.72728
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   16.98346          .        .       .            .           .
        rho1 |   .8350519          .        .       .            .           .
        rho2 |   .1299661          .        .       .            .           .
        rho3 |   1.626462          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu m
> 1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log~2018 |      2,065    7.654962    .9346144   3.415595   12.69544
        male |      2,065    .5079903    .5000572          0          1
    startexp |      2,065    9.271671    7.264673          0         32
 startexpsqr |      2,065    138.7138    176.2695          0       1024
  highvocedu |      2,065    .1157385    .3199886          0          1
-------------+---------------------------------------------------------
  highgenedu |      2,065    .0290557    .1680033          0          1
    adultedu |      2,065    .1583535    .3651606          0          1
          m1 |      2,065    1.141925    .1316266      .8275   1.722059
          m2 |      2,065   -.5523343     .142152  -.7214794  -.1822043
          m3 |      2,065   -.3237661    .1928872  -.7241249  -.0285886

. outreg2 using "`xlspath2_1'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu provi
> ncedum2-provincedum15 if inrange(birthyear, 1971, 1992), sel(educat=male startexp startexps
> qr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf
> (2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -10987.42
Iteration 1:  Log likelihood = -9475.4388
Iteration 2:  Log likelihood = -9391.6845
Iteration 3:  Log likelihood = -9388.1951
Iteration 4:  Log likelihood = -9388.1869

Multinomial logistic regression                   Number of obs   =      10708
                                                  LR chi2(12)     =    3198.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -9388.1869                       Pseudo R2       =     0.1456

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   -.111746   .0522022    -2.14   0.032    -.2140603   -.0094316
    startexp |    .074688   .0108559     6.88   0.000     .0534108    .0959651
 startexpsqr |  -.0014101   .0004497    -3.14   0.002    -.0022915   -.0005287
ins1_secge~e |  -1.178045   .3222505    -3.66   0.000    -1.809644   -.5464451
ins2_highe~e |  -.0359531   .0795078    -0.45   0.651    -.1917855    .1198793
ins3_vs_en~e |   1.062574   .3729216     2.85   0.004     .3316615    1.793487
       _cons |  -1.204933   .1210453    -9.95   0.000    -1.442178   -.9676889
-------------+----------------------------------------------------------------
3            |
        male |   .1547483   .0526886     2.94   0.003     .0514806    .2580161
    startexp |   .2617597   .0123158    21.25   0.000     .2376213    .2858982
 startexpsqr |  -.0034297   .0004257    -8.06   0.000    -.0042642   -.0025952
ins1_secge~e |   1.797912   .3441895     5.22   0.000     1.123313    2.472511
ins2_highe~e |  -.4166966   .0947687    -4.40   0.000    -.6024398   -.2309535
ins3_vs_en~e |    -1.0243   .3953164    -2.59   0.010    -1.799106   -.2494939
       _cons |  -3.022214   .1451768   -20.82   0.000    -3.306755   -2.737672
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,065
-------------+----------------------------------   F(23, 2041)     =     25.63
       Model |  404.087712        23   17.569031   Prob > F        =    0.0000
    Residual |  1398.82455     2,041  .685362348   R-squared       =    0.2241
-------------+----------------------------------   Adj R-squared   =    0.2154
       Total |  1802.91226     2,064  .873504004   Root MSE        =    .82787

-------------------------------------------------------------------------------
voc_logs~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1691543   .0416667     4.06   0.000     .0874406    .2508681
     startexp |   .3051583   .0402214     7.59   0.000     .2262791    .3840375
  startexpsqr |  -.0081555   .0011564    -7.05   0.000    -.0104233   -.0058877
   highvocedu |   .0351535   .0590726     0.60   0.552    -.0806954    .1510025
   highgenedu |   -.011805   .1121205    -0.11   0.916    -.2316875    .2080775
     adultedu |  -.1951966   .0550829    -3.54   0.000    -.3032211   -.0871721
 provincedum2 |  -.5416167   .1067684    -5.07   0.000    -.7510032   -.3322303
 provincedum3 |  -.3079924   .1227258    -2.51   0.012    -.5486733   -.0673114
 provincedum4 |  -.3730152   .1017729    -3.67   0.000    -.5726049   -.1734256
 provincedum5 |   -.100752   .1022347    -0.99   0.324    -.3012472    .0997432
 provincedum6 |  -.4635371   .1142438    -4.06   0.000    -.6875838   -.2394905
 provincedum7 |  -.4942745   .1002951    -4.93   0.000    -.6909659    -.297583
 provincedum8 |  -.3820088   .0989102    -3.86   0.000    -.5759843   -.1880332
 provincedum9 |  -.3226862   .1046546    -3.08   0.002    -.5279271   -.1174453
provincedum10 |   -.324255   .1063219    -3.05   0.002    -.5327657   -.1157442
provincedum11 |  -.1018527   .0947175    -1.08   0.282    -.2876058    .0839004
provincedum12 |  -.4095361   .1062262    -3.86   0.000    -.6178592   -.2012131
provincedum13 |  -.1397956   .1065579    -1.31   0.190    -.3487691    .0691779
provincedum14 |  -.3223778   .1163345    -2.77   0.006    -.5505244   -.0942311
provincedum15 |  -.6466443   .1389087    -4.66   0.000     -.919062   -.3742266
          _m1 |   2.820054   .4647981     6.07   0.000     1.908526    3.731582
          _m2 |   .3392382   1.547748     0.22   0.827    -2.696093    3.374569
          _m3 |   4.456957   1.426144     3.13   0.002     1.660108    7.253807
        _cons |   4.608505    .968983     4.76   0.000     2.708207    6.508804
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   9.487483          .        .       .            .           .
        rho1 |   .9155498          .        .       .            .           .
        rho2 |    .110136          .        .       .            .           .
        rho3 |   1.446981          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu p
> rovincedum2-provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log~2018 |      2,065    7.654962    .9346144   3.415595   12.69544
        male |      2,065    .5079903    .5000572          0          1
    startexp |      2,065    9.271671    7.264673          0         32
 startexpsqr |      2,065    138.7138    176.2695          0       1024
  highvocedu |      2,065    .1157385    .3199886          0          1
-------------+---------------------------------------------------------
  highgenedu |      2,065    .0290557    .1680033          0          1
    adultedu |      2,065    .1583535    .3651606          0          1
provincedum2 |      2,065    .0634383    .2438086          0          1
provincedum3 |      2,065    .0421308    .2009361          0          1
provincedum4 |      2,065    .0692494    .2539393          0          1
-------------+---------------------------------------------------------
provincedum5 |      2,065    .0769976    .2666522          0          1
provincedum6 |      2,065    .0474576    .2126671          0          1
provincedum7 |      2,065    .0900726    .2863551          0          1
provincedum8 |      2,065    .0808717     .272704          0          1
provincedum9 |      2,065    .0677966    .2514575          0          1
-------------+---------------------------------------------------------
provinced~10 |      2,065    .0692494    .2539393          0          1
provinced~11 |      2,065    .1157385    .3199886          0          1
provinced~12 |      2,065    .0576271    .2330934          0          1
provinced~13 |      2,065    .0668281    .2497845          0          1
provinced~14 |      2,065    .0435835    .2042161          0          1
-------------+---------------------------------------------------------
provinced~15 |      2,065    .0290557    .1680033          0          1
          m1 |      2,065    1.141925    .1316266      .8275   1.722059
          m2 |      2,065   -.5523343     .142152  -.7214794  -.1822043
          m3 |      2,065   -.3237661    .1928872  -.7241249  -.0285886

. outreg2 using "`xlspath2_1'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_logstartwage2018 male startexp startexpsqr higheredu if inrange(birthyear, 1971
> , 1992), sel(educat=male startexp startexpsqr ins1_secgen_entrant_relative ins2_highedu_ent
> rant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -10987.42
Iteration 1:  Log likelihood = -9475.4388
Iteration 2:  Log likelihood = -9391.6845
Iteration 3:  Log likelihood = -9388.1951
Iteration 4:  Log likelihood = -9388.1869

Multinomial logistic regression                   Number of obs   =      10708
                                                  LR chi2(12)     =    3198.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -9388.1869                       Pseudo R2       =     0.1456

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   -.111746   .0522022    -2.14   0.032    -.2140603   -.0094316
    startexp |    .074688   .0108559     6.88   0.000     .0534108    .0959651
 startexpsqr |  -.0014101   .0004497    -3.14   0.002    -.0022915   -.0005287
ins1_secge~e |  -1.178045   .3222505    -3.66   0.000    -1.809644   -.5464451
ins2_highe~e |  -.0359531   .0795078    -0.45   0.651    -.1917855    .1198793
ins3_vs_en~e |   1.062574   .3729216     2.85   0.004     .3316615    1.793487
       _cons |  -1.204933   .1210453    -9.95   0.000    -1.442178   -.9676889
-------------+----------------------------------------------------------------
3            |
        male |   .1547483   .0526886     2.94   0.003     .0514806    .2580161
    startexp |   .2617597   .0123158    21.25   0.000     .2376213    .2858982
 startexpsqr |  -.0034297   .0004257    -8.06   0.000    -.0042642   -.0025952
ins1_secge~e |   1.797912   .3441895     5.22   0.000     1.123313    2.472511
ins2_highe~e |  -.4166966   .0947687    -4.40   0.000    -.6024398   -.2309535
ins3_vs_en~e |    -1.0243   .3953164    -2.59   0.010    -1.799106   -.2494939
       _cons |  -3.022214   .1451768   -20.82   0.000    -3.306755   -2.737672
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,065
-------------+----------------------------------   F(7, 2057)      =     68.54
       Model |  340.999023         7  48.7141462   Prob > F        =    0.0000
    Residual |  1461.91324     2,057  .710701624   R-squared       =    0.1891
-------------+----------------------------------   Adj R-squared   =    0.1864
       Total |  1802.91226     2,064  .873504004   Root MSE        =    .84303

------------------------------------------------------------------------------
voc_log~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1727238   .0417275     4.14   0.000     .0908912    .2545564
    startexp |   .4058427    .036038    11.26   0.000      .335168    .4765175
 startexpsqr |  -.0100612   .0011201    -8.98   0.000    -.0122579   -.0078645
   higheredu |  -.0704852    .043042    -1.64   0.102    -.1548957    .0139253
         _m1 |   3.559077   .4508611     7.89   0.000     2.674885    4.443269
         _m2 |   .2002622   1.550315     0.13   0.897    -2.840089    3.240614
         _m3 |   6.740056   1.338377     5.04   0.000      4.11534    9.364771
       _cons |   3.449987   .9556281     3.61   0.000     1.575888    5.324086
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    17.5395          .        .       .            .           .
        rho1 |   .8498237          .        .       .            .           .
        rho2 |   .0478179          .        .       .            .           .
        rho3 |   1.609366          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_logstartwage2018 male startexp startexpsqr higheredu m1 m2 m3 if inrange(bi
> rthyear, 1971, 1992)

. sum voc_logstartwage2018 male startexp startexpsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log~2018 |      2,065    7.654962    .9346144   3.415595   12.69544
        male |      2,065    .5079903    .5000572          0          1
    startexp |      2,065    9.271671    7.264673          0         32
 startexpsqr |      2,065    138.7138    176.2695          0       1024
   higheredu |      2,065    .3031477    .4597298          0          1
-------------+---------------------------------------------------------
    adultedu |      2,065    .1583535    .3651606          0          1
          m1 |      2,065    1.141925    .1316266      .8275   1.722059
          m2 |      2,065   -.5523343     .142152  -.7214794  -.1822043
          m3 |      2,065   -.3237661    .1928872  -.7241249  -.0285886

. outreg2 using "`xlspath2_1'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provincedum15
>  if inrange(birthyear, 1971, 1992), sel(educat=male startexp startexpsqr ins1_secgen_entran
> t_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -10987.42
Iteration 1:  Log likelihood = -9475.4388
Iteration 2:  Log likelihood = -9391.6845
Iteration 3:  Log likelihood = -9388.1951
Iteration 4:  Log likelihood = -9388.1869

Multinomial logistic regression                   Number of obs   =      10708
                                                  LR chi2(12)     =    3198.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -9388.1869                       Pseudo R2       =     0.1456

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   -.111746   .0522022    -2.14   0.032    -.2140603   -.0094316
    startexp |    .074688   .0108559     6.88   0.000     .0534108    .0959651
 startexpsqr |  -.0014101   .0004497    -3.14   0.002    -.0022915   -.0005287
ins1_secge~e |  -1.178045   .3222505    -3.66   0.000    -1.809644   -.5464451
ins2_highe~e |  -.0359531   .0795078    -0.45   0.651    -.1917855    .1198793
ins3_vs_en~e |   1.062574   .3729216     2.85   0.004     .3316615    1.793487
       _cons |  -1.204933   .1210453    -9.95   0.000    -1.442178   -.9676889
-------------+----------------------------------------------------------------
3            |
        male |   .1547483   .0526886     2.94   0.003     .0514806    .2580161
    startexp |   .2617597   .0123158    21.25   0.000     .2376213    .2858982
 startexpsqr |  -.0034297   .0004257    -8.06   0.000    -.0042642   -.0025952
ins1_secge~e |   1.797912   .3441895     5.22   0.000     1.123313    2.472511
ins2_highe~e |  -.4166966   .0947687    -4.40   0.000    -.6024398   -.2309535
ins3_vs_en~e |    -1.0243   .3953164    -2.59   0.010    -1.799106   -.2494939
       _cons |  -3.022214   .1451768   -20.82   0.000    -3.306755   -2.737672
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,065
-------------+----------------------------------   F(21, 2043)     =     27.45
       Model |  396.809505        21  18.8956907   Prob > F        =    0.0000
    Residual |  1406.10276     2,043   .68825392   R-squared       =    0.2201
-------------+----------------------------------   Adj R-squared   =    0.2121
       Total |  1802.91226     2,064  .873504004   Root MSE        =    .82961

-------------------------------------------------------------------------------
voc_logs~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1651452   .0417342     3.96   0.000     .0832992    .2469912
     startexp |   .3222918   .0399483     8.07   0.000     .2439483    .4006354
  startexpsqr |  -.0084565   .0011551    -7.32   0.000    -.0107217   -.0061913
    higheredu |  -.0821347   .0428466    -1.92   0.055    -.1661623    .0018928
 provincedum2 |  -.5184283   .1066393    -4.86   0.000    -.7275614   -.3092951
 provincedum3 |  -.2762331   .1225851    -2.25   0.024    -.5166379   -.0358283
 provincedum4 |  -.3486909   .1016606    -3.43   0.001    -.5480601   -.1493217
 provincedum5 |  -.0690928   .1018929    -0.68   0.498    -.2689175     .130732
 provincedum6 |  -.4434321   .1142554    -3.88   0.000    -.6675013    -.219363
 provincedum7 |  -.4607515   .0999713    -4.61   0.000    -.6568079   -.2646952
 provincedum8 |  -.3523062   .0986406    -3.57   0.000    -.5457529   -.1588595
 provincedum9 |  -.3108398   .1047313    -2.97   0.003    -.5162311   -.1054485
provincedum10 |  -.3028706   .1062193    -2.85   0.004      -.51118   -.0945613
provincedum11 |  -.0763933   .0945467    -0.81   0.419    -.2618113    .1090247
provincedum12 |  -.3930916   .1062704    -3.70   0.000    -.6015013   -.1846819
provincedum13 |  -.1154835   .1064873    -1.08   0.278    -.3243184    .0933515
provincedum14 |  -.3144324   .1164523    -2.70   0.007      -.54281   -.0860548
provincedum15 |  -.6392237   .1391815    -4.59   0.000    -.9121761   -.3662713
          _m1 |   2.973048    .463348     6.42   0.000     2.064365    3.881732
          _m2 |   .0161413   1.545664     0.01   0.992      -3.0151    3.047382
          _m3 |   4.644102   1.427502     3.25   0.001     1.844591    7.443613
        _cons |    4.17691   .9589435     4.36   0.000     2.296301    6.057519
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    10.3479          .        .       .            .           .
        rho1 |    .924221          .        .       .            .           .
        rho2 |   .0050178          .        .       .            .           .
        rho3 |   1.443695          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provinced
> um15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum voc_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provincedum15 m1 
> m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log~2018 |      2,065    7.654962    .9346144   3.415595   12.69544
        male |      2,065    .5079903    .5000572          0          1
    startexp |      2,065    9.271671    7.264673          0         32
 startexpsqr |      2,065    138.7138    176.2695          0       1024
   higheredu |      2,065    .3031477    .4597298          0          1
-------------+---------------------------------------------------------
provincedum2 |      2,065    .0634383    .2438086          0          1
provincedum3 |      2,065    .0421308    .2009361          0          1
provincedum4 |      2,065    .0692494    .2539393          0          1
provincedum5 |      2,065    .0769976    .2666522          0          1
provincedum6 |      2,065    .0474576    .2126671          0          1
-------------+---------------------------------------------------------
provincedum7 |      2,065    .0900726    .2863551          0          1
provincedum8 |      2,065    .0808717     .272704          0          1
provincedum9 |      2,065    .0677966    .2514575          0          1
provinced~10 |      2,065    .0692494    .2539393          0          1
provinced~11 |      2,065    .1157385    .3199886          0          1
-------------+---------------------------------------------------------
provinced~12 |      2,065    .0576271    .2330934          0          1
provinced~13 |      2,065    .0668281    .2497845          0          1
provinced~14 |      2,065    .0435835    .2042161          0          1
provinced~15 |      2,065    .0290557    .1680033          0          1
          m1 |      2,065    1.141925    .1316266      .8275   1.722059
-------------+---------------------------------------------------------
          m2 |      2,065   -.5523343     .142152  -.7214794  -.1822043
          m3 |      2,065   -.3237661    .1928872  -.7241249  -.0285886

. outreg2 using "`xlspath2_1'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu if in
> range(birthyear, 1971, 1992), sel(educat=male startexp startexpsqr ins1_secgen_entrant_rela
> tive ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -10987.42
Iteration 1:  Log likelihood = -9475.4388
Iteration 2:  Log likelihood = -9391.6845
Iteration 3:  Log likelihood = -9388.1951
Iteration 4:  Log likelihood = -9388.1869

Multinomial logistic regression                   Number of obs   =      10708
                                                  LR chi2(12)     =    3198.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -9388.1869                       Pseudo R2       =     0.1456

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   -.111746   .0522022    -2.14   0.032    -.2140603   -.0094316
    startexp |    .074688   .0108559     6.88   0.000     .0534108    .0959651
 startexpsqr |  -.0014101   .0004497    -3.14   0.002    -.0022915   -.0005287
ins1_secge~e |  -1.178045   .3222505    -3.66   0.000    -1.809644   -.5464451
ins2_highe~e |  -.0359531   .0795078    -0.45   0.651    -.1917855    .1198793
ins3_vs_en~e |   1.062574   .3729216     2.85   0.004     .3316615    1.793487
       _cons |  -1.204933   .1210453    -9.95   0.000    -1.442178   -.9676889
-------------+----------------------------------------------------------------
3            |
        male |   .1547483   .0526886     2.94   0.003     .0514806    .2580161
    startexp |   .2617597   .0123158    21.25   0.000     .2376213    .2858982
 startexpsqr |  -.0034297   .0004257    -8.06   0.000    -.0042642   -.0025952
ins1_secge~e |   1.797912   .3441895     5.22   0.000     1.123313    2.472511
ins2_highe~e |  -.4166966   .0947687    -4.40   0.000    -.6024398   -.2309535
ins3_vs_en~e |    -1.0243   .3953164    -2.59   0.010    -1.799106   -.2494939
       _cons |  -3.022214   .1451768   -20.82   0.000    -3.306755   -2.737672
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,310
-------------+----------------------------------   F(9, 5300)      =     74.95
       Model |   453.55125         9  50.3945834   Prob > F        =    0.0000
    Residual |  3563.57483     5,300   .67237261   R-squared       =    0.1129
-------------+----------------------------------   Adj R-squared   =    0.1114
       Total |  4017.12608     5,309  .756663417   Root MSE        =    .81998

------------------------------------------------------------------------------
gen_log~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .2063644   .0246961     8.36   0.000     .1579499    .2547788
    startexp |   .3705576   .0229455    16.15   0.000      .325575    .4155402
 startexpsqr |  -.0091726   .0008565   -10.71   0.000    -.0108518   -.0074935
  highvocedu |   .1784914   .0346106     5.16   0.000     .1106403    .2463425
  highgenedu |   .3719114   .0337576    11.02   0.000     .3057326    .4380902
    adultedu |  -.0022964    .043115    -0.05   0.958    -.0868195    .0822268
         _m1 |    9.20803   .7979653    11.54   0.000      7.64369    10.77237
         _m2 |   1.087953   .5390033     2.02   0.044     .0312844    2.144621
         _m3 |   8.156652   .8543878     9.55   0.000       6.4817    9.831604
       _cons |   10.18191   .2179861    46.71   0.000      9.75457    10.60925
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    36.7286          .        .       .            .           .
        rho1 |   1.519373          .        .       .            .           .
        rho2 |   .1795179          .        .       .            .           .
        rho3 |    1.34589          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu m
> 1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log~2018 |      5,310    7.884785     .869864   2.740079   11.90482
        male |      5,310     .540113    .4984353          0          1
    startexp |      5,310    6.977213    6.531207          0         32
 startexpsqr |      5,310    91.33013    145.9163          0       1024
  highvocedu |      5,310    .2519774    .4341892          0          1
-------------+---------------------------------------------------------
  highgenedu |      5,310    .4052731     .490991          0          1
    adultedu |      5,310    .1105461    .3135988          0          1
          m1 |      5,310    -.292309    .0405439  -.4241107  -.1099993
          m2 |      5,310    .4593574    .2795398   .1576978   1.554005
          m3 |      5,310   -.2648051    .1762868  -.7259871  -.0285886

. outreg2 using "`xlspath2_1'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu provi
> ncedum2-provincedum15 if inrange(birthyear, 1971, 1992), sel(educat=male startexp startexps
> qr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf
> (2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -10987.42
Iteration 1:  Log likelihood = -9475.4388
Iteration 2:  Log likelihood = -9391.6845
Iteration 3:  Log likelihood = -9388.1951
Iteration 4:  Log likelihood = -9388.1869

Multinomial logistic regression                   Number of obs   =      10708
                                                  LR chi2(12)     =    3198.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -9388.1869                       Pseudo R2       =     0.1456

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   -.111746   .0522022    -2.14   0.032    -.2140603   -.0094316
    startexp |    .074688   .0108559     6.88   0.000     .0534108    .0959651
 startexpsqr |  -.0014101   .0004497    -3.14   0.002    -.0022915   -.0005287
ins1_secge~e |  -1.178045   .3222505    -3.66   0.000    -1.809644   -.5464451
ins2_highe~e |  -.0359531   .0795078    -0.45   0.651    -.1917855    .1198793
ins3_vs_en~e |   1.062574   .3729216     2.85   0.004     .3316615    1.793487
       _cons |  -1.204933   .1210453    -9.95   0.000    -1.442178   -.9676889
-------------+----------------------------------------------------------------
3            |
        male |   .1547483   .0526886     2.94   0.003     .0514806    .2580161
    startexp |   .2617597   .0123158    21.25   0.000     .2376213    .2858982
 startexpsqr |  -.0034297   .0004257    -8.06   0.000    -.0042642   -.0025952
ins1_secge~e |   1.797912   .3441895     5.22   0.000     1.123313    2.472511
ins2_highe~e |  -.4166966   .0947687    -4.40   0.000    -.6024398   -.2309535
ins3_vs_en~e |    -1.0243   .3953164    -2.59   0.010    -1.799106   -.2494939
       _cons |  -3.022214   .1451768   -20.82   0.000    -3.306755   -2.737672
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,310
-------------+----------------------------------   F(23, 5286)     =     45.01
       Model |  657.829574        23  28.6012858   Prob > F        =    0.0000
    Residual |  3359.29651     5,286  .635508231   R-squared       =    0.1638
-------------+----------------------------------   Adj R-squared   =    0.1601
       Total |  4017.12608     5,309  .756663417   Root MSE        =    .79719

-------------------------------------------------------------------------------
gen_logs~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1749884   .0243164     7.20   0.000     .1273182    .2226587
     startexp |   .2581748   .0242948    10.63   0.000     .2105469    .3058027
  startexpsqr |  -.0073833   .0008496    -8.69   0.000    -.0090488   -.0057178
   highvocedu |   .2025963   .0337262     6.01   0.000     .1364792    .2687135
   highgenedu |   .3667414   .0330275    11.10   0.000     .3019939    .4314889
     adultedu |  -.0070046   .0421675    -0.17   0.868    -.0896704    .0756612
 provincedum2 |  -.7788906   .0599953   -12.98   0.000    -.8965061   -.6612751
 provincedum3 |  -.4200772   .0612383    -6.86   0.000    -.5401296   -.3000248
 provincedum4 |  -.3984199   .0592125    -6.73   0.000     -.514501   -.2823389
 provincedum5 |  -.2001066   .0545469    -3.67   0.000    -.3070412   -.0931721
 provincedum6 |  -.4321707   .0611659    -7.07   0.000    -.5520811   -.3122603
 provincedum7 |  -.5438978    .059345    -9.17   0.000    -.6602385    -.427557
 provincedum8 |  -.4633988   .0552334    -8.39   0.000     -.571679   -.3551186
 provincedum9 |  -.3846165   .0573191    -6.71   0.000    -.4969855   -.2722474
provincedum10 |  -.4288116   .0603987    -7.10   0.000     -.547218   -.3104052
provincedum11 |  -.1535657   .0491539    -3.12   0.002    -.2499276   -.0572039
provincedum12 |  -.4999258   .0615108    -8.13   0.000    -.6205123   -.3793393
provincedum13 |  -.4537121   .0580989    -7.81   0.000    -.5676101   -.3398142
provincedum14 |  -.4083247     .07613    -5.36   0.000     -.557571   -.2590785
provincedum15 |  -.8022391    .073068   -10.98   0.000    -.9454825   -.6589957
          _m1 |   7.338507   .7982094     9.19   0.000     5.773686    8.903327
          _m2 |   .9144698   .5290172     1.73   0.084    -.1226223    1.951562
          _m3 |   4.942733   .8820036     5.60   0.000     3.213642    6.671824
        _cons |   9.872058   .2159459    45.72   0.000     9.448715     10.2954
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   19.96381          .        .       .            .           .
        rho1 |   1.642427          .        .       .            .           .
        rho2 |   .2046669          .        .       .            .           .
        rho3 |    1.10623          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu p
> rovincedum2-provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log~2018 |      5,310    7.884785     .869864   2.740079   11.90482
        male |      5,310     .540113    .4984353          0          1
    startexp |      5,310    6.977213    6.531207          0         32
 startexpsqr |      5,310    91.33013    145.9163          0       1024
  highvocedu |      5,310    .2519774    .4341892          0          1
-------------+---------------------------------------------------------
  highgenedu |      5,310    .4052731     .490991          0          1
    adultedu |      5,310    .1105461    .3135988          0          1
provincedum2 |      5,310    .0596987      .23695          0          1
provincedum3 |      5,310    .0629002    .2428062          0          1
provincedum4 |      5,310    .0572505    .2323425          0          1
-------------+---------------------------------------------------------
provincedum5 |      5,310    .0815443    .2736949          0          1
provincedum6 |      5,310     .053484    .2250178          0          1
provincedum7 |      5,310    .0619586     .241103          0          1
provincedum8 |      5,310    .0779661    .2681435          0          1
provincedum9 |      5,310    .0700565    .2552662          0          1
-------------+---------------------------------------------------------
provinced~10 |      5,310    .0608286    .2390382          0          1
provinced~11 |      5,310      .13371    .3403725          0          1
provinced~12 |      5,310    .0510358    .2200915          0          1
provinced~13 |      5,310     .066855    .2497942          0          1
provinced~14 |      5,310    .0276836    .1640802          0          1
-------------+---------------------------------------------------------
provinced~15 |      5,310    .0350282    .1838685          0          1
          m1 |      5,310    -.292309    .0405439  -.4241107  -.1099993
          m2 |      5,310    .4593574    .2795398   .1576978   1.554005
          m3 |      5,310   -.2648051    .1762868  -.7259871  -.0285886

. outreg2 using "`xlspath2_1'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_logstartwage2018 male startexp startexpsqr higheredu if inrange(birthyear, 1971
> , 1992), sel(educat=male startexp startexpsqr ins1_secgen_entrant_relative ins2_highedu_ent
> rant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -10987.42
Iteration 1:  Log likelihood = -9475.4388
Iteration 2:  Log likelihood = -9391.6845
Iteration 3:  Log likelihood = -9388.1951
Iteration 4:  Log likelihood = -9388.1869

Multinomial logistic regression                   Number of obs   =      10708
                                                  LR chi2(12)     =    3198.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -9388.1869                       Pseudo R2       =     0.1456

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   -.111746   .0522022    -2.14   0.032    -.2140603   -.0094316
    startexp |    .074688   .0108559     6.88   0.000     .0534108    .0959651
 startexpsqr |  -.0014101   .0004497    -3.14   0.002    -.0022915   -.0005287
ins1_secge~e |  -1.178045   .3222505    -3.66   0.000    -1.809644   -.5464451
ins2_highe~e |  -.0359531   .0795078    -0.45   0.651    -.1917855    .1198793
ins3_vs_en~e |   1.062574   .3729216     2.85   0.004     .3316615    1.793487
       _cons |  -1.204933   .1210453    -9.95   0.000    -1.442178   -.9676889
-------------+----------------------------------------------------------------
3            |
        male |   .1547483   .0526886     2.94   0.003     .0514806    .2580161
    startexp |   .2617597   .0123158    21.25   0.000     .2376213    .2858982
 startexpsqr |  -.0034297   .0004257    -8.06   0.000    -.0042642   -.0025952
ins1_secge~e |   1.797912   .3441895     5.22   0.000     1.123313    2.472511
ins2_highe~e |  -.4166966   .0947687    -4.40   0.000    -.6024398   -.2309535
ins3_vs_en~e |    -1.0243   .3953164    -2.59   0.010    -1.799106   -.2494939
       _cons |  -3.022214   .1451768   -20.82   0.000    -3.306755   -2.737672
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,310
-------------+----------------------------------   F(7, 5302)      =     79.04
       Model |  379.603461         7  54.2290658   Prob > F        =    0.0000
    Residual |  3637.52262     5,302   .68606613   R-squared       =    0.0945
-------------+----------------------------------   Adj R-squared   =    0.0933
       Total |  4017.12608     5,309  .756663417   Root MSE        =    .82829

------------------------------------------------------------------------------
gen_log~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .2127377   .0249384     8.53   0.000     .1638482    .2616271
    startexp |   .3801465   .0231145    16.45   0.000     .3348325    .4254605
 startexpsqr |  -.0093773   .0008645   -10.85   0.000     -.011072   -.0076825
   higheredu |   .2313351    .030594     7.56   0.000     .1713584    .2913118
         _m1 |   9.548682   .8045337    11.87   0.000     7.971465     11.1259
         _m2 |   1.139147   .5442495     2.09   0.036     .0721944      2.2061
         _m3 |   8.577533   .8620836     9.95   0.000     6.887494    10.26757
       _cons |   10.33559   .2194601    47.10   0.000     9.905362    10.76583
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   39.87747          .        .       .            .           .
        rho1 |   1.512097          .        .       .            .           .
        rho2 |   .1803915          .        .       .            .           .
        rho3 |   1.358309          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_logstartwage2018 male startexp startexpsqr higheredu m1 m2 m3 if inrange(bi
> rthyear, 1971, 1992)

. sum gen_logstartwage2018 male startexp startexpsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log~2018 |      5,310    7.884785     .869864   2.740079   11.90482
        male |      5,310     .540113    .4984353          0          1
    startexp |      5,310    6.977213    6.531207          0         32
 startexpsqr |      5,310    91.33013    145.9163          0       1024
   higheredu |      5,310    .7677966    .4222778          0          1
-------------+---------------------------------------------------------
    adultedu |      5,310    .1105461    .3135988          0          1
          m1 |      5,310    -.292309    .0405439  -.4241107  -.1099993
          m2 |      5,310    .4593574    .2795398   .1576978   1.554005
          m3 |      5,310   -.2648051    .1762868  -.7259871  -.0285886

. outreg2 using "`xlspath2_1'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provincedum15
>  if inrange(birthyear, 1971, 1992), sel(educat=male startexp startexpsqr ins1_secgen_entran
> t_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -10987.42
Iteration 1:  Log likelihood = -9475.4388
Iteration 2:  Log likelihood = -9391.6845
Iteration 3:  Log likelihood = -9388.1951
Iteration 4:  Log likelihood = -9388.1869

Multinomial logistic regression                   Number of obs   =      10708
                                                  LR chi2(12)     =    3198.47
                                                  Prob > chi2     =     0.0000
Log likelihood = -9388.1869                       Pseudo R2       =     0.1456

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   -.111746   .0522022    -2.14   0.032    -.2140603   -.0094316
    startexp |    .074688   .0108559     6.88   0.000     .0534108    .0959651
 startexpsqr |  -.0014101   .0004497    -3.14   0.002    -.0022915   -.0005287
ins1_secge~e |  -1.178045   .3222505    -3.66   0.000    -1.809644   -.5464451
ins2_highe~e |  -.0359531   .0795078    -0.45   0.651    -.1917855    .1198793
ins3_vs_en~e |   1.062574   .3729216     2.85   0.004     .3316615    1.793487
       _cons |  -1.204933   .1210453    -9.95   0.000    -1.442178   -.9676889
-------------+----------------------------------------------------------------
3            |
        male |   .1547483   .0526886     2.94   0.003     .0514806    .2580161
    startexp |   .2617597   .0123158    21.25   0.000     .2376213    .2858982
 startexpsqr |  -.0034297   .0004257    -8.06   0.000    -.0042642   -.0025952
ins1_secge~e |   1.797912   .3441895     5.22   0.000     1.123313    2.472511
ins2_highe~e |  -.4166966   .0947687    -4.40   0.000    -.6024398   -.2309535
ins3_vs_en~e |    -1.0243   .3953164    -2.59   0.010    -1.799106   -.2494939
       _cons |  -3.022214   .1451768   -20.82   0.000    -3.306755   -2.737672
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,310
-------------+----------------------------------   F(21, 5288)     =     43.29
       Model |  589.281369        21  28.0610176   Prob > F        =    0.0000
    Residual |  3427.84471     5,288  .648230846   R-squared       =    0.1467
-------------+----------------------------------   Adj R-squared   =    0.1433
       Total |  4017.12608     5,309  .756663417   Root MSE        =    .80513

-------------------------------------------------------------------------------
gen_logs~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1806321   .0245524     7.36   0.000     .1324994    .2287648
     startexp |    .268846   .0244261    11.01   0.000     .2209608    .3167313
  startexpsqr |  -.0076469   .0008569    -8.92   0.000    -.0093267   -.0059671
    higheredu |   .2376978   .0298691     7.96   0.000     .1791421    .2962535
 provincedum2 |   -.792153   .0603557   -13.12   0.000    -.9104751   -.6738308
 provincedum3 |  -.4240253   .0617608    -6.87   0.000    -.5451019   -.3029486
 provincedum4 |  -.3889268   .0597807    -6.51   0.000    -.5061216    -.271732
 provincedum5 |  -.1867467    .054974    -3.40   0.001    -.2945184    -.078975
 provincedum6 |  -.4269621   .0616079    -6.93   0.000    -.5477389   -.3061853
 provincedum7 |  -.5384872   .0597804    -9.01   0.000    -.6556815   -.4212929
 provincedum8 |  -.4640411   .0555571    -8.35   0.000    -.5729559   -.3551262
 provincedum9 |  -.3812474   .0577524    -6.60   0.000    -.4944659   -.2680288
provincedum10 |  -.4458176   .0607995    -7.33   0.000    -.5650097   -.3266255
provincedum11 |  -.1554598     .04951    -3.14   0.002    -.2525199   -.0583997
provincedum12 |  -.5094562   .0620556    -8.21   0.000    -.6311108   -.3878015
provincedum13 |  -.4660674   .0585589    -7.96   0.000     -.580867   -.3512679
provincedum14 |  -.4204466    .076869    -5.47   0.000    -.5711415   -.2697516
provincedum15 |  -.7926875   .0737695   -10.75   0.000    -.9373061    -.648069
          _m1 |   7.729816   .8039518     9.61   0.000     6.153739    9.305894
          _m2 |    .980693   .5340395     1.84   0.066    -.0662447    2.027631
          _m3 |   5.371749   .8895564     6.04   0.000     3.627851    7.115647
        _cons |    10.0338   .2172892    46.18   0.000     9.607824    10.45978
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   22.45756          .        .       .            .           .
        rho1 |   1.631127          .        .       .            .           .
        rho2 |   .2069435          .        .       .            .           .
        rho3 |   1.133534          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provinced
> um15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum gen_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provincedum15 m1 
> m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log~2018 |      5,310    7.884785     .869864   2.740079   11.90482
        male |      5,310     .540113    .4984353          0          1
    startexp |      5,310    6.977213    6.531207          0         32
 startexpsqr |      5,310    91.33013    145.9163          0       1024
   higheredu |      5,310    .7677966    .4222778          0          1
-------------+---------------------------------------------------------
provincedum2 |      5,310    .0596987      .23695          0          1
provincedum3 |      5,310    .0629002    .2428062          0          1
provincedum4 |      5,310    .0572505    .2323425          0          1
provincedum5 |      5,310    .0815443    .2736949          0          1
provincedum6 |      5,310     .053484    .2250178          0          1
-------------+---------------------------------------------------------
provincedum7 |      5,310    .0619586     .241103          0          1
provincedum8 |      5,310    .0779661    .2681435          0          1
provincedum9 |      5,310    .0700565    .2552662          0          1
provinced~10 |      5,310    .0608286    .2390382          0          1
provinced~11 |      5,310      .13371    .3403725          0          1
-------------+---------------------------------------------------------
provinced~12 |      5,310    .0510358    .2200915          0          1
provinced~13 |      5,310     .066855    .2497942          0          1
provinced~14 |      5,310    .0276836    .1640802          0          1
provinced~15 |      5,310    .0350282    .1838685          0          1
          m1 |      5,310    -.292309    .0405439  -.4241107  -.1099993
-------------+---------------------------------------------------------
          m2 |      5,310    .4593574    .2795398   .1576978   1.554005
          m3 |      5,310   -.2648051    .1762868  -.7259871  -.0285886

. outreg2 using "`xlspath2_1'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage.xls
dir : seeout

. drop m1 m2 m3

. 
. *Without Outliers (99%)
. selmlog voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu if in
> range(birthyear, 1971, 1992) & inrange(startwage2018, 172, 21651), sel(educat=male startexp
>  startexpsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_rel
> ative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10605.567
Iteration 1:  Log likelihood = -9098.7253
Iteration 2:  Log likelihood = -9007.3055
Iteration 3:  Log likelihood = -9002.8076
Iteration 4:  Log likelihood = -9002.7921

Multinomial logistic regression                   Number of obs   =      10344
                                                  LR chi2(12)     =    3205.55
                                                  Prob > chi2     =     0.0000
Log likelihood = -9002.7921                       Pseudo R2       =     0.1511

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1217528    .053058    -2.29   0.022    -.2257446    -.017761
    startexp |   .0774835   .0110759     7.00   0.000     .0557752    .0991918
 startexpsqr |  -.0014887   .0004559    -3.27   0.001    -.0023822   -.0005953
ins1_secge~e |  -1.153631   .3271871    -3.53   0.000    -1.794906   -.5123565
ins2_highe~e |  -.0292831   .0806467    -0.36   0.717    -.1873478    .1287816
ins3_vs_en~e |   1.067155   .3785239     2.82   0.005     .3252614    1.809048
       _cons |  -1.229706   .1237939    -9.93   0.000    -1.472338   -.9870748
-------------+----------------------------------------------------------------
3            |
        male |   .1675276   .0540541     3.10   0.002     .0615835    .2734717
    startexp |   .2813567   .0129277    21.76   0.000     .2560188    .3066945
 startexpsqr |  -.0039108   .0004395    -8.90   0.000    -.0047721   -.0030494
ins1_secge~e |   1.844673   .3538761     5.21   0.000     1.151089    2.538258
ins2_highe~e |  -.3690791   .0966165    -3.82   0.000    -.5584439   -.1797142
ins3_vs_en~e |  -1.078776   .4058827    -2.66   0.008    -1.874291   -.2832605
       _cons |  -3.230122   .1524412   -21.19   0.000    -3.528902   -2.931343
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,031
-------------+----------------------------------   F(9, 2021)      =     58.27
       Model |   307.42666         9  34.1585177   Prob > F        =    0.0000
    Residual |  1184.76783     2,021  .586228517   R-squared       =    0.2060
-------------+----------------------------------   Adj R-squared   =    0.2025
       Total |  1492.19449     2,030  .735071179   Root MSE        =    .76566

------------------------------------------------------------------------------
voc_log~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1510708   .0389039     3.88   0.000     .0747749    .2273666
    startexp |   .3926086   .0358888    10.94   0.000     .3222257    .4629916
 startexpsqr |   -.009349   .0010562    -8.85   0.000    -.0114204   -.0072776
  highvocedu |   .0682763   .0545527     1.25   0.211    -.0387091    .1752618
  highgenedu |   .0187695    .103156     0.18   0.856    -.1835337    .2210727
    adultedu |   -.120915   .0507308    -2.38   0.017    -.2204051   -.0214249
         _m1 |   3.322948   .4203745     7.90   0.000     2.498535     4.14736
         _m2 |  -1.001273   1.371677    -0.73   0.465    -3.691322    1.688776
         _m3 |   5.783465   1.224046     4.72   0.000     3.382941    8.183989
       _cons |   2.731016   .8652211     3.16   0.002     1.034197    4.427834
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   13.99525          .        .       .            .           .
        rho1 |    .888246          .        .       .            .           .
        rho2 |  -.2676469          .        .       .            .           .
        rho3 |   1.545958          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu m
> 1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(startwage2018, 172, 21651)

. sum voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log~2018 |      2,031    7.645302    .8573629   5.156065    9.97727
        male |      2,031    .5056622    .5000911          0          1
    startexp |      2,031    9.282127    7.266677          0         32
 startexpsqr |      2,031    138.9365    176.7051          0       1024
  highvocedu |      2,031    .1166913    .3211311          0          1
-------------+---------------------------------------------------------
  highgenedu |      2,031    .0295421     .169362          0          1
    adultedu |      2,031    .1565731    .3634873          0          1
          m1 |      2,031    1.140968    .1339661   .8225553   1.722408
          m2 |      2,031   -.5537066    .1440702  -.7214906  -.1836181
          m3 |      2,031   -.3186337    .1977517  -.7239554  -.0266805

. outreg2 using "`xlspath2_2'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu provi
> ncedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(startwage2018, 172, 21651
> ), sel(educat=male startexp startexpsqr ins1_secgen_entrant_relative ins2_highedu_entrant_r
> elative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10605.567
Iteration 1:  Log likelihood = -9098.7253
Iteration 2:  Log likelihood = -9007.3055
Iteration 3:  Log likelihood = -9002.8076
Iteration 4:  Log likelihood = -9002.7921

Multinomial logistic regression                   Number of obs   =      10344
                                                  LR chi2(12)     =    3205.55
                                                  Prob > chi2     =     0.0000
Log likelihood = -9002.7921                       Pseudo R2       =     0.1511

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1217528    .053058    -2.29   0.022    -.2257446    -.017761
    startexp |   .0774835   .0110759     7.00   0.000     .0557752    .0991918
 startexpsqr |  -.0014887   .0004559    -3.27   0.001    -.0023822   -.0005953
ins1_secge~e |  -1.153631   .3271871    -3.53   0.000    -1.794906   -.5123565
ins2_highe~e |  -.0292831   .0806467    -0.36   0.717    -.1873478    .1287816
ins3_vs_en~e |   1.067155   .3785239     2.82   0.005     .3252614    1.809048
       _cons |  -1.229706   .1237939    -9.93   0.000    -1.472338   -.9870748
-------------+----------------------------------------------------------------
3            |
        male |   .1675276   .0540541     3.10   0.002     .0615835    .2734717
    startexp |   .2813567   .0129277    21.76   0.000     .2560188    .3066945
 startexpsqr |  -.0039108   .0004395    -8.90   0.000    -.0047721   -.0030494
ins1_secge~e |   1.844673   .3538761     5.21   0.000     1.151089    2.538258
ins2_highe~e |  -.3690791   .0966165    -3.82   0.000    -.5584439   -.1797142
ins3_vs_en~e |  -1.078776   .4058827    -2.66   0.008    -1.874291   -.2832605
       _cons |  -3.230122   .1524412   -21.19   0.000    -3.528902   -2.931343
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,031
-------------+----------------------------------   F(23, 2007)     =     27.23
       Model |  354.923539        23  15.4314582   Prob > F        =    0.0000
    Residual |  1137.27095     2,007  .566652195   R-squared       =    0.2379
-------------+----------------------------------   Adj R-squared   =    0.2291
       Total |  1492.19449     2,030  .735071179   Root MSE        =    .75276

-------------------------------------------------------------------------------
voc_logs~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1457691   .0388517     3.75   0.000     .0695752     .221963
     startexp |   .3154253   .0388937     8.11   0.000     .2391492    .3917015
  startexpsqr |  -.0079004   .0010863    -7.27   0.000    -.0100308   -.0057699
   highvocedu |   .0630318   .0539797     1.17   0.243    -.0428303     .168894
   highgenedu |   .0124711   .1020409     0.12   0.903     -.187646    .2125883
     adultedu |  -.1417459   .0506592    -2.80   0.005    -.2410961   -.0423958
 provincedum2 |  -.4940503   .0954136    -5.18   0.000    -.6811704   -.3069303
 provincedum3 |  -.2969617   .1097419    -2.71   0.007    -.5121816   -.0817418
 provincedum4 |  -.3190499   .0916406    -3.48   0.001    -.4987705   -.1393293
 provincedum5 |  -.0889123   .0917928    -0.97   0.333    -.2689314    .0911068
 provincedum6 |  -.4079591    .103496    -3.94   0.000    -.6109299   -.2049883
 provincedum7 |  -.4722646   .0892073    -5.29   0.000    -.6472131    -.297316
 provincedum8 |  -.3408881   .0883489    -3.86   0.000    -.5141532    -.167623
 provincedum9 |  -.2622915   .0942122    -2.78   0.005    -.4470555   -.0775275
provincedum10 |  -.3002134   .0950145    -3.16   0.002    -.4865507   -.1138761
provincedum11 |  -.0922619   .0845773    -1.09   0.275    -.2581304    .0736065
provincedum12 |  -.4093178   .0968794    -4.23   0.000    -.5993125   -.2193232
provincedum13 |  -.1250189   .0960247    -1.30   0.193    -.3133374    .0632996
provincedum14 |  -.2828974   .1050865    -2.69   0.007    -.4889874   -.0768073
provincedum15 |  -.5483859   .1254688    -4.37   0.000    -.7944487   -.3023231
          _m1 |   2.807385    .430911     6.51   0.000     1.962305    3.652464
          _m2 |  -.9991633   1.364564    -0.73   0.464    -3.675274    1.676947
          _m3 |   4.002104   1.287816     3.11   0.002     1.476508      6.5277
        _cons |   3.546442   .8684964     4.08   0.000     1.843194    5.249691
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   8.603491          .        .       .            .           .
        rho1 |   .9571161          .        .       .            .           .
        rho2 |  -.3406427          .        .       .            .           .
        rho3 |   1.364429          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu p
> rovincedum2-provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(startwage201
> 8, 172, 21651)

. sum voc_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log~2018 |      2,031    7.645302    .8573629   5.156065    9.97727
        male |      2,031    .5056622    .5000911          0          1
    startexp |      2,031    9.282127    7.266677          0         32
 startexpsqr |      2,031    138.9365    176.7051          0       1024
  highvocedu |      2,031    .1166913    .3211311          0          1
-------------+---------------------------------------------------------
  highgenedu |      2,031    .0295421     .169362          0          1
    adultedu |      2,031    .1565731    .3634873          0          1
provincedum2 |      2,031    .0640079    .2448272          0          1
provincedum3 |      2,031    .0423437    .2014216          0          1
provincedum4 |      2,031    .0699163    .2550687          0          1
-------------+---------------------------------------------------------
provincedum5 |      2,031    .0773018    .2671355          0          1
provincedum6 |      2,031     .046775    .2112086          0          1
provincedum7 |      2,031    .0910881    .2878053          0          1
provincedum8 |      2,031    .0822255    .2747756          0          1
provincedum9 |      2,031    .0674545    .2508692          0          1
-------------+---------------------------------------------------------
provinced~10 |      2,031    .0699163    .2550687          0          1
provinced~11 |      2,031    .1161989    .3205422          0          1
provinced~12 |      2,031    .0556376     .229277          0          1
provinced~13 |      2,031    .0649926    .2465735          0          1
provinced~14 |      2,031    .0433284    .2036455          0          1
-------------+---------------------------------------------------------
provinced~15 |      2,031    .0285574    .1665998          0          1
          m1 |      2,031    1.140968    .1339661   .8225553   1.722408
          m2 |      2,031   -.5537066    .1440702  -.7214906  -.1836181
          m3 |      2,031   -.3186337    .1977517  -.7239554  -.0266805

. outreg2 using "`xlspath2_2'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_logstartwage2018 male startexp startexpsqr higheredu if inrange(birthyear, 1971
> , 1992) & inrange(startwage2018, 172, 21651), sel(educat=male startexp startexpsqr ins1_sec
> gen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlo
> git gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10605.567
Iteration 1:  Log likelihood = -9098.7253
Iteration 2:  Log likelihood = -9007.3055
Iteration 3:  Log likelihood = -9002.8076
Iteration 4:  Log likelihood = -9002.7921

Multinomial logistic regression                   Number of obs   =      10344
                                                  LR chi2(12)     =    3205.55
                                                  Prob > chi2     =     0.0000
Log likelihood = -9002.7921                       Pseudo R2       =     0.1511

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1217528    .053058    -2.29   0.022    -.2257446    -.017761
    startexp |   .0774835   .0110759     7.00   0.000     .0557752    .0991918
 startexpsqr |  -.0014887   .0004559    -3.27   0.001    -.0023822   -.0005953
ins1_secge~e |  -1.153631   .3271871    -3.53   0.000    -1.794906   -.5123565
ins2_highe~e |  -.0292831   .0806467    -0.36   0.717    -.1873478    .1287816
ins3_vs_en~e |   1.067155   .3785239     2.82   0.005     .3252614    1.809048
       _cons |  -1.229706   .1237939    -9.93   0.000    -1.472338   -.9870748
-------------+----------------------------------------------------------------
3            |
        male |   .1675276   .0540541     3.10   0.002     .0615835    .2734717
    startexp |   .2813567   .0129277    21.76   0.000     .2560188    .3066945
 startexpsqr |  -.0039108   .0004395    -8.90   0.000    -.0047721   -.0030494
ins1_secge~e |   1.844673   .3538761     5.21   0.000     1.151089    2.538258
ins2_highe~e |  -.3690791   .0966165    -3.82   0.000    -.5584439   -.1797142
ins3_vs_en~e |  -1.078776   .4058827    -2.66   0.008    -1.874291   -.2832605
       _cons |  -3.230122   .1524412   -21.19   0.000    -3.528902   -2.931343
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,031
-------------+----------------------------------   F(7, 2023)      =     73.50
       Model |  302.571094         7  43.2244419   Prob > F        =    0.0000
    Residual |   1189.6234     2,023  .588049135   R-squared       =    0.2028
-------------+----------------------------------   Adj R-squared   =    0.2000
       Total |  1492.19449     2,030  .735071179   Root MSE        =    .76684

------------------------------------------------------------------------------
voc_log~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1461685   .0389233     3.76   0.000     .0698346    .2225023
    startexp |   .4036889   .0357337    11.30   0.000     .3336102    .4737676
 startexpsqr |  -.0095502   .0010555    -9.05   0.000    -.0116203   -.0074801
   higheredu |  -.0292341   .0394574    -0.74   0.459    -.1066156    .0481473
         _m1 |   3.432187   .4192952     8.19   0.000     2.609892    4.254483
         _m2 |  -1.298261   1.367783    -0.95   0.343    -3.980672    1.384149
         _m3 |   5.831579   1.225022     4.76   0.000     3.429143    8.234015
       _cons |   2.383286   .8556466     2.79   0.005     .7052452    4.061326
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |     14.654          .        .       .            .           .
        rho1 |   .8965879          .        .       .            .           .
        rho2 |   -.339144          .        .       .            .           .
        rho3 |   1.523379          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_logstartwage2018 male startexp startexpsqr higheredu m1 m2 m3 if inrange(bi
> rthyear, 1971, 1992) & inrange(startwage2018, 172, 21651)

. sum voc_logstartwage2018 male startexp startexpsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log~2018 |      2,031    7.645302    .8573629   5.156065    9.97727
        male |      2,031    .5056622    .5000911          0          1
    startexp |      2,031    9.282127    7.266677          0         32
 startexpsqr |      2,031    138.9365    176.7051          0       1024
   higheredu |      2,031    .3028065    .4595854          0          1
-------------+---------------------------------------------------------
    adultedu |      2,031    .1565731    .3634873          0          1
          m1 |      2,031    1.140968    .1339661   .8225553   1.722408
          m2 |      2,031   -.5537066    .1440702  -.7214906  -.1836181
          m3 |      2,031   -.3186337    .1977517  -.7239554  -.0266805

. outreg2 using "`xlspath2_2'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provincedum15
>  if inrange(birthyear, 1971, 1992) & inrange(startwage2018, 172, 21651), sel(educat=male st
> artexp startexpsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entra
> nt_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10605.567
Iteration 1:  Log likelihood = -9098.7253
Iteration 2:  Log likelihood = -9007.3055
Iteration 3:  Log likelihood = -9002.8076
Iteration 4:  Log likelihood = -9002.7921

Multinomial logistic regression                   Number of obs   =      10344
                                                  LR chi2(12)     =    3205.55
                                                  Prob > chi2     =     0.0000
Log likelihood = -9002.7921                       Pseudo R2       =     0.1511

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1217528    .053058    -2.29   0.022    -.2257446    -.017761
    startexp |   .0774835   .0110759     7.00   0.000     .0557752    .0991918
 startexpsqr |  -.0014887   .0004559    -3.27   0.001    -.0023822   -.0005953
ins1_secge~e |  -1.153631   .3271871    -3.53   0.000    -1.794906   -.5123565
ins2_highe~e |  -.0292831   .0806467    -0.36   0.717    -.1873478    .1287816
ins3_vs_en~e |   1.067155   .3785239     2.82   0.005     .3252614    1.809048
       _cons |  -1.229706   .1237939    -9.93   0.000    -1.472338   -.9870748
-------------+----------------------------------------------------------------
3            |
        male |   .1675276   .0540541     3.10   0.002     .0615835    .2734717
    startexp |   .2813567   .0129277    21.76   0.000     .2560188    .3066945
 startexpsqr |  -.0039108   .0004395    -8.90   0.000    -.0047721   -.0030494
ins1_secge~e |   1.844673   .3538761     5.21   0.000     1.151089    2.538258
ins2_highe~e |  -.3690791   .0966165    -3.82   0.000    -.5584439   -.1797142
ins3_vs_en~e |  -1.078776   .4058827    -2.66   0.008    -1.874291   -.2832605
       _cons |  -3.230122   .1524412   -21.19   0.000    -3.528902   -2.931343
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,031
-------------+----------------------------------   F(21, 2009)     =     29.24
       Model |  349.326913        21  16.6346149   Prob > F        =    0.0000
    Residual |  1142.86758     2,009  .568873858   R-squared       =    0.2341
-------------+----------------------------------   Adj R-squared   =    0.2261
       Total |  1492.19449     2,030  .735071179   Root MSE        =    .75424

-------------------------------------------------------------------------------
voc_logs~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1412598   .0388981     3.63   0.000      .064975    .2175446
     startexp |   .3314005   .0386232     8.58   0.000     .2556548    .4071461
  startexpsqr |  -.0081876   .0010846    -7.55   0.000    -.0103145   -.0060606
    higheredu |   -.041158   .0392793    -1.05   0.295    -.1181905    .0358746
 provincedum2 |  -.4757305   .0953093    -4.99   0.000    -.6626458   -.2888151
 provincedum3 |  -.2713673   .1096424    -2.48   0.013     -.486392   -.0563426
 provincedum4 |  -.2992081   .0915531    -3.27   0.001     -.478757   -.1196592
 provincedum5 |  -.0625423   .0914995    -0.68   0.494    -.2419862    .1169015
 provincedum6 |  -.3894681    .103476    -3.76   0.000    -.5923996   -.1865366
 provincedum7 |  -.4451305   .0889574    -5.00   0.000     -.619589    -.270672
 provincedum8 |  -.3167779   .0881358    -3.59   0.000     -.489625   -.1439307
 provincedum9 |  -.2522835   .0942646    -2.68   0.008      -.43715   -.0674169
provincedum10 |  -.2832828   .0949275    -2.98   0.003    -.4694494   -.0971162
provincedum11 |  -.0720867   .0844562    -0.85   0.393    -.2377177    .0935443
provincedum12 |  -.3957387   .0969149    -4.08   0.000    -.5858029   -.2056746
provincedum13 |  -.1066471   .0960058    -1.11   0.267    -.2949283    .0816342
provincedum14 |  -.2782783   .1051801    -2.65   0.008    -.4845518   -.0720047
provincedum15 |  -.5424492   .1256992    -4.32   0.000    -.7889635   -.2959348
          _m1 |    2.94965   .4293186     6.87   0.000     2.107693    3.791606
          _m2 |  -1.293174    1.36201    -0.95   0.343    -3.964274    1.377925
          _m3 |   4.169558   1.288853     3.24   0.001      1.64193    6.697185
        _cons |   3.149053   .8581896     3.67   0.000     1.466018    4.832087
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   9.471482          .        .       .            .           .
        rho1 |   .9584324          .        .       .            .           .
        rho2 |  -.4201923          .        .       .            .           .
        rho3 |   1.354818          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provinced
> um15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(startwage2018, 172, 21651)

. sum voc_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provincedum15 m1 
> m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log~2018 |      2,031    7.645302    .8573629   5.156065    9.97727
        male |      2,031    .5056622    .5000911          0          1
    startexp |      2,031    9.282127    7.266677          0         32
 startexpsqr |      2,031    138.9365    176.7051          0       1024
   higheredu |      2,031    .3028065    .4595854          0          1
-------------+---------------------------------------------------------
provincedum2 |      2,031    .0640079    .2448272          0          1
provincedum3 |      2,031    .0423437    .2014216          0          1
provincedum4 |      2,031    .0699163    .2550687          0          1
provincedum5 |      2,031    .0773018    .2671355          0          1
provincedum6 |      2,031     .046775    .2112086          0          1
-------------+---------------------------------------------------------
provincedum7 |      2,031    .0910881    .2878053          0          1
provincedum8 |      2,031    .0822255    .2747756          0          1
provincedum9 |      2,031    .0674545    .2508692          0          1
provinced~10 |      2,031    .0699163    .2550687          0          1
provinced~11 |      2,031    .1161989    .3205422          0          1
-------------+---------------------------------------------------------
provinced~12 |      2,031    .0556376     .229277          0          1
provinced~13 |      2,031    .0649926    .2465735          0          1
provinced~14 |      2,031    .0433284    .2036455          0          1
provinced~15 |      2,031    .0285574    .1665998          0          1
          m1 |      2,031    1.140968    .1339661   .8225553   1.722408
-------------+---------------------------------------------------------
          m2 |      2,031   -.5537066    .1440702  -.7214906  -.1836181
          m3 |      2,031   -.3186337    .1977517  -.7239554  -.0266805

. outreg2 using "`xlspath2_2'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu if in
> range(birthyear, 1971, 1992) & inrange(startwage2018, 172, 21651), sel(educat=male startexp
>  startexpsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_rel
> ative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10605.567
Iteration 1:  Log likelihood = -9098.7253
Iteration 2:  Log likelihood = -9007.3055
Iteration 3:  Log likelihood = -9002.8076
Iteration 4:  Log likelihood = -9002.7921

Multinomial logistic regression                   Number of obs   =      10344
                                                  LR chi2(12)     =    3205.55
                                                  Prob > chi2     =     0.0000
Log likelihood = -9002.7921                       Pseudo R2       =     0.1511

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1217528    .053058    -2.29   0.022    -.2257446    -.017761
    startexp |   .0774835   .0110759     7.00   0.000     .0557752    .0991918
 startexpsqr |  -.0014887   .0004559    -3.27   0.001    -.0023822   -.0005953
ins1_secge~e |  -1.153631   .3271871    -3.53   0.000    -1.794906   -.5123565
ins2_highe~e |  -.0292831   .0806467    -0.36   0.717    -.1873478    .1287816
ins3_vs_en~e |   1.067155   .3785239     2.82   0.005     .3252614    1.809048
       _cons |  -1.229706   .1237939    -9.93   0.000    -1.472338   -.9870748
-------------+----------------------------------------------------------------
3            |
        male |   .1675276   .0540541     3.10   0.002     .0615835    .2734717
    startexp |   .2813567   .0129277    21.76   0.000     .2560188    .3066945
 startexpsqr |  -.0039108   .0004395    -8.90   0.000    -.0047721   -.0030494
ins1_secge~e |   1.844673   .3538761     5.21   0.000     1.151089    2.538258
ins2_highe~e |  -.3690791   .0966165    -3.82   0.000    -.5584439   -.1797142
ins3_vs_en~e |  -1.078776   .4058827    -2.66   0.008    -1.874291   -.2832605
       _cons |  -3.230122   .1524412   -21.19   0.000    -3.528902   -2.931343
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,229
-------------+----------------------------------   F(9, 5219)      =     76.39
       Model |  383.777391         9  42.6419324   Prob > F        =    0.0000
    Residual |  2913.44451     5,219  .558238075   R-squared       =    0.1164
-------------+----------------------------------   Adj R-squared   =    0.1149
       Total |  3297.22191     5,228  .630685139   Root MSE        =    .74715

------------------------------------------------------------------------------
gen_log~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1872154   .0229701     8.15   0.000     .1421844    .2322465
    startexp |   .3490001   .0227965    15.31   0.000     .3043094    .3936908
 startexpsqr |  -.0081579   .0008014   -10.18   0.000     -.009729   -.0065867
  highvocedu |   .1627515    .031785     5.12   0.000     .1004396    .2250635
  highgenedu |   .3487481   .0309686    11.26   0.000     .2880367    .4094595
    adultedu |   .0160394   .0396822     0.40   0.686    -.0617544    .0938332
         _m1 |   8.341547   .7498558    11.12   0.000     6.871516    9.811579
         _m2 |   .4323694   .4832634     0.89   0.371    -.5150292    1.379768
         _m3 |   6.889431   .7930673     8.69   0.000     5.334688    8.444175
       _cons |   9.921313   .2035007    48.75   0.000     9.522366    10.32026
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   28.19501          .        .       .            .           .
        rho1 |   1.570943          .        .       .            .           .
        rho2 |   .0814271          .        .       .            .           .
        rho3 |    1.29747          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu m
> 1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(startwage2018, 172, 21651)

. sum gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log~2018 |      5,229    7.875354    .7941569   5.160758   9.962615
        male |      5,229    .5391088    .4985158          0          1
    startexp |      5,229    6.968828    6.523747          0         32
 startexpsqr |      5,229     91.1157    145.7804          0       1024
  highvocedu |      5,229    .2512909    .4337969          0          1
-------------+---------------------------------------------------------
  highgenedu |      5,229    .4056225    .4910591          0          1
    adultedu |      5,229    .1091987    .3119182          0          1
          m1 |      5,229   -.2927732    .0412236  -.4266883  -.1098177
          m2 |      5,229    .4536393    .2829666   .1562716   1.537692
          m3 |      5,229   -.2574623    .1803084  -.7258683  -.0266805

. outreg2 using "`xlspath2_2'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu provi
> ncedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(startwage2018, 172, 21651
> ), sel(educat=male startexp startexpsqr ins1_secgen_entrant_relative ins2_highedu_entrant_r
> elative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10605.567
Iteration 1:  Log likelihood = -9098.7253
Iteration 2:  Log likelihood = -9007.3055
Iteration 3:  Log likelihood = -9002.8076
Iteration 4:  Log likelihood = -9002.7921

Multinomial logistic regression                   Number of obs   =      10344
                                                  LR chi2(12)     =    3205.55
                                                  Prob > chi2     =     0.0000
Log likelihood = -9002.7921                       Pseudo R2       =     0.1511

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1217528    .053058    -2.29   0.022    -.2257446    -.017761
    startexp |   .0774835   .0110759     7.00   0.000     .0557752    .0991918
 startexpsqr |  -.0014887   .0004559    -3.27   0.001    -.0023822   -.0005953
ins1_secge~e |  -1.153631   .3271871    -3.53   0.000    -1.794906   -.5123565
ins2_highe~e |  -.0292831   .0806467    -0.36   0.717    -.1873478    .1287816
ins3_vs_en~e |   1.067155   .3785239     2.82   0.005     .3252614    1.809048
       _cons |  -1.229706   .1237939    -9.93   0.000    -1.472338   -.9870748
-------------+----------------------------------------------------------------
3            |
        male |   .1675276   .0540541     3.10   0.002     .0615835    .2734717
    startexp |   .2813567   .0129277    21.76   0.000     .2560188    .3066945
 startexpsqr |  -.0039108   .0004395    -8.90   0.000    -.0047721   -.0030494
ins1_secge~e |   1.844673   .3538761     5.21   0.000     1.151089    2.538258
ins2_highe~e |  -.3690791   .0966165    -3.82   0.000    -.5584439   -.1797142
ins3_vs_en~e |  -1.078776   .4058827    -2.66   0.008    -1.874291   -.2832605
       _cons |  -3.230122   .1524412   -21.19   0.000    -3.528902   -2.931343
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,229
-------------+----------------------------------   F(23, 5205)     =     46.96
       Model |  566.618184        23  24.6355732   Prob > F        =    0.0000
    Residual |  2730.60372     5,205  .524611666   R-squared       =    0.1718
-------------+----------------------------------   Adj R-squared   =    0.1682
       Total |  3297.22191     5,228  .630685139   Root MSE        =     .7243

-------------------------------------------------------------------------------
gen_logs~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1608854   .0225399     7.14   0.000     .1166977     .205073
     startexp |   .2505048   .0235779    10.62   0.000     .2042822    .2967274
  startexpsqr |  -.0065902   .0007906    -8.34   0.000      -.00814   -.0050404
   highvocedu |   .1843923   .0308846     5.97   0.000     .1238455    .2449391
   highgenedu |   .3432776   .0302117    11.36   0.000       .28405    .4025052
     adultedu |    .009946   .0386921     0.26   0.797    -.0659067    .0857987
 provincedum2 |  -.7369249   .0541449   -13.61   0.000    -.8430716   -.6307782
 provincedum3 |  -.3618172   .0550257    -6.58   0.000    -.4696907   -.2539437
 provincedum4 |  -.3905877    .053807    -7.26   0.000    -.4960721   -.2851033
 provincedum5 |  -.1914214    .049534    -3.86   0.000     -.288529   -.0943139
 provincedum6 |  -.4395923   .0555019    -7.92   0.000    -.5483993   -.3307853
 provincedum7 |  -.5209166   .0536231    -9.71   0.000    -.6260404   -.4157928
 provincedum8 |  -.4382682   .0497785    -8.80   0.000     -.535855   -.3406815
 provincedum9 |  -.3635831   .0518355    -7.01   0.000    -.4652024   -.2619638
provincedum10 |   -.422977   .0546229    -7.74   0.000    -.5300609   -.3158932
provincedum11 |  -.1657823   .0444625    -3.73   0.000    -.2529475   -.0786171
provincedum12 |  -.4361911   .0560056    -7.79   0.000    -.5459856   -.3263966
provincedum13 |  -.4029759   .0528724    -7.62   0.000    -.5066281   -.2993238
provincedum14 |  -.3550779   .0698537    -5.08   0.000    -.4920205   -.2181353
provincedum15 |   -.792851   .0662029   -11.98   0.000    -.9226364   -.6630655
          _m1 |   6.789714   .7449362     9.11   0.000     5.329326    8.250102
          _m2 |   .2777466   .4724914     0.59   0.557     -.648535    1.204028
          _m3 |   4.145283   .8066662     5.14   0.000     2.563879    5.726688
        _cons |   9.741364   .2006316    48.55   0.000     9.348041    10.13469
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    16.0173          .        .       .            .           .
        rho1 |   1.696512          .        .       .            .           .
        rho2 |   .0693991          .        .       .            .           .
        rho3 |   1.035761          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu p
> rovincedum2-provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(startwage201
> 8, 172, 21651)

. sum gen_logstartwage2018 male startexp startexpsqr highvocedu highgenedu adultedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log~2018 |      5,229    7.875354    .7941569   5.160758   9.962615
        male |      5,229    .5391088    .4985158          0          1
    startexp |      5,229    6.968828    6.523747          0         32
 startexpsqr |      5,229     91.1157    145.7804          0       1024
  highvocedu |      5,229    .2512909    .4337969          0          1
-------------+---------------------------------------------------------
  highgenedu |      5,229    .4056225    .4910591          0          1
    adultedu |      5,229    .1091987    .3119182          0          1
provincedum2 |      5,229     .060241    .2379555          0          1
provincedum3 |      5,229    .0629183    .2428392          0          1
provincedum4 |      5,229    .0577548    .2333016          0          1
-------------+---------------------------------------------------------
provincedum5 |      5,229    .0812775    .2732869          0          1
provincedum6 |      5,229    .0535475    .2251441          0          1
provincedum7 |      5,229    .0621534     .241457          0          1
provincedum8 |      5,229    .0791738    .2700357          0          1
provincedum9 |      5,229    .0709505    .2567666          0          1
-------------+---------------------------------------------------------
provinced~10 |      5,229    .0606234    .2386611          0          1
provinced~11 |      5,229    .1334863    .3401321          0          1
provinced~12 |      5,229    .0510614     .220144          0          1
provinced~13 |      5,229    .0659782    .2482677          0          1
provinced~14 |      5,229    .0271562    .1625541          0          1
-------------+---------------------------------------------------------
provinced~15 |      5,229    .0348059    .1833054          0          1
          m1 |      5,229   -.2927732    .0412236  -.4266883  -.1098177
          m2 |      5,229    .4536393    .2829666   .1562716   1.537692
          m3 |      5,229   -.2574623    .1803084  -.7258683  -.0266805

. outreg2 using "`xlspath2_2'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_logstartwage2018 male startexp startexpsqr higheredu if inrange(birthyear, 1971
> , 1992) & inrange(startwage2018, 172, 21651), sel(educat=male startexp startexpsqr ins1_sec
> gen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlo
> git gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10605.567
Iteration 1:  Log likelihood = -9098.7253
Iteration 2:  Log likelihood = -9007.3055
Iteration 3:  Log likelihood = -9002.8076
Iteration 4:  Log likelihood = -9002.7921

Multinomial logistic regression                   Number of obs   =      10344
                                                  LR chi2(12)     =    3205.55
                                                  Prob > chi2     =     0.0000
Log likelihood = -9002.7921                       Pseudo R2       =     0.1511

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1217528    .053058    -2.29   0.022    -.2257446    -.017761
    startexp |   .0774835   .0110759     7.00   0.000     .0557752    .0991918
 startexpsqr |  -.0014887   .0004559    -3.27   0.001    -.0023822   -.0005953
ins1_secge~e |  -1.153631   .3271871    -3.53   0.000    -1.794906   -.5123565
ins2_highe~e |  -.0292831   .0806467    -0.36   0.717    -.1873478    .1287816
ins3_vs_en~e |   1.067155   .3785239     2.82   0.005     .3252614    1.809048
       _cons |  -1.229706   .1237939    -9.93   0.000    -1.472338   -.9870748
-------------+----------------------------------------------------------------
3            |
        male |   .1675276   .0540541     3.10   0.002     .0615835    .2734717
    startexp |   .2813567   .0129277    21.76   0.000     .2560188    .3066945
 startexpsqr |  -.0039108   .0004395    -8.90   0.000    -.0047721   -.0030494
ins1_secge~e |   1.844673   .3538761     5.21   0.000     1.151089    2.538258
ins2_highe~e |  -.3690791   .0966165    -3.82   0.000    -.5584439   -.1797142
ins3_vs_en~e |  -1.078776   .4058827    -2.66   0.008    -1.874291   -.2832605
       _cons |  -3.230122   .1524412   -21.19   0.000    -3.528902   -2.931343
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,229
-------------+----------------------------------   F(7, 5221)      =     81.30
       Model |  324.079532         7  46.2970759   Prob > F        =    0.0000
    Residual |  2973.14237     5,221  .569458413   R-squared       =    0.0983
-------------+----------------------------------   Adj R-squared   =    0.0971
       Total |  3297.22191     5,228  .630685139   Root MSE        =    .75462

------------------------------------------------------------------------------
gen_log~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1926243   .0231936     8.31   0.000     .1471551    .2380934
    startexp |   .3569181   .0229617    15.54   0.000     .3119036    .4019326
 startexpsqr |  -.0083159   .0008088   -10.28   0.000    -.0099015   -.0067302
   higheredu |   .2184112   .0280629     7.78   0.000     .1633961    .2734263
         _m1 |   8.632582   .7559849    11.42   0.000     7.150536    10.11463
         _m2 |   .4731096   .4878299     0.97   0.332     -.483241     1.42946
         _m3 |   7.249685   .8001973     9.06   0.000     5.680963    8.818406
       _cons |   10.05387   .2048596    49.08   0.000     9.652263    10.45548
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   30.51473          .        .       .            .           .
        rho1 |   1.562737          .        .       .            .           .
        rho2 |    .085646          .        .       .            .           .
        rho3 |   1.312394          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_logstartwage2018 male startexp startexpsqr higheredu m1 m2 m3 if inrange(bi
> rthyear, 1971, 1992) & inrange(startwage2018, 172, 21651)

. sum gen_logstartwage2018 male startexp startexpsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log~2018 |      5,229    7.875354    .7941569   5.160758   9.962615
        male |      5,229    .5391088    .4985158          0          1
    startexp |      5,229    6.968828    6.523747          0         32
 startexpsqr |      5,229     91.1157    145.7804          0       1024
   higheredu |      5,229    .7661121    .4233422          0          1
-------------+---------------------------------------------------------
    adultedu |      5,229    .1091987    .3119182          0          1
          m1 |      5,229   -.2927732    .0412236  -.4266883  -.1098177
          m2 |      5,229    .4536393    .2829666   .1562716   1.537692
          m3 |      5,229   -.2574623    .1803084  -.7258683  -.0266805

. outreg2 using "`xlspath2_2'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provincedum15
>  if inrange(birthyear, 1971, 1992) & inrange(startwage2018, 172, 21651), sel(educat=male st
> artexp startexpsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entra
> nt_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10605.567
Iteration 1:  Log likelihood = -9098.7253
Iteration 2:  Log likelihood = -9007.3055
Iteration 3:  Log likelihood = -9002.8076
Iteration 4:  Log likelihood = -9002.7921

Multinomial logistic regression                   Number of obs   =      10344
                                                  LR chi2(12)     =    3205.55
                                                  Prob > chi2     =     0.0000
Log likelihood = -9002.7921                       Pseudo R2       =     0.1511

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1217528    .053058    -2.29   0.022    -.2257446    -.017761
    startexp |   .0774835   .0110759     7.00   0.000     .0557752    .0991918
 startexpsqr |  -.0014887   .0004559    -3.27   0.001    -.0023822   -.0005953
ins1_secge~e |  -1.153631   .3271871    -3.53   0.000    -1.794906   -.5123565
ins2_highe~e |  -.0292831   .0806467    -0.36   0.717    -.1873478    .1287816
ins3_vs_en~e |   1.067155   .3785239     2.82   0.005     .3252614    1.809048
       _cons |  -1.229706   .1237939    -9.93   0.000    -1.472338   -.9870748
-------------+----------------------------------------------------------------
3            |
        male |   .1675276   .0540541     3.10   0.002     .0615835    .2734717
    startexp |   .2813567   .0129277    21.76   0.000     .2560188    .3066945
 startexpsqr |  -.0039108   .0004395    -8.90   0.000    -.0047721   -.0030494
ins1_secge~e |   1.844673   .3538761     5.21   0.000     1.151089    2.538258
ins2_highe~e |  -.3690791   .0966165    -3.82   0.000    -.5584439   -.1797142
ins3_vs_en~e |  -1.078776   .4058827    -2.66   0.008    -1.874291   -.2832605
       _cons |  -3.230122   .1524412   -21.19   0.000    -3.528902   -2.931343
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,229
-------------+----------------------------------   F(21, 5207)     =     45.55
       Model |  511.676426        21  24.3655441   Prob > F        =    0.0000
    Residual |  2785.54548     5,207  .534961682   R-squared       =    0.1552
-------------+----------------------------------   Adj R-squared   =    0.1518
       Total |  3297.22191     5,228  .630685139   Root MSE        =    .73141

-------------------------------------------------------------------------------
gen_logs~2018 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1656519   .0227562     7.28   0.000     .1210402    .2102635
     startexp |   .2592219   .0237093    10.93   0.000     .2127417    .3057021
  startexpsqr |  -.0067949   .0007974    -8.52   0.000     -.008358   -.0052317
    higheredu |   .2233309   .0273224     8.17   0.000     .1697676    .2768943
 provincedum2 |  -.7515246    .054483   -13.79   0.000    -.8583341   -.6447152
 provincedum3 |  -.3685322    .055496    -6.64   0.000    -.4773277   -.2597367
 provincedum4 |  -.3825704   .0543204    -7.04   0.000    -.4890612   -.2760796
 provincedum5 |  -.1804321   .0499187    -3.61   0.000    -.2782937   -.0825705
 provincedum6 |  -.4377041   .0559146    -7.83   0.000    -.5473202    -.328088
 provincedum7 |  -.5179383   .0540331    -9.59   0.000    -.6238658   -.4120108
 provincedum8 |  -.4415399   .0500788    -8.82   0.000    -.5397154   -.3433643
 provincedum9 |  -.3624845   .0522322    -6.94   0.000    -.4648815   -.2600874
provincedum10 |  -.4405631   .0550009    -8.01   0.000    -.5483879   -.3327383
provincedum11 |  -.1687408   .0447896    -3.77   0.000    -.2565473   -.0809343
provincedum12 |  -.4456939   .0565007    -7.89   0.000     -.556459   -.3349289
provincedum13 |  -.4142203   .0532884    -7.77   0.000    -.5186879   -.3097527
provincedum14 |  -.3651999   .0705258    -5.18   0.000      -.50346   -.2269397
provincedum15 |  -.7846556   .0668291   -11.74   0.000    -.9156688   -.6536425
          _m1 |   7.118723   .7503705     9.49   0.000     5.647682    8.589764
          _m2 |   .3277376   .4768507     0.69   0.492    -.6070898    1.262565
          _m3 |   4.504166    .813574     5.54   0.000      2.90922    6.099113
        _cons |   9.880826   .2018973    48.94   0.000     9.485023    10.27663
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   17.84777          .        .       .            .           .
        rho1 |    1.68504          .        .       .            .           .
        rho2 |   .0775772          .        .       .            .           .
        rho3 |    1.06616          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provinced
> um15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(startwage2018, 172, 21651)

. sum gen_logstartwage2018 male startexp startexpsqr higheredu provincedum2-provincedum15 m1 
> m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log~2018 |      5,229    7.875354    .7941569   5.160758   9.962615
        male |      5,229    .5391088    .4985158          0          1
    startexp |      5,229    6.968828    6.523747          0         32
 startexpsqr |      5,229     91.1157    145.7804          0       1024
   higheredu |      5,229    .7661121    .4233422          0          1
-------------+---------------------------------------------------------
provincedum2 |      5,229     .060241    .2379555          0          1
provincedum3 |      5,229    .0629183    .2428392          0          1
provincedum4 |      5,229    .0577548    .2333016          0          1
provincedum5 |      5,229    .0812775    .2732869          0          1
provincedum6 |      5,229    .0535475    .2251441          0          1
-------------+---------------------------------------------------------
provincedum7 |      5,229    .0621534     .241457          0          1
provincedum8 |      5,229    .0791738    .2700357          0          1
provincedum9 |      5,229    .0709505    .2567666          0          1
provinced~10 |      5,229    .0606234    .2386611          0          1
provinced~11 |      5,229    .1334863    .3401321          0          1
-------------+---------------------------------------------------------
provinced~12 |      5,229    .0510614     .220144          0          1
provinced~13 |      5,229    .0659782    .2482677          0          1
provinced~14 |      5,229    .0271562    .1625541          0          1
provinced~15 |      5,229    .0348059    .1833054          0          1
          m1 |      5,229   -.2927732    .0412236  -.4266883  -.1098177
-------------+---------------------------------------------------------
          m2 |      5,229    .4536393    .2829666   .1562716   1.537692
          m3 |      5,229   -.2574623    .1803084  -.7258683  -.0266805

. outreg2 using "`xlspath2_2'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Start Wage NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. *3) Wage Growth
. 
. *With Outliners
. selmlog voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear,
>  1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_
> relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,866
-------------+----------------------------------   F(9, 1856)      =      1.66
       Model |  8.29220999         9  .921356665   Prob > F        =    0.0923
    Residual |  1027.13078     1,856  .553410983   R-squared       =    0.0080
-------------+----------------------------------   Adj R-squared   =    0.0032
       Total |  1035.42299     1,865  .555186592   Root MSE        =    .74392

------------------------------------------------------------------------------
voc_wagegr~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0570516    .043626    -1.31   0.191    -.1426128    .0285095
         exp |   .0089402   .0377981     0.24   0.813     -.065191    .0830715
      expsqr |  -.0003973   .0011418    -0.35   0.728    -.0026366     .001842
  highvocedu |   .0997345   .0566904     1.76   0.079    -.0114492    .2109182
  highgenedu |  -.0286751   .0998183    -0.29   0.774    -.2244432    .1670929
    adultedu |   .0495116   .0478828     1.03   0.301    -.0443982    .1434215
         _m1 |   .4037627   .3001657     1.35   0.179    -.1849353    .9924606
         _m2 |   -1.40135   .8163573    -1.72   0.086    -3.002425    .1997251
         _m3 |  -1.044138   .7127359    -1.46   0.143    -2.441986    .3537103
       _cons |   -1.40192   1.135523    -1.23   0.217    -3.628956    .8251168
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.179366          .        .       .            .           .
        rho1 |   .3717935          .        .       .            .           .
        rho2 |  -1.290394          .        .       .            .           .
        rho3 |  -.9614652          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inran
> ge(birthyear, 1971, 1992)

. sum voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_wagegr~h |      1,866    .1575666    .7451084   -.917979    15.4042
        male |      1,866    .5144695    .4999246          0          1
         exp |      1,866     18.0911    6.363709          1         32
      expsqr |      1,866    367.7631    233.3679          1       1024
  highvocedu |      1,866    .1152197    .3193725          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,866    .0316184    .1750289          0          1
    adultedu |      1,866    .1672026    .3732567          0          1
          m1 |      1,866    1.129921    .1845627   .8161486   2.152648
          m2 |      1,866   -.5216653    .1455064  -.7260005  -.0301977
          m3 |      1,866   -.3515744    .1890579  -.7259521  -.0050685

. outreg2 using "`xlspath3_1'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-province
> dum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_rel
> ative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,866
-------------+----------------------------------   F(23, 1842)     =      1.10
       Model |  13.9924479        23  .608367298   Prob > F        =    0.3398
    Residual |  1021.43055     1,842  .554522555   R-squared       =    0.0135
-------------+----------------------------------   Adj R-squared   =    0.0012
       Total |  1035.42299     1,865  .555186592   Root MSE        =    .74466

-------------------------------------------------------------------------------
voc_wagegro~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0427565   .0464406    -0.92   0.357    -.1338382    .0483252
          exp |  -.0056596    .041754    -0.14   0.892    -.0875497    .0762305
       expsqr |   .0000171   .0012447     0.01   0.989    -.0024241    .0024582
   highvocedu |    .102845   .0573229     1.79   0.073    -.0095797    .2152698
   highgenedu |   -.027909   .1007542    -0.28   0.782    -.2255134    .1696954
     adultedu |    .060307   .0491607     1.23   0.220    -.0361095    .1567235
 provincedum2 |   -.000203   .1015149    -0.00   0.998    -.1992994    .1988934
 provincedum3 |   .0026992   .1045947     0.03   0.979    -.2024373    .2078358
 provincedum4 |  -.0761824   .0988089    -0.77   0.441    -.2699717     .117607
 provincedum5 |   .0048223    .092155     0.05   0.958    -.1759169    .1855615
 provincedum6 |  -.0454779   .1143229    -0.40   0.691    -.2696939    .1787381
 provincedum7 |   .0833838   .0970079     0.86   0.390    -.1068733    .2736409
 provincedum8 |   .0749014   .1014869     0.74   0.461    -.1241401    .2739429
 provincedum9 |   .0496676   .0985772     0.50   0.614    -.1436672    .2430024
provincedum10 |   .1025259   .0965544     1.06   0.288    -.0868417    .2918935
provincedum11 |  -.0076482   .0913894    -0.08   0.933    -.1868859    .1715895
provincedum12 |   .0041691   .1018799     0.04   0.967    -.1956431    .2039813
provincedum13 |   .1361865   .1011087     1.35   0.178    -.0621132    .3344863
provincedum14 |  -.0043223   .1112976    -0.04   0.969    -.2226049    .2139604
provincedum15 |  -.0361508   .1211953    -0.30   0.766    -.2738455    .2015439
          _m1 |   .2753932   .3334325     0.83   0.409    -.3785522    .9293386
          _m2 |  -1.044877   .9350127    -1.12   0.264    -2.878673     .788919
          _m3 |  -.7884317   .7774581    -1.01   0.311    -2.313223      .73636
        _cons |  -.9032634   1.266173    -0.71   0.476    -3.386548    1.580022
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .8914376          .        .       .            .           .
        rho1 |   .2916807          .        .       .            .           .
        rho2 |  -1.106674          .        .       .            .           .
        rho3 |  -.8350617          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-prov
> incedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum1
> 5 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_wagegr~h |      1,866    .1575666    .7451084   -.917979    15.4042
        male |      1,866    .5144695    .4999246          0          1
         exp |      1,866     18.0911    6.363709          1         32
      expsqr |      1,866    367.7631    233.3679          1       1024
  highvocedu |      1,866    .1152197    .3193725          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,866    .0316184    .1750289          0          1
    adultedu |      1,866    .1672026    .3732567          0          1
provincedum2 |      1,866    .0637728    .2444132          0          1
provincedum3 |      1,866    .0444802    .2062146          0          1
provincedum4 |      1,866    .0669882    .2500686          0          1
-------------+---------------------------------------------------------
provincedum5 |      1,866    .0760986    .2652269          0          1
provincedum6 |      1,866    .0444802    .2062146          0          1
provincedum7 |      1,866    .0937835    .2916054          0          1
provincedum8 |      1,866    .0830654     .276055          0          1
provincedum9 |      1,866    .0605573    .2385805          0          1
-------------+---------------------------------------------------------
provinced~10 |      1,866      .06806    .2519164          0          1
provinced~11 |      1,866    .1146838    .3187254          0          1
provinced~12 |      1,866    .0594855    .2365946          0          1
provinced~13 |      1,866    .0664523    .2491378          0          1
provinced~14 |      1,866    .0428725    .2026238          0          1
-------------+---------------------------------------------------------
provinced~15 |      1,866    .0321543    .1764571          0          1
          m1 |      1,866    1.129921    .1845627   .8161486   2.152648
          m2 |      1,866   -.5216653    .1455064  -.7260005  -.0301977
          m3 |      1,866   -.3515744    .1890579  -.7259521  -.0050685

. outreg2 using "`xlspath3_1'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_wagegrowth male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(edu
> cat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entr
> ant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,866
-------------+----------------------------------   F(7, 1858)      =      1.93
       Model |  7.46783296         7  1.06683328   Prob > F        =    0.0615
    Residual |  1027.95516     1,858  .553258967   R-squared       =    0.0072
-------------+----------------------------------   Adj R-squared   =    0.0035
       Total |  1035.42299     1,865  .555186592   Root MSE        =    .74381

------------------------------------------------------------------------------
voc_wagegr~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   -.056818   .0436064    -1.30   0.193    -.1423407    .0287048
         exp |   .0082339   .0376079     0.22   0.827    -.0655242    .0819921
      expsqr |  -.0003948   .0011377    -0.35   0.729     -.002626    .0018364
   higheredu |   .0597354   .0381806     1.56   0.118    -.0151459    .1346168
         _m1 |   .4107473   .2999361     1.37   0.171    -.1774998    .9989944
         _m2 |  -1.436409   .8155865    -1.76   0.078    -3.035971    .1631535
         _m3 |  -1.078651   .7119522    -1.52   0.130    -2.474961    .3176592
       _cons |  -1.428397   1.133852    -1.26   0.208    -3.652154    .7953605
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.213771          .        .       .            .           .
        rho1 |   .3728261          .        .       .            .           .
        rho2 |  -1.303796          .        .       .            .           .
        rho3 |  -.9790674          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_wagegrowth male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1
> 992)

. sum voc_wagegrowth male exp expsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_wagegr~h |      1,866    .1575666    .7451084   -.917979    15.4042
        male |      1,866    .5144695    .4999246          0          1
         exp |      1,866     18.0911    6.363709          1         32
      expsqr |      1,866    367.7631    233.3679          1       1024
   higheredu |      1,866    .3140407    .4642571          0          1
-------------+---------------------------------------------------------
    adultedu |      1,866    .1672026    .3732567          0          1
          m1 |      1,866    1.129921    .1845627   .8161486   2.152648
          m2 |      1,866   -.5216653    .1455064  -.7260005  -.0301977
          m3 |      1,866   -.3515744    .1890579  -.7259521  -.0050685

. outreg2 using "`xlspath3_1'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 if inrange(birt
> hyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_en
> trant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,866
-------------+----------------------------------   F(21, 1844)     =      1.13
       Model |  13.1884155        21  .628019784   Prob > F        =    0.3048
    Residual |  1022.23458     1,844  .554357147   R-squared       =    0.0127
-------------+----------------------------------   Adj R-squared   =    0.0015
       Total |  1035.42299     1,865  .555186592   Root MSE        =    .74455

-------------------------------------------------------------------------------
voc_wagegro~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.042211   .0463961    -0.91   0.363    -.1332053    .0487834
          exp |   -.006233   .0415336    -0.15   0.881    -.0876908    .0752248
       expsqr |   .0000154     .00124     0.01   0.990    -.0024166    .0024473
    higheredu |   .0670112   .0392375     1.71   0.088    -.0099435    .1439658
 provincedum2 |   .0071864   .1012538     0.07   0.943    -.1913977    .2057705
 provincedum3 |   .0082247   .1043832     0.08   0.937    -.1964969    .2129463
 provincedum4 |  -.0700229   .0985507    -0.71   0.477    -.2633056    .1232598
 provincedum5 |   .0123112   .0917895     0.13   0.893     -.167711    .1923334
 provincedum6 |   -.040135    .114202    -0.35   0.725    -.2641137    .1838438
 provincedum7 |   .0855738   .0966017     0.89   0.376    -.1038864     .275034
 provincedum8 |   .0810989   .1011704     0.80   0.423    -.1173217    .2795195
 provincedum9 |   .0562941   .0983997     0.57   0.567    -.1366924    .2492806
provincedum10 |   .1093985   .0963316     1.14   0.256    -.0795319     .298329
provincedum11 |  -.0019754   .0911167    -0.02   0.983    -.1806781    .1767273
provincedum12 |    .010006   .1017133     0.10   0.922    -.1894793    .2094913
provincedum13 |   .1423102   .1008395     1.41   0.158    -.0554614    .3400819
provincedum14 |    .001528   .1111731     0.01   0.989    -.2165104    .2195664
provincedum15 |  -.0343968   .1211541    -0.28   0.777    -.2720104    .2032168
          _m1 |   .2798117   .3330956     0.84   0.401    -.3734725    .9330958
          _m2 |  -1.063403   .9338336    -1.14   0.255    -2.894886    .7680788
          _m3 |  -.8148401   .7765604    -1.05   0.294     -2.33787      .70819
        _cons |  -.9217157   1.263462    -0.73   0.466    -3.399683    1.556251
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .9080532          .        .       .            .           .
        rho1 |   .2936366          .        .       .            .           .
        rho2 |  -1.115944          .        .       .            .           .
        rho3 |  -.8550997          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if
>  inrange(birthyear, 1971, 1992)

. sum voc_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_wagegr~h |      1,866    .1575666    .7451084   -.917979    15.4042
        male |      1,866    .5144695    .4999246          0          1
         exp |      1,866     18.0911    6.363709          1         32
      expsqr |      1,866    367.7631    233.3679          1       1024
   higheredu |      1,866    .3140407    .4642571          0          1
-------------+---------------------------------------------------------
provincedum2 |      1,866    .0637728    .2444132          0          1
provincedum3 |      1,866    .0444802    .2062146          0          1
provincedum4 |      1,866    .0669882    .2500686          0          1
provincedum5 |      1,866    .0760986    .2652269          0          1
provincedum6 |      1,866    .0444802    .2062146          0          1
-------------+---------------------------------------------------------
provincedum7 |      1,866    .0937835    .2916054          0          1
provincedum8 |      1,866    .0830654     .276055          0          1
provincedum9 |      1,866    .0605573    .2385805          0          1
provinced~10 |      1,866      .06806    .2519164          0          1
provinced~11 |      1,866    .1146838    .3187254          0          1
-------------+---------------------------------------------------------
provinced~12 |      1,866    .0594855    .2365946          0          1
provinced~13 |      1,866    .0664523    .2491378          0          1
provinced~14 |      1,866    .0428725    .2026238          0          1
provinced~15 |      1,866    .0321543    .1764571          0          1
          m1 |      1,866    1.129921    .1845627   .8161486   2.152648
-------------+---------------------------------------------------------
          m2 |      1,866   -.5216653    .1455064  -.7260005  -.0301977
          m3 |      1,866   -.3515744    .1890579  -.7259521  -.0050685

. outreg2 using "`xlspath3_1'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear,
>  1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_
> relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,947
-------------+----------------------------------   F(9, 4937)      =      3.53
       Model |  8.39797446         9  .933108274   Prob > F        =    0.0002
    Residual |  1303.98728     4,937  .264125437   R-squared       =    0.0064
-------------+----------------------------------   Adj R-squared   =    0.0046
       Total |  1312.38526     4,946  .265342753   Root MSE        =    .51393

------------------------------------------------------------------------------
gen_wagegr~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0060886   .0164187    -0.37   0.711    -.0382765    .0260994
         exp |  -.0004124    .012997    -0.03   0.975    -.0258924    .0250675
      expsqr |  -.0001674   .0004167    -0.40   0.688    -.0009843    .0006495
  highvocedu |  -.0512139   .0228452    -2.24   0.025    -.0960006   -.0064271
  highgenedu |  -.0539007   .0217076    -2.48   0.013    -.0964573   -.0113441
    adultedu |   -.045582   .0271137    -1.68   0.093    -.0987369     .007573
         _m1 |   .2106612   .2823283     0.75   0.456    -.3428279    .7641502
         _m2 |   -.022713   .0812694    -0.28   0.780    -.1820371    .1366111
         _m3 |  -.0382313   .1855685    -0.21   0.837     -.402028    .3255655
       _cons |   .3031522   .0445944     6.80   0.000     .2157274     .390577
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2752371          .        .       .            .           .
        rho1 |   .4015421          .        .       .            .           .
        rho2 |  -.0432933          .        .       .            .           .
        rho3 |  -.0728727          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inran
> ge(birthyear, 1971, 1992)

. sum gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_wagegr~h |      4,947    .1477777    .5151143  -.9486358   12.67017
        male |      4,947    .5431575    .4981843          0          1
         exp |      4,947    15.21063    6.936377          0         33
      expsqr |      4,947    279.4669    232.5505          0       1089
  highvocedu |      4,947    .2488377    .4323833          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,947    .4119668    .4922389          0          1
    adultedu |      4,947    .1103699     .313382          0          1
          m1 |      4,947   -.2767809    .0695575  -.4278784  -.0452841
          m2 |      4,947    .4722061    .3552428   .0031895   2.421548
          m3 |      4,947    -.261605    .2012325  -.7259181  -.0015162

. outreg2 using "`xlspath3_1'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-province
> dum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_rel
> ative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,947
-------------+----------------------------------   F(23, 4923)     =      2.26
       Model |  13.7132226        23   .59622707   Prob > F        =    0.0005
    Residual |  1298.67204     4,923  .263796879   R-squared       =    0.0104
-------------+----------------------------------   Adj R-squared   =    0.0058
       Total |  1312.38526     4,946  .265342753   Root MSE        =    .51361

-------------------------------------------------------------------------------
gen_wagegro~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0046563    .016742    -0.28   0.781     -.037478    .0281654
          exp |  -.0013557   .0137308    -0.10   0.921    -.0282743    .0255628
       expsqr |  -.0001558   .0004333    -0.36   0.719    -.0010054    .0006937
   highvocedu |  -.0511713   .0230131    -2.22   0.026    -.0962873   -.0060553
   highgenedu |  -.0477726   .0223823    -2.13   0.033    -.0916518   -.0038934
     adultedu |  -.0408439    .027412    -1.49   0.136    -.0945836    .0128958
 provincedum2 |   .0302756   .0391378     0.77   0.439     -.046452    .1070032
 provincedum3 |   .0975798   .0369864     2.64   0.008       .02507    .1700897
 provincedum4 |  -.0160155    .039902    -0.40   0.688    -.0942412    .0622103
 provincedum5 |   .0769473   .0350792     2.19   0.028     .0081764    .1457182
 provincedum6 |   .0261496   .0421529     0.62   0.535    -.0564889     .108788
 provincedum7 |   .0684681   .0396856     1.73   0.085    -.0093335    .1462696
 provincedum8 |   .0695517   .0387574     1.79   0.073    -.0064301    .1455335
 provincedum9 |   .0609678   .0371146     1.64   0.101    -.0117934     .133729
provincedum10 |   .0630877   .0388975     1.62   0.105    -.0131688    .1393442
provincedum11 |    .032307    .033102     0.98   0.329    -.0325877    .0972017
provincedum12 |   .0483338   .0412789     1.17   0.242    -.0325913    .1292588
provincedum13 |   .1037817   .0382846     2.71   0.007     .0287269    .1788366
provincedum14 |   .0316312   .0521392     0.61   0.544    -.0705849    .1338473
provincedum15 |   .0181065   .0455509     0.40   0.691    -.0711935    .1074066
          _m1 |   .1742163   .3011255     0.58   0.563     -.416124    .7645567
          _m2 |   .0181402   .0856287     0.21   0.832    -.1497303    .1860107
          _m3 |   .0181224   .1900614     0.10   0.924    -.3544826    .3907274
        _cons |   .2480849   .0527402     4.70   0.000     .1446906    .3514791
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2703576          .        .       .            .           .
        rho1 |   .3350576          .        .       .            .           .
        rho2 |   .0348877          .        .       .            .           .
        rho3 |   .0348535          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-prov
> incedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

. sum gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum1
> 5 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_wagegr~h |      4,947    .1477777    .5151143  -.9486358   12.67017
        male |      4,947    .5431575    .4981843          0          1
         exp |      4,947    15.21063    6.936377          0         33
      expsqr |      4,947    279.4669    232.5505          0       1089
  highvocedu |      4,947    .2488377    .4323833          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,947    .4119668    .4922389          0          1
    adultedu |      4,947    .1103699     .313382          0          1
provincedum2 |      4,947     .060845    .2390699          0          1
provincedum3 |      4,947    .0644835    .2456371          0          1
provincedum4 |      4,947    .0555892    .2291499          0          1
-------------+---------------------------------------------------------
provincedum5 |      4,947    .0830807     .276032          0          1
provincedum6 |      4,947    .0515464    .2211317          0          1
provincedum7 |      4,947    .0624621    .2420174          0          1
provincedum8 |      4,947    .0776228    .2676041          0          1
provincedum9 |      4,947    .0673135    .2505895          0          1
-------------+---------------------------------------------------------
provinced~10 |      4,947    .0602385    .2379523          0          1
provinced~11 |      4,947    .1338185    .3404916          0          1
provinced~12 |      4,947    .0511421    .2203098          0          1
provinced~13 |      4,947    .0658985    .2481297          0          1
provinced~14 |      4,947    .0272893    .1629415          0          1
-------------+---------------------------------------------------------
provinced~15 |      4,947    .0359814    .1862626          0          1
          m1 |      4,947   -.2767809    .0695575  -.4278784  -.0452841
          m2 |      4,947    .4722061    .3552428   .0031895   2.421548
          m3 |      4,947    -.261605    .2012325  -.7259181  -.0015162

. outreg2 using "`xlspath3_1'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_wagegrowth male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(edu
> cat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entr
> ant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,947
-------------+----------------------------------   F(7, 4939)      =      4.53
       Model |  8.36968404         7  1.19566915   Prob > F        =    0.0000
    Residual |  1304.01557     4,939   .26402421   R-squared       =    0.0064
-------------+----------------------------------   Adj R-squared   =    0.0050
       Total |  1312.38526     4,946  .265342753   Root MSE        =    .51383

------------------------------------------------------------------------------
gen_wagegr~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0061804   .0164057    -0.38   0.706    -.0383428    .0259819
         exp |  -.0003799   .0129913    -0.03   0.977    -.0258486    .0250888
      expsqr |  -.0001681   .0004166    -0.40   0.687    -.0009848    .0006485
   higheredu |  -.0511042   .0193896    -2.64   0.008    -.0891164    -.013092
         _m1 |   .2087454   .2820882     0.74   0.459    -.3442728    .7617635
         _m2 |  -.0229794   .0812409    -0.28   0.777    -.1822477    .1362888
         _m3 |  -.0418865   .1851875    -0.23   0.821    -.4049364    .3211633
       _cons |   .3009811   .0440891     6.83   0.000      .214547    .3874153
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2750943          .        .       .            .           .
        rho1 |   .3979935          .        .       .            .           .
        rho2 |  -.0438126          .        .       .            .           .
        rho3 |  -.0798608          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_wagegrowth male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1
> 992)

. sum gen_wagegrowth male exp expsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_wagegr~h |      4,947    .1477777    .5151143  -.9486358   12.67017
        male |      4,947    .5431575    .4981843          0          1
         exp |      4,947    15.21063    6.936377          0         33
      expsqr |      4,947    279.4669    232.5505          0       1089
   higheredu |      4,947    .7711744    .4201191          0          1
-------------+---------------------------------------------------------
    adultedu |      4,947    .1103699     .313382          0          1
          m1 |      4,947   -.2767809    .0695575  -.4278784  -.0452841
          m2 |      4,947    .4722061    .3552428   .0031895   2.421548
          m3 |      4,947    -.261605    .2012325  -.7259181  -.0015162

. outreg2 using "`xlspath3_1'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 if inrange(birt
> hyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_en
> trant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,947
-------------+----------------------------------   F(21, 4925)     =      2.47
       Model |  13.6744273        21  .651163204   Prob > F        =    0.0002
    Residual |  1298.71083     4,925  .263697631   R-squared       =    0.0104
-------------+----------------------------------   Adj R-squared   =    0.0062
       Total |  1312.38526     4,946  .265342753   Root MSE        =    .51351

-------------------------------------------------------------------------------
gen_wagegro~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0049115   .0167195    -0.29   0.769    -.0376892    .0278662
          exp |  -.0011956     .01371    -0.09   0.931    -.0280733    .0256822
       expsqr |  -.0001594    .000433    -0.37   0.713    -.0010082    .0006895
    higheredu |  -.0474105   .0198142    -2.39   0.017    -.0862551   -.0085658
 provincedum2 |   .0296035   .0388912     0.76   0.447    -.0466406    .1058476
 provincedum3 |    .097286   .0369386     2.63   0.008       .02487    .1697021
 provincedum4 |  -.0162783    .039866    -0.41   0.683    -.0944335    .0618768
 provincedum5 |   .0763177   .0350162     2.18   0.029     .0076704     .144965
 provincedum6 |   .0255817   .0420079     0.61   0.543    -.0567726     .107936
 provincedum7 |    .067722   .0395169     1.71   0.087    -.0097487    .1451927
 provincedum8 |   .0687188   .0384676     1.79   0.074    -.0066948    .1441324
 provincedum9 |   .0602455   .0370093     1.63   0.104    -.0123091    .1328002
provincedum10 |   .0624691   .0386776     1.62   0.106    -.0133561    .1382944
provincedum11 |   .0317165   .0328693     0.96   0.335     -.032722     .096155
provincedum12 |   .0479739   .0411387     1.17   0.244    -.0326763    .1286242
provincedum13 |   .1032461   .0380745     2.71   0.007     .0286032    .1778891
provincedum14 |   .0317974   .0520351     0.61   0.541    -.0702146    .1338094
provincedum15 |   .0177301   .0455297     0.39   0.697    -.0715284    .1069886
          _m1 |   .1767654   .3002276     0.59   0.556    -.4118145    .7653454
          _m2 |   .0171287   .0855251     0.20   0.841    -.1505386    .1847961
          _m3 |    .014949   .1896906     0.08   0.937    -.3569292    .3868272
        _cons |   .2472613   .0519637     4.76   0.000     .1453892    .3491334
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .270562          .        .       .            .           .
        rho1 |   .3398318          .        .       .            .           .
        rho2 |     .03293          .        .       .            .           .
        rho3 |   .0287394          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if
>  inrange(birthyear, 1971, 1992)

. sum gen_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_wagegr~h |      4,947    .1477777    .5151143  -.9486358   12.67017
        male |      4,947    .5431575    .4981843          0          1
         exp |      4,947    15.21063    6.936377          0         33
      expsqr |      4,947    279.4669    232.5505          0       1089
   higheredu |      4,947    .7711744    .4201191          0          1
-------------+---------------------------------------------------------
provincedum2 |      4,947     .060845    .2390699          0          1
provincedum3 |      4,947    .0644835    .2456371          0          1
provincedum4 |      4,947    .0555892    .2291499          0          1
provincedum5 |      4,947    .0830807     .276032          0          1
provincedum6 |      4,947    .0515464    .2211317          0          1
-------------+---------------------------------------------------------
provincedum7 |      4,947    .0624621    .2420174          0          1
provincedum8 |      4,947    .0776228    .2676041          0          1
provincedum9 |      4,947    .0673135    .2505895          0          1
provinced~10 |      4,947    .0602385    .2379523          0          1
provinced~11 |      4,947    .1338185    .3404916          0          1
-------------+---------------------------------------------------------
provinced~12 |      4,947    .0511421    .2203098          0          1
provinced~13 |      4,947    .0658985    .2481297          0          1
provinced~14 |      4,947    .0272893    .1629415          0          1
provinced~15 |      4,947    .0359814    .1862626          0          1
          m1 |      4,947   -.2767809    .0695575  -.4278784  -.0452841
-------------+---------------------------------------------------------
          m2 |      4,947    .4722061    .3552428   .0031895   2.421548
          m3 |      4,947    -.261605    .2012325  -.7259181  -.0015162

. outreg2 using "`xlspath3_1'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth.xls
dir : seeout

. drop m1 m2 m3

. 
. *Without Outliers (99%)
. selmlog voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear,
>  1971, 1992) & inrange(wagegrowth, -.50, 1.66), sel(educat=male exp expsqr ins1_secgen_entr
> ant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(
> m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9554.3349
Iteration 1:  Log likelihood = -8119.6405
Iteration 2:  Log likelihood = -8012.3591
Iteration 3:  Log likelihood = -8002.0815
Iteration 4:  Log likelihood = -8001.9058
Iteration 5:  Log likelihood = -8001.9058

Multinomial logistic regression                   Number of obs   =       9381
                                                  LR chi2(12)     =    3104.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -8001.9058                       Pseudo R2       =     0.1625

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1682882   .0563631    -2.99   0.003    -.2787579   -.0578185
         exp |   .3472421   .0260893    13.31   0.000      .296108    .3983762
      expsqr |  -.0068117    .000661   -10.31   0.000    -.0081071   -.0055162
ins1_secge~e |   3.157032   .4365619     7.23   0.000     2.301386    4.012677
ins2_highe~e |   .1275559   .0897895     1.42   0.155    -.0484282      .30354
ins3_vs_en~e |   .8012641    .414502     1.93   0.053    -.0111449    1.613673
       _cons |  -5.694644    .325647   -17.49   0.000      -6.3329   -5.056388
-------------+----------------------------------------------------------------
3            |
        male |   .0326449   .0573249     0.57   0.569    -.0797098    .1449996
         exp |   .5680949    .032657    17.40   0.000     .5040883    .6321015
      expsqr |   -.007339   .0007381    -9.94   0.000    -.0087857   -.0058923
ins1_secge~e |   8.506877   .4784181    17.78   0.000     7.569194    9.444559
ins2_highe~e |   .5381778   .0959538     5.61   0.000     .3501118    .7262439
ins3_vs_en~e |  -.8392131   .4649414    -1.80   0.071    -1.750482    .0720553
       _cons |  -11.11759   .4303025   -25.84   0.000    -11.96097   -10.27421
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,837
-------------+----------------------------------   F(9, 1827)      =      5.68
       Model |  1.88178955         9  .209087728   Prob > F        =    0.0000
    Residual |  67.1985696     1,827  .036780826   R-squared       =    0.0272
-------------+----------------------------------   Adj R-squared   =    0.0224
       Total |  69.0803591     1,836  .037625468   Root MSE        =    .19178

------------------------------------------------------------------------------
voc_wagegr~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0198709   .0126971    -1.56   0.118    -.0447732    .0050314
         exp |  -.0001973   .0099318    -0.02   0.984    -.0196761    .0192815
      expsqr |  -.0001566   .0002905    -0.54   0.590    -.0007262    .0004131
  highvocedu |   .0117847   .0147674     0.80   0.425    -.0171781    .0407476
  highgenedu |   .0095401   .0257514     0.37   0.711    -.0409651    .0600453
    adultedu |   .0280858   .0123879     2.27   0.023     .0037898    .0523818
         _m1 |   .1171358   .0711612     1.65   0.100    -.0224301    .2567017
         _m2 |  -.3059719    .197356    -1.55   0.121     -.693039    .0810951
         _m3 |  -.2839593   .1726936    -1.64   0.100    -.6226569    .0547383
       _cons |  -.2123322     .26706    -0.80   0.427    -.7361073    .3114428
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0747345          .        .       .            .           .
        rho1 |   .4284785          .        .       .            .           .
        rho2 |  -1.119234          .        .       .            .           .
        rho3 |  -1.038713          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inran
> ge(birthyear, 1971, 1992) & inrange(wagegrowth, -.50, 1.66)

. sum voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_wagegr~h |      1,837    .1123704    .1939729   -.453731   1.526209
        male |      1,837     .513337    .4999582          0          1
         exp |      1,837    18.10942    6.369479          1         32
      expsqr |      1,837    368.4992    233.5151          1       1024
  highvocedu |      1,837    .1143168    .3182823          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,837    .0321176    .1763604          0          1
    adultedu |      1,837    .1687534    .3746359          0          1
          m1 |      1,837    1.123796    .1829457   .7959387    1.99701
          m2 |      1,837   -.5408471    .1389931      -.726  -.0485854
          m3 |      1,837   -.3262894    .1854466  -.7258732  -.0052854

. outreg2 using "`xlspath3_2'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-province
> dum15 if inrange(birthyear, 1971, 1992) & inrange(wagegrowth, -.50, 1.66), sel(educat=male 
> exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relat
> ive) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9554.3349
Iteration 1:  Log likelihood = -8119.6405
Iteration 2:  Log likelihood = -8012.3591
Iteration 3:  Log likelihood = -8002.0815
Iteration 4:  Log likelihood = -8001.9058
Iteration 5:  Log likelihood = -8001.9058

Multinomial logistic regression                   Number of obs   =       9381
                                                  LR chi2(12)     =    3104.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -8001.9058                       Pseudo R2       =     0.1625

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1682882   .0563631    -2.99   0.003    -.2787579   -.0578185
         exp |   .3472421   .0260893    13.31   0.000      .296108    .3983762
      expsqr |  -.0068117    .000661   -10.31   0.000    -.0081071   -.0055162
ins1_secge~e |   3.157032   .4365619     7.23   0.000     2.301386    4.012677
ins2_highe~e |   .1275559   .0897895     1.42   0.155    -.0484282      .30354
ins3_vs_en~e |   .8012641    .414502     1.93   0.053    -.0111449    1.613673
       _cons |  -5.694644    .325647   -17.49   0.000      -6.3329   -5.056388
-------------+----------------------------------------------------------------
3            |
        male |   .0326449   .0573249     0.57   0.569    -.0797098    .1449996
         exp |   .5680949    .032657    17.40   0.000     .5040883    .6321015
      expsqr |   -.007339   .0007381    -9.94   0.000    -.0087857   -.0058923
ins1_secge~e |   8.506877   .4784181    17.78   0.000     7.569194    9.444559
ins2_highe~e |   .5381778   .0959538     5.61   0.000     .3501118    .7262439
ins3_vs_en~e |  -.8392131   .4649414    -1.80   0.071    -1.750482    .0720553
       _cons |  -11.11759   .4303025   -25.84   0.000    -11.96097   -10.27421
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,837
-------------+----------------------------------   F(23, 1813)     =      2.83
       Model |  2.39772955        23  .104249111   Prob > F        =    0.0000
    Residual |  66.6826296     1,813   .03678027   R-squared       =    0.0347
-------------+----------------------------------   Adj R-squared   =    0.0225
       Total |  69.0803591     1,836  .037625468   Root MSE        =    .19178

-------------------------------------------------------------------------------
voc_wagegro~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0176485   .0132994    -1.33   0.185    -.0437322    .0084352
          exp |  -.0025309   .0108542    -0.23   0.816     -.023819    .0187572
       expsqr |  -.0001016   .0003139    -0.32   0.746    -.0007172     .000514
   highvocedu |   .0138929    .014918     0.93   0.352    -.0153654    .0431513
   highgenedu |   .0164757   .0259778     0.63   0.526    -.0344738    .0674252
     adultedu |   .0332568   .0126989     2.62   0.009     .0083508    .0581628
 provincedum2 |   .0173084   .0259721     0.67   0.505    -.0336301    .0682468
 provincedum3 |   .0045062   .0275594     0.16   0.870    -.0495453    .0585577
 provincedum4 |  -.0090345   .0254304    -0.36   0.722    -.0589104    .0408415
 provincedum5 |   .0526342   .0236807     2.22   0.026     .0061899    .0990785
 provincedum6 |   .0208591   .0295037     0.71   0.480    -.0370057    .0787239
 provincedum7 |    .021519   .0247031     0.87   0.384    -.0269306    .0699686
 provincedum8 |   .0374239   .0257397     1.45   0.146    -.0130587    .0879065
 provincedum9 |   .0344123   .0252389     1.36   0.173     -.015088    .0839126
provincedum10 |   .0397221   .0243207     1.63   0.103    -.0079774    .0874217
provincedum11 |   .0446023   .0230519     1.93   0.053    -.0006087    .0898134
provincedum12 |   .0217045   .0261437     0.83   0.407    -.0295705    .0729795
provincedum13 |   .0261765   .0258002     1.01   0.310    -.0244248    .0767779
provincedum14 |     .02188   .0286199     0.76   0.445    -.0342514    .0780114
provincedum15 |   .0105357   .0299277     0.35   0.725    -.0481606     .069232
          _m1 |   .0970164   .0781475     1.24   0.215    -.0562523    .2502851
          _m2 |  -.2371518   .2163001    -1.10   0.273    -.6613753    .1870718
          _m3 |  -.2611494   .1813742    -1.44   0.150    -.6168737     .094575
        _cons |  -.1505153   .2916273    -0.52   0.606    -.7224761    .4214455
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0639807          .        .       .            .           .
        rho1 |   .3835487          .        .       .            .           .
        rho2 |  -.9375658          .        .       .            .           .
        rho3 |  -1.032439          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-prov
> incedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(wagegrowth, -.50, 1.66)

. sum voc_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum1
> 5 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_wagegr~h |      1,837    .1123704    .1939729   -.453731   1.526209
        male |      1,837     .513337    .4999582          0          1
         exp |      1,837    18.10942    6.369479          1         32
      expsqr |      1,837    368.4992    233.5151          1       1024
  highvocedu |      1,837    .1143168    .3182823          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,837    .0321176    .1763604          0          1
    adultedu |      1,837    .1687534    .3746359          0          1
provincedum2 |      1,837    .0642352    .2452381          0          1
provincedum3 |      1,837    .0440936    .2053591          0          1
provincedum4 |      1,837     .066957    .2500156          0          1
-------------+---------------------------------------------------------
provincedum5 |      1,837    .0772999    .2671395          0          1
provincedum6 |      1,837     .044638     .206564          0          1
provincedum7 |      1,837    .0925422    .2898687          0          1
provincedum8 |      1,837     .083288    .2763922          0          1
provincedum9 |      1,837    .0598802    .2373294          0          1
-------------+---------------------------------------------------------
provinced~10 |      1,837    .0675014    .2509566          0          1
provinced~11 |      1,837    .1154056    .3195977          0          1
provinced~12 |      1,837    .0587915    .2352981          0          1
provinced~13 |      1,837    .0653239    .2471638          0          1
provinced~14 |      1,837    .0430049    .2029234          0          1
-------------+---------------------------------------------------------
provinced~15 |      1,837    .0326619    .1777986          0          1
          m1 |      1,837    1.123796    .1829457   .7959387    1.99701
          m2 |      1,837   -.5408471    .1389931      -.726  -.0485854
          m3 |      1,837   -.3262894    .1854466  -.7258732  -.0052854

. outreg2 using "`xlspath3_2'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_wagegrowth male exp expsqr higheredu if inrange(birthyear, 1971, 1992) & inrang
> e(wagegrowth, -.50, 1.66), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_hig
> hedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9554.3349
Iteration 1:  Log likelihood = -8119.6405
Iteration 2:  Log likelihood = -8012.3591
Iteration 3:  Log likelihood = -8002.0815
Iteration 4:  Log likelihood = -8001.9058
Iteration 5:  Log likelihood = -8001.9058

Multinomial logistic regression                   Number of obs   =       9381
                                                  LR chi2(12)     =    3104.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -8001.9058                       Pseudo R2       =     0.1625

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1682882   .0563631    -2.99   0.003    -.2787579   -.0578185
         exp |   .3472421   .0260893    13.31   0.000      .296108    .3983762
      expsqr |  -.0068117    .000661   -10.31   0.000    -.0081071   -.0055162
ins1_secge~e |   3.157032   .4365619     7.23   0.000     2.301386    4.012677
ins2_highe~e |   .1275559   .0897895     1.42   0.155    -.0484282      .30354
ins3_vs_en~e |   .8012641    .414502     1.93   0.053    -.0111449    1.613673
       _cons |  -5.694644    .325647   -17.49   0.000      -6.3329   -5.056388
-------------+----------------------------------------------------------------
3            |
        male |   .0326449   .0573249     0.57   0.569    -.0797098    .1449996
         exp |   .5680949    .032657    17.40   0.000     .5040883    .6321015
      expsqr |   -.007339   .0007381    -9.94   0.000    -.0087857   -.0058923
ins1_secge~e |   8.506877   .4784181    17.78   0.000     7.569194    9.444559
ins2_highe~e |   .5381778   .0959538     5.61   0.000     .3501118    .7262439
ins3_vs_en~e |  -.8392131   .4649414    -1.80   0.071    -1.750482    .0720553
       _cons |  -11.11759   .4303025   -25.84   0.000    -11.96097   -10.27421
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,837
-------------+----------------------------------   F(7, 1829)      =      7.16
       Model |  1.84293553         7  .263276504   Prob > F        =    0.0000
    Residual |  67.2374236     1,829   .03676185   R-squared       =    0.0267
-------------+----------------------------------   Adj R-squared   =    0.0230
       Total |  69.0803591     1,836  .037625468   Root MSE        =    .19173

------------------------------------------------------------------------------
voc_wagegr~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   -.020198   .0126898    -1.59   0.112     -.045086      .00469
         exp |   .0007829    .009883     0.08   0.937    -.0186002     .020166
      expsqr |  -.0001808   .0002894    -0.62   0.532    -.0007485    .0003868
   higheredu |   .0204579   .0098947     2.07   0.039     .0010518    .0398641
         _m1 |   .1188298   .0711205     1.67   0.095    -.0206561    .2583157
         _m2 |   -.307823   .1971658    -1.56   0.119    -.6945167    .0788708
         _m3 |  -.2853941   .1725031    -1.65   0.098    -.6237177    .0529296
       _cons |  -.2244012   .2666805    -0.84   0.400    -.7474315    .2986291
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0753223          .        .       .            .           .
        rho1 |   .4329759          .        .       .            .           .
        rho2 |  -1.121603          .        .       .            .           .
        rho3 |   -1.03988          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_wagegrowth male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1
> 992) & inrange(wagegrowth, -.50, 1.66)

. sum voc_wagegrowth male exp expsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_wagegr~h |      1,837    .1123704    .1939729   -.453731   1.526209
        male |      1,837     .513337    .4999582          0          1
         exp |      1,837    18.10942    6.369479          1         32
      expsqr |      1,837    368.4992    233.5151          1       1024
   higheredu |      1,837    .3151878    .4647171          0          1
-------------+---------------------------------------------------------
    adultedu |      1,837    .1687534    .3746359          0          1
          m1 |      1,837    1.123796    .1829457   .7959387    1.99701
          m2 |      1,837   -.5408471    .1389931      -.726  -.0485854
          m3 |      1,837   -.3262894    .1854466  -.7258732  -.0052854

. outreg2 using "`xlspath3_2'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 if inrange(birt
> hyear, 1971, 1992) & inrange(wagegrowth, -.50, 1.66), sel(educat=male exp expsqr ins1_secge
> n_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogi
> t gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9554.3349
Iteration 1:  Log likelihood = -8119.6405
Iteration 2:  Log likelihood = -8012.3591
Iteration 3:  Log likelihood = -8002.0815
Iteration 4:  Log likelihood = -8001.9058
Iteration 5:  Log likelihood = -8001.9058

Multinomial logistic regression                   Number of obs   =       9381
                                                  LR chi2(12)     =    3104.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -8001.9058                       Pseudo R2       =     0.1625

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1682882   .0563631    -2.99   0.003    -.2787579   -.0578185
         exp |   .3472421   .0260893    13.31   0.000      .296108    .3983762
      expsqr |  -.0068117    .000661   -10.31   0.000    -.0081071   -.0055162
ins1_secge~e |   3.157032   .4365619     7.23   0.000     2.301386    4.012677
ins2_highe~e |   .1275559   .0897895     1.42   0.155    -.0484282      .30354
ins3_vs_en~e |   .8012641    .414502     1.93   0.053    -.0111449    1.613673
       _cons |  -5.694644    .325647   -17.49   0.000      -6.3329   -5.056388
-------------+----------------------------------------------------------------
3            |
        male |   .0326449   .0573249     0.57   0.569    -.0797098    .1449996
         exp |   .5680949    .032657    17.40   0.000     .5040883    .6321015
      expsqr |   -.007339   .0007381    -9.94   0.000    -.0087857   -.0058923
ins1_secge~e |   8.506877   .4784181    17.78   0.000     7.569194    9.444559
ins2_highe~e |   .5381778   .0959538     5.61   0.000     .3501118    .7262439
ins3_vs_en~e |  -.8392131   .4649414    -1.80   0.071    -1.750482    .0720553
       _cons |  -11.11759   .4303025   -25.84   0.000    -11.96097   -10.27421
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,837
-------------+----------------------------------   F(21, 1815)     =      3.04
       Model |   2.3499885        21  .111904214   Prob > F        =    0.0000
    Residual |  66.7303706     1,815  .036766044   R-squared       =    0.0340
-------------+----------------------------------   Adj R-squared   =    0.0228
       Total |  69.0803591     1,836  .037625468   Root MSE        =    .19174

-------------------------------------------------------------------------------
voc_wagegro~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0180795   .0132907    -1.36   0.174    -.0441463    .0079872
          exp |  -.0014456   .0108094    -0.13   0.894    -.0226458    .0197547
       expsqr |  -.0001265    .000313    -0.40   0.686    -.0007404    .0004873
    higheredu |   .0245919    .010155     2.42   0.016     .0046752    .0445085
 provincedum2 |   .0159472   .0259002     0.62   0.538    -.0348501    .0667444
 provincedum3 |   .0029955   .0275013     0.11   0.913    -.0509421    .0569331
 provincedum4 |  -.0106829    .025363    -0.42   0.674    -.0604265    .0390607
 provincedum5 |   .0508021   .0235827     2.15   0.031     .0045501    .0970542
 provincedum6 |   .0200264   .0294691     0.68   0.497    -.0377704    .0778233
 provincedum7 |   .0190326   .0246018     0.77   0.439    -.0292182    .0672833
 provincedum8 |   .0354729   .0256565     1.38   0.167    -.0148465    .0857922
 provincedum9 |    .033741   .0251903     1.34   0.181    -.0156641    .0831461
provincedum10 |   .0388118   .0242673     1.60   0.110    -.0087829    .0864066
provincedum11 |   .0429288   .0229804     1.87   0.062     -.002142    .0879995
provincedum12 |   .0207845   .0261046     0.80   0.426    -.0304137    .0719826
provincedum13 |   .0244845   .0257333     0.95   0.341    -.0259855    .0749546
provincedum14 |   .0218171   .0285794     0.76   0.445    -.0342348     .077869
provincedum15 |   .0101122   .0299169     0.34   0.735     -.048563    .0687874
          _m1 |    .099068   .0780995     1.27   0.205    -.0541065    .2522424
          _m2 |  -.2439877   .2160461    -1.13   0.259    -.6677128    .1797373
          _m3 |  -.2636227   .1811343    -1.46   0.146    -.6188763    .0916309
        _cons |  -.1662655   .2911009    -0.57   0.568    -.7371935    .4046625
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0649839          .        .       .            .           .
        rho1 |   .3886247          .        .       .            .           .
        rho2 |  -.9571172          .        .       .            .           .
        rho3 |  -1.034141          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress voc_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if
>  inrange(birthyear, 1971, 1992) & inrange(wagegrowth, -.50, 1.66)

. sum voc_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_wagegr~h |      1,837    .1123704    .1939729   -.453731   1.526209
        male |      1,837     .513337    .4999582          0          1
         exp |      1,837    18.10942    6.369479          1         32
      expsqr |      1,837    368.4992    233.5151          1       1024
   higheredu |      1,837    .3151878    .4647171          0          1
-------------+---------------------------------------------------------
provincedum2 |      1,837    .0642352    .2452381          0          1
provincedum3 |      1,837    .0440936    .2053591          0          1
provincedum4 |      1,837     .066957    .2500156          0          1
provincedum5 |      1,837    .0772999    .2671395          0          1
provincedum6 |      1,837     .044638     .206564          0          1
-------------+---------------------------------------------------------
provincedum7 |      1,837    .0925422    .2898687          0          1
provincedum8 |      1,837     .083288    .2763922          0          1
provincedum9 |      1,837    .0598802    .2373294          0          1
provinced~10 |      1,837    .0675014    .2509566          0          1
provinced~11 |      1,837    .1154056    .3195977          0          1
-------------+---------------------------------------------------------
provinced~12 |      1,837    .0587915    .2352981          0          1
provinced~13 |      1,837    .0653239    .2471638          0          1
provinced~14 |      1,837    .0430049    .2029234          0          1
provinced~15 |      1,837    .0326619    .1777986          0          1
          m1 |      1,837    1.123796    .1829457   .7959387    1.99701
-------------+---------------------------------------------------------
          m2 |      1,837   -.5408471    .1389931      -.726  -.0485854
          m3 |      1,837   -.3262894    .1854466  -.7258732  -.0052854

. outreg2 using "`xlspath3_2'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear,
>  1971, 1992) & inrange(wagegrowth, -.50, 1.66), sel(educat=male exp expsqr ins1_secgen_entr
> ant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(
> m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9554.3349
Iteration 1:  Log likelihood = -8119.6405
Iteration 2:  Log likelihood = -8012.3591
Iteration 3:  Log likelihood = -8002.0815
Iteration 4:  Log likelihood = -8001.9058
Iteration 5:  Log likelihood = -8001.9058

Multinomial logistic regression                   Number of obs   =       9381
                                                  LR chi2(12)     =    3104.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -8001.9058                       Pseudo R2       =     0.1625

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1682882   .0563631    -2.99   0.003    -.2787579   -.0578185
         exp |   .3472421   .0260893    13.31   0.000      .296108    .3983762
      expsqr |  -.0068117    .000661   -10.31   0.000    -.0081071   -.0055162
ins1_secge~e |   3.157032   .4365619     7.23   0.000     2.301386    4.012677
ins2_highe~e |   .1275559   .0897895     1.42   0.155    -.0484282      .30354
ins3_vs_en~e |   .8012641    .414502     1.93   0.053    -.0111449    1.613673
       _cons |  -5.694644    .325647   -17.49   0.000      -6.3329   -5.056388
-------------+----------------------------------------------------------------
3            |
        male |   .0326449   .0573249     0.57   0.569    -.0797098    .1449996
         exp |   .5680949    .032657    17.40   0.000     .5040883    .6321015
      expsqr |   -.007339   .0007381    -9.94   0.000    -.0087857   -.0058923
ins1_secge~e |   8.506877   .4784181    17.78   0.000     7.569194    9.444559
ins2_highe~e |   .5381778   .0959538     5.61   0.000     .3501118    .7262439
ins3_vs_en~e |  -.8392131   .4649414    -1.80   0.071    -1.750482    .0720553
       _cons |  -11.11759   .4303025   -25.84   0.000    -11.96097   -10.27421
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,853
-------------+----------------------------------   F(9, 4843)      =     15.02
       Model |  5.41194673         9  .601327414   Prob > F        =    0.0000
    Residual |  193.937512     4,843  .040044913   R-squared       =    0.0271
-------------+----------------------------------   Adj R-squared   =    0.0253
       Total |  199.349459     4,852  .041086038   Root MSE        =    .20011

------------------------------------------------------------------------------
gen_wagegr~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0038362   .0071238     0.54   0.590    -.0101297    .0178021
         exp |   -.014683   .0053981    -2.72   0.007    -.0252657   -.0041002
      expsqr |   .0003392   .0001702     1.99   0.046     5.63e-06    .0006728
  highvocedu |   .0009309   .0089999     0.10   0.918    -.0167131    .0185749
  highgenedu |   .0040271   .0085406     0.47   0.637    -.0127163    .0207706
    adultedu |  -.0073431   .0106601    -0.69   0.491    -.0282417    .0135555
         _m1 |   -.047427   .1111961    -0.43   0.670    -.2654218    .1705678
         _m2 |   .0369099   .0393963     0.94   0.349    -.0403247    .1141445
         _m3 |   .1007911   .0864503     1.17   0.244    -.0686906    .2702729
       _cons |   .2392875   .0180653    13.25   0.000     .2038714    .2747037
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0427461          .        .       .            .           .
        rho1 |  -.2293916          .        .       .            .           .
        rho2 |   .1785232          .        .       .            .           .
        rho3 |   .4874995          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inran
> ge(birthyear, 1971, 1992) & inrange(wagegrowth, -.50, 1.66)

. sum gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_wagegr~h |      4,853    .1183883    .2026969  -.4981602   1.622091
        male |      4,853    .5444055    .4980756          0          1
         exp |      4,853    15.22625    6.921381          0         33
      expsqr |      4,853    279.7344    232.1217          0       1089
  highvocedu |      4,853    .2491243    .4325505          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,853    .4143829    .4926659          0          1
    adultedu |      4,853    .1108593    .3139901          0          1
          m1 |      4,853   -.2742345    .0718128  -.4328278   -.041867
          m2 |      4,853    .4370334    .3318473   .0016581    2.21886
          m3 |      4,853   -.2434146    .1931019  -.7259991  -.0017699

. outreg2 using "`xlspath3_2'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-province
> dum15 if inrange(birthyear, 1971, 1992) & inrange(wagegrowth, -.50, 1.66), sel(educat=male 
> exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relat
> ive) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9554.3349
Iteration 1:  Log likelihood = -8119.6405
Iteration 2:  Log likelihood = -8012.3591
Iteration 3:  Log likelihood = -8002.0815
Iteration 4:  Log likelihood = -8001.9058
Iteration 5:  Log likelihood = -8001.9058

Multinomial logistic regression                   Number of obs   =       9381
                                                  LR chi2(12)     =    3104.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -8001.9058                       Pseudo R2       =     0.1625

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1682882   .0563631    -2.99   0.003    -.2787579   -.0578185
         exp |   .3472421   .0260893    13.31   0.000      .296108    .3983762
      expsqr |  -.0068117    .000661   -10.31   0.000    -.0081071   -.0055162
ins1_secge~e |   3.157032   .4365619     7.23   0.000     2.301386    4.012677
ins2_highe~e |   .1275559   .0897895     1.42   0.155    -.0484282      .30354
ins3_vs_en~e |   .8012641    .414502     1.93   0.053    -.0111449    1.613673
       _cons |  -5.694644    .325647   -17.49   0.000      -6.3329   -5.056388
-------------+----------------------------------------------------------------
3            |
        male |   .0326449   .0573249     0.57   0.569    -.0797098    .1449996
         exp |   .5680949    .032657    17.40   0.000     .5040883    .6321015
      expsqr |   -.007339   .0007381    -9.94   0.000    -.0087857   -.0058923
ins1_secge~e |   8.506877   .4784181    17.78   0.000     7.569194    9.444559
ins2_highe~e |   .5381778   .0959538     5.61   0.000     .3501118    .7262439
ins3_vs_en~e |  -.8392131   .4649414    -1.80   0.071    -1.750482    .0720553
       _cons |  -11.11759   .4303025   -25.84   0.000    -11.96097   -10.27421
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,853
-------------+----------------------------------   F(23, 4829)     =      7.99
       Model |  7.31211107        23  .317917873   Prob > F        =    0.0000
    Residual |  192.037348     4,829  .039767519   R-squared       =    0.0367
-------------+----------------------------------   Adj R-squared   =    0.0321
       Total |  199.349459     4,852  .041086038   Root MSE        =    .19942

-------------------------------------------------------------------------------
gen_wagegro~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0046512   .0072582     0.64   0.522    -.0095782    .0188807
          exp |  -.0157464   .0057273    -2.75   0.006    -.0269744   -.0045184
       expsqr |   .0003611   .0001778     2.03   0.042     .0000126    .0007097
   highvocedu |   .0035331   .0090418     0.39   0.696     -.014193    .0212592
   highgenedu |     .00942   .0087784     1.07   0.283    -.0077897    .0266297
     adultedu |  -.0024399   .0107441    -0.23   0.820    -.0235032    .0186233
 provincedum2 |   .0149847   .0153242     0.98   0.328    -.0150576    .0450271
 provincedum3 |    .024017   .0146505     1.64   0.101    -.0047046    .0527386
 provincedum4 |   .0054256   .0156229     0.35   0.728    -.0252023    .0360536
 provincedum5 |   .0541532    .013767     3.93   0.000     .0271637    .0811427
 provincedum6 |   .0299383    .016454     1.82   0.069     -.002319    .0621956
 provincedum7 |   .0339708   .0155062     2.19   0.029     .0035716      .06437
 provincedum8 |   .0090495   .0150831     0.60   0.549    -.0205203    .0386193
 provincedum9 |   .0617996    .014466     4.27   0.000     .0334397    .0901595
provincedum10 |   .0540023   .0150576     3.59   0.000     .0244826    .0835221
provincedum11 |   .0489378   .0128582     3.81   0.000     .0237298    .0741458
provincedum12 |    .038056   .0161448     2.36   0.018     .0064048    .0697072
provincedum13 |   .0495776    .015011     3.30   0.001     .0201492     .079006
provincedum14 |   .0400388   .0202386     1.98   0.048      .000362    .0797155
provincedum15 |   .0386126   .0177126     2.18   0.029     .0038878    .0733374
          _m1 |  -.0751049   .1194146    -0.63   0.529    -.3092119    .1590021
          _m2 |   .0631713   .0409825     1.54   0.123    -.0171731    .1435158
          _m3 |   .1324687   .0882766     1.50   0.134    -.0405936     .305531
        _cons |   .2008873   .0210127     9.56   0.000     .1596929    .2420817
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0453272          .        .       .            .           .
        rho1 |  -.3527677          .        .       .            .           .
        rho2 |   .2967159          .        .       .            .           .
        rho3 |   .6222058          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-prov
> incedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(wagegrowth, -.50, 1.66)

. sum gen_wagegrowth male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum1
> 5 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_wagegr~h |      4,853    .1183883    .2026969  -.4981602   1.622091
        male |      4,853    .5444055    .4980756          0          1
         exp |      4,853    15.22625    6.921381          0         33
      expsqr |      4,853    279.7344    232.1217          0       1089
  highvocedu |      4,853    .2491243    .4325505          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,853    .4143829    .4926659          0          1
    adultedu |      4,853    .1108593    .3139901          0          1
provincedum2 |      4,853    .0609932    .2393425          0          1
provincedum3 |      4,853    .0644962    .2456601          0          1
provincedum4 |      4,853    .0554296    .2288405          0          1
-------------+---------------------------------------------------------
provincedum5 |      4,853    .0826293    .2753495          0          1
provincedum6 |      4,853    .0519266    .2219018          0          1
provincedum7 |      4,853    .0626417    .2423423          0          1
provincedum8 |      4,853    .0774778    .2673757          0          1
provincedum9 |      4,853     .067381    .2507065          0          1
-------------+---------------------------------------------------------
provinced~10 |      4,853     .060169    .2378241          0          1
provinced~11 |      4,853    .1341438    .3408419          0          1
provinced~12 |      4,853    .0508964    .2198087          0          1
provinced~13 |      4,853    .0649083    .2463894          0          1
provinced~14 |      4,853    .0274057    .1632794          0          1
-------------+---------------------------------------------------------
provinced~15 |      4,853    .0356481    .1854302          0          1
          m1 |      4,853   -.2742345    .0718128  -.4328278   -.041867
          m2 |      4,853    .4370334    .3318473   .0016581    2.21886
          m3 |      4,853   -.2434146    .1931019  -.7259991  -.0017699

. outreg2 using "`xlspath3_2'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_wagegrowth male exp expsqr higheredu if inrange(birthyear, 1971, 1992) & inrang
> e(wagegrowth, -.50, 1.66), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_hig
> hedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9554.3349
Iteration 1:  Log likelihood = -8119.6405
Iteration 2:  Log likelihood = -8012.3591
Iteration 3:  Log likelihood = -8002.0815
Iteration 4:  Log likelihood = -8001.9058
Iteration 5:  Log likelihood = -8001.9058

Multinomial logistic regression                   Number of obs   =       9381
                                                  LR chi2(12)     =    3104.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -8001.9058                       Pseudo R2       =     0.1625

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1682882   .0563631    -2.99   0.003    -.2787579   -.0578185
         exp |   .3472421   .0260893    13.31   0.000      .296108    .3983762
      expsqr |  -.0068117    .000661   -10.31   0.000    -.0081071   -.0055162
ins1_secge~e |   3.157032   .4365619     7.23   0.000     2.301386    4.012677
ins2_highe~e |   .1275559   .0897895     1.42   0.155    -.0484282      .30354
ins3_vs_en~e |   .8012641    .414502     1.93   0.053    -.0111449    1.613673
       _cons |  -5.694644    .325647   -17.49   0.000      -6.3329   -5.056388
-------------+----------------------------------------------------------------
3            |
        male |   .0326449   .0573249     0.57   0.569    -.0797098    .1449996
         exp |   .5680949    .032657    17.40   0.000     .5040883    .6321015
      expsqr |   -.007339   .0007381    -9.94   0.000    -.0087857   -.0058923
ins1_secge~e |   8.506877   .4784181    17.78   0.000     7.569194    9.444559
ins2_highe~e |   .5381778   .0959538     5.61   0.000     .3501118    .7262439
ins3_vs_en~e |  -.8392131   .4649414    -1.80   0.071    -1.750482    .0720553
       _cons |  -11.11759   .4303025   -25.84   0.000    -11.96097   -10.27421
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,853
-------------+----------------------------------   F(7, 4845)      =     19.13
       Model |   5.3607404         7  .765820057   Prob > F        =    0.0000
    Residual |  193.988718     4,845  .040038951   R-squared       =    0.0269
-------------+----------------------------------   Adj R-squared   =    0.0255
       Total |  199.349459     4,852  .041086038   Root MSE        =     .2001

------------------------------------------------------------------------------
gen_wagegr~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0040529    .007118     0.57   0.569    -.0099016    .0180074
         exp |  -.0147061   .0053966    -2.73   0.006    -.0252859   -.0041264
      expsqr |   .0003396   .0001701     2.00   0.046     6.13e-06    .0006732
   higheredu |   .0004011   .0076409     0.05   0.958    -.0145786    .0153808
         _m1 |  -.0439104   .1110923    -0.40   0.693    -.2617016    .1738809
         _m2 |   .0377389   .0393838     0.96   0.338    -.0394712     .114949
         _m3 |   .1065522   .0862915     1.23   0.217    -.0626184    .2757227
       _cons |   .2421817   .0178809    13.54   0.000      .207127    .2772364
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0429062          .        .       .            .           .
        rho1 |   -.211986          .        .       .            .           .
        rho2 |   .1821919          .        .       .            .           .
        rho3 |   .5144017          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_wagegrowth male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1
> 992) & inrange(wagegrowth, -.50, 1.66)

. sum gen_wagegrowth male exp expsqr higheredu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_wagegr~h |      4,853    .1183883    .2026969  -.4981602   1.622091
        male |      4,853    .5444055    .4980756          0          1
         exp |      4,853    15.22625    6.921381          0         33
      expsqr |      4,853    279.7344    232.1217          0       1089
   higheredu |      4,853    .7743664     .418042          0          1
-------------+---------------------------------------------------------
    adultedu |      4,853    .1108593    .3139901          0          1
          m1 |      4,853   -.2742345    .0718128  -.4328278   -.041867
          m2 |      4,853    .4370334    .3318473   .0016581    2.21886
          m3 |      4,853   -.2434146    .1931019  -.7259991  -.0017699

. outreg2 using "`xlspath3_2'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 if inrange(birt
> hyear, 1971, 1992) & inrange(wagegrowth, -.50, 1.66), sel(educat=male exp expsqr ins1_secge
> n_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogi
> t gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9554.3349
Iteration 1:  Log likelihood = -8119.6405
Iteration 2:  Log likelihood = -8012.3591
Iteration 3:  Log likelihood = -8002.0815
Iteration 4:  Log likelihood = -8001.9058
Iteration 5:  Log likelihood = -8001.9058

Multinomial logistic regression                   Number of obs   =       9381
                                                  LR chi2(12)     =    3104.86
                                                  Prob > chi2     =     0.0000
Log likelihood = -8001.9058                       Pseudo R2       =     0.1625

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1682882   .0563631    -2.99   0.003    -.2787579   -.0578185
         exp |   .3472421   .0260893    13.31   0.000      .296108    .3983762
      expsqr |  -.0068117    .000661   -10.31   0.000    -.0081071   -.0055162
ins1_secge~e |   3.157032   .4365619     7.23   0.000     2.301386    4.012677
ins2_highe~e |   .1275559   .0897895     1.42   0.155    -.0484282      .30354
ins3_vs_en~e |   .8012641    .414502     1.93   0.053    -.0111449    1.613673
       _cons |  -5.694644    .325647   -17.49   0.000      -6.3329   -5.056388
-------------+----------------------------------------------------------------
3            |
        male |   .0326449   .0573249     0.57   0.569    -.0797098    .1449996
         exp |   .5680949    .032657    17.40   0.000     .5040883    .6321015
      expsqr |   -.007339   .0007381    -9.94   0.000    -.0087857   -.0058923
ins1_secge~e |   8.506877   .4784181    17.78   0.000     7.569194    9.444559
ins2_highe~e |   .5381778   .0959538     5.61   0.000     .3501118    .7262439
ins3_vs_en~e |  -.8392131   .4649414    -1.80   0.071    -1.750482    .0720553
       _cons |  -11.11759   .4303025   -25.84   0.000    -11.96097   -10.27421
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,853
-------------+----------------------------------   F(21, 4831)     =      8.68
       Model |  7.24890133        21  .345185778   Prob > F        =    0.0000
    Residual |  192.100557     4,831  .039764139   R-squared       =    0.0364
-------------+----------------------------------   Adj R-squared   =    0.0322
       Total |  199.349459     4,852  .041086038   Root MSE        =    .19941

-------------------------------------------------------------------------------
gen_wagegro~h | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0046764   .0072515     0.64   0.519    -.0095399    .0188927
          exp |  -.0155491   .0057211    -2.72   0.007    -.0267651   -.0043332
       expsqr |    .000357   .0001777     2.01   0.045     8.62e-06    .0007055
    higheredu |   .0045471   .0077855     0.58   0.559    -.0107161    .0198102
 provincedum2 |   .0135529    .015236     0.89   0.374    -.0163166    .0434224
 provincedum3 |   .0234841   .0146373     1.60   0.109    -.0052117      .05218
 provincedum4 |   .0050186   .0156139     0.32   0.748    -.0255916    .0356289
 provincedum5 |   .0540037   .0137469     3.93   0.000     .0270535    .0809539
 provincedum6 |   .0288825   .0164026     1.76   0.078     -.003274    .0610391
 provincedum7 |   .0330128   .0154486     2.14   0.033     .0027264    .0632992
 provincedum8 |   .0076138   .0149797     0.51   0.611    -.0217532    .0369808
 provincedum9 |   .0612981   .0144305     4.25   0.000     .0330078    .0895884
provincedum10 |   .0526291   .0149798     3.51   0.000     .0232619    .0819964
provincedum11 |   .0476185   .0127729     3.73   0.000     .0225778    .0726592
provincedum12 |   .0368657   .0160959     2.29   0.022     .0053105     .068421
provincedum13 |   .0481587   .0149327     3.23   0.001     .0188838    .0774335
provincedum14 |   .0386457   .0202058     1.91   0.056    -.0009668    .0782582
provincedum15 |   .0386657   .0177082     2.18   0.029     .0039497    .0733818
          _m1 |  -.0657162   .1190831    -0.55   0.581    -.2991734    .1677409
          _m2 |   .0628872   .0409556     1.54   0.125    -.0174043    .1431788
          _m3 |   .1385991   .0881216     1.57   0.116    -.0341595    .3113576
        _cons |   .2050665   .0207455     9.88   0.000     .1643959     .245737
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0452903          .        .       .            .           .
        rho1 |  -.3087951          .        .       .            .           .
        rho2 |   .2955017          .        .       .            .           .
        rho3 |   .6512652          .        .       .            .           .
------------------------------------------------------------------------------

. qui regress gen_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if
>  inrange(birthyear, 1971, 1992) & inrange(wagegrowth, -.50, 1.66)

. sum gen_wagegrowth male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_wagegr~h |      4,853    .1183883    .2026969  -.4981602   1.622091
        male |      4,853    .5444055    .4980756          0          1
         exp |      4,853    15.22625    6.921381          0         33
      expsqr |      4,853    279.7344    232.1217          0       1089
   higheredu |      4,853    .7743664     .418042          0          1
-------------+---------------------------------------------------------
provincedum2 |      4,853    .0609932    .2393425          0          1
provincedum3 |      4,853    .0644962    .2456601          0          1
provincedum4 |      4,853    .0554296    .2288405          0          1
provincedum5 |      4,853    .0826293    .2753495          0          1
provincedum6 |      4,853    .0519266    .2219018          0          1
-------------+---------------------------------------------------------
provincedum7 |      4,853    .0626417    .2423423          0          1
provincedum8 |      4,853    .0774778    .2673757          0          1
provincedum9 |      4,853     .067381    .2507065          0          1
provinced~10 |      4,853     .060169    .2378241          0          1
provinced~11 |      4,853    .1341438    .3408419          0          1
-------------+---------------------------------------------------------
provinced~12 |      4,853    .0508964    .2198087          0          1
provinced~13 |      4,853    .0649083    .2463894          0          1
provinced~14 |      4,853    .0274057    .1632794          0          1
provinced~15 |      4,853    .0356481    .1854302          0          1
          m1 |      4,853   -.2742345    .0718128  -.4328278   -.041867
-------------+---------------------------------------------------------
          m2 |      4,853    .4370334    .3318473   .0016581    2.21886
          m3 |      4,853   -.2434146    .1931019  -.7259991  -.0017699

. outreg2 using "`xlspath3_2'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pval
> ue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog #Job 
> & Wages/Selmlog Urban Wage Growth NoOutliers.xls
dir : seeout

. drop m1 m2 m3

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/
> Selmlog #Job & Wages/Selmlog Urban (1) #Jobs (2) Start Wage (3) Wage Growth.log
  log type:  text
 closed on:   6 Aug 2024, 17:47:46
---------------------------------------------------------------------------------------------
