---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rur
> al/Selmlog Rural Parent NoFirstStage.log
  log type:  text
 opened on:   8 Aug 2024, 12:31:03

. use "`datapath'", clear

. 
. *Step Zero: A New Dataset for Merging
. 
. gen headsecedu = .
(35,007 missing values generated)

. gen headhighedu = .
(35,007 missing values generated)

. gen spousesecedu = .
(35,007 missing values generated)

. gen spousehighedu = .
(35,007 missing values generated)

. gen headparty = .
(35,007 missing values generated)

. gen spouseparty = .
(35,007 missing values generated)

. gen spouseparentsecedu = .
(35,007 missing values generated)

. gen spouseparenthighedu = .
(35,007 missing values generated)

. gen spouseparentparty = .
(35,007 missing values generated)

. gen headparentsecedu = .
(35,007 missing values generated)

. gen headparenthighedu = .
(35,007 missing values generated)

. gen headparentparty = .
(35,007 missing values generated)

. replace headsecedu = 1 if A02 == 1 & inrange(A13_1, 4, 9)
(1,332 real changes made)

. replace headsecedu = 0 if A02 == 1 & inrange(A13_1, 1, 3)
(7,897 real changes made)

. replace headhighedu = 1 if A02 == 1 & inrange(A13_1, 7, 9)
(180 real changes made)

. replace headhighedu = 0 if A02 == 1 & inrange(A13_1, 1, 6)
(9,049 real changes made)

. replace spousesecedu = 1 if A02 == 2 & inrange(A13_1, 4, 9)
(686 real changes made)

. replace spousesecedu = 0 if A02 == 2 & inrange(A13_1, 1, 3)
(7,673 real changes made)

. replace spousehighedu = 1 if A02 == 2 & inrange(A13_1, 7, 9)
(110 real changes made)

. replace spousehighedu = 0 if A02 == 2 & inrange(A13_1, 1, 6)
(8,249 real changes made)

. replace headparty = 1 if A02 == 1 & A07_1 == 1
(1,198 real changes made)

. replace headparty = 0 if A02 == 1 & inrange(A07_1, 2, 4)
(8,040 real changes made)

. replace spouseparty = 1 if A02 == 2 & A07_1 == 1
(267 real changes made)

. replace spouseparty = 0 if A02 == 2 & inrange(A07_1, 2, 4)
(8,101 real changes made)

. replace spouseparentsecedu = 0 if A02 == 5 & inrange(A13_1, 1, 3)
(68 real changes made)

. replace spouseparentsecedu = 1 if A02 == 5 & inrange(A13_1, 4, 9)
(2 real changes made)

. replace spouseparenthighedu = 0 if A02 == 5 & inrange(A13_1, 1, 6)
(70 real changes made)

. replace spouseparenthighedu = 1 if A02 == 5 & inrange(A13_1, 7, 9)
(0 real changes made)

. replace spouseparentparty = 0 if A02 == 5 & inrange(A07_1, 2, 4)
(66 real changes made)

. replace spouseparentparty = 1 if A02 == 5 & A07_1 == 1
(5 real changes made)

. replace headparentsecedu = 0 if A02 == 4 & inrange(A13_1, 1, 3)
(1,573 real changes made)

. replace headparentsecedu = 1 if A02 == 4 & inrange(A13_1, 4, 9)
(64 real changes made)

. replace headparenthighedu = 0 if A02 == 4 & inrange(A13_1, 1, 6)
(1,632 real changes made)

. replace headparenthighedu = 1 if A02 == 4 & inrange(A13_1, 7, 9)
(5 real changes made)

. replace headparentparty = 0 if A02 == 4 & inrange(A07_1, 2, 4)
(1,544 real changes made)

. replace headparentparty = 1 if A02 == 4 & A07_1 == 1
(97 real changes made)

. collapse (max) headsecedu headhighedu spousesecedu spousehighedu headparty spouseparty spou
> separentsecedu spouseparenthighedu spouseparentparty headparentsecedu headparenthighedu hea
> dparentparty, by(hhcode)

. 
. save "`folderpath'/`logname'.dta", replace
(file /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent
    Indicator/Rural/Selmlog Rural Parent NoFirstStage.dta not found)
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent
    Indicator/Rural/Selmlog Rural Parent NoFirstStage.dta saved

. 
. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. 
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for secjun
. gen jun_log_monthlyearning = log_monthlyearning if secjun == 1
(27,895 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *6) Instrument
. 
. gen yearat15 = birthyear+15
(7 missing values generated)

. local obsnum = _N

. 
. forval i =  1/`obsnum' {
  2.         
.         *extract the observation's year at age 15
.         qui sum yearat15  in `i'
  3.         local yearvalue = round(mod(r(mean),100))
  4.         
.         *get the variables' names for this observation
.         *graduates of mid and sec schools
.         if inrange(`yearvalue', 0, 9) {
  5.                 local czgrad_year = "czgrad0`yearvalue'"
  6.                 local gzgrad_year = "gzgrad0`yearvalue'"
  7.         }
  8.         else {
  9.                 local czgrad_year = "czgrad`yearvalue'"
 10.                 local gzgrad_year = "gzgrad`yearvalue'"
 11.         }
 12.         *entrants of sec and universities
.         if inrange(`yearvalue'+1, 0, 9) {
 13.                 local gzentrant_year = "gzentrant0`=`yearvalue'+1'"
 14.                 local gxentrant_year = "gxentrant0`=`yearvalue'+1'"
 15.                 local vsentrant_year = "vsentrant0`=`yearvalue'+1'"
 16.                 local tsentrant_year = "tsentrant0`=`yearvalue'+1'"
 17.         }
 18.         else{
 19.                 if `yearvalue' == 99 {
 20.                 local gzentrant_year = "gzentrant00"
 21.                 local gxentrant_year = "gxentrant00"
 22.                 local vsentrant_year = "vsentrant00"
 23.                 local tsentrant_year = "tsentrant00"
 24.                 }
 25.         else {
 26.                 local gzentrant_year = "gzentrant`=`yearvalue'+1'"
 27.                 local gxentrant_year = "gxentrant`=`yearvalue'+1'"
 28.                 local vsentrant_year = "vsentrant`=`yearvalue'+1'"
 29.                 local tsentrant_year = "tsentrant`=`yearvalue'+1'"
 30.         }
 31.         }
 32.         
.         
.         *For Ins 1 & 2: check whether the variable names exist (whether we have those years
> ' or not)
.         capture ds `czgrad_year' `gzgrad_year' `gzentrant_year' `gxentrant_year'
 33.         if _rc == 0 {
 34.                 *generate/replace the instrument
.                 capture ds ins1_secgen_entrant_relative ins2_highedu_entrant_relative
 35.                 if _rc!=0 {
 36.                         qui gen ins1_secgen_entrant_relative = `gzentrant_year'/`czgrad_
> year' if _n == `i'
 37.                         qui gen ins2_highedu_entrant_relative = `gxentrant_year'/`gzgrad
> _year' if _n == `i'
 38.                 
.                 }
 39.                 else {
 40.                         qui replace ins1_secgen_entrant_relative = `gzentrant_year'/`czg
> rad_year' if _n == `i'
 41.                         qui replace ins2_highedu_entrant_relative = `gxentrant_year'/`gz
> grad_year' if _n == `i'
 42.                 }
 43.         }
 44.         
.         *For Ins 3
.         capture ds `czgrad_year' `vsentrant_year'
 45.         if _rc == 0 {
 46.                 *generate/replace the instrument
.                 capture ds ins3_vs_entrant_relative
 47.                 if _rc!=0 {
 48.                         qui gen ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_year
> ' if _n == `i'
 49.                 }
 50.                 else {
 51.                         qui replace ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_
> year' if _n == `i'
 52.                 }
 53.         }
 54. }

. 
. 
. sum ins1_secgen_entrant_relative, d

                ins1_secgen_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%       .15625       .0699308
 5%     .1682079       .0699308
10%     .1885442       .0699308       Obs              12,056
25%     .2211083       .0699308       Sum of wgt.      12,056

50%     .3033619                      Mean           .3236294
                        Largest       Std. dev.      .1151896
75%     .4300829       .6448125
90%     .4801857       .6448125       Variance       .0132686
95%     .5088161       .6448125       Skewness       .3696383
99%     .5762522       .6448125       Kurtosis       1.967837

. sum ins2_highedu_entrant_relative, d

                ins2_highedu_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1447144       .1281053
 5%     .1651736       .1380375
10%        .2112       .1380375       Obs              12,056
25%     .2949015       .1380375       Sum of wgt.      12,056

50%     .5866208                      Mean           .5873466
                        Largest       Std. dev.      .3496799
75%     .8063707       2.985416
90%       .96183       2.985416       Variance        .122276
95%     1.052114       2.985416       Skewness       1.750181
99%     2.036869       2.985416       Kurtosis       10.40442

. sum ins3_vs_entrant_relative, d

                  ins3_vs_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1185751       .0852398
 5%     .1373378       .0852398
10%     .1486554       .0852398       Obs              12,419
25%      .184019       .0852398       Sum of wgt.      12,419

50%      .234389                      Mean           .2488276
                        Largest       Std. dev.      .0852013
75%     .3009205       .6566039
90%     .3645212       .6566039       Variance       .0072593
95%     .4095488       .6566039       Skewness       .8011841
99%     .4754733       .6566039       Kurtosis         3.4377

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Parent Indicators
. merge m:1 hhcode using "`folderpath'/`logname'.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            35,007  (_merge==3)
    -----------------------------------------

. *parent_secedu
. gen parent_secedu = 0 if (A02==1 & (inrange(H03_R1, 1, 3) | inrange(H03_R2, 1, 3))) | (A02=
> =2 & (inrange(H03_R3, 1, 3) | inrange(H03_R4, 1, 3)))
(28,206 missing values generated)

. replace parent_secedu = 0 if A02 ==3 & (headsecedu == 0 | spousesecedu == 0)
(9,445 real changes made)

. replace parent_secedu = 0 if (A02 == 2 & spouseparentsecedu == 0) | (A02 == 1 & headparents
> ecedu == 0)
(354 real changes made)

. replace parent_secedu=1 if (A02==1 & (inrange(H03_R1, 4, 9) | inrange(H03_R2, 4, 9)))|(A02=
> =2 & (inrange(H03_R3, 4, 9) | inrange(H03_R4, 4, 9)))
(441 real changes made)

. replace parent_secedu = 1 if A02 ==3 & (headsecedu == 1 | spousesecedu == 1)
(1,775 real changes made)

. replace parent_secedu = 1 if (A02 == 2 & spouseparentsecedu == 1) | (A02 == 1 & headparents
> ecedu == 1)
(15 real changes made)

. tab parent_secedu

parent_sece |
         du |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,834       86.93       86.93
          1 |      2,231       13.07      100.00
------------+-----------------------------------
      Total |     17,065      100.00

.  *parent_highedu
. gen parent_highedu = 0 if (A02==1 & (inrange(H03_R1, 1, 6) | inrange(H03_R2, 1, 6))) | (A02
> ==2 & (inrange(H03_R3, 1, 6) | inrange(H03_R4, 1, 6)))
(28,161 missing values generated)

. replace parent_highedu = 0 if A02 == 3 & (headhighedu == 0 | spousehighedu == 0)
(9,786 real changes made)

. replace parent_highedu = 0 if (A02 == 2 & spouseparenthighedu == 0) | (A02 == 1 & headparen
> thighedu == 0)
(358 real changes made)

. replace parent_highedu=1 if (A02==1 & (inrange(H03_R1, 7, 9) | inrange(H03_R2, 7, 9)))|(A02
> ==2 & (inrange(H03_R3, 7, 9) | inrange(H03_R4, 7, 9)))
(16 real changes made)

. replace parent_highedu = 1 if A02 == 3 & (headhighedu == 1 | spousehighedu == 1)
(269 real changes made)

. replace parent_highedu = 1 if (A02 == 2 & spouseparenthighedu == 1) | (A02 == 1 & headparen
> thighedu == 1)
(2 real changes made)

. tab parent_highedu

parent_high |
        edu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,778       98.32       98.32
          1 |        287        1.68      100.00
------------+-----------------------------------
      Total |     17,065      100.00

. *parent_partymember
. gen parent_partymember = 0 if ((A02==1 & (inrange(H07_R1, 2, 4) | inrange(H07_R2, 2, 4))) |
>  (A02==2 & (inrange(H07_R3, 2, 4) | inrange(H07_R4, 2, 4))))
(28,178 missing values generated)

. replace parent_partymember = 0 if A02 == 3 & (headparty == 0 | spouseparty == 0)
(9,759 real changes made)

. replace parent_partymember = 0 if (A02 == 2 & spouseparentparty == 0) | (A02 == 1 & headpar
> entparty == 0)
(339 real changes made)

. replace parent_partymember=1 if (A02==1 & (H07_R1 == 1 | H07_R2 == 1)) | (A02==2 & (H07_R3 
> == 1 | H07_R4 == 1))
(634 real changes made)

. replace parent_partymember = 1 if A02 == 3 & (headparty == 1 | spouseparty == 1)
(1,264 real changes made)

. replace parent_partymember = 1 if (A02 == 2 & spouseparentparty == 1) | (A02 == 1 & headpar
> entparty == 1)
(29 real changes made)

. tab parent_partymember

parent_part |
    ymember |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,165       88.73       88.73
          1 |      1,927       11.27      100.00
------------+-----------------------------------
      Total |     17,092      100.00

. 
. *9) Key School Indicator
. 
. gen Keyschool = 0 if A14 != .

. replace Keyschool = 1 if inrange(A14, 1, 3)
(2,217 real changes made)

. 
. *10) GaoKao Indicator
. gen TakeGaoKao = 1 if A15_1 == 1
(32,059 missing values generated)

. replace TakeGaoKao = 0 if A15_1 == 2
(26,078 real changes made)

. tab TakeGaoKao

 TakeGaoKao |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,078       89.84       89.84
          1 |      2,948       10.16      100.00
------------+-----------------------------------
      Total |     29,026      100.00

. tab TakeGaoKao educat

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |       998      1,350     10,086 |    12,434 
         1 |       320      2,508         87 |     2,915 
-----------+---------------------------------+----------
     Total |     1,318      3,858     10,173 |    15,349 

. tab TakeGaoKao educat if male==1

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |       607        867      5,808 |     7,282 
         1 |       174      1,410         43 |     1,627 
-----------+---------------------------------+----------
     Total |       781      2,277      5,851 |     8,909 

. tab TakeGaoKao educat if male==0

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |       391        483      4,278 |     5,152 
         1 |       146      1,098         44 |     1,288 
-----------+---------------------------------+----------
     Total |       537      1,581      4,322 |     6,440 

. 
. *Step Two: Regressions
. 
. *1) All parent indicators & Specified higher education, Sec Voc + inrange(birthyear, 1971, 
> 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entr
> ant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(12, 512)      =      4.69
       Model |   21.129977        12  1.76083142   Prob > F        =    0.0000
    Residual |  192.331086       512  .375646653   R-squared       =    0.0990
-------------+----------------------------------   Adj R-squared   =    0.0779
       Total |  213.461063       524  .407368441   Root MSE        =     .6129

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3693742   .0618956     5.97   0.000     .2477736    .4909748
               exp |   .0595653   .0332492     1.79   0.074    -.0057564    .1248871
            expsqr |  -.0013263   .0008775    -1.51   0.131    -.0030502    .0003975
        highvocedu |   .0476809   .0990848     0.48   0.631    -.1469819    .2423438
        highgenedu |   .1551475   .2551913     0.61   0.543    -.3462034    .6564984
          adultedu |   .1814423   .1546136     1.17   0.241    -.1223127    .4851974
     parent_secedu |  -.0210071   .0700661    -0.30   0.764    -.1586595    .1166453
    parent_highedu |   .0382283   .2634563     0.15   0.885    -.4793601    .5558167
parent_partymember |   .0440565   .0759949     0.58   0.562    -.1052437    .1933567
               _m1 |  -.2538642   .1168114    -2.17   0.030    -.4833528   -.0243757
               _m2 |   .0441681   .2955408     0.15   0.881    -.5364537    .6247898
               _m3 |   .0225694   .1439976     0.16   0.876    -.2603294    .3054682
             _cons |   7.713823   .3917831    19.69   0.000     6.944122    8.483523
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4074868          .        .       .            .           .
        rho1 |  -.3976901          .        .       .            .           .
        rho2 |   .0691913          .        .       .            .           .
        rho3 |    .035356          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrang
> e(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
  highvocedu |        525    .0857143    .2802087          0          1
-------------+---------------------------------------------------------
  highgenedu |        525    .0114286    .1063932          0          1
    adultedu |        525     .032381    .1771785          0          1
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
-------------+---------------------------------------------------------
          m1 |        525    1.333378     .410071   .4635267   3.007092
          m2 |        525   -.3666274    .2108173  -.7259973  -.0044607
          m3 |        525   -.4815773    .2715142  -.7259987   3.366965

. outreg2 using "`xlspath'", replace ctitle(All Parent Indicators, Sec Voc, Specified Highere
> du,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) All parent indicators & Specified higher education, Sec Voc + inrange(birthyear, 1971, 
> 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(26, 498)      =      3.73
       Model |  34.8225569        26  1.33932911   Prob > F        =    0.0000
    Residual |  178.638506       498   .35871186   R-squared       =    0.1631
-------------+----------------------------------   Adj R-squared   =    0.1194
       Total |  213.461063       524  .407368441   Root MSE        =    .59893

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3756175   .0619433     6.06   0.000     .2539152    .4973199
               exp |   .0831746   .0447818     1.86   0.064      -.00481    .1711592
            expsqr |  -.0018914   .0011948    -1.58   0.114    -.0042389    .0004561
        highvocedu |   -.004323   .1000605    -0.04   0.966    -.2009158    .1922699
        highgenedu |   .1921719   .2548849     0.75   0.451    -.3086103    .6929541
          adultedu |   .1757241    .153073     1.15   0.252    -.1250244    .4764725
     parent_secedu |  -.0252729   .0705146    -0.36   0.720    -.1638157    .1132699
    parent_highedu |   -.016193   .2659333    -0.06   0.951    -.5386825    .5062966
parent_partymember |     .06687   .0757245     0.88   0.378    -.0819089    .2156489
      provincedum2 |  -.2222382   .2628366    -0.85   0.398    -.7386434     .294167
      provincedum3 |   .0629145   .2954652     0.21   0.831    -.5175975    .6434266
      provincedum4 |   .2156469    .302828     0.71   0.477    -.3793312    .8106249
      provincedum5 |   .3448314   .2045735     1.69   0.092    -.0571022    .7467649
      provincedum6 |   .1981754   .2324084     0.85   0.394    -.2584464    .6547973
      provincedum7 |   .1180082   .2395014     0.49   0.622    -.3525495    .5885658
      provincedum8 |  -.0753948   .2440154    -0.31   0.757    -.5548213    .4040317
      provincedum9 |   .2868936   .2164494     1.33   0.186     -.138373    .7121602
     provincedum10 |   .0183779   .2239333     0.08   0.935    -.4215925    .4583483
     provincedum11 |   .1510627   .2298283     0.66   0.511    -.3004899    .6026152
     provincedum12 |  -.1388395   .2253888    -0.62   0.538    -.5816698    .3039908
     provincedum13 |  -.1910507   .2236824    -0.85   0.393    -.6305282    .2484268
     provincedum14 |  -.0939522   .2543359    -0.37   0.712    -.5936559    .4057514
     provincedum15 |  -.1523264    .256145    -0.59   0.552    -.6555845    .3509316
               _m1 |  -.2342274   .2353176    -1.00   0.320    -.6965651    .2281102
               _m2 |  -.0141233   .5181617    -0.03   0.978    -1.032176    1.003929
               _m3 |    .113055    .153006     0.74   0.460    -.1875619    .4136719
             _cons |   7.458381   .6053028    12.32   0.000     6.269119    8.647643
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3743184          .        .       .            .           .
        rho1 |  -.3828398          .        .       .            .           .
        rho2 |  -.0230842          .        .       .            .           .
        rho3 |    .184786          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
  highvocedu |        525    .0857143    .2802087          0          1
-------------+---------------------------------------------------------
  highgenedu |        525    .0114286    .1063932          0          1
    adultedu |        525     .032381    .1771785          0          1
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
-------------+---------------------------------------------------------
provincedum2 |        525    .0266667    .1612609          0          1
provincedum3 |        525    .0171429    .1299274          0          1
provincedum4 |        525    .0114286    .1063932          0          1
provincedum5 |        525    .0704762    .2561919          0          1
provincedum6 |        525    .0628571    .2429373          0          1
-------------+---------------------------------------------------------
provincedum7 |        525     .072381    .2593648          0          1
provincedum8 |        525    .0971429    .2964346          0          1
provincedum9 |        525    .0780952    .2685773          0          1
provinced~10 |        525    .1161905    .3207588          0          1
provinced~11 |        525    .1257143    .3318433          0          1
-------------+---------------------------------------------------------
provinced~12 |        525         .04    .1961461          0          1
provinced~13 |        525    .0761905    .2655557          0          1
provinced~14 |        525     .047619     .213162          0          1
provinced~15 |        525    .0628571    .2429373          0          1
          m1 |        525    1.333378     .410071   .4635267   3.007092
-------------+---------------------------------------------------------
          m2 |        525   -.3666274    .2108173  -.7259973  -.0044607
          m3 |        525   -.4815773    .2715142  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Specified Highered
> u, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) All parent indicators & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1
> 992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel
> (educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_
> entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(10, 514)      =      5.58
       Model |  20.8931457        10  2.08931457   Prob > F        =    0.0000
    Residual |  192.567917       514  .374645754   R-squared       =    0.0979
-------------+----------------------------------   Adj R-squared   =    0.0803
       Total |  213.461063       524  .407368441   Root MSE        =    .61208

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3660036   .0615928     5.94   0.000     .2449989    .4870082
               exp |   .0587184   .0331872     1.77   0.077    -.0064808    .1239175
            expsqr |  -.0012887   .0008749    -1.47   0.141    -.0030076    .0004302
         higheredu |   .0913613   .0821726     1.11   0.267    -.0700741    .2527967
     parent_secedu |  -.0214987   .0698989    -0.31   0.759    -.1588213     .115824
    parent_highedu |   .0300084   .2628859     0.11   0.909    -.4864547    .5464715
parent_partymember |    .038314   .0754914     0.51   0.612    -.1099957    .1866236
               _m1 |  -.2662676   .1152095    -2.31   0.021    -.4926069   -.0399282
               _m2 |    .063519   .2935432     0.22   0.829    -.5131731    .6402111
               _m3 |   .0280659   .1436326     0.20   0.845    -.2541133    .3102451
             _cons |   7.746446    .388433    19.94   0.000     6.983334    8.509558
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .412391          .        .       .            .           .
        rho1 |  -.4146329          .        .       .            .           .
        rho2 |    .098912          .        .       .            .           .
        rho3 |   .0437044          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200
> , 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
   higheredu |        525    .1295238     .336099          0          1
-------------+---------------------------------------------------------
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
          m1 |        525    1.333378     .410071   .4635267   3.007092
          m2 |        525   -.3666274    .2108173  -.7259973  -.0044607
-------------+---------------------------------------------------------
          m3 |        525   -.4815773    .2715142  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Non-specified High
> eredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) All parent indicators & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1
> 992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(24, 500)      =      3.99
       Model |  34.3436126        24  1.43098386   Prob > F        =    0.0000
    Residual |  179.117451       500  .358234901   R-squared       =    0.1609
-------------+----------------------------------   Adj R-squared   =    0.1206
       Total |  213.461063       524  .407368441   Root MSE        =    .59853

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3724394   .0617441     6.03   0.000     .2511295    .4937493
               exp |   .0798202   .0446193     1.79   0.074    -.0078442    .1674846
            expsqr |  -.0017854   .0011897    -1.50   0.134    -.0041228    .0005519
         higheredu |   .0607223   .0826218     0.73   0.463    -.1016064     .223051
     parent_secedu |  -.0264995   .0704422    -0.38   0.707    -.1648986    .1118996
    parent_highedu |  -.0251937   .2656167    -0.09   0.924    -.5470561    .4966687
parent_partymember |   .0582671   .0753009     0.77   0.439    -.0896781    .2062122
      provincedum2 |  -.2125666   .2625274    -0.81   0.419    -.7283594    .3032262
      provincedum3 |    .074069   .2939294     0.25   0.801    -.5034198    .6515579
      provincedum4 |   .2366337   .3019986     0.78   0.434    -.3567089    .8299763
      provincedum5 |   .3332286   .2041669     1.63   0.103    -.0679022    .7343593
      provincedum6 |   .1940068   .2321105     0.84   0.404    -.2620253    .6500389
      provincedum7 |   .1160823   .2393081     0.49   0.628     -.354091    .5862556
      provincedum8 |  -.0658001   .2429786    -0.27   0.787    -.5431849    .4115847
      provincedum9 |    .294031   .2160449     1.36   0.174    -.1304368    .7184988
     provincedum10 |   .0207104   .2237419     0.09   0.926    -.4188798    .4603005
     provincedum11 |   .1561409   .2296231     0.68   0.497    -.2950042    .6072861
     provincedum12 |  -.1415097   .2251518    -0.63   0.530    -.5838699    .3008505
     provincedum13 |  -.1888511   .2235037    -0.84   0.399    -.6279733    .2502711
     provincedum14 |  -.0815866   .2536247    -0.32   0.748    -.5798881    .4167148
     provincedum15 |  -.1519409   .2559561    -0.59   0.553    -.6548231    .3509412
               _m1 |  -.2531637   .2344679    -1.08   0.281    -.7138275    .2075001
               _m2 |   .0257834   .5166618     0.05   0.960    -.9893123    1.040879
               _m3 |   .1172095   .1528497     0.77   0.444    -.1830973    .4175163
             _cons |   7.523778   .6022441    12.49   0.000     6.340537    8.707019
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3811067          .        .       .            .           .
        rho1 |   -.410089          .        .       .            .           .
        rho2 |   .0417654          .        .       .            .           .
        rho3 |   .1898626          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
   higheredu |        525    .1295238     .336099          0          1
-------------+---------------------------------------------------------
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
provincedum2 |        525    .0266667    .1612609          0          1
provincedum3 |        525    .0171429    .1299274          0          1
-------------+---------------------------------------------------------
provincedum4 |        525    .0114286    .1063932          0          1
provincedum5 |        525    .0704762    .2561919          0          1
provincedum6 |        525    .0628571    .2429373          0          1
provincedum7 |        525     .072381    .2593648          0          1
provincedum8 |        525    .0971429    .2964346          0          1
-------------+---------------------------------------------------------
provincedum9 |        525    .0780952    .2685773          0          1
provinced~10 |        525    .1161905    .3207588          0          1
provinced~11 |        525    .1257143    .3318433          0          1
provinced~12 |        525         .04    .1961461          0          1
provinced~13 |        525    .0761905    .2655557          0          1
-------------+---------------------------------------------------------
provinced~14 |        525     .047619     .213162          0          1
provinced~15 |        525    .0628571    .2429373          0          1
          m1 |        525    1.333378     .410071   .4635267   3.007092
          m2 |        525   -.3666274    .2108173  -.7259973  -.0044607
          m3 |        525   -.4815773    .2715142  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Non-specified High
> eredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) All parent indicators & Specified higher education, Sec Gen + inrange(birthyear, 1971, 
> 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entr
> ant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(12, 962)      =      5.69
       Model |  25.4916622        12  2.12430518   Prob > F        =    0.0000
    Residual |  359.247346       962   .37343799   R-squared       =    0.0663
-------------+----------------------------------   Adj R-squared   =    0.0546
       Total |  384.739008       974  .395009249   Root MSE        =     .6111

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2568188   .0445541     5.76   0.000     .1693842    .3442533
               exp |   -.016053   .0246293    -0.65   0.515    -.0643862    .0322803
            expsqr |    .000199   .0006889     0.29   0.773    -.0011529     .001551
        highvocedu |   .1838745   .0554915     3.31   0.001     .0749762    .2927728
        highgenedu |   .2451979   .0636323     3.85   0.000     .1203238    .3700719
          adultedu |   .0018632   .0894667     0.02   0.983    -.1737093    .1774356
     parent_secedu |   .0303739   .0479594     0.63   0.527    -.0637431     .124491
    parent_highedu |   .0380482   .1514576     0.25   0.802    -.2591772    .3352736
parent_partymember |  -.0206737   .0526443    -0.39   0.695    -.1239845    .0826372
               _m1 |  -.4052839   .3024651    -1.34   0.181    -.9988514    .1882836
               _m2 |   .0687657     .10133     0.68   0.498    -.1300876     .267619
               _m3 |  -.2185754   .2177912    -1.00   0.316    -.6459759    .2088252
             _cons |   7.867518   .1320684    59.57   0.000     7.608342    8.126693
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4063203          .        .       .            .           .
        rho1 |  -.6358066          .        .       .            .           .
        rho2 |   .1078792          .        .       .            .           .
        rho3 |  -.3428996          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrang
> e(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
  highvocedu |        975    .2615385    .4396981          0          1
-------------+---------------------------------------------------------
  highgenedu |        975    .2523077    .4345598          0          1
    adultedu |        975    .0553846    .2288468          0          1
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
-------------+---------------------------------------------------------
          m1 |        975   -.2348152    .1030695  -.6403428  -.0164993
          m2 |        975    .8022729    .6214218   .0167035   2.932487
          m3 |        975   -.3778199    .2581209  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Specified Highered
> u,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) All parent indicators & Specified higher education, Sec Gen + inrange(birthyear, 1971, 
> 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(26, 948)      =      4.56
       Model |  42.7836964        26  1.64552678   Prob > F        =    0.0000
    Residual |  341.955312       948  .360712354   R-squared       =    0.1112
-------------+----------------------------------   Adj R-squared   =    0.0868
       Total |  384.739008       974  .395009249   Root MSE        =    .60059

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2561497   .0441374     5.80   0.000     .1695314    .3427679
               exp |   .0099814   .0290826     0.34   0.732    -.0470923    .0670552
            expsqr |  -.0004535   .0007709    -0.59   0.557    -.0019664    .0010595
        highvocedu |   .1875009    .056634     3.31   0.001     .0763584    .2986435
        highgenedu |   .2236398   .0654994     3.41   0.001     .0950993    .3521803
          adultedu |   .0127074   .0896574     0.14   0.887    -.1632425    .1886574
     parent_secedu |    .025332   .0479929     0.53   0.598    -.0688527    .1195166
    parent_highedu |    .078617   .1516112     0.52   0.604    -.2189154    .3761493
parent_partymember |  -.0418092   .0521572    -0.80   0.423    -.1441661    .0605478
      provincedum2 |  -.3000185   .1726656    -1.74   0.083    -.6388694    .0388324
      provincedum3 |  -.4987818    .183384    -2.72   0.007    -.8586673   -.1388963
      provincedum4 |  -.4585986   .2218469    -2.07   0.039    -.8939664   -.0232308
      provincedum5 |  -.0885195   .1431082    -0.62   0.536    -.3693649    .1923259
      provincedum6 |  -.1586405   .1589539    -1.00   0.319    -.4705827    .1533017
      provincedum7 |   -.217621   .1644925    -1.32   0.186    -.5404326    .1051905
      provincedum8 |  -.4302211   .1623997    -2.65   0.008    -.7489255   -.1115167
      provincedum9 |  -.0131883   .1471684    -0.09   0.929    -.3020018    .2756253
     provincedum10 |  -.1265356   .1498358    -0.84   0.399    -.4205839    .1675126
     provincedum11 |  -.2097245   .1597073    -1.31   0.189    -.5231452    .1036962
     provincedum12 |  -.3106827   .1787991    -1.74   0.083    -.6615705    .0402051
     provincedum13 |  -.2775707   .1606777    -1.73   0.084    -.5928959    .0377545
     provincedum14 |  -.2150486   .1744485    -1.23   0.218    -.5573985    .1273013
     provincedum15 |  -.4122565   .1601603    -2.57   0.010    -.7265662   -.0979468
               _m1 |   .2924441   .4300208     0.68   0.497    -.5514587    1.136347
               _m2 |  -.0849917   .1304124    -0.65   0.515     -.340922    .1709385
               _m3 |  -.1782204   .2300285    -0.77   0.439    -.6296443    .2732035
             _cons |   8.204654   .2292868    35.78   0.000     7.754685    8.654622
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3723014          .        .       .            .           .
        rho1 |   .4792868          .        .       .            .           .
        rho2 |   -.139293          .        .       .            .           .
        rho3 |  -.2920855          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
  highvocedu |        975    .2615385    .4396981          0          1
-------------+---------------------------------------------------------
  highgenedu |        975    .2523077    .4345598          0          1
    adultedu |        975    .0553846    .2288468          0          1
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
-------------+---------------------------------------------------------
provincedum2 |        975         .04    .1960597          0          1
provincedum3 |        975    .0246154    .1550294          0          1
provincedum4 |        975    .0112821    .1056703          0          1
provincedum5 |        975    .0861538    .2807351          0          1
provincedum6 |        975    .0717949    .2582804          0          1
-------------+---------------------------------------------------------
provincedum7 |        975    .0728205     .259975          0          1
provincedum8 |        975    .1251282     .331034          0          1
provincedum9 |        975    .1076923    .3101505          0          1
provinced~10 |        975    .1035897     .304884          0          1
provinced~11 |        975    .1076923    .3101505          0          1
-------------+---------------------------------------------------------
provinced~12 |        975    .0225641    .1485854          0          1
provinced~13 |        975    .0492308    .2164605          0          1
provinced~14 |        975    .0482051    .2143094          0          1
provinced~15 |        975    .0810256    .2730145          0          1
          m1 |        975   -.2348152    .1030695  -.6403428  -.0164993
-------------+---------------------------------------------------------
          m2 |        975    .8022729    .6214218   .0167035   2.932487
          m3 |        975   -.3778199    .2581209  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Specified Highered
> u, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) All parent indicators & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1
> 992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel
> (educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_
> entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(10, 964)      =      6.18
       Model |  23.1872884        10  2.31872884   Prob > F        =    0.0000
    Residual |   361.55172       964  .375053651   R-squared       =    0.0603
-------------+----------------------------------   Adj R-squared   =    0.0505
       Total |  384.739008       974  .395009249   Root MSE        =    .61242

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2610058   .0445462     5.86   0.000     .1735871    .3484244
               exp |  -.0237185   .0244472    -0.97   0.332    -.0716945    .0242574
            expsqr |   .0003521   .0006867     0.51   0.608    -.0009955    .0016998
         higheredu |   .1688358   .0490551     3.44   0.001     .0725687     .265103
     parent_secedu |   .0360842   .0478905     0.75   0.451    -.0578975    .1300658
    parent_highedu |   .0463757   .1515542     0.31   0.760    -.2510384    .3437899
parent_partymember |  -.0168886   .0527352    -0.32   0.749    -.1203776    .0866004
               _m1 |  -.3519868   .3012678    -1.17   0.243    -.9432031    .2392295
               _m2 |   .0702306   .1015121     0.69   0.489    -.1289797    .2694409
               _m3 |  -.2056688   .2181995    -0.94   0.346    -.6338695    .2225319
             _cons |   7.957849   .1253977    63.46   0.000     7.711765    8.203933
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .399789          .        .       .            .           .
        rho1 |  -.5566868          .        .       .            .           .
        rho2 |   .1110736          .        .       .            .           .
        rho3 |  -.3252768          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200
> , 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
   higheredu |        975    .5692308     .495438          0          1
-------------+---------------------------------------------------------
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
          m1 |        975   -.2348152    .1030695  -.6403428  -.0164993
          m2 |        975    .8022729    .6214218   .0167035   2.932487
-------------+---------------------------------------------------------
          m3 |        975   -.3778199    .2581209  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Non-specified High
> eredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) All parent indicators & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1
> 992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(24, 950)      =      4.74
       Model |    41.11095        24  1.71295625   Prob > F        =    0.0000
    Residual |  343.628058       950  .361713745   R-squared       =    0.1069
-------------+----------------------------------   Adj R-squared   =    0.0843
       Total |  384.739008       974  .395009249   Root MSE        =    .60143

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2601914   .0441167     5.90   0.000     .1736141    .3467688
               exp |   .0056008   .0290329     0.19   0.847    -.0513751    .0625768
            expsqr |  -.0003735   .0007709    -0.48   0.628    -.0018863    .0011393
         higheredu |   .1641325   .0504686     3.25   0.001     .0650898    .2631753
     parent_secedu |   .0287901   .0478729     0.60   0.548    -.0651588     .122739
    parent_highedu |   .0918905   .1514749     0.61   0.544    -.2053735    .3891545
parent_partymember |  -.0381453   .0522015    -0.73   0.465     -.140589    .0642983
      provincedum2 |  -.3273399   .1720733    -1.90   0.057    -.6650276    .0103479
      provincedum3 |  -.5060594   .1832225    -2.76   0.006    -.8656269   -.1464919
      provincedum4 |  -.4704988   .2218327    -2.12   0.034    -.9058376   -.0351601
      provincedum5 |  -.0987436   .1431652    -0.69   0.491    -.3797003    .1822131
      provincedum6 |  -.1702013   .1588676    -1.07   0.284    -.4819733    .1415707
      provincedum7 |  -.2361972   .1640702    -1.44   0.150    -.5581791    .0857847
      provincedum8 |  -.4494611   .1619737    -2.77   0.006    -.7673288   -.1315935
      provincedum9 |  -.0294999   .1468252    -0.20   0.841    -.3176392    .2586394
     provincedum10 |  -.1476134   .1491617    -0.99   0.323     -.440338    .1451112
     provincedum11 |  -.2317653   .1594413    -1.45   0.146    -.5446632    .0811326
     provincedum12 |   -.362988   .1773863    -2.05   0.041    -.7111022   -.0148737
     provincedum13 |  -.3100566   .1600648    -1.94   0.053    -.6241779    .0040648
     provincedum14 |  -.2442142   .1739073    -1.40   0.161     -.585501    .0970726
     provincedum15 |  -.4330048   .1593939    -2.72   0.007    -.7458095      -.1202
               _m1 |   .3657298   .4253848     0.86   0.390    -.4690726    1.200532
               _m2 |   -.093612   .1304111    -0.72   0.473    -.3495392    .1623152
               _m3 |  -.1652686   .2302606    -0.72   0.473    -.6171467    .2866095
             _cons |   8.299801   .2215117    37.47   0.000     7.865092     8.73451
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3857449          .        .       .            .           .
        rho1 |   .5888576          .        .       .            .           .
        rho2 |  -.1507236          .        .       .            .           .
        rho3 |  -.2660972          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
   higheredu |        975    .5692308     .495438          0          1
-------------+---------------------------------------------------------
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
provincedum2 |        975         .04    .1960597          0          1
provincedum3 |        975    .0246154    .1550294          0          1
-------------+---------------------------------------------------------
provincedum4 |        975    .0112821    .1056703          0          1
provincedum5 |        975    .0861538    .2807351          0          1
provincedum6 |        975    .0717949    .2582804          0          1
provincedum7 |        975    .0728205     .259975          0          1
provincedum8 |        975    .1251282     .331034          0          1
-------------+---------------------------------------------------------
provincedum9 |        975    .1076923    .3101505          0          1
provinced~10 |        975    .1035897     .304884          0          1
provinced~11 |        975    .1076923    .3101505          0          1
provinced~12 |        975    .0225641    .1485854          0          1
provinced~13 |        975    .0492308    .2164605          0          1
-------------+---------------------------------------------------------
provinced~14 |        975    .0482051    .2143094          0          1
provinced~15 |        975    .0810256    .2730145          0          1
          m1 |        975   -.2348152    .1030695  -.6403428  -.0164993
          m2 |        975    .8022729    .6214218   .0167035   2.932487
          m3 |        975   -.3778199    .2581209  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Non-specified High
> eredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) Parent Edu & Specified higher education, Sec Voc + inrange(birthyear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       527
-------------+----------------------------------   F(11, 515)      =      5.15
       Model |  21.2001655        11  1.92728777   Prob > F        =    0.0000
    Residual |  192.620549       515  .374020484   R-squared       =    0.0991
-------------+----------------------------------   Adj R-squared   =    0.0799
       Total |  213.820715       526   .40650326   Root MSE        =    .61157

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .3668871   .0615073     5.96   0.000      .246051    .4877232
           exp |   .0611315   .0330193     1.85   0.065    -.0037375    .1260005
        expsqr |  -.0013411   .0008727    -1.54   0.125    -.0030556    .0003734
    highvocedu |   .0522797    .098622     0.53   0.596    -.1414712    .2460305
    highgenedu |   .1473007   .2541956     0.58   0.563    -.3520872    .6466886
      adultedu |   .1733364   .1540007     1.13   0.261    -.1292105    .4758832
 parent_secedu |  -.0136279   .0683986    -0.20   0.842    -.1480025    .1207467
parent_highedu |   .0680191   .2580537     0.26   0.792    -.4389482    .5749864
           _m1 |  -.2671068   .1148423    -2.33   0.020    -.4927239   -.0414898
           _m2 |   .0547495   .2938275     0.19   0.852    -.5224983    .6319974
           _m3 |   .0325422   .1431301     0.23   0.820    -.2486484    .3137328
         _cons |   7.729205   .3883346    19.90   0.000      6.96629     8.49212
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4111467          .        .       .            .           .
        rho1 |  -.4165687          .        .       .            .           .
        rho2 |   .0853851          .        .       .            .           .
        rho3 |   .0507515          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 2
> 00, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        527    8.178065    .6375761   5.298317   9.721166
        male |        527    .7381404    .4400643          0          1
         exp |        527    14.89753    6.310482          2         32
      expsqr |        527    261.6831    217.8646          4       1024
  highvocedu |        527     .085389    .2797252          0          1
-------------+---------------------------------------------------------
  highgenedu |        527    .0113852    .1061931          0          1
    adultedu |        527    .0322581    .1768526          0          1
parent_sec~u |        527    .2049336    .4040366          0          1
parent_hig~u |        527    .0113852    .1061931          0          1
          m1 |        527    1.331819    .4100797   .4635267   3.007092
-------------+---------------------------------------------------------
          m2 |        527   -.3654865    .2112297  -.7259973  -.0044607
          m3 |        527   -.4822741    .2712334  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Specified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) Parent Edu & Specified higher education, Sec Voc + inrange(birthyear, 1971, 1992) + Pro
> vincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(mon
> thlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       527
-------------+----------------------------------   F(25, 501)      =      3.88
       Model |  34.6925538        25  1.38770215   Prob > F        =    0.0000
    Residual |  179.128161       501  .357541239   R-squared       =    0.1623
-------------+----------------------------------   Adj R-squared   =    0.1204
       Total |  213.820715       526   .40650326   Root MSE        =    .59795

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .3729359   .0615597     6.06   0.000     .2519889    .4938828
           exp |   .0853388   .0446445     1.91   0.057    -.0023746    .1730522
        expsqr |  -.0019111   .0011919    -1.60   0.109    -.0042529    .0004307
    highvocedu |   .0019404   .0996662     0.02   0.984    -.1938747    .1977556
    highgenedu |   .1817833   .2541502     0.72   0.475    -.3175481    .6811147
      adultedu |   .1638548   .1524826     1.07   0.283    -.1357294    .4634389
 parent_secedu |  -.0133448   .0688585    -0.19   0.846    -.1486318    .1219422
parent_highedu |   .0299966   .2605298     0.12   0.908    -.4818691    .5418623
  provincedum2 |  -.2090567   .2611677    -0.80   0.424    -.7221756    .3040622
  provincedum3 |   .0552025   .2946293     0.19   0.851    -.5236587    .6340637
  provincedum4 |   .2145193   .3020134     0.71   0.478    -.3788495    .8078881
  provincedum5 |   .3402179   .2038314     1.67   0.096    -.0602518    .7406876
  provincedum6 |   .1926242   .2315943     0.83   0.406    -.2623915    .6476398
  provincedum7 |   .1291304   .2379338     0.54   0.588    -.3383405    .5966013
  provincedum8 |  -.0779985   .2431227    -0.32   0.748    -.5556641     .399667
  provincedum9 |     .28583   .2156324     1.33   0.186    -.1378252    .7094852
 provincedum10 |   .0172615   .2230694     0.08   0.938    -.4210052    .4555281
 provincedum11 |   .1464235   .2290126     0.64   0.523    -.3035199    .5963669
 provincedum12 |  -.1436769   .2245317    -0.64   0.523    -.5848168    .2974629
 provincedum13 |  -.1905791   .2227906    -0.86   0.393    -.6282979    .2471398
 provincedum14 |    -.09307   .2533074    -0.37   0.713    -.5907457    .4046057
 provincedum15 |   -.149971   .2553027    -0.59   0.557    -.6515669    .3516249
           _m1 |  -.2508337   .2342583    -1.07   0.285    -.7110834     .209416
           _m2 |  -.0057656   .5169874    -0.01   0.991    -1.021496    1.009965
           _m3 |   .1246714   .1523764     0.82   0.414    -.1747041    .4240469
         _cons |   7.474391   .6035045    12.38   0.000     6.288679    8.660102
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3788534          .        .       .            .           .
        rho1 |  -.4075213          .        .       .            .           .
        rho2 |  -.0093672          .        .       .            .           .
        rho3 |   .2025495          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) 
> & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        527    8.178065    .6375761   5.298317   9.721166
        male |        527    .7381404    .4400643          0          1
         exp |        527    14.89753    6.310482          2         32
      expsqr |        527    261.6831    217.8646          4       1024
  highvocedu |        527     .085389    .2797252          0          1
-------------+---------------------------------------------------------
  highgenedu |        527    .0113852    .1061931          0          1
    adultedu |        527    .0322581    .1768526          0          1
parent_sec~u |        527    .2049336    .4040366          0          1
parent_hig~u |        527    .0113852    .1061931          0          1
provincedum2 |        527    .0265655    .1609624          0          1
-------------+---------------------------------------------------------
provincedum3 |        527    .0170778    .1296845          0          1
provincedum4 |        527    .0113852    .1061931          0          1
provincedum5 |        527    .0702087    .2557412          0          1
provincedum6 |        527    .0626186    .2425059          0          1
provincedum7 |        527    .0721063    .2589095          0          1
-------------+---------------------------------------------------------
provincedum8 |        527    .0967742    .2959309          0          1
provincedum9 |        527    .0777989    .2681093          0          1
provinced~10 |        527    .1157495    .3202283          0          1
provinced~11 |        527    .1252372    .3313021          0          1
provinced~12 |        527    .0398482    .1957883          0          1
-------------+---------------------------------------------------------
provinced~13 |        527    .0759013    .2650918          0          1
provinced~14 |        527    .0474383    .2127765          0          1
provinced~15 |        527    .0626186    .2425059          0          1
          m1 |        527    1.331819    .4100797   .4635267   3.007092
          m2 |        527   -.3654865    .2112297  -.7259973  -.0044607
-------------+---------------------------------------------------------
          m3 |        527   -.4822741    .2712334  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) Parent Edu & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu if i
> nrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp ex
> psqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) d
> mf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       527
-------------+----------------------------------   F(9, 517)       =      6.26
       Model |   21.005717         9  2.33396855   Prob > F        =    0.0000
    Residual |  192.814998       517  .372949705   R-squared       =    0.0982
-------------+----------------------------------   Adj R-squared   =    0.0825
       Total |  213.820715       526   .40650326   Root MSE        =     .6107

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .3638474   .0612081     5.94   0.000     .2436003    .4840946
           exp |   .0601528   .0329421     1.83   0.068    -.0045641    .1248696
        expsqr |  -.0013034   .0008697    -1.50   0.135     -.003012    .0004052
     higheredu |   .0915355   .0819659     1.12   0.265    -.0694918    .2525627
 parent_secedu |   -.015045   .0682254    -0.22   0.826    -.1490781    .1189882
parent_highedu |   .0570774   .2571896     0.22   0.824    -.4481878    .5623427
           _m1 |  -.2779151   .1133408    -2.45   0.015    -.5005803   -.0552499
           _m2 |   .0724333   .2918513     0.25   0.804    -.5009271    .6457937
           _m3 |   .0366315    .142803     0.26   0.798    -.2439141    .3171771
         _cons |   7.759339    .384971    20.16   0.000     7.003039    8.515639
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .415641          .        .       .            .           .
        rho1 |  -.4310751          .        .       .            .           .
        rho2 |   .1123516          .        .       .            .           .
        rho3 |   .0568193          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu  
> m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        527    8.178065    .6375761   5.298317   9.721166
        male |        527    .7381404    .4400643          0          1
         exp |        527    14.89753    6.310482          2         32
      expsqr |        527    261.6831    217.8646          4       1024
   higheredu |        527    .1290323    .3355542          0          1
-------------+---------------------------------------------------------
parent_sec~u |        527    .2049336    .4040366          0          1
parent_hig~u |        527    .0113852    .1061931          0          1
          m1 |        527    1.331819    .4100797   .4635267   3.007092
          m2 |        527   -.3654865    .2112297  -.7259973  -.0044607
          m3 |        527   -.4822741    .2712334  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Non-specified Higheredu,) pva
> lue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) Parent Edu & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1992) + Prov
> incedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu prov
> incedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 166
> 67), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative 
> ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       527
-------------+----------------------------------   F(23, 503)      =      4.18
       Model |  34.2967503        23  1.49116306   Prob > F        =    0.0000
    Residual |  179.523964       503   .35690649   R-squared       =    0.1604
-------------+----------------------------------   Adj R-squared   =    0.1220
       Total |  213.820715       526   .40650326   Root MSE        =    .59742

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .3701091   .0613551     6.03   0.000     .2495653    .4906529
           exp |   .0820329   .0444568     1.85   0.066    -.0053109    .1693767
        expsqr |  -.0018111   .0011863    -1.53   0.127    -.0041417    .0005196
     higheredu |   .0606388   .0824441     0.74   0.462    -.1013384     .222616
 parent_secedu |  -.0159264   .0687401    -0.23   0.817    -.1509794    .1191267
parent_highedu |   .0163663   .2599425     0.06   0.950    -.4943405    .5270732
  provincedum2 |  -.2021772   .2608539    -0.78   0.439    -.7146746    .3103203
  provincedum3 |   .0663108   .2930191     0.23   0.821    -.5093813    .6420028
  provincedum4 |    .233344   .3011196     0.77   0.439     -.358263    .8249511
  provincedum5 |    .329812   .2033887     1.62   0.106    -.0697841    .7294082
  provincedum6 |   .1891076    .231257     0.82   0.414     -.265241    .6434562
  provincedum7 |   .1257266   .2376789     0.53   0.597    -.3412391    .5926923
  provincedum8 |  -.0691349    .242058    -0.29   0.775    -.5447042    .4064344
  provincedum9 |   .2921883   .2151983     1.36   0.175    -.1306099    .7149865
 provincedum10 |    .019188   .2228359     0.09   0.931    -.4186157    .4569918
 provincedum11 |   .1512561   .2287556     0.66   0.509    -.2981781    .6006902
 provincedum12 |  -.1460099   .2242544    -0.65   0.515    -.5866007    .2945808
 provincedum13 |  -.1889533     .22257    -0.85   0.396    -.6262348    .2483281
 provincedum14 |  -.0822395   .2525821    -0.33   0.745    -.5784855    .4140064
 provincedum15 |  -.1500177   .2550602    -0.59   0.557    -.6511322    .3510969
           _m1 |    -.26694   .2334321    -1.14   0.253     -.725562     .191682
           _m2 |   .0302052   .5153947     0.06   0.953    -.9823863    1.042797
           _m3 |   .1273049   .1522075     0.84   0.403    -.1717359    .4263456
         _cons |   7.533684   .6003282    12.55   0.000     6.354224    8.713144
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3850063          .        .       .            .           .
        rho1 |  -.4302092          .        .       .            .           .
        rho2 |   .0486797          .        .       .            .           .
        rho3 |   .2051687          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> rovincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        527    8.178065    .6375761   5.298317   9.721166
        male |        527    .7381404    .4400643          0          1
         exp |        527    14.89753    6.310482          2         32
      expsqr |        527    261.6831    217.8646          4       1024
   higheredu |        527    .1290323    .3355542          0          1
-------------+---------------------------------------------------------
parent_sec~u |        527    .2049336    .4040366          0          1
parent_hig~u |        527    .0113852    .1061931          0          1
provincedum2 |        527    .0265655    .1609624          0          1
provincedum3 |        527    .0170778    .1296845          0          1
provincedum4 |        527    .0113852    .1061931          0          1
-------------+---------------------------------------------------------
provincedum5 |        527    .0702087    .2557412          0          1
provincedum6 |        527    .0626186    .2425059          0          1
provincedum7 |        527    .0721063    .2589095          0          1
provincedum8 |        527    .0967742    .2959309          0          1
provincedum9 |        527    .0777989    .2681093          0          1
-------------+---------------------------------------------------------
provinced~10 |        527    .1157495    .3202283          0          1
provinced~11 |        527    .1252372    .3313021          0          1
provinced~12 |        527    .0398482    .1957883          0          1
provinced~13 |        527    .0759013    .2650918          0          1
provinced~14 |        527    .0474383    .2127765          0          1
-------------+---------------------------------------------------------
provinced~15 |        527    .0626186    .2425059          0          1
          m1 |        527    1.331819    .4100797   .4635267   3.007092
          m2 |        527   -.3654865    .2112297  -.7259973  -.0044607
          m3 |        527   -.4822741    .2712334  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Non-specified Higheredu, Prov
> ince Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) Parent Edu & Specified higher education, Sec Gen + inrange(birthyear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       976
-------------+----------------------------------   F(11, 964)      =      6.20
       Model |  25.4398901        11  2.31271728   Prob > F        =    0.0000
    Residual |  359.330714       964  .372749703   R-squared       =    0.0661
-------------+----------------------------------   Adj R-squared   =    0.0555
       Total |  384.770604       975  .394636517   Root MSE        =    .61053

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2557411   .0444455     5.75   0.000     .1685201    .3429621
           exp |  -.0156839   .0245921    -0.64   0.524    -.0639442    .0325764
        expsqr |   .0001851   .0006875     0.27   0.788    -.0011641    .0015343
    highvocedu |   .1828602   .0553156     3.31   0.001     .0743074    .2914131
    highgenedu |   .2440571   .0634351     3.85   0.000     .1195703     .368544
      adultedu |   .0044676   .0886394     0.05   0.960    -.1694809    .1784161
 parent_secedu |   .0254307   .0463757     0.55   0.584    -.0655782    .1164395
parent_highedu |   .0320744   .1505169     0.21   0.831    -.2633042    .3274531
           _m1 |  -.3976841   .3017577    -1.32   0.188    -.9898618    .1944937
           _m2 |   .0677258   .1011996     0.67   0.504    -.1308711    .2663227
           _m3 |  -.2202378   .2175619    -1.01   0.312    -.6471873    .2067118
         _cons |   7.866619    .131913    59.63   0.000     7.607749    8.125489
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4045216          .        .       .            .           .
        rho1 |  -.6252697          .        .       .            .           .
        rho2 |   .1064837          .        .       .            .           .
        rho3 |  -.3462749          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 2
> 00, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |        976    .7264344    .4460171          0          1
         exp |        976    12.90471    7.144669          1         32
      expsqr |        976    217.5256    231.5611          1       1024
  highvocedu |        976    .2612705    .4395522          0          1
-------------+---------------------------------------------------------
  highgenedu |        976    .2520492     .434412          0          1
    adultedu |        976    .0563525    .2307193          0          1
parent_sec~u |        976    .2633197    .4406602          0          1
parent_hig~u |        976    .0184426    .1346145          0          1
          m1 |        976   -.2346505    .1031449  -.6403428  -.0164993
-------------+---------------------------------------------------------
          m2 |        976    .8031746    .6217416   .0167035   2.932487
          m3 |        976   -.3781636    .2582119  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Specified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) Parent Edu & Specified higher education, Sec Gen + inrange(birthyear, 1971, 1992) + Pro
> vincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(mon
> thlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       976
-------------+----------------------------------   F(25, 950)      =      4.72
       Model |  42.4737537        25  1.69895015   Prob > F        =    0.0000
    Residual |   342.29685       950  .360312474   R-squared       =    0.1104
-------------+----------------------------------   Adj R-squared   =    0.0870
       Total |  384.770604       975  .394636517   Root MSE        =    .60026

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2539153    .044041     5.77   0.000     .1674865    .3403442
           exp |   .0102822   .0290453     0.35   0.723    -.0467183    .0672827
        expsqr |  -.0004709   .0007698    -0.61   0.541    -.0019816    .0010398
    highvocedu |   .1851656   .0564173     3.28   0.001     .0744487    .2958824
    highgenedu |   .2211738   .0652677     3.39   0.001     .0930882    .3492593
      adultedu |   .0183447   .0887565     0.21   0.836    -.1558367    .1925261
 parent_secedu |   .0152976   .0464793     0.33   0.742    -.0759163    .1065115
parent_highedu |   .0671105   .1507639     0.45   0.656    -.2287582    .3629792
  provincedum2 |  -.3065602   .1723198    -1.78   0.076    -.6447317    .0316113
  provincedum3 |  -.4971497   .1832738    -2.71   0.007    -.8568179   -.1374815
  provincedum4 |  -.4626503    .221626    -2.09   0.037    -.8975833   -.0277172
  provincedum5 |  -.0930673   .1428713    -0.65   0.515    -.3734471    .1873124
  provincedum6 |  -.1587486   .1588291    -1.00   0.318     -.470445    .1529478
  provincedum7 |  -.2217078   .1642616    -1.35   0.177    -.5440653    .1006496
  provincedum8 |  -.4292654   .1620464    -2.65   0.008    -.7472756   -.1112551
  provincedum9 |  -.0188298   .1468287    -0.13   0.898     -.306976    .2693164
 provincedum10 |   -.128459   .1496874    -0.86   0.391    -.4222151    .1652972
 provincedum11 |  -.2119603   .1595256    -1.33   0.184    -.5250236    .1011029
 provincedum12 |   -.313234   .1786691    -1.75   0.080    -.6638658    .0373978
 provincedum13 |  -.2820055   .1604813    -1.76   0.079    -.5969443    .0329332
 provincedum14 |  -.2179654   .1742783    -1.25   0.211    -.5599804    .1240496
 provincedum15 |  -.4124994   .1600581    -2.58   0.010    -.7266078   -.0983911
           _m1 |   .3076908   .4293805     0.72   0.474     -.534953    1.150335
           _m2 |  -.0873895   .1301582    -0.67   0.502    -.3428202    .1680412
           _m3 |  -.1861656   .2297521    -0.81   0.418    -.6370458    .2647147
         _cons |   8.207196   .2291309    35.82   0.000     7.757535    8.656857
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3744333          .        .       .            .           .
        rho1 |   .5028371          .        .       .            .           .
        rho2 |  -.1428144          .        .       .            .           .
        rho3 |   -.304237          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) 
> & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        976    8.238095     .628201    5.37836   9.645658
        male |        976    .7264344    .4460171          0          1
         exp |        976    12.90471    7.144669          1         32
      expsqr |        976    217.5256    231.5611          1       1024
  highvocedu |        976    .2612705    .4395522          0          1
-------------+---------------------------------------------------------
  highgenedu |        976    .2520492     .434412          0          1
    adultedu |        976    .0563525    .2307193          0          1
parent_sec~u |        976    .2633197    .4406602          0          1
parent_hig~u |        976    .0184426    .1346145          0          1
provincedum2 |        976     .039959    .1959634          0          1
-------------+---------------------------------------------------------
provincedum3 |        976    .0245902    .1549519          0          1
provincedum4 |        976    .0112705    .1056167          0          1
provincedum5 |        976    .0860656    .2806046          0          1
provincedum6 |        976    .0717213    .2581582          0          1
provincedum7 |        976    .0727459    .2598521          0          1
-------------+---------------------------------------------------------
provincedum8 |        976    .1260246    .3320472          0          1
provincedum9 |        976     .107582    .3100106          0          1
provinced~10 |        976    .1034836    .3047456          0          1
provinced~11 |        976     .107582    .3100106          0          1
provinced~12 |        976     .022541    .1485109          0          1
-------------+---------------------------------------------------------
provinced~13 |        976    .0491803    .2163552          0          1
provinced~14 |        976    .0481557     .214205          0          1
provinced~15 |        976    .0809426    .2728868          0          1
          m1 |        976   -.2346505    .1031449  -.6403428  -.0164993
          m2 |        976    .8031746    .6217416   .0167035   2.932487
-------------+---------------------------------------------------------
          m3 |        976   -.3781636    .2582119  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) Parent Edu & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu if i
> nrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp ex
> psqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) d
> mf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       976
-------------+----------------------------------   F(9, 966)       =      6.88
       Model |  23.1802795         9  2.57558661   Prob > F        =    0.0000
    Residual |  361.590324       966  .374317106   R-squared       =    0.0602
-------------+----------------------------------   Adj R-squared   =    0.0515
       Total |  384.770604       975  .394636517   Root MSE        =    .61181

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2604943   .0444171     5.86   0.000     .1733291    .3476595
           exp |  -.0234193   .0244028    -0.96   0.337     -.071308    .0244694
        expsqr |   .0003411   .0006851     0.50   0.619    -.0010034    .0016856
     higheredu |   .1678814   .0487984     3.44   0.001     .0721183    .2636444
 parent_secedu |   .0321876   .0462789     0.70   0.487    -.0586311    .1230063
parent_highedu |   .0413325   .1505871     0.27   0.784     -.254183    .3368479
           _m1 |  -.3475711   .3005812    -1.16   0.248    -.9374386    .2422963
           _m2 |   .0693415   .1013746     0.68   0.494    -.1295983    .2682812
           _m3 |  -.2066816   .2179486    -0.95   0.343    -.6343888    .2210257
         _cons |   7.956597   .1252055    63.55   0.000     7.710891    8.202303
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3986487          .        .       .            .           .
        rho1 |  -.5504889          .        .       .            .           .
        rho2 |   .1098241          .        .       .            .           .
        rho3 |  -.3273456          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu  
> m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        976    8.238095     .628201    5.37836   9.645658
        male |        976    .7264344    .4460171          0          1
         exp |        976    12.90471    7.144669          1         32
      expsqr |        976    217.5256    231.5611          1       1024
   higheredu |        976    .5696721    .4953758          0          1
-------------+---------------------------------------------------------
parent_sec~u |        976    .2633197    .4406602          0          1
parent_hig~u |        976    .0184426    .1346145          0          1
          m1 |        976   -.2346505    .1031449  -.6403428  -.0164993
          m2 |        976    .8031746    .6217416   .0167035   2.932487
          m3 |        976   -.3781636    .2582119  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Non-specified Higheredu,) pva
> lue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) Parent Edu & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1992) + Prov
> incedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu prov
> incedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 166
> 67), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative 
> ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       976
-------------+----------------------------------   F(23, 952)      =      4.92
       Model |  40.9105785        23   1.7787208   Prob > F        =    0.0000
    Residual |  343.860025       952  .361197506   R-squared       =    0.1063
-------------+----------------------------------   Adj R-squared   =    0.0847
       Total |  384.770604       975  .394636517   Root MSE        =      .601

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2583843   .0439956     5.87   0.000     .1720447    .3447239
           exp |   .0061028   .0289927     0.21   0.833    -.0507941    .0629998
        expsqr |  -.0003935   .0007696    -0.51   0.609    -.0019039    .0011168
     higheredu |   .1626603   .0501393     3.24   0.001      .064264    .2610565
 parent_secedu |   .0197525   .0463303     0.43   0.670    -.0711689    .1106738
parent_highedu |   .0806769   .1505814     0.54   0.592    -.2148329    .3761867
  provincedum2 |  -.3329997   .1717085    -1.94   0.053    -.6699706    .0039712
  provincedum3 |  -.5046268   .1830826    -2.76   0.006    -.8639189   -.1453348
  provincedum4 |  -.4743598   .2215787    -2.14   0.033    -.9091989   -.0395206
  provincedum5 |  -.1029177   .1429081    -0.72   0.472    -.3833689    .1775335
  provincedum6 |  -.1705865   .1587144    -1.07   0.283     -.482057     .140884
  provincedum7 |  -.2399524   .1638157    -1.46   0.143    -.5614341    .0815293
  provincedum8 |  -.4496487   .1615715    -2.78   0.005    -.7667261   -.1325712
  provincedum9 |   -.034727   .1464669    -0.24   0.813    -.3221623    .2527084
 provincedum10 |   -.149362   .1489875    -1.00   0.316    -.4417439    .1430198
 provincedum11 |  -.2337972   .1592263    -1.47   0.142    -.5462723     .078678
 provincedum12 |  -.3639333   .1772203    -2.05   0.040    -.7117208   -.0161458
 provincedum13 |  -.3134007   .1598493    -1.96   0.050    -.6270984     .000297
 provincedum14 |  -.2465146   .1737064    -1.42   0.156    -.5874063    .0943771
 provincedum15 |  -.4331512   .1592636    -2.72   0.007    -.7456994    -.120603
           _m1 |   .3784156   .4247131     0.89   0.373    -.4550664    1.211898
           _m2 |  -.0963334   .1301338    -0.74   0.459    -.3517156    .1590487
           _m3 |  -.1718601   .2299255    -0.75   0.455    -.6230794    .2793592
         _cons |   8.300238   .2213105    37.50   0.000     7.865925     8.73455
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3878914          .        .       .            .           .
        rho1 |   .6075947          .        .       .            .           .
        rho2 |  -.1546757          .        .       .            .           .
        rho3 |  -.2759434          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> rovincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        976    8.238095     .628201    5.37836   9.645658
        male |        976    .7264344    .4460171          0          1
         exp |        976    12.90471    7.144669          1         32
      expsqr |        976    217.5256    231.5611          1       1024
   higheredu |        976    .5696721    .4953758          0          1
-------------+---------------------------------------------------------
parent_sec~u |        976    .2633197    .4406602          0          1
parent_hig~u |        976    .0184426    .1346145          0          1
provincedum2 |        976     .039959    .1959634          0          1
provincedum3 |        976    .0245902    .1549519          0          1
provincedum4 |        976    .0112705    .1056167          0          1
-------------+---------------------------------------------------------
provincedum5 |        976    .0860656    .2806046          0          1
provincedum6 |        976    .0717213    .2581582          0          1
provincedum7 |        976    .0727459    .2598521          0          1
provincedum8 |        976    .1260246    .3320472          0          1
provincedum9 |        976     .107582    .3100106          0          1
-------------+---------------------------------------------------------
provinced~10 |        976    .1034836    .3047456          0          1
provinced~11 |        976     .107582    .3100106          0          1
provinced~12 |        976     .022541    .1485109          0          1
provinced~13 |        976    .0491803    .2163552          0          1
provinced~14 |        976    .0481557     .214205          0          1
-------------+---------------------------------------------------------
provinced~15 |        976    .0809426    .2728868          0          1
          m1 |        976   -.2346505    .1031449  -.6403428  -.0164993
          m2 |        976    .8031746    .6217416   .0167035   2.932487
          m3 |        976   -.3781636    .2582119  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Non-specified Higheredu, Prov
> ince Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) Parent Party Membership & Specified higher education, Sec Voc + inrange(birthyear, 1971
> , 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=
> male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_
> relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(10, 515)      =      5.57
       Model |  20.8459392        10  2.08459392   Prob > F        =    0.0000
    Residual |  192.640164       515  .374058571   R-squared       =    0.0976
-------------+----------------------------------   Adj R-squared   =    0.0801
       Total |  213.486103       525  .406640197   Root MSE        =     .6116

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3668478   .0614795     5.97   0.000     .2460662    .4876293
               exp |   .0585235   .0330962     1.77   0.078    -.0064968    .1235438
            expsqr |  -.0012865   .0008724    -1.47   0.141    -.0030004    .0004274
        highvocedu |    .045757     .09849     0.46   0.642    -.1477345    .2392486
        highgenedu |     .14756   .2542028     0.58   0.562     -.351842    .6469619
          adultedu |   .1792871   .1542674     1.16   0.246    -.1237836    .4823578
parent_partymember |   .0395212   .0721682     0.55   0.584    -.1022592    .1813015
               _m1 |  -.2534263   .1164686    -2.18   0.030    -.4822383   -.0246144
               _m2 |   .0447771   .2945441     0.15   0.879    -.5338787    .6234329
               _m3 |   .0212768   .1435394     0.15   0.882    -.2607179    .3032716
             _cons |   7.718009   .3907341    19.75   0.000      6.95038    8.485637
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4072695          .        .       .            .           .
        rho1 |    -.39711          .        .       .            .           .
        rho2 |   .0701641          .        .       .            .           .
        rho3 |     .03334          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        526    8.176781    .6376835   5.298317   9.721166
        male |        526    .7376426    .4403347          0          1
         exp |        526    14.89734    6.325527          2         32
      expsqr |        526    261.8669     218.597          4       1024
  highvocedu |        526    .0855513    .2799666          0          1
-------------+---------------------------------------------------------
  highgenedu |        526    .0114068     .106293          0          1
    adultedu |        526    .0323194    .1770153          0          1
parent_par~r |        526    .1711027    .3769571          0          1
          m1 |        526    1.334836    .4110429   .4635267   3.007092
          m2 |        526   -.3661431    .2109091  -.7259973  -.0044607
-------------+---------------------------------------------------------
          m3 |        526   -.4819783    .2714114  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Specified Higher
> edu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) Parent Party Membership & Specified higher education, Sec Voc + inrange(birthyear, 1971
> , 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearnin
> g, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(24, 501)      =      4.01
       Model |  34.3954312        24  1.43314297   Prob > F        =    0.0000
    Residual |  179.090672       501  .357466412   R-squared       =    0.1611
-------------+----------------------------------   Adj R-squared   =    0.1209
       Total |  213.486103       525  .406640197   Root MSE        =    .59788

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3721297   .0615368     6.05   0.000     .2512277    .4930316
               exp |   .0813598   .0446352     1.82   0.069    -.0063355    .1690551
            expsqr |  -.0018393   .0011911    -1.54   0.123    -.0041796    .0005009
        highvocedu |  -.0079173   .0994657    -0.08   0.937    -.2033387    .1875041
        highgenedu |   .1800521   .2541308     0.71   0.479    -.3192413    .6793454
          adultedu |    .173621   .1527696     1.14   0.256     -.126527     .473769
parent_partymember |   .0570869    .071852     0.79   0.427    -.0840815    .1982553
      provincedum2 |  -.2270016   .2618218    -0.87   0.386    -.7414055    .2874024
      provincedum3 |   .0545179   .2931805     0.19   0.853    -.5214967    .6305326
      provincedum4 |   .2093336   .3017973     0.69   0.488    -.3836108    .8022779
      provincedum5 |   .3406612   .2039772     1.67   0.096    -.0600949    .7414174
      provincedum6 |   .1930857   .2304334     0.84   0.402    -.2596492    .6458207
      provincedum7 |   .1172999   .2390162     0.49   0.624    -.3522977    .5868975
      provincedum8 |  -.0698274   .2416027    -0.29   0.773    -.5445066    .4048519
      provincedum9 |   .2815984    .215757     1.31   0.192    -.1423016    .7054985
     provincedum10 |   .0154365   .2234967     0.07   0.945    -.4236698    .4545428
     provincedum11 |   .1471554   .2290767     0.64   0.521     -.302914    .5972248
     provincedum12 |  -.1425402   .2248774    -0.63   0.526    -.5843593    .2992788
     provincedum13 |  -.1950721   .2230202    -0.87   0.382    -.6332422    .2430981
     provincedum14 |  -.0937955   .2538745    -0.37   0.712    -.5925855    .4049944
     provincedum15 |  -.1561033   .2556167    -0.61   0.542    -.6583162    .3461095
               _m1 |  -.2299185   .2348615    -0.98   0.328    -.6913534    .2315164
               _m2 |  -.0051779   .5166069    -0.01   0.992    -1.020161    1.009805
               _m3 |   .1111165   .1525931     0.73   0.467    -.1886848    .4109178
             _cons |   7.471355   .6034869    12.38   0.000     6.285678    8.657032
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3732571          .        .       .            .           .
        rho1 |  -.3763309          .        .       .            .           .
        rho2 |  -.0084751          .        .       .            .           .
        rho3 |   .1818756          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(
> monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        526    8.176781    .6376835   5.298317   9.721166
        male |        526    .7376426    .4403347          0          1
         exp |        526    14.89734    6.325527          2         32
      expsqr |        526    261.8669     218.597          4       1024
  highvocedu |        526    .0855513    .2799666          0          1
-------------+---------------------------------------------------------
  highgenedu |        526    .0114068     .106293          0          1
    adultedu |        526    .0323194    .1770153          0          1
parent_par~r |        526    .1711027    .3769571          0          1
provincedum2 |        526     .026616    .1611115          0          1
provincedum3 |        526    .0171103    .1298058          0          1
-------------+---------------------------------------------------------
provincedum4 |        526    .0114068     .106293          0          1
provincedum5 |        526    .0703422    .2559663          0          1
provincedum6 |        526    .0627376    .2427213          0          1
provincedum7 |        526    .0722433    .2591369          0          1
provincedum8 |        526    .0988593    .2987572          0          1
-------------+---------------------------------------------------------
provincedum9 |        526    .0779468     .268343          0          1
provinced~10 |        526    .1159696    .3204932          0          1
provinced~11 |        526    .1254753    .3315724          0          1
provinced~12 |        526     .039924    .1959669          0          1
provinced~13 |        526    .0760456    .2653234          0          1
-------------+---------------------------------------------------------
provinced~14 |        526    .0475285     .212969          0          1
provinced~15 |        526    .0627376    .2427213          0          1
          m1 |        526    1.334836    .4110429   .4635267   3.007092
          m2 |        526   -.3661431    .2109091  -.7259973  -.0044607
          m3 |        526   -.4819783    .2714114  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Specified Higher
> edu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) Parent Party Membership & Combined higher education, Sec Voc + inrange(birthyear, 1971,
>  1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_partymember if inrange(bir
> thyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_
> secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) show
> mlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(8, 517)       =      6.91
       Model |  20.6135146         8  2.57668932   Prob > F        =    0.0000
    Residual |  192.872589       517    .3730611   R-squared       =    0.0966
-------------+----------------------------------   Adj R-squared   =    0.0826
       Total |  213.486103       525  .406640197   Root MSE        =    .61079

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3634495   .0611829     5.94   0.000     .2432517    .4836472
               exp |   .0577061   .0330356     1.75   0.081    -.0071944    .1226065
            expsqr |  -.0012498   .0008699    -1.44   0.151    -.0029588    .0004592
         higheredu |   .0887107   .0817011     1.09   0.278    -.0717962    .2492176
parent_partymember |   .0332179   .0715845     0.46   0.643    -.1074144    .1738503
               _m1 |  -.2659777   .1148399    -2.32   0.021     -.491588   -.0403674
               _m2 |   .0645255   .2924868     0.22   0.825    -.5100833    .6391343
               _m3 |   .0269526    .143161     0.19   0.851    -.2542961    .3082014
             _cons |   7.750804    .387349    20.01   0.000     6.989833    8.511776
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .412223          .        .       .            .           .
        rho1 |  -.4142658          .        .       .            .           .
        rho2 |   .1004998          .        .       .            .           .
        rho3 |   .0419793          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_partymember  m1 m2 m3 i
> f inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_partymember m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        526    8.176781    .6376835   5.298317   9.721166
        male |        526    .7376426    .4403347          0          1
         exp |        526    14.89734    6.325527          2         32
      expsqr |        526    261.8669     218.597          4       1024
   higheredu |        526    .1292776    .3358263          0          1
-------------+---------------------------------------------------------
parent_par~r |        526    .1711027    .3769571          0          1
          m1 |        526    1.334836    .4110429   .4635267   3.007092
          m2 |        526   -.3661431    .2109091  -.7259973  -.0044607
          m3 |        526   -.4819783    .2714114  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Non-specified Hi
> gheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) Parent Party Membership & Combined higher education, Sec Voc + inrange(birthyear, 1971,
>  1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_partymember provincedum2-p
> rovincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(22, 503)      =      4.32
       Model |  33.9225242        22  1.54193292   Prob > F        =    0.0000
    Residual |  179.563579       503  .356985247   R-squared       =    0.1589
-------------+----------------------------------   Adj R-squared   =    0.1221
       Total |  213.486103       525  .406640197   Root MSE        =    .59748

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3689569     .06134     6.01   0.000     .2484427    .4894711
               exp |   .0781832     .04448     1.76   0.079    -.0092061    .1655726
            expsqr |  -.0017374   .0011862    -1.46   0.144     -.004068    .0005931
         higheredu |   .0564943   .0821409     0.69   0.492    -.1048873    .2178758
parent_partymember |   .0476826     .07133     0.67   0.504    -.0924587     .187824
      provincedum2 |  -.2176702   .2615162    -0.83   0.406    -.7314689    .2961284
      provincedum3 |   .0634909    .291681     0.22   0.828    -.5095722     .636554
      provincedum4 |   .2300608   .3009924     0.76   0.445    -.3612963    .8214179
      provincedum5 |   .3288296   .2035574     1.62   0.107     -.071098    .7287571
      provincedum6 |   .1875719   .2301188     0.82   0.415    -.2645406    .6396844
      provincedum7 |   .1150161   .2388197     0.48   0.630    -.3541909    .5842231
      provincedum8 |  -.0617598   .2405655    -0.26   0.797    -.5343967    .4108772
      provincedum9 |   .2881391   .2153468     1.34   0.181    -.1349508     .711229
     provincedum10 |    .017492   .2233033     0.08   0.938    -.4212301    .4562141
     provincedum11 |   .1517809   .2288734     0.66   0.508    -.2978847    .6014466
     provincedum12 |  -.1455735   .2246331    -0.65   0.517    -.5869083    .2957612
     provincedum13 |  -.1934086   .2228414    -0.87   0.386    -.6312232     .244406
     provincedum14 |  -.0820649   .2531675    -0.32   0.746    -.5794609    .4153311
     provincedum15 |  -.1559839   .2554245    -0.61   0.542    -.6578143    .3458464
               _m1 |  -.2489194   .2340173    -1.06   0.288    -.7086912    .2108524
               _m2 |   .0335053   .5151557     0.07   0.948    -.9786168    1.045627
               _m3 |    .115559   .1524307     0.76   0.449    -.1839202    .4150383
             _cons |   7.535304   .6005144    12.55   0.000     6.355478    8.715129
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3800637          .        .       .            .           .
        rho1 |  -.4037668          .        .       .            .           .
        rho2 |   .0543482          .        .       .            .           .
        rho3 |   .1874458          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum
> 2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 
> 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum2-provin
> cedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        526    8.176781    .6376835   5.298317   9.721166
        male |        526    .7376426    .4403347          0          1
         exp |        526    14.89734    6.325527          2         32
      expsqr |        526    261.8669     218.597          4       1024
   higheredu |        526    .1292776    .3358263          0          1
-------------+---------------------------------------------------------
parent_par~r |        526    .1711027    .3769571          0          1
provincedum2 |        526     .026616    .1611115          0          1
provincedum3 |        526    .0171103    .1298058          0          1
provincedum4 |        526    .0114068     .106293          0          1
provincedum5 |        526    .0703422    .2559663          0          1
-------------+---------------------------------------------------------
provincedum6 |        526    .0627376    .2427213          0          1
provincedum7 |        526    .0722433    .2591369          0          1
provincedum8 |        526    .0988593    .2987572          0          1
provincedum9 |        526    .0779468     .268343          0          1
provinced~10 |        526    .1159696    .3204932          0          1
-------------+---------------------------------------------------------
provinced~11 |        526    .1254753    .3315724          0          1
provinced~12 |        526     .039924    .1959669          0          1
provinced~13 |        526    .0760456    .2653234          0          1
provinced~14 |        526    .0475285     .212969          0          1
provinced~15 |        526    .0627376    .2427213          0          1
-------------+---------------------------------------------------------
          m1 |        526    1.334836    .4110429   .4635267   3.007092
          m2 |        526   -.3661431    .2109091  -.7259973  -.0044607
          m3 |        526   -.4819783    .2714114  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Non-specified Hi
> gheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) Parent Party Membership & Specified higher education, Sec Gen + inrange(birthyear, 1971
> , 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=
> male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_
> relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       978
-------------+----------------------------------   F(10, 967)      =      6.62
       Model |  24.8047305        10  2.48047305   Prob > F        =    0.0000
    Residual |  362.433403       967  .374801865   R-squared       =    0.0641
-------------+----------------------------------   Adj R-squared   =    0.0544
       Total |  387.238134       977  .396354282   Root MSE        =    .61221

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2604372   .0445895     5.84   0.000     .1729339    .3479405
               exp |   -.016463    .024465    -0.67   0.501    -.0644736    .0315476
            expsqr |   .0002286   .0006822     0.34   0.738    -.0011102    .0015675
        highvocedu |   .1830371   .0553929     3.30   0.001     .0743328    .2917413
        highgenedu |   .2475204   .0634838     3.90   0.000     .1229386    .3721023
          adultedu |   -.003035   .0896096    -0.03   0.973    -.1788867    .1728167
parent_partymember |  -.0130266   .0503874    -0.26   0.796    -.1119078    .0858546
               _m1 |    -.39374   .3022638    -1.30   0.193    -.9869087    .1994286
               _m2 |   .0668837   .1011974     0.66   0.509     -.131708    .2654755
               _m3 |  -.2241718   .2176947    -1.03   0.303    -.6513802    .2030367
             _cons |   7.875946   .1322338    59.56   0.000     7.616448    8.135444
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4060068          .        .       .            .           .
        rho1 |  -.6179351          .        .       .            .           .
        rho2 |   .1049673          .        .       .            .           .
        rho3 |  -.3518149          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |        978    .7280164    .4452092          0          1
         exp |        978    12.93456    7.167238          1         32
      expsqr |        978    218.6196    232.5427          1       1024
  highvocedu |        978    .2607362    .4392609          0          1
-------------+---------------------------------------------------------
  highgenedu |        978    .2515337    .4341166          0          1
    adultedu |        978    .0552147    .2285158          0          1
parent_par~r |        978    .1891616    .3918373          0          1
          m1 |        978   -.2342994    .1033308  -.6403428  -.0164993
          m2 |        978    .8053992    .6230592   .0167035   2.932487
-------------+---------------------------------------------------------
          m3 |        978   -.3787709     .258297  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Specified Higher
> edu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) Parent Party Membership & Specified higher education, Sec Gen + inrange(birthyear, 1971
> , 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearnin
> g, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       978
-------------+----------------------------------   F(24, 953)      =      4.66
       Model |  40.6800773        24  1.69500322   Prob > F        =    0.0000
    Residual |  346.558056       953  .363649587   R-squared       =    0.1051
-------------+----------------------------------   Adj R-squared   =    0.0825
       Total |  387.238134       977  .396354282   Root MSE        =    .60303

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2602572   .0442697     5.88   0.000       .17338    .3471345
               exp |   .0066558   .0289826     0.23   0.818    -.0502213    .0635329
            expsqr |  -.0003463   .0007668    -0.45   0.652     -.001851    .0011584
        highvocedu |   .1878058   .0566216     3.32   0.001     .0766884    .2989231
        highgenedu |   .2271869   .0654355     3.47   0.001     .0987726    .3556012
          adultedu |   .0086968   .0899946     0.10   0.923    -.1679138    .1853073
parent_partymember |  -.0339662   .0501315    -0.68   0.498    -.1323471    .0644148
      provincedum2 |  -.2874598   .1729604    -1.66   0.097    -.6268871    .0519674
      provincedum3 |  -.4460353    .181396    -2.46   0.014     -.802017   -.0900536
      provincedum4 |  -.4612879   .2224629    -2.07   0.038    -.8978616   -.0247142
      provincedum5 |  -.0814886   .1436548    -0.57   0.571     -.363405    .2004277
      provincedum6 |   -.153407   .1593832    -0.96   0.336    -.4661895    .1593756
      provincedum7 |  -.2106551    .165082    -1.28   0.202    -.5346214    .1133111
      provincedum8 |  -.3987778   .1627533    -2.45   0.014    -.7181741   -.0793815
      provincedum9 |  -.0072511   .1477435    -0.05   0.961    -.2971912     .282689
     provincedum10 |  -.1152834   .1503104    -0.77   0.443     -.410261    .1796943
     provincedum11 |  -.1964024   .1602372    -1.23   0.221    -.5108609    .1180562
     provincedum12 |  -.2962559   .1789264    -1.66   0.098    -.6473911    .0548792
     provincedum13 |  -.2726563   .1612545    -1.69   0.091    -.5891112    .0437987
     provincedum14 |  -.2075442   .1748003    -1.19   0.235     -.550582    .1354937
     provincedum15 |  -.4039242     .16078    -2.51   0.012     -.719448   -.0884003
               _m1 |   .2658794    .431075     0.62   0.538    -.5800864    1.111845
               _m2 |  -.0769356    .130787    -0.59   0.557    -.3335994    .1797283
               _m3 |  -.1904189   .2302534    -0.83   0.408    -.6422813    .2614434
             _cons |   8.201389   .2301642    35.63   0.000     7.749702    8.653077
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3717686          .        .       .            .           .
        rho1 |   .4360621          .        .       .            .           .
        rho2 |  -.1261801          .        .       .            .           .
        rho3 |  -.3123013          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(
> monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        978    8.240976    .6295667    5.37836   9.645658
        male |        978    .7280164    .4452092          0          1
         exp |        978    12.93456    7.167238          1         32
      expsqr |        978    218.6196    232.5427          1       1024
  highvocedu |        978    .2607362    .4392609          0          1
-------------+---------------------------------------------------------
  highgenedu |        978    .2515337    .4341166          0          1
    adultedu |        978    .0552147    .2285158          0          1
parent_par~r |        978    .1891616    .3918373          0          1
provincedum2 |        978    .0398773     .195771          0          1
provincedum3 |        978    .0255624    .1579064          0          1
-------------+---------------------------------------------------------
provincedum4 |        978    .0112474    .1055098          0          1
provincedum5 |        978    .0858896    .2803443          0          1
provincedum6 |        978    .0715746    .2579142          0          1
provincedum7 |        978    .0725971    .2596068          0          1
provincedum8 |        978    .1267894    .3329071          0          1
-------------+---------------------------------------------------------
provincedum9 |        978     .107362    .3097313          0          1
provinced~10 |        978     .103272    .3044695          0          1
provinced~11 |        978     .107362    .3097313          0          1
provinced~12 |        978    .0224949    .1483623          0          1
provinced~13 |        978    .0490798    .2161451          0          1
-------------+---------------------------------------------------------
provinced~14 |        978    .0480573    .2139967          0          1
provinced~15 |        978    .0807771    .2726319          0          1
          m1 |        978   -.2342994    .1033308  -.6403428  -.0164993
          m2 |        978    .8053992    .6230592   .0167035   2.932487
          m3 |        978   -.3787709     .258297  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Specified Higher
> edu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) Parent Party Membership & Combined higher education, Sec Gen + inrange(birthyear, 1971,
>  1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_partymember if inrange(bir
> thyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_
> secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) show
> mlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       978
-------------+----------------------------------   F(8, 969)       =      7.42
       Model |  22.3496079         8  2.79370099   Prob > F        =    0.0000
    Residual |  364.888526       969  .376561946   R-squared       =    0.0577
-------------+----------------------------------   Adj R-squared   =    0.0499
       Total |  387.238134       977  .396354282   Root MSE        =    .61365

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2645848   .0445856     5.93   0.000     .1770893    .3520804
               exp |  -.0241852   .0243084    -0.99   0.320    -.0718885     .023518
            expsqr |    .000378   .0006808     0.56   0.579    -.0009579    .0017139
         higheredu |   .1685865   .0490033     3.44   0.001     .0724217    .2647513
parent_partymember |  -.0068572   .0504467    -0.14   0.892    -.1058545    .0921402
               _m1 |  -.3353131    .300895    -1.11   0.265     -.925794    .2551678
               _m2 |   .0691247   .1013953     0.68   0.496     -.129855    .2681044
               _m3 |  -.2101249   .2181349    -0.96   0.336    -.6381962    .2179463
             _cons |   7.970345   .1255134    63.50   0.000     7.724035    8.216654
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3992074          .        .       .            .           .
        rho1 |  -.5307026          .        .       .            .           .
        rho2 |   .1094041          .        .       .            .           .
        rho3 |  -.3325664          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_partymember  m1 m2 m3 i
> f inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_partymember m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        978    8.240976    .6295667    5.37836   9.645658
        male |        978    .7280164    .4452092          0          1
         exp |        978    12.93456    7.167238          1         32
      expsqr |        978    218.6196    232.5427          1       1024
   higheredu |        978    .5674847    .4956784          0          1
-------------+---------------------------------------------------------
parent_par~r |        978    .1891616    .3918373          0          1
          m1 |        978   -.2342994    .1033308  -.6403428  -.0164993
          m2 |        978    .8053992    .6230592   .0167035   2.932487
          m3 |        978   -.3787709     .258297  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Non-specified Hi
> gheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) Parent Party Membership & Combined higher education, Sec Gen + inrange(birthyear, 1971,
>  1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_partymember provincedum2-p
> rovincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       978
-------------+----------------------------------   F(22, 955)      =      4.85
       Model |  38.8831609        22   1.7674164   Prob > F        =    0.0000
    Residual |  348.354973       955  .364769605   R-squared       =    0.1004
-------------+----------------------------------   Adj R-squared   =    0.0797
       Total |  387.238134       977  .396354282   Root MSE        =    .60396

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |    .264282   .0442519     5.97   0.000     .1774399    .3511242
               exp |   .0021468   .0289463     0.07   0.941    -.0546589    .0589524
            expsqr |  -.0002672    .000767    -0.35   0.728    -.0017724    .0012381
         higheredu |   .1649975   .0505017     3.27   0.001     .0658904    .2641045
parent_partymember |  -.0283571   .0501421    -0.57   0.572    -.1267587    .0700444
      provincedum2 |  -.3154603   .1723577    -1.83   0.068    -.6537038    .0227832
      provincedum3 |  -.4524965   .1812256    -2.50   0.013    -.8081429     -.09685
      provincedum4 |  -.4749786   .2224243    -2.14   0.033    -.9114753   -.0384818
      provincedum5 |  -.0920463   .1437318    -0.64   0.522    -.3741129    .1900203
      provincedum6 |  -.1662162   .1592744    -1.04   0.297    -.4787844    .1463521
      provincedum7 |  -.2306793   .1646459    -1.40   0.162    -.5537889    .0924303
      provincedum8 |  -.4188485   .1623496    -2.58   0.010    -.7374518   -.1002453
      provincedum9 |  -.0244316   .1474108    -0.17   0.868    -.3137181    .2648548
     provincedum10 |  -.1370182   .1497033    -0.92   0.360    -.4308035    .1567672
     provincedum11 |  -.2190189   .1599946    -1.37   0.171    -.5330005    .0949626
     provincedum12 |  -.3492038   .1776041    -1.97   0.050    -.6977432   -.0006644
     provincedum13 |  -.3069454   .1606312    -1.91   0.056    -.6221764    .0082856
     provincedum14 |  -.2384203   .1742142    -1.37   0.171    -.5803071    .1034665
     provincedum15 |  -.4261798   .1600187    -2.66   0.008    -.7402087   -.1121508
               _m1 |    .345316   .4261441     0.81   0.418    -.4909711    1.181603
               _m2 |  -.0854768   .1307995    -0.65   0.514    -.3421645    .1712108
               _m3 |  -.1769474   .2305126    -0.77   0.443    -.6293172    .2754223
             _cons |   8.301906   .2222834    37.35   0.000     7.865686    8.738126
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3853506          .        .       .            .           .
        rho1 |   .5562738          .        .       .            .           .
        rho2 |  -.1376957          .        .       .            .           .
        rho3 |  -.2850468          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum
> 2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 
> 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum2-provin
> cedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        978    8.240976    .6295667    5.37836   9.645658
        male |        978    .7280164    .4452092          0          1
         exp |        978    12.93456    7.167238          1         32
      expsqr |        978    218.6196    232.5427          1       1024
   higheredu |        978    .5674847    .4956784          0          1
-------------+---------------------------------------------------------
parent_par~r |        978    .1891616    .3918373          0          1
provincedum2 |        978    .0398773     .195771          0          1
provincedum3 |        978    .0255624    .1579064          0          1
provincedum4 |        978    .0112474    .1055098          0          1
provincedum5 |        978    .0858896    .2803443          0          1
-------------+---------------------------------------------------------
provincedum6 |        978    .0715746    .2579142          0          1
provincedum7 |        978    .0725971    .2596068          0          1
provincedum8 |        978    .1267894    .3329071          0          1
provincedum9 |        978     .107362    .3097313          0          1
provinced~10 |        978     .103272    .3044695          0          1
-------------+---------------------------------------------------------
provinced~11 |        978     .107362    .3097313          0          1
provinced~12 |        978    .0224949    .1483623          0          1
provinced~13 |        978    .0490798    .2161451          0          1
provinced~14 |        978    .0480573    .2139967          0          1
provinced~15 |        978    .0807771    .2726319          0          1
-------------+---------------------------------------------------------
          m1 |        978   -.2342994    .1033308  -.6403428  -.0164993
          m2 |        978    .8053992    .6230592   .0167035   2.932487
          m3 |        978   -.3787709     .258297  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Non-specified Hi
> gheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) All Parent Indicators & Keyschool & Specified higher education, Sec Voc + inrange(birth
> year, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(m
> onthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_hi
> ghedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(13, 511)      =      4.94
       Model |  23.8140215        13  1.83184781   Prob > F        =    0.0000
    Residual |  189.647042       511   .37112924   R-squared       =    0.1116
-------------+----------------------------------   Adj R-squared   =    0.0890
       Total |  213.461063       524  .407368441   Root MSE        =     .6092

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3658004   .0615367     5.94   0.000     .2449044    .4866964
               exp |    .065604   .0331249     1.98   0.048     .0005262    .1306818
            expsqr |  -.0014818   .0008741    -1.70   0.091    -.0031991    .0002354
        highvocedu |   .0717878   .0988943     0.73   0.468    -.1225017    .2660773
        highgenedu |   .1791826   .2538096     0.71   0.481    -.3194562    .6778213
          adultedu |   .1971236   .1537917     1.28   0.201    -.1050182    .4992654
     parent_secedu |  -.0083182   .0698031    -0.12   0.905    -.1454547    .1288183
    parent_highedu |   .0462057   .2618842     0.18   0.860    -.4682965    .5607079
parent_partymember |   .0370541   .0755815     0.49   0.624    -.1114346    .1855427
         Keyschool |   .4013414   .1492388     2.69   0.007     .1081443    .6945385
               _m1 |  -.2656282   .1161892    -2.29   0.023    -.4938956   -.0373608
               _m2 |   .0927732   .2943138     0.32   0.753    -.4854408    .6709872
               _m3 |   .0323669   .1431755     0.23   0.821    -.2489181     .313652
             _cons |   7.687341   .3895448    19.73   0.000     6.922034    8.452647
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4074386          .        .       .            .           .
        rho1 |  -.4161435          .        .       .            .           .
        rho2 |   .1453421          .        .       .            .           .
        rho3 |   .0507073          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
  highvocedu |        525    .0857143    .2802087          0          1
-------------+---------------------------------------------------------
  highgenedu |        525    .0114286    .1063932          0          1
    adultedu |        525     .032381    .1771785          0          1
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
-------------+---------------------------------------------------------
   Keyschool |        525    .0342857    .1821356          0          1
          m1 |        525    1.333378     .410071   .4635267   3.007092
          m2 |        525   -.3666274    .2108173  -.7259973  -.0044607
          m3 |        525   -.4815773    .2715142  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Specif
> ied Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) All Parent Indicators & Keyschool & Specified higher education, Sec Voc + inrange(birth
> year, 1971, 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secg
> en_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlog
> it gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(27, 497)      =      3.76
       Model |  36.2127469        27  1.34121285   Prob > F        =    0.0000
    Residual |  177.248316       497  .356636451   R-squared       =    0.1696
-------------+----------------------------------   Adj R-squared   =    0.1245
       Total |  213.461063       524  .407368441   Root MSE        =    .59719

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3737233   .0617712     6.05   0.000     .2523583    .4950883
               exp |   .0769141   .0447646     1.72   0.086     -.011037    .1648652
            expsqr |  -.0017219   .0011944    -1.44   0.150    -.0040687    .0006248
        highvocedu |   .0215181   .1006255     0.21   0.831    -.1761857    .2192219
        highgenedu |   .2091266   .2542915     0.82   0.411    -.2904922    .7087455
          adultedu |   .1962513   .1529832     1.28   0.200    -.1043223    .4968249
     parent_secedu |  -.0159891   .0704674    -0.23   0.821    -.1544398    .1224616
    parent_highedu |  -.0127848   .2651685    -0.05   0.962    -.5337743    .5082047
parent_partymember |   .0588006   .0756157     0.78   0.437    -.0897652    .2073664
         Keyschool |   .2995778   .1517349     1.97   0.049     .0014569    .5976986
      provincedum2 |  -.1570484   .2641469    -0.59   0.552    -.6760306    .3619338
      provincedum3 |   .0887937   .2949007     0.30   0.763     -.490612    .6681994
      provincedum4 |   .2189343   .3019553     0.73   0.469     -.374332    .8122006
      provincedum5 |   .3661671   .2042669     1.79   0.074    -.0351661    .7675002
      provincedum6 |   .2654348   .2342257     1.13   0.258    -.1947599    .7256296
      provincedum7 |   .1805226   .2408975     0.75   0.454    -.2927804    .6538256
      provincedum8 |   -.001325   .2461838    -0.01   0.996    -.4850142    .4823642
      provincedum9 |   .3326127   .2170611     1.53   0.126    -.0938577    .7590832
     provincedum10 |   .0828205   .2256576     0.37   0.714    -.3605399    .5261809
     provincedum11 |     .19509   .2302449     0.85   0.397    -.2572833    .6474633
     provincedum12 |  -.0797731   .2267184    -0.35   0.725    -.5252178    .3656716
     provincedum13 |  -.1354646   .2248043    -0.60   0.547    -.5771486    .3062193
     provincedum14 |  -.0204878   .2563143    -0.08   0.936     -.524081    .4831055
     provincedum15 |  -.0885578   .2574371    -0.34   0.731     -.594357    .4172413
               _m1 |  -.2953922   .2366722    -1.25   0.213    -.7603936    .1696091
               _m2 |   .1561493    .523809     0.30   0.766    -.8730037    1.185302
               _m3 |   .1258553   .1527004     0.82   0.410    -.1741626    .4258733
             _cons |   7.594537   .6074762    12.50   0.000     6.400998    8.788075
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .396461          .        .       .            .           .
        rho1 |  -.4691361          .        .       .            .           .
        rho2 |   .2479932          .        .       .            .           .
        rho3 |   .1998809          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if in
> range(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
  highvocedu |        525    .0857143    .2802087          0          1
-------------+---------------------------------------------------------
  highgenedu |        525    .0114286    .1063932          0          1
    adultedu |        525     .032381    .1771785          0          1
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
-------------+---------------------------------------------------------
   Keyschool |        525    .0342857    .1821356          0          1
provincedum2 |        525    .0266667    .1612609          0          1
provincedum3 |        525    .0171429    .1299274          0          1
provincedum4 |        525    .0114286    .1063932          0          1
provincedum5 |        525    .0704762    .2561919          0          1
-------------+---------------------------------------------------------
provincedum6 |        525    .0628571    .2429373          0          1
provincedum7 |        525     .072381    .2593648          0          1
provincedum8 |        525    .0971429    .2964346          0          1
provincedum9 |        525    .0780952    .2685773          0          1
provinced~10 |        525    .1161905    .3207588          0          1
-------------+---------------------------------------------------------
provinced~11 |        525    .1257143    .3318433          0          1
provinced~12 |        525         .04    .1961461          0          1
provinced~13 |        525    .0761905    .2655557          0          1
provinced~14 |        525     .047619     .213162          0          1
provinced~15 |        525    .0628571    .2429373          0          1
-------------+---------------------------------------------------------
          m1 |        525    1.333378     .410071   .4635267   3.007092
          m2 |        525   -.3666274    .2108173  -.7259973  -.0044607
          m3 |        525   -.4815773    .2715142  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Specif
> ied Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) All Parent Indicators & Keyschool & Combined higher education, Sec Voc + inrange(birthy
> ear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 1
> 6667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relativ
> e ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(11, 513)      =      5.80
       Model |  23.6010972        11  2.14555429   Prob > F        =    0.0000
    Residual |  189.859966       513  .370097399   R-squared       =    0.1106
-------------+----------------------------------   Adj R-squared   =    0.0915
       Total |  213.461063       524  .407368441   Root MSE        =    .60836

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3626638   .0612302     5.92   0.000     .2423709    .4829567
               exp |   .0648222   .0330622     1.96   0.050    -.0001317    .1297761
            expsqr |  -.0014465   .0008715    -1.66   0.098    -.0031588    .0002657
         higheredu |   .1133924   .0820773     1.38   0.168    -.0478567    .2746414
     parent_secedu |  -.0086542   .0696354    -0.12   0.901    -.1454598    .1281514
    parent_highedu |   .0383813   .2613036     0.15   0.883    -.4749755    .5517382
parent_partymember |   .0315117   .0750739     0.42   0.675    -.1159784    .1790018
         Keyschool |   .4030604   .1490074     2.70   0.007     .1103207    .6958002
               _m1 |  -.2772023   .1145793    -2.42   0.016    -.5023047   -.0520999
               _m2 |   .1108691   .2922806     0.38   0.705     -.463345    .6850832
               _m3 |   .0375841   .1428014     0.26   0.793    -.2429635    .3181316
             _cons |   7.717594   .3862153    19.98   0.000     6.958836    8.476352
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4124802          .        .       .            .           .
        rho1 |  -.4316137          .        .       .            .           .
        rho2 |   .1726271          .        .       .            .           .
        rho3 |   .0585197          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
   higheredu |        525    .1295238     .336099          0          1
-------------+---------------------------------------------------------
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
   Keyschool |        525    .0342857    .1821356          0          1
          m1 |        525    1.333378     .410071   .4635267   3.007092
-------------+---------------------------------------------------------
          m2 |        525   -.3666274    .2108173  -.7259973  -.0044607
          m3 |        525   -.4815773    .2715142  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Non-sp
> ecified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) All Parent Indicators & Keyschool & Combined higher education, Sec Voc + inrange(birthy
> ear, 1971, 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inr
> ange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative i
> ns2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(25, 499)      =      4.02
       Model |  35.7662513        25  1.43065005   Prob > F        =    0.0000
    Residual |  177.694812       499  .356101827   R-squared       =    0.1676
-------------+----------------------------------   Adj R-squared   =    0.1258
       Total |  213.461063       524  .407368441   Root MSE        =    .59674

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3705981   .0615669     6.02   0.000     .2496358    .4915605
               exp |   .0736241   .0445941     1.65   0.099    -.0139913    .1612395
            expsqr |  -.0016181   .0011891    -1.36   0.174    -.0039543     .000718
         higheredu |   .0846291   .0832393     1.02   0.310    -.0789136    .2481717
     parent_secedu |  -.0170837   .0703899    -0.24   0.808    -.1553809    .1212135
    parent_highedu |  -.0213962   .2648315    -0.08   0.936    -.5417185    .4989262
parent_partymember |   .0504147   .0751791     0.67   0.503    -.0972919    .1981213
         Keyschool |   .3029883   .1515883     2.00   0.046     .0051583    .6008183
      provincedum2 |  -.1469783   .2637936    -0.56   0.578    -.6652613    .3713046
      provincedum3 |   .0995828   .2933308     0.34   0.734    -.4767329    .6758986
      provincedum4 |   .2393036   .3011011     0.79   0.427    -.3522786    .8308857
      provincedum5 |   .3551774   .2038541     1.74   0.082    -.0453408    .7556955
      provincedum6 |   .2621009   .2339127     1.12   0.263    -.1974742     .721676
      provincedum7 |   .1793372   .2406842     0.75   0.457    -.2935421    .6522165
      provincedum8 |   .0085846    .245096     0.04   0.972    -.4729627    .4901318
      provincedum9 |   .3399336   .2166216     1.57   0.117    -.0856692    .7655364
     provincedum10 |   .0857657   .2254367     0.38   0.704    -.3571565    .5286879
     provincedum11 |   .2004708   .2300103     0.87   0.384    -.2514372    .6523787
     provincedum12 |  -.0817384   .2264636    -0.36   0.718     -.526678    .3632012
     provincedum13 |  -.1327409   .2245986    -0.59   0.555    -.5740164    .3085346
     provincedum14 |  -.0078461   .2555456    -0.03   0.976    -.5099241    .4942319
     provincedum15 |  -.0874914    .257222    -0.34   0.734    -.5928631    .4178803
               _m1 |   -.314446   .2357709    -1.33   0.183     -.777672    .1487801
               _m2 |    .196589   .5221615     0.38   0.707    -.8293171    1.222495
               _m3 |   .1300315   .1525289     0.85   0.394    -.1696465    .4297095
             _cons |   7.659242   .6042613    12.68   0.000     6.472032    8.846452
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .407234          .        .       .            .           .
        rho1 |   -.492747          .        .       .            .           .
        rho2 |   .3080614          .        .       .            .           .
        rho3 |   .2037635          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971
> , 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
   higheredu |        525    .1295238     .336099          0          1
-------------+---------------------------------------------------------
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
   Keyschool |        525    .0342857    .1821356          0          1
provincedum2 |        525    .0266667    .1612609          0          1
-------------+---------------------------------------------------------
provincedum3 |        525    .0171429    .1299274          0          1
provincedum4 |        525    .0114286    .1063932          0          1
provincedum5 |        525    .0704762    .2561919          0          1
provincedum6 |        525    .0628571    .2429373          0          1
provincedum7 |        525     .072381    .2593648          0          1
-------------+---------------------------------------------------------
provincedum8 |        525    .0971429    .2964346          0          1
provincedum9 |        525    .0780952    .2685773          0          1
provinced~10 |        525    .1161905    .3207588          0          1
provinced~11 |        525    .1257143    .3318433          0          1
provinced~12 |        525         .04    .1961461          0          1
-------------+---------------------------------------------------------
provinced~13 |        525    .0761905    .2655557          0          1
provinced~14 |        525     .047619     .213162          0          1
provinced~15 |        525    .0628571    .2429373          0          1
          m1 |        525    1.333378     .410071   .4635267   3.007092
          m2 |        525   -.3666274    .2108173  -.7259973  -.0044607
-------------+---------------------------------------------------------
          m3 |        525   -.4815773    .2715142  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Non-sp
> ecified Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) All Parent Indicators & Keyschool & Specified higher education, Sec Gen + inrange(birth
> year, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(m
> onthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_hi
> ghedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(13, 961)      =      5.40
       Model |  26.2042668        13  2.01571283   Prob > F        =    0.0000
    Residual |  358.534741       961  .373085059   R-squared       =    0.0681
-------------+----------------------------------   Adj R-squared   =    0.0555
       Total |  384.739008       974  .395009249   Root MSE        =    .61081

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |    .261873    .044683     5.86   0.000     .1741855    .3495605
               exp |  -.0162965   .0246183    -0.66   0.508    -.0646083    .0320152
            expsqr |   .0002023   .0006886     0.29   0.769     -.001149    .0015537
        highvocedu |   .1835773   .0554657     3.31   0.001     .0747296    .2924251
        highgenedu |   .2296451   .0645901     3.56   0.000     .1028912     .356399
          adultedu |   .0049653   .0894526     0.06   0.956    -.1705796    .1805103
     parent_secedu |   .0315612   .0479444     0.66   0.511    -.0625267     .125649
    parent_highedu |   .0334701   .1514223     0.22   0.825    -.2636863    .3306265
parent_partymember |  -.0235988   .0526619    -0.45   0.654    -.1269445    .0797469
         Keyschool |   .0592218    .042851     1.38   0.167    -.0248706    .1433141
               _m1 |   -.421467   .3025488    -1.39   0.164      -1.0152    .1722656
               _m2 |   .0748362   .1013773     0.74   0.461    -.1241102    .2737825
               _m3 |  -.2306304   .2178629    -1.06   0.290    -.6581723    .1969115
             _cons |   7.832594   .1344029    58.28   0.000     7.568837    8.096351
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4088399          .        .       .            .           .
        rho1 |  -.6591541          .        .       .            .           .
        rho2 |   .1170402          .        .       .            .           .
        rho3 |  -.3606948          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
  highvocedu |        975    .2615385    .4396981          0          1
-------------+---------------------------------------------------------
  highgenedu |        975    .2523077    .4345598          0          1
    adultedu |        975    .0553846    .2288468          0          1
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
-------------+---------------------------------------------------------
   Keyschool |        975    .4153846    .4930411          0          1
          m1 |        975   -.2348152    .1030695  -.6403428  -.0164993
          m2 |        975    .8022729    .6214218   .0167035   2.932487
          m3 |        975   -.3778199    .2581209  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Specif
> ied Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) All Parent Indicators & Keyschool & Specified higher education, Sec Gen + inrange(birth
> year, 1971, 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secg
> en_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlog
> it gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(27, 947)      =      4.49
       Model |  43.6550906        27  1.61685521   Prob > F        =    0.0000
    Residual |  341.083918       947  .360173092   R-squared       =    0.1135
-------------+----------------------------------   Adj R-squared   =    0.0882
       Total |  384.739008       974  .395009249   Root MSE        =    .60014

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2613754   .0442322     5.91   0.000     .1745711    .3481798
               exp |   .0121043   .0290929     0.42   0.677    -.0449897    .0691983
            expsqr |  -.0004991   .0007709    -0.65   0.517     -.002012    .0010137
        highvocedu |   .1854095   .0566076     3.28   0.001     .0743186    .2965004
        highgenedu |   .2044213   .0666064     3.07   0.002      .073708    .3351345
          adultedu |   .0180209   .0896555     0.20   0.841    -.1579255    .1939673
     parent_secedu |   .0255718   .0479573     0.53   0.594    -.0685431    .1196866
    parent_highedu |   .0750133   .1515156     0.50   0.621    -.2223318    .3723584
parent_partymember |  -.0449225   .0521566    -0.86   0.389    -.1472785    .0574334
         Keyschool |   .0670322   .0430955     1.56   0.120    -.0175415    .1516059
      provincedum2 |  -.3206421   .1730452    -1.85   0.064    -.6602384    .0189543
      provincedum3 |  -.5006122   .1832506    -2.73   0.006    -.8602365   -.1409879
      provincedum4 |  -.4554011   .2216905    -2.05   0.040    -.8904626   -.0203395
      provincedum5 |  -.1051519   .1434004    -0.73   0.464    -.3865711    .1762674
      provincedum6 |  -.1807287   .1594686    -1.13   0.257    -.4936814     .132224
      provincedum7 |  -.2433046   .1651968    -1.47   0.141    -.5674988    .0808895
      provincedum8 |  -.4478004   .1626713    -2.75   0.006    -.7670383   -.1285624
      provincedum9 |  -.0192871   .1471106    -0.13   0.896    -.3079876    .2694134
     provincedum10 |  -.1414591   .1500309    -0.94   0.346    -.4358905    .1529723
     provincedum11 |  -.2267823   .1599642    -1.42   0.157    -.5407077    .0871431
     provincedum12 |  -.3415884   .1797668    -1.90   0.058    -.6943758     .011199
     provincedum13 |   -.301209   .1612752    -1.87   0.062    -.6177071    .0152891
     provincedum14 |  -.2408301   .1751043    -1.38   0.169    -.5844674    .1028073
     provincedum15 |  -.4243633   .1602297    -2.65   0.008    -.7388096    -.109917
               _m1 |   .3046262   .4297706     0.71   0.479    -.5387867    1.148039
               _m2 |  -.0920839   .1303946    -0.71   0.480    -.3479796    .1638118
               _m3 |  -.1892384   .2299656    -0.82   0.411    -.6405395    .2620626
             _cons |    8.18169   .2295905    35.64   0.000     7.731125    8.632255
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3734817          .        .       .            .           .
        rho1 |   .4984626          .        .       .            .           .
        rho2 |  -.1506777          .        .       .            .           .
        rho3 |  -.3096526          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if in
> range(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
  highvocedu |        975    .2615385    .4396981          0          1
-------------+---------------------------------------------------------
  highgenedu |        975    .2523077    .4345598          0          1
    adultedu |        975    .0553846    .2288468          0          1
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
-------------+---------------------------------------------------------
   Keyschool |        975    .4153846    .4930411          0          1
provincedum2 |        975         .04    .1960597          0          1
provincedum3 |        975    .0246154    .1550294          0          1
provincedum4 |        975    .0112821    .1056703          0          1
provincedum5 |        975    .0861538    .2807351          0          1
-------------+---------------------------------------------------------
provincedum6 |        975    .0717949    .2582804          0          1
provincedum7 |        975    .0728205     .259975          0          1
provincedum8 |        975    .1251282     .331034          0          1
provincedum9 |        975    .1076923    .3101505          0          1
provinced~10 |        975    .1035897     .304884          0          1
-------------+---------------------------------------------------------
provinced~11 |        975    .1076923    .3101505          0          1
provinced~12 |        975    .0225641    .1485854          0          1
provinced~13 |        975    .0492308    .2164605          0          1
provinced~14 |        975    .0482051    .2143094          0          1
provinced~15 |        975    .0810256    .2730145          0          1
-------------+---------------------------------------------------------
          m1 |        975   -.2348152    .1030695  -.6403428  -.0164993
          m2 |        975    .8022729    .6214218   .0167035   2.932487
          m3 |        975   -.3778199    .2581209  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Specif
> ied Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) All Parent Indicators & Keyschool & Combined higher education, Sec Gen + inrange(birthy
> ear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 1
> 6667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relativ
> e ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(11, 963)      =      5.90
       Model |   24.281131        11  2.20737555   Prob > F        =    0.0000
    Residual |  360.457877       963  .374307245   R-squared       =    0.0631
-------------+----------------------------------   Adj R-squared   =    0.0524
       Total |  384.739008       974  .395009249   Root MSE        =    .61181

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2673293   .0446553     5.99   0.000     .1796964    .3549622
               exp |  -.0229162   .0244274    -0.94   0.348    -.0708533    .0250209
            expsqr |   .0003325   .0006861     0.48   0.628     -.001014    .0016789
         higheredu |   .1638976   .0490914     3.34   0.001     .0675593     .260236
     parent_secedu |   .0361589   .0478428     0.76   0.450    -.0577293    .1300471
    parent_highedu |   .0418172   .1514268     0.28   0.782    -.2553473    .3389816
parent_partymember |  -.0207492   .0527311    -0.39   0.694    -.1242303    .0827318
         Keyschool |   .0718808   .0420484     1.71   0.088    -.0106363     .154398
               _m1 |  -.3830274   .3015151    -1.27   0.204    -.9747299     .208675
               _m2 |   .0780889   .1015152     0.77   0.442    -.1211276    .2773055
               _m3 |  -.2215121   .2181792    -1.02   0.310    -.6496735    .2066493
             _cons |   7.901349   .1295594    60.99   0.000     7.647098      8.1556
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4041432          .        .       .            .           .
        rho1 |  -.6025072          .        .       .            .           .
        rho2 |   .1228349          .        .       .            .           .
        rho3 |  -.3484414          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
   higheredu |        975    .5692308     .495438          0          1
-------------+---------------------------------------------------------
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
   Keyschool |        975    .4153846    .4930411          0          1
          m1 |        975   -.2348152    .1030695  -.6403428  -.0164993
-------------+---------------------------------------------------------
          m2 |        975    .8022729    .6214218   .0167035   2.932487
          m3 |        975   -.3778199    .2581209  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Non-sp
> ecified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) All Parent Indicators & Keyschool & Combined higher education, Sec Gen + inrange(birthy
> ear, 1971, 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inr
> ange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative i
> ns2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(25, 949)      =      4.69
       Model |  42.3222073        25  1.69288829   Prob > F        =    0.0000
    Residual |  342.416801       949  .360818547   R-squared       =    0.1100
-------------+----------------------------------   Adj R-squared   =    0.0866
       Total |  384.739008       974  .395009249   Root MSE        =    .60068

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2662503   .0441859     6.03   0.000     .1795368    .3529637
               exp |   .0088798   .0290521     0.31   0.760     -.048134    .0658935
            expsqr |  -.0004412   .0007708    -0.57   0.567    -.0019539    .0010714
         higheredu |   .1580842    .050514     3.13   0.002     .0589521    .2572164
     parent_secedu |   .0275509   .0478184     0.58   0.565    -.0662912     .121393
    parent_highedu |   .0883718   .1512995     0.58   0.559    -.2085484    .3852921
parent_partymember |  -.0421426   .0521825    -0.81   0.420    -.1445491    .0602639
         Keyschool |    .077264     .04217     1.83   0.067    -.0054932    .1600212
      provincedum2 |  -.3446177   .1721188    -2.00   0.046    -.6823951   -.0068403
      provincedum3 |  -.5039663   .1829992    -2.75   0.006     -.863096   -.1448365
      provincedum4 |  -.4623951   .2216022    -2.09   0.037    -.8972821   -.0275082
      provincedum5 |  -.1154738   .1432792    -0.81   0.420    -.3966546    .1657069
      provincedum6 |  -.1919274   .1591134    -1.21   0.228    -.5041821    .1203273
      provincedum7 |  -.2602231   .1643909    -1.58   0.114    -.5828347    .0623886
      provincedum8 |  -.4641581   .1619719    -2.87   0.004    -.7820225   -.1462936
      provincedum9 |  -.0316843   .1466483    -0.22   0.829    -.3194767    .2561082
     provincedum10 |  -.1586066   .1490978    -1.06   0.288    -.4512061    .1339929
     provincedum11 |  -.2467224    .159453    -1.55   0.122    -.5596436    .0661988
     provincedum12 |  -.3919726   .1778715    -2.20   0.028    -.7410396   -.0429057
     provincedum13 |  -.3315256   .1602954    -2.07   0.039       -.6461   -.0169511
     provincedum14 |     -.2677   .1741643    -1.54   0.125    -.6094916    .0740917
     provincedum15 |  -.4402415   .1592455    -2.76   0.006    -.7527555   -.1277275
               _m1 |   .3546942   .4249008     0.83   0.404    -.4791595    1.188548
               _m2 |  -.0991611   .1302849    -0.76   0.447    -.3548408    .1565186
               _m3 |   -.180112   .2301181    -0.78   0.434    -.6317111    .2714872
             _cons |   8.250124   .2228926    37.01   0.000     7.812705    8.687544
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3830148          .        .       .            .           .
        rho1 |   .5731209          .        .       .            .           .
        rho2 |  -.1602262          .        .       .            .           .
        rho3 |   -.291028          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971
> , 1992) & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
   higheredu |        975    .5692308     .495438          0          1
-------------+---------------------------------------------------------
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
   Keyschool |        975    .4153846    .4930411          0          1
provincedum2 |        975         .04    .1960597          0          1
-------------+---------------------------------------------------------
provincedum3 |        975    .0246154    .1550294          0          1
provincedum4 |        975    .0112821    .1056703          0          1
provincedum5 |        975    .0861538    .2807351          0          1
provincedum6 |        975    .0717949    .2582804          0          1
provincedum7 |        975    .0728205     .259975          0          1
-------------+---------------------------------------------------------
provincedum8 |        975    .1251282     .331034          0          1
provincedum9 |        975    .1076923    .3101505          0          1
provinced~10 |        975    .1035897     .304884          0          1
provinced~11 |        975    .1076923    .3101505          0          1
provinced~12 |        975    .0225641    .1485854          0          1
-------------+---------------------------------------------------------
provinced~13 |        975    .0492308    .2164605          0          1
provinced~14 |        975    .0482051    .2143094          0          1
provinced~15 |        975    .0810256    .2730145          0          1
          m1 |        975   -.2348152    .1030695  -.6403428  -.0164993
          m2 |        975    .8022729    .6214218   .0167035   2.932487
-------------+---------------------------------------------------------
          m3 |        975   -.3778199    .2581209  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Non-sp
> ecified Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rur
> al/Selmlog Rural Parent NoFirstStage.log
  log type:  text
 closed on:   8 Aug 2024, 12:32:27
---------------------------------------------------------------------------------------------
