---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rur
> al/Selmlog Rural Parent BothStages.log
  log type:  text
 opened on:   8 Aug 2024, 12:29:29

. use "`datapath'", clear

. 
. *Step Zero: A New Dataset for Merging
. 
. gen headsecedu = .
(35,007 missing values generated)

. gen headhighedu = .
(35,007 missing values generated)

. gen spousesecedu = .
(35,007 missing values generated)

. gen spousehighedu = .
(35,007 missing values generated)

. gen headparty = .
(35,007 missing values generated)

. gen spouseparty = .
(35,007 missing values generated)

. gen spouseparentsecedu = .
(35,007 missing values generated)

. gen spouseparenthighedu = .
(35,007 missing values generated)

. gen spouseparentparty = .
(35,007 missing values generated)

. gen headparentsecedu = .
(35,007 missing values generated)

. gen headparenthighedu = .
(35,007 missing values generated)

. gen headparentparty = .
(35,007 missing values generated)

. replace headsecedu = 1 if A02 == 1 & inrange(A13_1, 4, 9)
(1,332 real changes made)

. replace headsecedu = 0 if A02 == 1 & inrange(A13_1, 1, 3)
(7,897 real changes made)

. replace headhighedu = 1 if A02 == 1 & inrange(A13_1, 7, 9)
(180 real changes made)

. replace headhighedu = 0 if A02 == 1 & inrange(A13_1, 1, 6)
(9,049 real changes made)

. replace spousesecedu = 1 if A02 == 2 & inrange(A13_1, 4, 9)
(686 real changes made)

. replace spousesecedu = 0 if A02 == 2 & inrange(A13_1, 1, 3)
(7,673 real changes made)

. replace spousehighedu = 1 if A02 == 2 & inrange(A13_1, 7, 9)
(110 real changes made)

. replace spousehighedu = 0 if A02 == 2 & inrange(A13_1, 1, 6)
(8,249 real changes made)

. replace headparty = 1 if A02 == 1 & A07_1 == 1
(1,198 real changes made)

. replace headparty = 0 if A02 == 1 & inrange(A07_1, 2, 4)
(8,040 real changes made)

. replace spouseparty = 1 if A02 == 2 & A07_1 == 1
(267 real changes made)

. replace spouseparty = 0 if A02 == 2 & inrange(A07_1, 2, 4)
(8,101 real changes made)

. replace spouseparentsecedu = 0 if A02 == 5 & inrange(A13_1, 1, 3)
(68 real changes made)

. replace spouseparentsecedu = 1 if A02 == 5 & inrange(A13_1, 4, 9)
(2 real changes made)

. replace spouseparenthighedu = 0 if A02 == 5 & inrange(A13_1, 1, 6)
(70 real changes made)

. replace spouseparenthighedu = 1 if A02 == 5 & inrange(A13_1, 7, 9)
(0 real changes made)

. replace spouseparentparty = 0 if A02 == 5 & inrange(A07_1, 2, 4)
(66 real changes made)

. replace spouseparentparty = 1 if A02 == 5 & A07_1 == 1
(5 real changes made)

. replace headparentsecedu = 0 if A02 == 4 & inrange(A13_1, 1, 3)
(1,573 real changes made)

. replace headparentsecedu = 1 if A02 == 4 & inrange(A13_1, 4, 9)
(64 real changes made)

. replace headparenthighedu = 0 if A02 == 4 & inrange(A13_1, 1, 6)
(1,632 real changes made)

. replace headparenthighedu = 1 if A02 == 4 & inrange(A13_1, 7, 9)
(5 real changes made)

. replace headparentparty = 0 if A02 == 4 & inrange(A07_1, 2, 4)
(1,544 real changes made)

. replace headparentparty = 1 if A02 == 4 & A07_1 == 1
(97 real changes made)

. collapse (max) headsecedu headhighedu spousesecedu spousehighedu headparty spouseparty spou
> separentsecedu spouseparenthighedu spouseparentparty headparentsecedu headparenthighedu hea
> dparentparty, by(hhcode)

. 
. save "`folderpath'/`logname'.dta", replace
(file /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent
    Indicator/Rural/Selmlog Rural Parent BothStages.dta not found)
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent
    Indicator/Rural/Selmlog Rural Parent BothStages.dta saved

. 
. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. 
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for secjun
. gen jun_log_monthlyearning = log_monthlyearning if secjun == 1
(27,895 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *6) Instrument
. 
. gen yearat15 = birthyear+15
(7 missing values generated)

. local obsnum = _N

. 
. forval i =  1/`obsnum' {
  2.         
.         *extract the observation's year at age 15
.         qui sum yearat15  in `i'
  3.         local yearvalue = round(mod(r(mean),100))
  4.         
.         *get the variables' names for this observation
.         *graduates of mid and sec schools
.         if inrange(`yearvalue', 0, 9) {
  5.                 local czgrad_year = "czgrad0`yearvalue'"
  6.                 local gzgrad_year = "gzgrad0`yearvalue'"
  7.         }
  8.         else {
  9.                 local czgrad_year = "czgrad`yearvalue'"
 10.                 local gzgrad_year = "gzgrad`yearvalue'"
 11.         }
 12.         *entrants of sec and universities
.         if inrange(`yearvalue'+1, 0, 9) {
 13.                 local gzentrant_year = "gzentrant0`=`yearvalue'+1'"
 14.                 local gxentrant_year = "gxentrant0`=`yearvalue'+1'"
 15.                 local vsentrant_year = "vsentrant0`=`yearvalue'+1'"
 16.                 local tsentrant_year = "tsentrant0`=`yearvalue'+1'"
 17.         }
 18.         else{
 19.                 if `yearvalue' == 99 {
 20.                 local gzentrant_year = "gzentrant00"
 21.                 local gxentrant_year = "gxentrant00"
 22.                 local vsentrant_year = "vsentrant00"
 23.                 local tsentrant_year = "tsentrant00"
 24.                 }
 25.         else {
 26.                 local gzentrant_year = "gzentrant`=`yearvalue'+1'"
 27.                 local gxentrant_year = "gxentrant`=`yearvalue'+1'"
 28.                 local vsentrant_year = "vsentrant`=`yearvalue'+1'"
 29.                 local tsentrant_year = "tsentrant`=`yearvalue'+1'"
 30.         }
 31.         }
 32.         
.         
.         *For Ins 1 & 2: check whether the variable names exist (whether we have those years
> ' or not)
.         capture ds `czgrad_year' `gzgrad_year' `gzentrant_year' `gxentrant_year'
 33.         if _rc == 0 {
 34.                 *generate/replace the instrument
.                 capture ds ins1_secgen_entrant_relative ins2_highedu_entrant_relative
 35.                 if _rc!=0 {
 36.                         qui gen ins1_secgen_entrant_relative = `gzentrant_year'/`czgrad_
> year' if _n == `i'
 37.                         qui gen ins2_highedu_entrant_relative = `gxentrant_year'/`gzgrad
> _year' if _n == `i'
 38.                 
.                 }
 39.                 else {
 40.                         qui replace ins1_secgen_entrant_relative = `gzentrant_year'/`czg
> rad_year' if _n == `i'
 41.                         qui replace ins2_highedu_entrant_relative = `gxentrant_year'/`gz
> grad_year' if _n == `i'
 42.                 }
 43.         }
 44.         
.         *For Ins 3
.         capture ds `czgrad_year' `vsentrant_year'
 45.         if _rc == 0 {
 46.                 *generate/replace the instrument
.                 capture ds ins3_vs_entrant_relative
 47.                 if _rc!=0 {
 48.                         qui gen ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_year
> ' if _n == `i'
 49.                 }
 50.                 else {
 51.                         qui replace ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_
> year' if _n == `i'
 52.                 }
 53.         }
 54. }

. 
. 
. sum ins1_secgen_entrant_relative, d

                ins1_secgen_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%       .15625       .0699308
 5%     .1682079       .0699308
10%     .1885442       .0699308       Obs              12,056
25%     .2211083       .0699308       Sum of wgt.      12,056

50%     .3033619                      Mean           .3236294
                        Largest       Std. dev.      .1151896
75%     .4300829       .6448125
90%     .4801857       .6448125       Variance       .0132686
95%     .5088161       .6448125       Skewness       .3696383
99%     .5762522       .6448125       Kurtosis       1.967837

. sum ins2_highedu_entrant_relative, d

                ins2_highedu_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1447144       .1281053
 5%     .1651736       .1380375
10%        .2112       .1380375       Obs              12,056
25%     .2949015       .1380375       Sum of wgt.      12,056

50%     .5866208                      Mean           .5873466
                        Largest       Std. dev.      .3496799
75%     .8063707       2.985416
90%       .96183       2.985416       Variance        .122276
95%     1.052114       2.985416       Skewness       1.750181
99%     2.036869       2.985416       Kurtosis       10.40442

. sum ins3_vs_entrant_relative, d

                  ins3_vs_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1185751       .0852398
 5%     .1373378       .0852398
10%     .1486554       .0852398       Obs              12,419
25%      .184019       .0852398       Sum of wgt.      12,419

50%      .234389                      Mean           .2488276
                        Largest       Std. dev.      .0852013
75%     .3009205       .6566039
90%     .3645212       .6566039       Variance       .0072593
95%     .4095488       .6566039       Skewness       .8011841
99%     .4754733       .6566039       Kurtosis         3.4377

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Parent Indicators
. merge m:1 hhcode using "`folderpath'/`logname'.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            35,007  (_merge==3)
    -----------------------------------------

. *parent_secedu
. gen parent_secedu = 0 if (A02==1 & (inrange(H03_R1, 1, 3) | inrange(H03_R2, 1, 3))) | (A02=
> =2 & (inrange(H03_R3, 1, 3) | inrange(H03_R4, 1, 3)))
(28,206 missing values generated)

. replace parent_secedu = 0 if A02 ==3 & (headsecedu == 0 | spousesecedu == 0)
(9,445 real changes made)

. replace parent_secedu = 0 if (A02 == 2 & spouseparentsecedu == 0) | (A02 == 1 & headparents
> ecedu == 0)
(354 real changes made)

. replace parent_secedu=1 if (A02==1 & (inrange(H03_R1, 4, 9) | inrange(H03_R2, 4, 9)))|(A02=
> =2 & (inrange(H03_R3, 4, 9) | inrange(H03_R4, 4, 9)))
(441 real changes made)

. replace parent_secedu = 1 if A02 ==3 & (headsecedu == 1 | spousesecedu == 1)
(1,775 real changes made)

. replace parent_secedu = 1 if (A02 == 2 & spouseparentsecedu == 1) | (A02 == 1 & headparents
> ecedu == 1)
(15 real changes made)

. tab parent_secedu

parent_sece |
         du |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,834       86.93       86.93
          1 |      2,231       13.07      100.00
------------+-----------------------------------
      Total |     17,065      100.00

.  *parent_highedu
. gen parent_highedu = 0 if (A02==1 & (inrange(H03_R1, 1, 6) | inrange(H03_R2, 1, 6))) | (A02
> ==2 & (inrange(H03_R3, 1, 6) | inrange(H03_R4, 1, 6)))
(28,161 missing values generated)

. replace parent_highedu = 0 if A02 == 3 & (headhighedu == 0 | spousehighedu == 0)
(9,786 real changes made)

. replace parent_highedu = 0 if (A02 == 2 & spouseparenthighedu == 0) | (A02 == 1 & headparen
> thighedu == 0)
(358 real changes made)

. replace parent_highedu=1 if (A02==1 & (inrange(H03_R1, 7, 9) | inrange(H03_R2, 7, 9)))|(A02
> ==2 & (inrange(H03_R3, 7, 9) | inrange(H03_R4, 7, 9)))
(16 real changes made)

. replace parent_highedu = 1 if A02 == 3 & (headhighedu == 1 | spousehighedu == 1)
(269 real changes made)

. replace parent_highedu = 1 if (A02 == 2 & spouseparenthighedu == 1) | (A02 == 1 & headparen
> thighedu == 1)
(2 real changes made)

. tab parent_highedu

parent_high |
        edu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,778       98.32       98.32
          1 |        287        1.68      100.00
------------+-----------------------------------
      Total |     17,065      100.00

. *parent_partymember
. gen parent_partymember = 0 if ((A02==1 & (inrange(H07_R1, 2, 4) | inrange(H07_R2, 2, 4))) |
>  (A02==2 & (inrange(H07_R3, 2, 4) | inrange(H07_R4, 2, 4))))
(28,178 missing values generated)

. replace parent_partymember = 0 if A02 == 3 & (headparty == 0 | spouseparty == 0)
(9,759 real changes made)

. replace parent_partymember = 0 if (A02 == 2 & spouseparentparty == 0) | (A02 == 1 & headpar
> entparty == 0)
(339 real changes made)

. replace parent_partymember=1 if (A02==1 & (H07_R1 == 1 | H07_R2 == 1)) | (A02==2 & (H07_R3 
> == 1 | H07_R4 == 1))
(634 real changes made)

. replace parent_partymember = 1 if A02 == 3 & (headparty == 1 | spouseparty == 1)
(1,264 real changes made)

. replace parent_partymember = 1 if (A02 == 2 & spouseparentparty == 1) | (A02 == 1 & headpar
> entparty == 1)
(29 real changes made)

. tab parent_partymember

parent_part |
    ymember |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,165       88.73       88.73
          1 |      1,927       11.27      100.00
------------+-----------------------------------
      Total |     17,092      100.00

. 
. *9) Key School Indicator
. 
. gen Keyschool = 0 if A14 != .

. replace Keyschool = 1 if inrange(A14, 1, 3)
(2,217 real changes made)

. 
. *10) GaoKao Indicator
. gen TakeGaoKao = 1 if A15_1 == 1
(32,059 missing values generated)

. replace TakeGaoKao = 0 if A15_1 == 2
(26,078 real changes made)

. tab TakeGaoKao

 TakeGaoKao |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,078       89.84       89.84
          1 |      2,948       10.16      100.00
------------+-----------------------------------
      Total |     29,026      100.00

. tab TakeGaoKao educat

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |       998      1,350     10,086 |    12,434 
         1 |       320      2,508         87 |     2,915 
-----------+---------------------------------+----------
     Total |     1,318      3,858     10,173 |    15,349 

. tab TakeGaoKao educat if male==1

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |       607        867      5,808 |     7,282 
         1 |       174      1,410         43 |     1,627 
-----------+---------------------------------+----------
     Total |       781      2,277      5,851 |     8,909 

. tab TakeGaoKao educat if male==0

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |       391        483      4,278 |     5,152 
         1 |       146      1,098         44 |     1,288 
-----------+---------------------------------+----------
     Total |       537      1,581      4,322 |     6,440 

. 
. *Step Two: Regressions
. 
. *1) All parent indicators & Specified higher education, Sec Voc + inrange(birthyear, 1971, 
> 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entr
> ant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymember ) dm
> f(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -3012.9408
Iteration 2:  Log likelihood = -2931.9396
Iteration 3:  Log likelihood =  -2926.511
Iteration 4:  Log likelihood = -2926.4819
Iteration 5:  Log likelihood = -2926.4819

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(18)     =    2010.30
                                                  Prob > chi2     =     0.0000
Log likelihood = -2926.4819                       Pseudo R2       =     0.2557

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0182489    .117675    -0.16   0.877    -.2488876    .2123898
         exp |  -.6322691   .0488514   -12.94   0.000    -.7280161   -.5365221
      expsqr |   .0102906   .0011901     8.65   0.000      .007958    .0126231
ins1_secge~e |  -8.224317   .8513367    -9.66   0.000    -9.892906   -6.555727
ins2_highe~e |   .8564428   .1647772     5.20   0.000     .5334855      1.1794
ins3_vs_en~e |   1.222061   .7690421     1.59   0.112    -.2852341    2.729356
parent_sec~u |   .5482452   .1395442     3.93   0.000     .2747437    .8217467
parent_hig~u |   .8666035   .6419943     1.35   0.177    -.3916821    2.124889
parent_par~r |   .3953126   .1457868     2.71   0.007     .1095756    .6810495
       _cons |   7.487307    .660447    11.34   0.000     6.192854    8.781759
-------------+----------------------------------------------------------------
2            |
        male |     .05695   .1065566     0.53   0.593    -.1518971    .2657972
         exp |  -.9741691   .0451596   -21.57   0.000     -1.06268   -.8856579
      expsqr |   .0176122   .0010436    16.88   0.000     .0155667    .0196576
ins1_secge~e |  -10.39447   .8087177   -12.85   0.000    -11.97953   -8.809411
ins2_highe~e |   .1863432   .1906096     0.98   0.328    -.1872447    .5599311
ins3_vs_en~e |  -.9197171   .7452477    -1.23   0.217    -2.380376    .5409415
parent_sec~u |   .8372977   .1228636     6.81   0.000     .5964895    1.078106
parent_hig~u |   1.073405   .5790396     1.85   0.064    -.0614916    2.208302
parent_par~r |    .422284   .1309171     3.23   0.001     .1656911    .6788768
       _cons |   12.80232    .633269    20.22   0.000     11.56113     14.0435
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(12, 512)      =      4.74
       Model |   21.356549        12  1.77971242   Prob > F        =    0.0000
    Residual |  192.104514       512  .375204129   R-squared       =    0.1000
-------------+----------------------------------   Adj R-squared   =    0.0790
       Total |  213.461063       524  .407368441   Root MSE        =    .61254

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3842343   .0618132     6.22   0.000     .2627956     .505673
               exp |   .0591826   .0338815     1.75   0.081    -.0073812    .1257464
            expsqr |  -.0012736   .0008993    -1.42   0.157    -.0030402    .0004931
        highvocedu |   .0554721   .0989636     0.56   0.575    -.1389526    .2498967
        highgenedu |    .159075   .2557277     0.62   0.534    -.3433297    .6614797
          adultedu |   .1767107   .1549514     1.14   0.255     -.127708    .4811293
     parent_secedu |  -.0380004   .0757886    -0.50   0.616    -.1868952    .1108945
    parent_highedu |   .0325112    .264378     0.12   0.902    -.4868881    .5519105
parent_partymember |   .0132726   .0789252     0.17   0.867    -.1417844    .1683296
               _m1 |  -.2923875   .1264689    -2.31   0.021    -.5408494   -.0439256
               _m2 |    .066228   .3075609     0.22   0.830    -.5380088    .6704647
               _m3 |   .0465219   .2123393     0.22   0.827    -.3706416    .4636853
             _cons |   7.766965   .3828945    20.28   0.000     7.014727    8.519203
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4203153          .        .       .            .           .
        rho1 |  -.4509945          .        .       .            .           .
        rho2 |   .1021536          .        .       .            .           .
        rho3 |   .0717579          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrang
> e(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
  highvocedu |        525    .0857143    .2802087          0          1
-------------+---------------------------------------------------------
  highgenedu |        525    .0114286    .1063932          0          1
    adultedu |        525     .032381    .1771785          0          1
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
-------------+---------------------------------------------------------
          m1 |        525    1.309027    .3917447   .4113325   2.847123
          m2 |        525   -.3674441    .2107215  -.7259405  -.0069064
          m3 |        525   -.4818022    .2343294  -.7259948   1.682636

. outreg2 using "`xlspath'", replace ctitle(All Parent Indicators, Sec Voc, Specified Highere
> du,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) All parent indicators & Specified higher education, Sec Voc + inrange(birthyear, 1971, 
> 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_high
> edu parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -3012.9408
Iteration 2:  Log likelihood = -2931.9396
Iteration 3:  Log likelihood =  -2926.511
Iteration 4:  Log likelihood = -2926.4819
Iteration 5:  Log likelihood = -2926.4819

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(18)     =    2010.30
                                                  Prob > chi2     =     0.0000
Log likelihood = -2926.4819                       Pseudo R2       =     0.2557

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0182489    .117675    -0.16   0.877    -.2488876    .2123898
         exp |  -.6322691   .0488514   -12.94   0.000    -.7280161   -.5365221
      expsqr |   .0102906   .0011901     8.65   0.000      .007958    .0126231
ins1_secge~e |  -8.224317   .8513367    -9.66   0.000    -9.892906   -6.555727
ins2_highe~e |   .8564428   .1647772     5.20   0.000     .5334855      1.1794
ins3_vs_en~e |   1.222061   .7690421     1.59   0.112    -.2852341    2.729356
parent_sec~u |   .5482452   .1395442     3.93   0.000     .2747437    .8217467
parent_hig~u |   .8666035   .6419943     1.35   0.177    -.3916821    2.124889
parent_par~r |   .3953126   .1457868     2.71   0.007     .1095756    .6810495
       _cons |   7.487307    .660447    11.34   0.000     6.192854    8.781759
-------------+----------------------------------------------------------------
2            |
        male |     .05695   .1065566     0.53   0.593    -.1518971    .2657972
         exp |  -.9741691   .0451596   -21.57   0.000     -1.06268   -.8856579
      expsqr |   .0176122   .0010436    16.88   0.000     .0155667    .0196576
ins1_secge~e |  -10.39447   .8087177   -12.85   0.000    -11.97953   -8.809411
ins2_highe~e |   .1863432   .1906096     0.98   0.328    -.1872447    .5599311
ins3_vs_en~e |  -.9197171   .7452477    -1.23   0.217    -2.380376    .5409415
parent_sec~u |   .8372977   .1228636     6.81   0.000     .5964895    1.078106
parent_hig~u |   1.073405   .5790396     1.85   0.064    -.0614916    2.208302
parent_par~r |    .422284   .1309171     3.23   0.001     .1656911    .6788768
       _cons |   12.80232    .633269    20.22   0.000     11.56113     14.0435
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(26, 498)      =      3.74
       Model |    34.86786        26  1.34107154   Prob > F        =    0.0000
    Residual |  178.593203       498   .35862089   R-squared       =    0.1633
-------------+----------------------------------   Adj R-squared   =    0.1197
       Total |  213.461063       524  .407368441   Root MSE        =    .59885

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3892748   .0620555     6.27   0.000      .267352    .5111977
               exp |   .0819747   .0423383     1.94   0.053    -.0012091    .1651584
            expsqr |   -.001859   .0011264    -1.65   0.099     -.004072    .0003541
        highvocedu |   .0056265   .0998021     0.06   0.955    -.1904586    .2017115
        highgenedu |   .1896856   .2554002     0.74   0.458    -.3121092    .6914803
          adultedu |   .1699438   .1532861     1.11   0.268    -.1312234    .4711109
     parent_secedu |  -.0506984   .0776051    -0.65   0.514    -.2031722    .1017754
    parent_highedu |  -.0336226   .2685056    -0.13   0.900     -.561166    .4939207
parent_partymember |   .0341405   .0800116     0.43   0.670    -.1230613    .1913424
      provincedum2 |  -.2142248   .2477325    -0.86   0.388    -.7009545    .2725049
      provincedum3 |   .0616843   .2800354     0.22   0.826    -.4885123    .6118808
      provincedum4 |   .2296814   .2970927     0.77   0.440    -.3540281     .813391
      provincedum5 |   .3531309   .1957024     1.80   0.072    -.0313732     .737635
      provincedum6 |   .2099609   .2205786     0.95   0.342    -.2234186    .6433403
      provincedum7 |   .1381368   .2277736     0.61   0.544    -.3093788    .5856525
      provincedum8 |  -.0553115   .2301672    -0.24   0.810    -.5075301     .396907
      provincedum9 |   .2950358   .2028852     1.45   0.147    -.1035806    .6936522
     provincedum10 |   .0282575   .2072745     0.14   0.892    -.3789828    .4354979
     provincedum11 |   .1647736   .2124606     0.78   0.438     -.252656    .5822033
     provincedum12 |  -.1250361   .2167833    -0.58   0.564    -.5509587    .3008866
     provincedum13 |  -.1755969   .2110209    -0.83   0.406    -.5901979    .2390041
     provincedum14 |  -.0808112   .2397415    -0.34   0.736    -.5518406    .3902183
     provincedum15 |  -.1410134   .2397919    -0.59   0.557    -.6121418     .330115
               _m1 |  -.2686384   .2307969    -1.16   0.245    -.7220942    .1848173
               _m2 |   .1111463   .5247627     0.21   0.832    -.9198754    1.142168
               _m3 |   .2014071   .2352412     0.86   0.392    -.2607804    .6635947
             _cons |   7.584363   .5706697    13.29   0.000     6.463146     8.70558
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3858664          .        .       .            .           .
        rho1 |  -.4324637          .        .       .            .           .
        rho2 |   .1789273          .        .       .            .           .
        rho3 |   .3242324          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
  highvocedu |        525    .0857143    .2802087          0          1
-------------+---------------------------------------------------------
  highgenedu |        525    .0114286    .1063932          0          1
    adultedu |        525     .032381    .1771785          0          1
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
-------------+---------------------------------------------------------
provincedum2 |        525    .0266667    .1612609          0          1
provincedum3 |        525    .0171429    .1299274          0          1
provincedum4 |        525    .0114286    .1063932          0          1
provincedum5 |        525    .0704762    .2561919          0          1
provincedum6 |        525    .0628571    .2429373          0          1
-------------+---------------------------------------------------------
provincedum7 |        525     .072381    .2593648          0          1
provincedum8 |        525    .0971429    .2964346          0          1
provincedum9 |        525    .0780952    .2685773          0          1
provinced~10 |        525    .1161905    .3207588          0          1
provinced~11 |        525    .1257143    .3318433          0          1
-------------+---------------------------------------------------------
provinced~12 |        525         .04    .1961461          0          1
provinced~13 |        525    .0761905    .2655557          0          1
provinced~14 |        525     .047619     .213162          0          1
provinced~15 |        525    .0628571    .2429373          0          1
          m1 |        525    1.309027    .3917447   .4113325   2.847123
-------------+---------------------------------------------------------
          m2 |        525   -.3674441    .2107215  -.7259405  -.0069064
          m3 |        525   -.4818022    .2343294  -.7259948   1.682636

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Specified Highered
> u, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) All parent indicators & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1
> 992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel
> (educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_
> entrant_relative  parent_secedu parent_highedu parent_partymember ) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -3012.9408
Iteration 2:  Log likelihood = -2931.9396
Iteration 3:  Log likelihood =  -2926.511
Iteration 4:  Log likelihood = -2926.4819
Iteration 5:  Log likelihood = -2926.4819

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(18)     =    2010.30
                                                  Prob > chi2     =     0.0000
Log likelihood = -2926.4819                       Pseudo R2       =     0.2557

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0182489    .117675    -0.16   0.877    -.2488876    .2123898
         exp |  -.6322691   .0488514   -12.94   0.000    -.7280161   -.5365221
      expsqr |   .0102906   .0011901     8.65   0.000      .007958    .0126231
ins1_secge~e |  -8.224317   .8513367    -9.66   0.000    -9.892906   -6.555727
ins2_highe~e |   .8564428   .1647772     5.20   0.000     .5334855      1.1794
ins3_vs_en~e |   1.222061   .7690421     1.59   0.112    -.2852341    2.729356
parent_sec~u |   .5482452   .1395442     3.93   0.000     .2747437    .8217467
parent_hig~u |   .8666035   .6419943     1.35   0.177    -.3916821    2.124889
parent_par~r |   .3953126   .1457868     2.71   0.007     .1095756    .6810495
       _cons |   7.487307    .660447    11.34   0.000     6.192854    8.781759
-------------+----------------------------------------------------------------
2            |
        male |     .05695   .1065566     0.53   0.593    -.1518971    .2657972
         exp |  -.9741691   .0451596   -21.57   0.000     -1.06268   -.8856579
      expsqr |   .0176122   .0010436    16.88   0.000     .0155667    .0196576
ins1_secge~e |  -10.39447   .8087177   -12.85   0.000    -11.97953   -8.809411
ins2_highe~e |   .1863432   .1906096     0.98   0.328    -.1872447    .5599311
ins3_vs_en~e |  -.9197171   .7452477    -1.23   0.217    -2.380376    .5409415
parent_sec~u |   .8372977   .1228636     6.81   0.000     .5964895    1.078106
parent_hig~u |   1.073405   .5790396     1.85   0.064    -.0614916    2.208302
parent_par~r |    .422284   .1309171     3.23   0.001     .1656911    .6788768
       _cons |   12.80232    .633269    20.22   0.000     11.56113     14.0435
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(10, 514)      =      5.66
       Model |  21.1592853        10  2.11592853   Prob > F        =    0.0000
    Residual |  192.301778       514  .374127972   R-squared       =    0.0991
-------------+----------------------------------   Adj R-squared   =    0.0816
       Total |  213.461063       524  .407368441   Root MSE        =    .61166

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3819305   .0615906     6.20   0.000     .2609302    .5029307
               exp |   .0593342   .0338303     1.75   0.080    -.0071284    .1257968
            expsqr |  -.0012564   .0008977    -1.40   0.162      -.00302    .0005071
         higheredu |   .0954598   .0820127     1.16   0.245    -.0656615    .2565811
     parent_secedu |  -.0388698   .0756507    -0.51   0.608    -.1874923    .1097528
    parent_highedu |   .0248392   .2637503     0.09   0.925    -.4933221    .5430005
parent_partymember |   .0064544   .0782058     0.08   0.934    -.1471879    .1600968
               _m1 |   -.306243   .1243025    -2.46   0.014    -.5504465   -.0620396
               _m2 |   .0848037   .3051564     0.28   0.781    -.5147036     .684311
               _m3 |   .0616943    .211002     0.29   0.770    -.3528382    .4762268
             _cons |   7.795584   .3791307    20.56   0.000     7.050747     8.54042
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4263354          .        .       .            .           .
        rho1 |  -.4690191          .        .       .            .           .
        rho2 |   .1298791          .        .       .            .           .
        rho3 |   .0944864          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200
> , 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
   higheredu |        525    .1295238     .336099          0          1
-------------+---------------------------------------------------------
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
          m1 |        525    1.309027    .3917447   .4113325   2.847123
          m2 |        525   -.3674441    .2107215  -.7259405  -.0069064
-------------+---------------------------------------------------------
          m3 |        525   -.4818022    .2343294  -.7259948   1.682636

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Non-specified High
> eredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) All parent indicators & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1
> 992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymembe
> r ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -3012.9408
Iteration 2:  Log likelihood = -2931.9396
Iteration 3:  Log likelihood =  -2926.511
Iteration 4:  Log likelihood = -2926.4819
Iteration 5:  Log likelihood = -2926.4819

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(18)     =    2010.30
                                                  Prob > chi2     =     0.0000
Log likelihood = -2926.4819                       Pseudo R2       =     0.2557

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0182489    .117675    -0.16   0.877    -.2488876    .2123898
         exp |  -.6322691   .0488514   -12.94   0.000    -.7280161   -.5365221
      expsqr |   .0102906   .0011901     8.65   0.000      .007958    .0126231
ins1_secge~e |  -8.224317   .8513367    -9.66   0.000    -9.892906   -6.555727
ins2_highe~e |   .8564428   .1647772     5.20   0.000     .5334855      1.1794
ins3_vs_en~e |   1.222061   .7690421     1.59   0.112    -.2852341    2.729356
parent_sec~u |   .5482452   .1395442     3.93   0.000     .2747437    .8217467
parent_hig~u |   .8666035   .6419943     1.35   0.177    -.3916821    2.124889
parent_par~r |   .3953126   .1457868     2.71   0.007     .1095756    .6810495
       _cons |   7.487307    .660447    11.34   0.000     6.192854    8.781759
-------------+----------------------------------------------------------------
2            |
        male |     .05695   .1065566     0.53   0.593    -.1518971    .2657972
         exp |  -.9741691   .0451596   -21.57   0.000     -1.06268   -.8856579
      expsqr |   .0176122   .0010436    16.88   0.000     .0155667    .0196576
ins1_secge~e |  -10.39447   .8087177   -12.85   0.000    -11.97953   -8.809411
ins2_highe~e |   .1863432   .1906096     0.98   0.328    -.1872447    .5599311
ins3_vs_en~e |  -.9197171   .7452477    -1.23   0.217    -2.380376    .5409415
parent_sec~u |   .8372977   .1228636     6.81   0.000     .5964895    1.078106
parent_hig~u |   1.073405   .5790396     1.85   0.064    -.0614916    2.208302
parent_par~r |    .422284   .1309171     3.23   0.001     .1656911    .6788768
       _cons |   12.80232    .633269    20.22   0.000     11.56113     14.0435
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(24, 500)      =      4.01
       Model |  34.4642835        24  1.43601181   Prob > F        =    0.0000
    Residual |   178.99678       500  .357993559   R-squared       =    0.1615
-------------+----------------------------------   Adj R-squared   =    0.1212
       Total |  213.461063       524  .407368441   Root MSE        =    .59833

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3872796   .0619084     6.26   0.000     .2656468    .5089123
               exp |   .0808075   .0422798     1.91   0.057    -.0022604    .1638754
            expsqr |  -.0017973   .0011238    -1.60   0.110    -.0040052    .0004107
         higheredu |   .0650258   .0824217     0.79   0.431    -.0969097    .2269614
     parent_secedu |   -.051657   .0775121    -0.67   0.505    -.2039466    .1006327
    parent_highedu |  -.0413935   .2681407    -0.15   0.877    -.5682149    .4854279
parent_partymember |   .0241499   .0793853     0.30   0.761    -.1318201    .1801198
      provincedum2 |  -.2069208   .2473859    -0.84   0.403    -.6929647    .2791231
      provincedum3 |   .0739214   .2786642     0.27   0.791    -.4735758    .6214186
      provincedum4 |   .2496361   .2960185     0.84   0.399    -.3319573    .8312295
      provincedum5 |    .343997   .1953415     1.76   0.079    -.0397943    .7277884
      provincedum6 |   .2057738   .2203341     0.93   0.351    -.2271209    .6386685
      provincedum7 |   .1368971   .2275659     0.60   0.548    -.3102061    .5840002
      provincedum8 |  -.0476556   .2294788    -0.21   0.836    -.4985171     .403206
      provincedum9 |    .302886   .2025229     1.50   0.135    -.0950147    .7007867
     provincedum10 |   .0311935   .2070732     0.15   0.880    -.3756474    .4380344
     provincedum11 |   .1689172     .21222     0.80   0.426    -.2480356      .58587
     provincedum12 |  -.1271001   .2165778    -0.59   0.558    -.5526148    .2984145
     provincedum13 |  -.1726113   .2108115    -0.82   0.413    -.5867968    .2415742
     provincedum14 |  -.0707627   .2392367    -0.30   0.768    -.5407958    .3992704
     provincedum15 |  -.1381514   .2395589    -0.58   0.564    -.6088175    .3325147
               _m1 |  -.2906287   .2292047    -1.27   0.205    -.7409518    .1596944
               _m2 |   .1438279   .5232452     0.27   0.784    -.8842023    1.171858
               _m3 |   .2205813   .2343166     0.94   0.347    -.2397851    .6809477
             _cons |   7.636198   .5676849    13.45   0.000     6.520856     8.75154
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3954997          .        .       .            .           .
        rho1 |  -.4621314          .        .       .            .           .
        rho2 |    .228702          .        .       .            .           .
        rho3 |   .3507484          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
   higheredu |        525    .1295238     .336099          0          1
-------------+---------------------------------------------------------
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
provincedum2 |        525    .0266667    .1612609          0          1
provincedum3 |        525    .0171429    .1299274          0          1
-------------+---------------------------------------------------------
provincedum4 |        525    .0114286    .1063932          0          1
provincedum5 |        525    .0704762    .2561919          0          1
provincedum6 |        525    .0628571    .2429373          0          1
provincedum7 |        525     .072381    .2593648          0          1
provincedum8 |        525    .0971429    .2964346          0          1
-------------+---------------------------------------------------------
provincedum9 |        525    .0780952    .2685773          0          1
provinced~10 |        525    .1161905    .3207588          0          1
provinced~11 |        525    .1257143    .3318433          0          1
provinced~12 |        525         .04    .1961461          0          1
provinced~13 |        525    .0761905    .2655557          0          1
-------------+---------------------------------------------------------
provinced~14 |        525     .047619     .213162          0          1
provinced~15 |        525    .0628571    .2429373          0          1
          m1 |        525    1.309027    .3917447   .4113325   2.847123
          m2 |        525   -.3674441    .2107215  -.7259405  -.0069064
          m3 |        525   -.4818022    .2343294  -.7259948   1.682636

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Non-specified High
> eredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) All parent indicators & Specified higher education, Sec Gen + inrange(birthyear, 1971, 
> 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entr
> ant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymember ) dm
> f(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -3012.9408
Iteration 2:  Log likelihood = -2931.9396
Iteration 3:  Log likelihood =  -2926.511
Iteration 4:  Log likelihood = -2926.4819
Iteration 5:  Log likelihood = -2926.4819

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(18)     =    2010.30
                                                  Prob > chi2     =     0.0000
Log likelihood = -2926.4819                       Pseudo R2       =     0.2557

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0182489    .117675    -0.16   0.877    -.2488876    .2123898
         exp |  -.6322691   .0488514   -12.94   0.000    -.7280161   -.5365221
      expsqr |   .0102906   .0011901     8.65   0.000      .007958    .0126231
ins1_secge~e |  -8.224317   .8513367    -9.66   0.000    -9.892906   -6.555727
ins2_highe~e |   .8564428   .1647772     5.20   0.000     .5334855      1.1794
ins3_vs_en~e |   1.222061   .7690421     1.59   0.112    -.2852341    2.729356
parent_sec~u |   .5482452   .1395442     3.93   0.000     .2747437    .8217467
parent_hig~u |   .8666035   .6419943     1.35   0.177    -.3916821    2.124889
parent_par~r |   .3953126   .1457868     2.71   0.007     .1095756    .6810495
       _cons |   7.487307    .660447    11.34   0.000     6.192854    8.781759
-------------+----------------------------------------------------------------
2            |
        male |     .05695   .1065566     0.53   0.593    -.1518971    .2657972
         exp |  -.9741691   .0451596   -21.57   0.000     -1.06268   -.8856579
      expsqr |   .0176122   .0010436    16.88   0.000     .0155667    .0196576
ins1_secge~e |  -10.39447   .8087177   -12.85   0.000    -11.97953   -8.809411
ins2_highe~e |   .1863432   .1906096     0.98   0.328    -.1872447    .5599311
ins3_vs_en~e |  -.9197171   .7452477    -1.23   0.217    -2.380376    .5409415
parent_sec~u |   .8372977   .1228636     6.81   0.000     .5964895    1.078106
parent_hig~u |   1.073405   .5790396     1.85   0.064    -.0614916    2.208302
parent_par~r |    .422284   .1309171     3.23   0.001     .1656911    .6788768
       _cons |   12.80232    .633269    20.22   0.000     11.56113     14.0435
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(12, 962)      =      5.76
       Model |  25.8007208        12  2.15006006   Prob > F        =    0.0000
    Residual |  358.938287       962  .373116723   R-squared       =    0.0671
-------------+----------------------------------   Adj R-squared   =    0.0554
       Total |  384.739008       974  .395009249   Root MSE        =    .61083

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2619613   .0445785     5.88   0.000      .174479    .3494437
               exp |  -.0198451   .0239304    -0.83   0.407    -.0668068    .0271167
            expsqr |   .0002866   .0006728     0.43   0.670    -.0010338    .0016069
        highvocedu |    .188431   .0556401     3.39   0.001      .079241     .297621
        highgenedu |   .2509677   .0639095     3.93   0.000     .1255495    .3763858
          adultedu |   .0044894   .0893131     0.05   0.960    -.1707816    .1797604
     parent_secedu |   .0617811    .051501     1.20   0.231    -.0392861    .1628482
    parent_highedu |   .0652203   .1509649     0.43   0.666    -.2310382    .3614789
parent_partymember |  -.0144934   .0531576    -0.27   0.785    -.1188117    .0898249
               _m1 |  -.4144326   .3043611    -1.36   0.174    -1.011721    .1828557
               _m2 |   .0711241   .1027784     0.69   0.489    -.1305717    .2728199
               _m3 |  -.2574318   .2180156    -1.18   0.238    -.6852729    .1704092
             _cons |   7.862172   .1286406    61.12   0.000     7.609723     8.11462
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4091105          .        .       .            .           .
        rho1 |  -.6479382          .        .       .            .           .
        rho2 |   .1111979          .        .       .            .           .
        rho3 |  -.4024778          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrang
> e(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
  highvocedu |        975    .2615385    .4396981          0          1
-------------+---------------------------------------------------------
  highgenedu |        975    .2523077    .4345598          0          1
    adultedu |        975    .0553846    .2288468          0          1
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
-------------+---------------------------------------------------------
          m1 |        975   -.2404647     .102152  -.6393699  -.0199448
          m2 |        975    .7893436    .6148034   .0140029   2.964509
          m3 |        975   -.3723645    .2591711  -.7259948   .4507049

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Specified Highered
> u,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) All parent indicators & Specified higher education, Sec Gen + inrange(birthyear, 1971, 
> 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_high
> edu parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -3012.9408
Iteration 2:  Log likelihood = -2931.9396
Iteration 3:  Log likelihood =  -2926.511
Iteration 4:  Log likelihood = -2926.4819
Iteration 5:  Log likelihood = -2926.4819

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(18)     =    2010.30
                                                  Prob > chi2     =     0.0000
Log likelihood = -2926.4819                       Pseudo R2       =     0.2557

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0182489    .117675    -0.16   0.877    -.2488876    .2123898
         exp |  -.6322691   .0488514   -12.94   0.000    -.7280161   -.5365221
      expsqr |   .0102906   .0011901     8.65   0.000      .007958    .0126231
ins1_secge~e |  -8.224317   .8513367    -9.66   0.000    -9.892906   -6.555727
ins2_highe~e |   .8564428   .1647772     5.20   0.000     .5334855      1.1794
ins3_vs_en~e |   1.222061   .7690421     1.59   0.112    -.2852341    2.729356
parent_sec~u |   .5482452   .1395442     3.93   0.000     .2747437    .8217467
parent_hig~u |   .8666035   .6419943     1.35   0.177    -.3916821    2.124889
parent_par~r |   .3953126   .1457868     2.71   0.007     .1095756    .6810495
       _cons |   7.487307    .660447    11.34   0.000     6.192854    8.781759
-------------+----------------------------------------------------------------
2            |
        male |     .05695   .1065566     0.53   0.593    -.1518971    .2657972
         exp |  -.9741691   .0451596   -21.57   0.000     -1.06268   -.8856579
      expsqr |   .0176122   .0010436    16.88   0.000     .0155667    .0196576
ins1_secge~e |  -10.39447   .8087177   -12.85   0.000    -11.97953   -8.809411
ins2_highe~e |   .1863432   .1906096     0.98   0.328    -.1872447    .5599311
ins3_vs_en~e |  -.9197171   .7452477    -1.23   0.217    -2.380376    .5409415
parent_sec~u |   .8372977   .1228636     6.81   0.000     .5964895    1.078106
parent_hig~u |   1.073405   .5790396     1.85   0.064    -.0614916    2.208302
parent_par~r |    .422284   .1309171     3.23   0.001     .1656911    .6788768
       _cons |   12.80232    .633269    20.22   0.000     11.56113     14.0435
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(26, 948)      =      4.60
       Model |   43.137187        26  1.65912258   Prob > F        =    0.0000
    Residual |  341.601821       948  .360339474   R-squared       =    0.1121
-------------+----------------------------------   Adj R-squared   =    0.0878
       Total |  384.739008       974  .395009249   Root MSE        =    .60028

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2519933   .0441592     5.71   0.000     .1653323    .3386542
               exp |  -.0000581   .0279268    -0.00   0.998    -.0548636    .0547473
            expsqr |  -.0002291   .0007457    -0.31   0.759    -.0016924    .0012342
        highvocedu |   .1967304   .0566244     3.47   0.001     .0856068    .3078541
        highgenedu |   .2345141   .0655561     3.58   0.000     .1058622     .363166
          adultedu |   .0189052    .089456     0.21   0.833    -.1566495    .1944599
     parent_secedu |    .030822   .0546773     0.56   0.573    -.0764805    .1381245
    parent_highedu |   .0901471   .1517685     0.59   0.553     -.207694    .3879883
parent_partymember |  -.0378082   .0527287    -0.72   0.474    -.1412866    .0656702
      provincedum2 |   -.297774   .1720311    -1.73   0.084    -.6353798    .0398318
      provincedum3 |  -.5033126   .1810608    -2.78   0.006     -.858639   -.1479862
      provincedum4 |   -.455171   .2212434    -2.06   0.040    -.8893544   -.0209875
      provincedum5 |  -.0885342   .1422047    -0.62   0.534    -.3676066    .1905381
      provincedum6 |  -.1504395   .1584217    -0.95   0.343    -.4613373    .1604583
      provincedum7 |  -.2083764   .1630355    -1.28   0.202    -.5283286    .1115758
      provincedum8 |  -.4154781   .1608322    -2.58   0.010    -.7311063   -.0998498
      provincedum9 |  -.0089082   .1454144    -0.06   0.951    -.2942795    .2764631
     provincedum10 |  -.1177829   .1475729    -0.80   0.425    -.4073903    .1718244
     provincedum11 |  -.1973023   .1570185    -1.26   0.209    -.5054464    .1108417
     provincedum12 |  -.3095285   .1791628    -1.73   0.084    -.6611299     .042073
     provincedum13 |  -.2754727   .1591986    -1.73   0.084    -.5878951    .0369497
     provincedum14 |  -.1984208   .1725635    -1.15   0.250    -.5370714    .1402298
     provincedum15 |  -.4116826   .1571084    -2.62   0.009    -.7200031   -.1033622
               _m1 |   .2398578   .4189019     0.57   0.567    -.5822245     1.06194
               _m2 |  -.0864579   .1327072    -0.65   0.515    -.3468917     .173976
               _m3 |  -.3077268   .2299056    -1.34   0.181    -.7589096     .143456
             _cons |   8.215492   .2278251    36.06   0.000     7.768392    8.662592
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3658758          .        .       .            .           .
        rho1 |     .39654          .        .       .            .           .
        rho2 |  -.1429347          .        .       .            .           .
        rho3 |   -.508743          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
  highvocedu |        975    .2615385    .4396981          0          1
-------------+---------------------------------------------------------
  highgenedu |        975    .2523077    .4345598          0          1
    adultedu |        975    .0553846    .2288468          0          1
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
-------------+---------------------------------------------------------
provincedum2 |        975         .04    .1960597          0          1
provincedum3 |        975    .0246154    .1550294          0          1
provincedum4 |        975    .0112821    .1056703          0          1
provincedum5 |        975    .0861538    .2807351          0          1
provincedum6 |        975    .0717949    .2582804          0          1
-------------+---------------------------------------------------------
provincedum7 |        975    .0728205     .259975          0          1
provincedum8 |        975    .1251282     .331034          0          1
provincedum9 |        975    .1076923    .3101505          0          1
provinced~10 |        975    .1035897     .304884          0          1
provinced~11 |        975    .1076923    .3101505          0          1
-------------+---------------------------------------------------------
provinced~12 |        975    .0225641    .1485854          0          1
provinced~13 |        975    .0492308    .2164605          0          1
provinced~14 |        975    .0482051    .2143094          0          1
provinced~15 |        975    .0810256    .2730145          0          1
          m1 |        975   -.2404647     .102152  -.6393699  -.0199448
-------------+---------------------------------------------------------
          m2 |        975    .7893436    .6148034   .0140029   2.964509
          m3 |        975   -.3723645    .2591711  -.7259948   .4507049

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Specified Highered
> u, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) All parent indicators & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1
> 992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel
> (educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_
> entrant_relative  parent_secedu parent_highedu parent_partymember ) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -3012.9408
Iteration 2:  Log likelihood = -2931.9396
Iteration 3:  Log likelihood =  -2926.511
Iteration 4:  Log likelihood = -2926.4819
Iteration 5:  Log likelihood = -2926.4819

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(18)     =    2010.30
                                                  Prob > chi2     =     0.0000
Log likelihood = -2926.4819                       Pseudo R2       =     0.2557

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0182489    .117675    -0.16   0.877    -.2488876    .2123898
         exp |  -.6322691   .0488514   -12.94   0.000    -.7280161   -.5365221
      expsqr |   .0102906   .0011901     8.65   0.000      .007958    .0126231
ins1_secge~e |  -8.224317   .8513367    -9.66   0.000    -9.892906   -6.555727
ins2_highe~e |   .8564428   .1647772     5.20   0.000     .5334855      1.1794
ins3_vs_en~e |   1.222061   .7690421     1.59   0.112    -.2852341    2.729356
parent_sec~u |   .5482452   .1395442     3.93   0.000     .2747437    .8217467
parent_hig~u |   .8666035   .6419943     1.35   0.177    -.3916821    2.124889
parent_par~r |   .3953126   .1457868     2.71   0.007     .1095756    .6810495
       _cons |   7.487307    .660447    11.34   0.000     6.192854    8.781759
-------------+----------------------------------------------------------------
2            |
        male |     .05695   .1065566     0.53   0.593    -.1518971    .2657972
         exp |  -.9741691   .0451596   -21.57   0.000     -1.06268   -.8856579
      expsqr |   .0176122   .0010436    16.88   0.000     .0155667    .0196576
ins1_secge~e |  -10.39447   .8087177   -12.85   0.000    -11.97953   -8.809411
ins2_highe~e |   .1863432   .1906096     0.98   0.328    -.1872447    .5599311
ins3_vs_en~e |  -.9197171   .7452477    -1.23   0.217    -2.380376    .5409415
parent_sec~u |   .8372977   .1228636     6.81   0.000     .5964895    1.078106
parent_hig~u |   1.073405   .5790396     1.85   0.064    -.0614916    2.208302
parent_par~r |    .422284   .1309171     3.23   0.001     .1656911    .6788768
       _cons |   12.80232    .633269    20.22   0.000     11.56113     14.0435
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(10, 964)      =      6.25
       Model |  23.4379596        10  2.34379596   Prob > F        =    0.0000
    Residual |  361.301049       964  .374793619   R-squared       =    0.0609
-------------+----------------------------------   Adj R-squared   =    0.0512
       Total |  384.739008       974  .395009249   Root MSE        =     .6122

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2655375   .0445626     5.96   0.000     .1780867    .3529884
               exp |  -.0267384   .0237923    -1.12   0.261    -.0734291    .0199524
            expsqr |   .0004195   .0006716     0.62   0.532    -.0008984    .0017374
         higheredu |   .1726021   .0492019     3.51   0.000      .076047    .2691572
     parent_secedu |   .0665576   .0514981     1.29   0.197    -.0345038    .1676189
    parent_highedu |   .0725682   .1510683     0.48   0.631    -.2238925    .3690288
parent_partymember |  -.0103789   .0532517    -0.19   0.846    -.1148814    .0941237
               _m1 |  -.3583207   .3029481    -1.18   0.237    -.9528345    .2361931
               _m2 |   .0741609   .1029811     0.72   0.472    -.1279321    .2762538
               _m3 |  -.2338936   .2183037    -1.07   0.284    -.6622988    .1945116
             _cons |   7.951865   .1219652    65.20   0.000     7.712517    8.191213
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4018805          .        .       .            .           .
        rho1 |  -.5652277          .        .       .            .           .
        rho2 |    .116984          .        .       .            .           .
        rho3 |   -.368952          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200
> , 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
   higheredu |        975    .5692308     .495438          0          1
-------------+---------------------------------------------------------
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
          m1 |        975   -.2404647     .102152  -.6393699  -.0199448
          m2 |        975    .7893436    .6148034   .0140029   2.964509
-------------+---------------------------------------------------------
          m3 |        975   -.3723645    .2591711  -.7259948   .4507049

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Non-specified High
> eredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) All parent indicators & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1
> 992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymembe
> r ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -3012.9408
Iteration 2:  Log likelihood = -2931.9396
Iteration 3:  Log likelihood =  -2926.511
Iteration 4:  Log likelihood = -2926.4819
Iteration 5:  Log likelihood = -2926.4819

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(18)     =    2010.30
                                                  Prob > chi2     =     0.0000
Log likelihood = -2926.4819                       Pseudo R2       =     0.2557

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0182489    .117675    -0.16   0.877    -.2488876    .2123898
         exp |  -.6322691   .0488514   -12.94   0.000    -.7280161   -.5365221
      expsqr |   .0102906   .0011901     8.65   0.000      .007958    .0126231
ins1_secge~e |  -8.224317   .8513367    -9.66   0.000    -9.892906   -6.555727
ins2_highe~e |   .8564428   .1647772     5.20   0.000     .5334855      1.1794
ins3_vs_en~e |   1.222061   .7690421     1.59   0.112    -.2852341    2.729356
parent_sec~u |   .5482452   .1395442     3.93   0.000     .2747437    .8217467
parent_hig~u |   .8666035   .6419943     1.35   0.177    -.3916821    2.124889
parent_par~r |   .3953126   .1457868     2.71   0.007     .1095756    .6810495
       _cons |   7.487307    .660447    11.34   0.000     6.192854    8.781759
-------------+----------------------------------------------------------------
2            |
        male |     .05695   .1065566     0.53   0.593    -.1518971    .2657972
         exp |  -.9741691   .0451596   -21.57   0.000     -1.06268   -.8856579
      expsqr |   .0176122   .0010436    16.88   0.000     .0155667    .0196576
ins1_secge~e |  -10.39447   .8087177   -12.85   0.000    -11.97953   -8.809411
ins2_highe~e |   .1863432   .1906096     0.98   0.328    -.1872447    .5599311
ins3_vs_en~e |  -.9197171   .7452477    -1.23   0.217    -2.380376    .5409415
parent_sec~u |   .8372977   .1228636     6.81   0.000     .5964895    1.078106
parent_hig~u |   1.073405   .5790396     1.85   0.064    -.0614916    2.208302
parent_par~r |    .422284   .1309171     3.23   0.001     .1656911    .6788768
       _cons |   12.80232    .633269    20.22   0.000     11.56113     14.0435
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(24, 950)      =      4.77
       Model |  41.3926093        24  1.72469205   Prob > F        =    0.0000
    Residual |  343.346399       950  .361417262   R-squared       =    0.1076
-------------+----------------------------------   Adj R-squared   =    0.0850
       Total |  384.739008       974  .395009249   Root MSE        =    .60118

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2551287   .0441211     5.78   0.000     .1685426    .3417148
               exp |  -.0039594   .0278959    -0.14   0.887    -.0587041    .0507853
            expsqr |  -.0001613    .000746    -0.22   0.829    -.0016253    .0013026
         higheredu |   .1727355   .0504277     3.43   0.001     .0737729    .2716982
     parent_secedu |   .0315608   .0546832     0.58   0.564    -.0757531    .1388746
    parent_highedu |    .101285   .1516524     0.67   0.504    -.1963275    .3988974
parent_partymember |   -.034276   .0527829    -0.65   0.516    -.1378606    .0693085
      provincedum2 |   -.323826   .1715609    -1.89   0.059     -.660508    .0128561
      provincedum3 |   -.507932   .1810066    -2.81   0.005     -.863151    -.152713
      provincedum4 |   -.465564   .2213125    -2.10   0.036    -.8998818   -.0312462
      provincedum5 |  -.0967619   .1423317    -0.68   0.497    -.3760828     .182559
      provincedum6 |   -.160659   .1584157    -1.01   0.311    -.4715442    .1502263
      provincedum7 |  -.2255781    .162731    -1.39   0.166    -.5449319    .0937756
      provincedum8 |  -.4338994   .1604998    -2.70   0.007    -.7488744   -.1189243
      provincedum9 |  -.0236711   .1451808    -0.16   0.871    -.3085832     .261241
     provincedum10 |  -.1375485     .14704    -0.94   0.350    -.4261092    .1510122
     provincedum11 |  -.2180885   .1568485    -1.39   0.165     -.525898    .0897209
     provincedum12 |  -.3616882    .177853    -2.03   0.042    -.7107182   -.0126581
     provincedum13 |  -.3061749   .1587423    -1.93   0.054     -.617701    .0053512
     provincedum14 |  -.2266695   .1721444    -1.32   0.188    -.5644966    .1111576
     provincedum15 |  -.4300979   .1565277    -2.75   0.006    -.7372778   -.1229179
               _m1 |   .3121722    .414422     0.75   0.451    -.5011161     1.12546
               _m2 |  -.0942605   .1327544    -0.71   0.478    -.3547863    .1662652
               _m3 |  -.2877239   .2300661    -1.25   0.211    -.7392204    .1637726
             _cons |   8.309752   .2205193    37.68   0.000      7.87699    8.742513
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3775493          .        .       .            .           .
        rho1 |    .508051          .        .       .            .           .
        rho2 |  -.1534062          .        .       .            .           .
        rho3 |  -.4682622          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
   higheredu |        975    .5692308     .495438          0          1
-------------+---------------------------------------------------------
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
provincedum2 |        975         .04    .1960597          0          1
provincedum3 |        975    .0246154    .1550294          0          1
-------------+---------------------------------------------------------
provincedum4 |        975    .0112821    .1056703          0          1
provincedum5 |        975    .0861538    .2807351          0          1
provincedum6 |        975    .0717949    .2582804          0          1
provincedum7 |        975    .0728205     .259975          0          1
provincedum8 |        975    .1251282     .331034          0          1
-------------+---------------------------------------------------------
provincedum9 |        975    .1076923    .3101505          0          1
provinced~10 |        975    .1035897     .304884          0          1
provinced~11 |        975    .1076923    .3101505          0          1
provinced~12 |        975    .0225641    .1485854          0          1
provinced~13 |        975    .0492308    .2164605          0          1
-------------+---------------------------------------------------------
provinced~14 |        975    .0482051    .2143094          0          1
provinced~15 |        975    .0810256    .2730145          0          1
          m1 |        975   -.2404647     .102152  -.6393699  -.0199448
          m2 |        975    .7893436    .6148034   .0140029   2.964509
          m3 |        975   -.3723645    .2591711  -.7259948   .4507049

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Non-specified High
> eredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) Parent Edu & Specified higher education, Sec Voc + inrange(birthyear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative  parent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -3941.415
Iteration 1:  Log likelihood = -3025.5534
Iteration 2:  Log likelihood = -2944.8357
Iteration 3:  Log likelihood = -2939.4844
Iteration 4:  Log likelihood =  -2939.455
Iteration 5:  Log likelihood =  -2939.455

Multinomial logistic regression                   Number of obs   =       4758
                                                  LR chi2(16)     =    2003.92
                                                  Prob > chi2     =     0.0000
Log likelihood =  -2939.455                       Pseudo R2       =     0.2542

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0201461    .117312    -0.17   0.864    -.2500734    .2097811
         exp |   -.626201   .0486821   -12.86   0.000    -.7216162   -.5307859
      expsqr |   .0102008   .0011869     8.59   0.000     .0078746    .0125271
ins1_secge~e |  -8.307994   .8501551    -9.77   0.000    -9.974268   -6.641721
ins2_highe~e |   .9071819   .1620318     5.60   0.000     .5896055    1.224758
ins3_vs_en~e |   1.365175   .7637747     1.79   0.074    -.1317956    2.862146
parent_sec~u |    .625599   .1357105     4.61   0.000     .3596114    .8915866
parent_hig~u |   1.041823   .6379798     1.63   0.102    -.2085947     2.29224
       _cons |   7.414201   .6573221    11.28   0.000     6.125873    8.702529
-------------+----------------------------------------------------------------
2            |
        male |   .0537835   .1062542     0.51   0.613    -.1544709     .262038
         exp |  -.9682699   .0449301   -21.55   0.000    -1.056331   -.8802086
      expsqr |   .0175077   .0010394    16.84   0.000     .0154705    .0195448
ins1_secge~e |  -10.43793   .8075062   -12.93   0.000    -12.02061   -8.855244
ins2_highe~e |   .2098414   .1901359     1.10   0.270    -.1628182    .5825009
ins3_vs_en~e |  -.8997782   .7434157    -1.21   0.226    -2.356846    .5572897
parent_sec~u |   .9215819   .1193565     7.72   0.000     .6876474    1.155516
parent_hig~u |   1.263334   .5748517     2.20   0.028     .1366457    2.390023
       _cons |   12.77734   .6300304    20.28   0.000      11.5425    14.01218
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       527
-------------+----------------------------------   F(11, 515)      =      5.23
       Model |  21.4883374        11  1.95348522   Prob > F        =    0.0000
    Residual |  192.332377       515  .373460927   R-squared       =    0.1005
-------------+----------------------------------   Adj R-squared   =    0.0813
       Total |  213.820715       526   .40650326   Root MSE        =    .61111

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |    .381962    .061458     6.22   0.000     .2612227    .5027012
           exp |   .0601015   .0324185     1.85   0.064    -.0035873    .1237903
        expsqr |  -.0012665   .0008664    -1.46   0.144    -.0029686    .0004356
    highvocedu |   .0610419   .0984248     0.62   0.535    -.1323216    .2544053
    highgenedu |   .1526707   .2544256     0.60   0.549     -.347169    .6525103
      adultedu |    .169696   .1540392     1.10   0.271    -.1329266    .4723186
 parent_secedu |  -.0389578   .0755665    -0.52   0.606    -.1874144    .1094988
parent_highedu |   .0410244   .2602783     0.16   0.875    -.4703133    .5523621
           _m1 |   -.298541   .1197088    -2.49   0.013    -.5337187   -.0633634
           _m2 |   .0353357   .2923397     0.12   0.904    -.5389894    .6096608
           _m3 |   .0316439     .16141     0.20   0.845    -.2854591    .3487469
         _cons |    7.74619   .3716718    20.84   0.000     7.016011     8.47637
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4210865          .        .       .            .           .
        rho1 |  -.4600642          .        .       .            .           .
        rho2 |   .0544537          .        .       .            .           .
        rho3 |   .0487646          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 2
> 00, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        527    8.178065    .6375761   5.298317   9.721166
        male |        527    .7381404    .4400643          0          1
         exp |        527    14.89753    6.310482          2         32
      expsqr |        527    261.6831    217.8646          4       1024
  highvocedu |        527     .085389    .2797252          0          1
-------------+---------------------------------------------------------
  highgenedu |        527    .0113852    .1061931          0          1
    adultedu |        527    .0322581    .1768526          0          1
parent_sec~u |        527    .2049336    .4040366          0          1
parent_hig~u |        527    .0113852    .1061931          0          1
          m1 |        527    1.309008    .3971462   .4127845    2.95401
-------------+---------------------------------------------------------
          m2 |        527   -.3648791    .2111295  -.7259849  -.0049211
          m3 |        527   -.4815368    .2562027  -.7260022   2.781404

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Specified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) Parent Edu & Specified higher education, Sec Voc + inrange(birthyear, 1971, 1992) + Pro
> vincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(mon
> thlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu ) dmf(2) showml
> ogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -3941.415
Iteration 1:  Log likelihood = -3025.5534
Iteration 2:  Log likelihood = -2944.8357
Iteration 3:  Log likelihood = -2939.4844
Iteration 4:  Log likelihood =  -2939.455
Iteration 5:  Log likelihood =  -2939.455

Multinomial logistic regression                   Number of obs   =       4758
                                                  LR chi2(16)     =    2003.92
                                                  Prob > chi2     =     0.0000
Log likelihood =  -2939.455                       Pseudo R2       =     0.2542

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0201461    .117312    -0.17   0.864    -.2500734    .2097811
         exp |   -.626201   .0486821   -12.86   0.000    -.7216162   -.5307859
      expsqr |   .0102008   .0011869     8.59   0.000     .0078746    .0125271
ins1_secge~e |  -8.307994   .8501551    -9.77   0.000    -9.974268   -6.641721
ins2_highe~e |   .9071819   .1620318     5.60   0.000     .5896055    1.224758
ins3_vs_en~e |   1.365175   .7637747     1.79   0.074    -.1317956    2.862146
parent_sec~u |    .625599   .1357105     4.61   0.000     .3596114    .8915866
parent_hig~u |   1.041823   .6379798     1.63   0.102    -.2085947     2.29224
       _cons |   7.414201   .6573221    11.28   0.000     6.125873    8.702529
-------------+----------------------------------------------------------------
2            |
        male |   .0537835   .1062542     0.51   0.613    -.1544709     .262038
         exp |  -.9682699   .0449301   -21.55   0.000    -1.056331   -.8802086
      expsqr |   .0175077   .0010394    16.84   0.000     .0154705    .0195448
ins1_secge~e |  -10.43793   .8075062   -12.93   0.000    -12.02061   -8.855244
ins2_highe~e |   .2098414   .1901359     1.10   0.270    -.1628182    .5825009
ins3_vs_en~e |  -.8997782   .7434157    -1.21   0.226    -2.356846    .5572897
parent_sec~u |   .9215819   .1193565     7.72   0.000     .6876474    1.155516
parent_hig~u |   1.263334   .5748517     2.20   0.028     .1366457    2.390023
       _cons |   12.77734   .6300304    20.28   0.000      11.5425    14.01218
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       527
-------------+----------------------------------   F(25, 501)      =      3.89
       Model |  34.7307888        25  1.38923155   Prob > F        =    0.0000
    Residual |  179.089926       501  .357464922   R-squared       =    0.1624
-------------+----------------------------------   Adj R-squared   =    0.1206
       Total |  213.820715       526   .40650326   Root MSE        =    .59788

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .3866028   .0617069     6.27   0.000     .2653667     .507839
           exp |    .082732   .0417768     1.98   0.048     .0006526    .1648114
        expsqr |  -.0018441   .0011213    -1.64   0.101    -.0040471    .0003589
    highvocedu |   .0123875   .0993264     0.12   0.901      -.18276     .207535
    highgenedu |   .1834825   .2546319     0.72   0.472    -.3167954    .6837604
      adultedu |   .1608508   .1525148     1.05   0.292    -.1387966    .4604983
 parent_secedu |  -.0478195   .0773729    -0.62   0.537    -.1998348    .1041957
parent_highedu |  -.0085537   .2645124    -0.03   0.974    -.5282439    .5111365
  provincedum2 |  -.2147162   .2472046    -0.87   0.385    -.7004016    .2709693
  provincedum3 |   .0407678    .278206     0.15   0.884    -.5058265    .5873621
  provincedum4 |   .2162237   .2957387     0.73   0.465    -.3648171    .7972645
  provincedum5 |   .3356643    .193604     1.73   0.084    -.0447114    .7160401
  provincedum6 |   .1909459   .2194077     0.87   0.385    -.2401266    .6220184
  provincedum7 |   .1323192   .2245981     0.59   0.556     -.308951    .5735895
  provincedum8 |  -.0726127   .2293145    -0.32   0.752    -.5231494    .3779239
  provincedum9 |   .2813094   .2011795     1.40   0.163    -.1139501    .6765689
 provincedum10 |   .0157741   .2070783     0.08   0.939    -.3910747    .4226229
 provincedum11 |   .1460996   .2115083     0.69   0.490     -.269453    .5616521
 provincedum12 |  -.1435459   .2150623    -0.67   0.505     -.566081    .2789893
 provincedum13 |  -.1865586   .2102802    -0.89   0.375    -.5996982     .226581
 provincedum14 |  -.0938517   .2386908    -0.39   0.694      -.56281    .3751066
 provincedum15 |  -.1528616   .2380707    -0.64   0.521    -.6206016    .3148784
           _m1 |    -.26583   .2218154    -1.20   0.231    -.7016331    .1699731
           _m2 |   .0247242   .4925128     0.05   0.960    -.9429208    .9923691
           _m3 |   .1422127   .1741206     0.82   0.414    -.1998838    .4843092
         _cons |   7.526204   .5474691    13.75   0.000     6.450586    8.601822
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3833646          .        .       .            .           .
        rho1 |  -.4293367          .        .       .            .           .
        rho2 |   .0399315          .        .       .            .           .
        rho3 |   .2296848          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) 
> & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        527    8.178065    .6375761   5.298317   9.721166
        male |        527    .7381404    .4400643          0          1
         exp |        527    14.89753    6.310482          2         32
      expsqr |        527    261.6831    217.8646          4       1024
  highvocedu |        527     .085389    .2797252          0          1
-------------+---------------------------------------------------------
  highgenedu |        527    .0113852    .1061931          0          1
    adultedu |        527    .0322581    .1768526          0          1
parent_sec~u |        527    .2049336    .4040366          0          1
parent_hig~u |        527    .0113852    .1061931          0          1
provincedum2 |        527    .0265655    .1609624          0          1
-------------+---------------------------------------------------------
provincedum3 |        527    .0170778    .1296845          0          1
provincedum4 |        527    .0113852    .1061931          0          1
provincedum5 |        527    .0702087    .2557412          0          1
provincedum6 |        527    .0626186    .2425059          0          1
provincedum7 |        527    .0721063    .2589095          0          1
-------------+---------------------------------------------------------
provincedum8 |        527    .0967742    .2959309          0          1
provincedum9 |        527    .0777989    .2681093          0          1
provinced~10 |        527    .1157495    .3202283          0          1
provinced~11 |        527    .1252372    .3313021          0          1
provinced~12 |        527    .0398482    .1957883          0          1
-------------+---------------------------------------------------------
provinced~13 |        527    .0759013    .2650918          0          1
provinced~14 |        527    .0474383    .2127765          0          1
provinced~15 |        527    .0626186    .2425059          0          1
          m1 |        527    1.309008    .3971462   .4127845    2.95401
          m2 |        527   -.3648791    .2111295  -.7259849  -.0049211
-------------+---------------------------------------------------------
          m3 |        527   -.4815368    .2562027  -.7260022   2.781404

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) Parent Edu & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu if i
> nrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp ex
> psqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  p
> arent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -3941.415
Iteration 1:  Log likelihood = -3025.5534
Iteration 2:  Log likelihood = -2944.8357
Iteration 3:  Log likelihood = -2939.4844
Iteration 4:  Log likelihood =  -2939.455
Iteration 5:  Log likelihood =  -2939.455

Multinomial logistic regression                   Number of obs   =       4758
                                                  LR chi2(16)     =    2003.92
                                                  Prob > chi2     =     0.0000
Log likelihood =  -2939.455                       Pseudo R2       =     0.2542

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0201461    .117312    -0.17   0.864    -.2500734    .2097811
         exp |   -.626201   .0486821   -12.86   0.000    -.7216162   -.5307859
      expsqr |   .0102008   .0011869     8.59   0.000     .0078746    .0125271
ins1_secge~e |  -8.307994   .8501551    -9.77   0.000    -9.974268   -6.641721
ins2_highe~e |   .9071819   .1620318     5.60   0.000     .5896055    1.224758
ins3_vs_en~e |   1.365175   .7637747     1.79   0.074    -.1317956    2.862146
parent_sec~u |    .625599   .1357105     4.61   0.000     .3596114    .8915866
parent_hig~u |   1.041823   .6379798     1.63   0.102    -.2085947     2.29224
       _cons |   7.414201   .6573221    11.28   0.000     6.125873    8.702529
-------------+----------------------------------------------------------------
2            |
        male |   .0537835   .1062542     0.51   0.613    -.1544709     .262038
         exp |  -.9682699   .0449301   -21.55   0.000    -1.056331   -.8802086
      expsqr |   .0175077   .0010394    16.84   0.000     .0154705    .0195448
ins1_secge~e |  -10.43793   .8075062   -12.93   0.000    -12.02061   -8.855244
ins2_highe~e |   .2098414   .1901359     1.10   0.270    -.1628182    .5825009
ins3_vs_en~e |  -.8997782   .7434157    -1.21   0.226    -2.356846    .5572897
parent_sec~u |   .9215819   .1193565     7.72   0.000     .6876474    1.155516
parent_hig~u |   1.263334   .5748517     2.20   0.028     .1366457    2.390023
       _cons |   12.77734   .6300304    20.28   0.000      11.5425    14.01218
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       527
-------------+----------------------------------   F(9, 517)       =      6.36
       Model |  21.3283629         9  2.36981811   Prob > F        =    0.0000
    Residual |  192.492352       517  .372325632   R-squared       =    0.0997
-------------+----------------------------------   Adj R-squared   =    0.0841
       Total |  213.820715       526   .40650326   Root MSE        =    .61018

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .3798582   .0612321     6.20   0.000     .2595638    .5001525
           exp |   .0597336   .0323642     1.85   0.066    -.0038479    .1233151
        expsqr |  -.0012401   .0008641    -1.44   0.152    -.0029377    .0004575
     higheredu |   .0967891    .081708     1.18   0.237    -.0637313    .2573096
 parent_secedu |  -.0406358   .0753961    -0.54   0.590    -.1887563    .1074846
parent_highedu |   .0305084   .2593185     0.12   0.906    -.4789392     .539956
           _m1 |  -.3099628   .1177774    -2.63   0.009     -.541344   -.0785816
           _m2 |    .047709   .2904516     0.16   0.870    -.5229016    .6183196
           _m3 |   .0387683   .1607949     0.24   0.810    -.2771234      .35466
         _cons |   7.769619    .368412    21.09   0.000      7.04585    8.493388
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4259164          .        .       .            .           .
        rho1 |  -.4749495          .        .       .            .           .
        rho2 |   .0731035          .        .       .            .           .
        rho3 |   .0594039          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu  
> m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        527    8.178065    .6375761   5.298317   9.721166
        male |        527    .7381404    .4400643          0          1
         exp |        527    14.89753    6.310482          2         32
      expsqr |        527    261.6831    217.8646          4       1024
   higheredu |        527    .1290323    .3355542          0          1
-------------+---------------------------------------------------------
parent_sec~u |        527    .2049336    .4040366          0          1
parent_hig~u |        527    .0113852    .1061931          0          1
          m1 |        527    1.309008    .3971462   .4127845    2.95401
          m2 |        527   -.3648791    .2111295  -.7259849  -.0049211
          m3 |        527   -.4815368    .2562027  -.7260022   2.781404

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Non-specified Higheredu,) pva
> lue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) Parent Edu & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1992) + Prov
> incedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu prov
> incedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 166
> 67), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative 
> ins3_vs_entrant_relative  parent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -3941.415
Iteration 1:  Log likelihood = -3025.5534
Iteration 2:  Log likelihood = -2944.8357
Iteration 3:  Log likelihood = -2939.4844
Iteration 4:  Log likelihood =  -2939.455
Iteration 5:  Log likelihood =  -2939.455

Multinomial logistic regression                   Number of obs   =       4758
                                                  LR chi2(16)     =    2003.92
                                                  Prob > chi2     =     0.0000
Log likelihood =  -2939.455                       Pseudo R2       =     0.2542

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0201461    .117312    -0.17   0.864    -.2500734    .2097811
         exp |   -.626201   .0486821   -12.86   0.000    -.7216162   -.5307859
      expsqr |   .0102008   .0011869     8.59   0.000     .0078746    .0125271
ins1_secge~e |  -8.307994   .8501551    -9.77   0.000    -9.974268   -6.641721
ins2_highe~e |   .9071819   .1620318     5.60   0.000     .5896055    1.224758
ins3_vs_en~e |   1.365175   .7637747     1.79   0.074    -.1317956    2.862146
parent_sec~u |    .625599   .1357105     4.61   0.000     .3596114    .8915866
parent_hig~u |   1.041823   .6379798     1.63   0.102    -.2085947     2.29224
       _cons |   7.414201   .6573221    11.28   0.000     6.125873    8.702529
-------------+----------------------------------------------------------------
2            |
        male |   .0537835   .1062542     0.51   0.613    -.1544709     .262038
         exp |  -.9682699   .0449301   -21.55   0.000    -1.056331   -.8802086
      expsqr |   .0175077   .0010394    16.84   0.000     .0154705    .0195448
ins1_secge~e |  -10.43793   .8075062   -12.93   0.000    -12.02061   -8.855244
ins2_highe~e |   .2098414   .1901359     1.10   0.270    -.1628182    .5825009
ins3_vs_en~e |  -.8997782   .7434157    -1.21   0.226    -2.356846    .5572897
parent_sec~u |   .9215819   .1193565     7.72   0.000     .6876474    1.155516
parent_hig~u |   1.263334   .5748517     2.20   0.028     .1366457    2.390023
       _cons |   12.77734   .6300304    20.28   0.000      11.5425    14.01218
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       527
-------------+----------------------------------   F(23, 503)      =      4.19
       Model |  34.3902527        23  1.49522838   Prob > F        =    0.0000
    Residual |  179.430462       503    .3567206   R-squared       =    0.1608
-------------+----------------------------------   Adj R-squared   =    0.1225
       Total |  213.820715       526   .40650326   Root MSE        =    .59726

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .3847152    .061551     6.25   0.000     .2637866    .5056439
           exp |   .0811825    .041697     1.95   0.052    -.0007393    .1631043
        expsqr |  -.0017796   .0011181    -1.59   0.112    -.0039764    .0004171
     higheredu |    .066406    .082211     0.81   0.420    -.0951132    .2279252
 parent_secedu |  -.0501786   .0772333    -0.65   0.516    -.2019183     .101561
parent_highedu |  -.0214425   .2638824    -0.08   0.935    -.5398899     .497005
  provincedum2 |  -.2114167   .2468742    -0.86   0.392    -.6964483    .2736149
  provincedum3 |    .050908   .2768844     0.18   0.854    -.4930844    .5949003
  provincedum4 |   .2324255   .2947121     0.79   0.431    -.3465928    .8114438
  provincedum5 |    .325432   .1931172     1.69   0.093    -.0539838    .7048478
  provincedum6 |   .1854007   .2190954     0.85   0.398    -.2450542    .6158556
  provincedum7 |   .1271915   .2242918     0.57   0.571    -.3134727    .5678557
  provincedum8 |  -.0674297   .2286814    -0.29   0.768    -.5167181    .3818586
  provincedum9 |   .2864134    .200867     1.43   0.155    -.1082283     .681055
 provincedum10 |   .0163458   .2068561     0.08   0.937    -.3900626    .4227541
 provincedum11 |   .1480185   .2112499     0.70   0.484    -.2670223    .5630594
 provincedum12 |  -.1472674   .2148012    -0.69   0.493    -.5692854    .2747506
 provincedum13 |  -.1861351   .2100482    -0.89   0.376     -.598815    .2265447
 provincedum14 |  -.0868865   .2382518    -0.36   0.716    -.5549777    .3812047
 provincedum15 |  -.1531341   .2378081    -0.64   0.520    -.6203537    .3140855
           _m1 |  -.2819054   .2205099    -1.28   0.202    -.7151393    .1513284
           _m2 |   .0445611   .4914371     0.09   0.928    -.9209611    1.010083
           _m3 |   .1501591   .1737277     0.86   0.388    -.1911621    .4914804
         _cons |   7.565901   .5450227    13.88   0.000     6.495099    8.636702
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3896802          .        .       .            .           .
        rho1 |  -.4515952          .        .       .            .           .
        rho2 |   .0713841          .        .       .            .           .
        rho3 |   .2405457          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> rovincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        527    8.178065    .6375761   5.298317   9.721166
        male |        527    .7381404    .4400643          0          1
         exp |        527    14.89753    6.310482          2         32
      expsqr |        527    261.6831    217.8646          4       1024
   higheredu |        527    .1290323    .3355542          0          1
-------------+---------------------------------------------------------
parent_sec~u |        527    .2049336    .4040366          0          1
parent_hig~u |        527    .0113852    .1061931          0          1
provincedum2 |        527    .0265655    .1609624          0          1
provincedum3 |        527    .0170778    .1296845          0          1
provincedum4 |        527    .0113852    .1061931          0          1
-------------+---------------------------------------------------------
provincedum5 |        527    .0702087    .2557412          0          1
provincedum6 |        527    .0626186    .2425059          0          1
provincedum7 |        527    .0721063    .2589095          0          1
provincedum8 |        527    .0967742    .2959309          0          1
provincedum9 |        527    .0777989    .2681093          0          1
-------------+---------------------------------------------------------
provinced~10 |        527    .1157495    .3202283          0          1
provinced~11 |        527    .1252372    .3313021          0          1
provinced~12 |        527    .0398482    .1957883          0          1
provinced~13 |        527    .0759013    .2650918          0          1
provinced~14 |        527    .0474383    .2127765          0          1
-------------+---------------------------------------------------------
provinced~15 |        527    .0626186    .2425059          0          1
          m1 |        527    1.309008    .3971462   .4127845    2.95401
          m2 |        527   -.3648791    .2111295  -.7259849  -.0049211
          m3 |        527   -.4815368    .2562027  -.7260022   2.781404

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Non-specified Higheredu, Prov
> ince Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) Parent Edu & Specified higher education, Sec Gen + inrange(birthyear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative  parent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -3941.415
Iteration 1:  Log likelihood = -3025.5534
Iteration 2:  Log likelihood = -2944.8357
Iteration 3:  Log likelihood = -2939.4844
Iteration 4:  Log likelihood =  -2939.455
Iteration 5:  Log likelihood =  -2939.455

Multinomial logistic regression                   Number of obs   =       4758
                                                  LR chi2(16)     =    2003.92
                                                  Prob > chi2     =     0.0000
Log likelihood =  -2939.455                       Pseudo R2       =     0.2542

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0201461    .117312    -0.17   0.864    -.2500734    .2097811
         exp |   -.626201   .0486821   -12.86   0.000    -.7216162   -.5307859
      expsqr |   .0102008   .0011869     8.59   0.000     .0078746    .0125271
ins1_secge~e |  -8.307994   .8501551    -9.77   0.000    -9.974268   -6.641721
ins2_highe~e |   .9071819   .1620318     5.60   0.000     .5896055    1.224758
ins3_vs_en~e |   1.365175   .7637747     1.79   0.074    -.1317956    2.862146
parent_sec~u |    .625599   .1357105     4.61   0.000     .3596114    .8915866
parent_hig~u |   1.041823   .6379798     1.63   0.102    -.2085947     2.29224
       _cons |   7.414201   .6573221    11.28   0.000     6.125873    8.702529
-------------+----------------------------------------------------------------
2            |
        male |   .0537835   .1062542     0.51   0.613    -.1544709     .262038
         exp |  -.9682699   .0449301   -21.55   0.000    -1.056331   -.8802086
      expsqr |   .0175077   .0010394    16.84   0.000     .0154705    .0195448
ins1_secge~e |  -10.43793   .8075062   -12.93   0.000    -12.02061   -8.855244
ins2_highe~e |   .2098414   .1901359     1.10   0.270    -.1628182    .5825009
ins3_vs_en~e |  -.8997782   .7434157    -1.21   0.226    -2.356846    .5572897
parent_sec~u |   .9215819   .1193565     7.72   0.000     .6876474    1.155516
parent_hig~u |   1.263334   .5748517     2.20   0.028     .1366457    2.390023
       _cons |   12.77734   .6300304    20.28   0.000      11.5425    14.01218
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       976
-------------+----------------------------------   F(11, 964)      =      6.31
       Model |  25.8292673        11  2.34811521   Prob > F        =    0.0000
    Residual |  358.941337       964  .372345785   R-squared       =    0.0671
-------------+----------------------------------   Adj R-squared   =    0.0565
       Total |  384.770604       975  .394636517   Root MSE        =     .6102

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2602892   .0444518     5.86   0.000     .1730557    .3475227
           exp |  -.0208825   .0241888    -0.86   0.388    -.0683512    .0265863
        expsqr |   .0002804   .0006835     0.41   0.682    -.0010609    .0016216
    highvocedu |   .1891231   .0553931     3.41   0.001     .0804182    .2978281
    highgenedu |   .2507538   .0636314     3.94   0.000     .1258818    .3756259
      adultedu |   .0095739   .0885088     0.11   0.914    -.1641183     .183266
 parent_secedu |   .0608883   .0505779     1.20   0.229    -.0383671    .1601437
parent_highedu |   .0641877   .1501154     0.43   0.669    -.2304029    .3587784
           _m1 |  -.3642147   .2999108    -1.21   0.225    -.9527679    .2243386
           _m2 |   .0714614   .1043084     0.69   0.493    -.1332363    .2761591
           _m3 |  -.2858182   .2266477    -1.26   0.208    -.7305981    .1589616
         _cons |   7.876473   .1288772    61.12   0.000     7.623561    8.129385
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3994929          .        .       .            .           .
        rho1 |  -.5762393          .        .       .            .           .
        rho2 |   .1130621          .        .       .            .           .
        rho3 |   -.452205          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 2
> 00, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |        976    .7264344    .4460171          0          1
         exp |        976    12.90471    7.144669          1         32
      expsqr |        976    217.5256    231.5611          1       1024
  highvocedu |        976    .2612705    .4395522          0          1
-------------+---------------------------------------------------------
  highgenedu |        976    .2520492     .434412          0          1
    adultedu |        976    .0563525    .2307193          0          1
parent_sec~u |        976    .2633197    .4406602          0          1
parent_hig~u |        976    .0184426    .1346145          0          1
          m1 |        976   -.2396998    .1030539  -.6486635  -.0203998
-------------+---------------------------------------------------------
          m2 |        976     .791657    .6165953   .0131677   2.943417
          m3 |        976   -.3736038    .2576025  -.7260022   .3250637

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Specified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) Parent Edu & Specified higher education, Sec Gen + inrange(birthyear, 1971, 1992) + Pro
> vincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(mon
> thlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu ) dmf(2) showml
> ogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -3941.415
Iteration 1:  Log likelihood = -3025.5534
Iteration 2:  Log likelihood = -2944.8357
Iteration 3:  Log likelihood = -2939.4844
Iteration 4:  Log likelihood =  -2939.455
Iteration 5:  Log likelihood =  -2939.455

Multinomial logistic regression                   Number of obs   =       4758
                                                  LR chi2(16)     =    2003.92
                                                  Prob > chi2     =     0.0000
Log likelihood =  -2939.455                       Pseudo R2       =     0.2542

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0201461    .117312    -0.17   0.864    -.2500734    .2097811
         exp |   -.626201   .0486821   -12.86   0.000    -.7216162   -.5307859
      expsqr |   .0102008   .0011869     8.59   0.000     .0078746    .0125271
ins1_secge~e |  -8.307994   .8501551    -9.77   0.000    -9.974268   -6.641721
ins2_highe~e |   .9071819   .1620318     5.60   0.000     .5896055    1.224758
ins3_vs_en~e |   1.365175   .7637747     1.79   0.074    -.1317956    2.862146
parent_sec~u |    .625599   .1357105     4.61   0.000     .3596114    .8915866
parent_hig~u |   1.041823   .6379798     1.63   0.102    -.2085947     2.29224
       _cons |   7.414201   .6573221    11.28   0.000     6.125873    8.702529
-------------+----------------------------------------------------------------
2            |
        male |   .0537835   .1062542     0.51   0.613    -.1544709     .262038
         exp |  -.9682699   .0449301   -21.55   0.000    -1.056331   -.8802086
      expsqr |   .0175077   .0010394    16.84   0.000     .0154705    .0195448
ins1_secge~e |  -10.43793   .8075062   -12.93   0.000    -12.02061   -8.855244
ins2_highe~e |   .2098414   .1901359     1.10   0.270    -.1628182    .5825009
ins3_vs_en~e |  -.8997782   .7434157    -1.21   0.226    -2.356846    .5572897
parent_sec~u |   .9215819   .1193565     7.72   0.000     .6876474    1.155516
parent_hig~u |   1.263334   .5748517     2.20   0.028     .1366457    2.390023
       _cons |   12.77734   .6300304    20.28   0.000      11.5425    14.01218
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       976
-------------+----------------------------------   F(25, 950)      =      4.78
       Model |  43.0274453        25  1.72109781   Prob > F        =    0.0000
    Residual |  341.743159       950  .359729641   R-squared       =    0.1118
-------------+----------------------------------   Adj R-squared   =    0.0885
       Total |  384.770604       975  .394636517   Root MSE        =    .59977

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2490894   .0440308     5.66   0.000     .1626805    .3354983
           exp |  -.0017122   .0281489    -0.06   0.952    -.0569535    .0535291
        expsqr |  -.0002257   .0007559    -0.30   0.765    -.0017092    .0012578
    highvocedu |   .1954414   .0563467     3.47   0.001      .084863    .3060199
    highgenedu |   .2317812   .0652831     3.55   0.000     .1036655     .359897
      adultedu |   .0254685   .0886128     0.29   0.774     -.148431     .199368
 parent_secedu |   .0250726   .0540471     0.46   0.643    -.0809928     .131138
parent_highedu |   .0844776   .1511385     0.56   0.576    -.2121262    .3810814
  provincedum2 |  -.3173402   .1724812    -1.84   0.066    -.6558283    .0211479
  provincedum3 |  -.5183342   .1820489    -2.85   0.005    -.8755986   -.1610699
  provincedum4 |  -.4693824    .221397    -2.12   0.034     -.903866   -.0348987
  provincedum5 |  -.1051474   .1428175    -0.74   0.462    -.3854216    .1751268
  provincedum6 |  -.1604914   .1589941    -1.01   0.313    -.4725116    .1515289
  provincedum7 |  -.2248578    .163787    -1.37   0.170    -.5462839    .0965683
  provincedum8 |  -.4245426   .1612909    -2.63   0.009    -.7410702    -.108015
  provincedum9 |  -.0276642   .1462324    -0.19   0.850    -.3146401    .2593117
 provincedum10 |  -.1313624   .1485146    -0.88   0.377    -.4228169    .1600922
 provincedum11 |  -.2097507   .1577884    -1.33   0.184    -.5194048    .0999035
 provincedum12 |  -.3212449   .1792807    -1.79   0.073    -.6730768     .030587
 provincedum13 |  -.2926748   .1600531    -1.83   0.068    -.6067734    .0214237
 provincedum14 |  -.2104198   .1730257    -1.22   0.224    -.5499765    .1291369
 provincedum15 |  -.4276282   .1585093    -2.70   0.007    -.7386971   -.1165594
           _m1 |   .2997713   .4135267     0.72   0.469    -.5117601    1.111303
           _m2 |   -.088369   .1326942    -0.67   0.506    -.3487767    .1720386
           _m3 |  -.3475491   .2399954    -1.45   0.148    -.8185315    .1234333
         _cons |   8.247874    .228974    36.02   0.000     7.798521    8.697228
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .372841          .        .       .            .           .
        rho1 |   .4909397          .        .       .            .           .
        rho2 |  -.1447233          .        .       .            .           .
        rho3 |  -.5691861          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) 
> & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        976    8.238095     .628201    5.37836   9.645658
        male |        976    .7264344    .4460171          0          1
         exp |        976    12.90471    7.144669          1         32
      expsqr |        976    217.5256    231.5611          1       1024
  highvocedu |        976    .2612705    .4395522          0          1
-------------+---------------------------------------------------------
  highgenedu |        976    .2520492     .434412          0          1
    adultedu |        976    .0563525    .2307193          0          1
parent_sec~u |        976    .2633197    .4406602          0          1
parent_hig~u |        976    .0184426    .1346145          0          1
provincedum2 |        976     .039959    .1959634          0          1
-------------+---------------------------------------------------------
provincedum3 |        976    .0245902    .1549519          0          1
provincedum4 |        976    .0112705    .1056167          0          1
provincedum5 |        976    .0860656    .2806046          0          1
provincedum6 |        976    .0717213    .2581582          0          1
provincedum7 |        976    .0727459    .2598521          0          1
-------------+---------------------------------------------------------
provincedum8 |        976    .1260246    .3320472          0          1
provincedum9 |        976     .107582    .3100106          0          1
provinced~10 |        976    .1034836    .3047456          0          1
provinced~11 |        976     .107582    .3100106          0          1
provinced~12 |        976     .022541    .1485109          0          1
-------------+---------------------------------------------------------
provinced~13 |        976    .0491803    .2163552          0          1
provinced~14 |        976    .0481557     .214205          0          1
provinced~15 |        976    .0809426    .2728868          0          1
          m1 |        976   -.2396998    .1030539  -.6486635  -.0203998
          m2 |        976     .791657    .6165953   .0131677   2.943417
-------------+---------------------------------------------------------
          m3 |        976   -.3736038    .2576025  -.7260022   .3250637

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) Parent Edu & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu if i
> nrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp ex
> psqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  p
> arent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -3941.415
Iteration 1:  Log likelihood = -3025.5534
Iteration 2:  Log likelihood = -2944.8357
Iteration 3:  Log likelihood = -2939.4844
Iteration 4:  Log likelihood =  -2939.455
Iteration 5:  Log likelihood =  -2939.455

Multinomial logistic regression                   Number of obs   =       4758
                                                  LR chi2(16)     =    2003.92
                                                  Prob > chi2     =     0.0000
Log likelihood =  -2939.455                       Pseudo R2       =     0.2542

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0201461    .117312    -0.17   0.864    -.2500734    .2097811
         exp |   -.626201   .0486821   -12.86   0.000    -.7216162   -.5307859
      expsqr |   .0102008   .0011869     8.59   0.000     .0078746    .0125271
ins1_secge~e |  -8.307994   .8501551    -9.77   0.000    -9.974268   -6.641721
ins2_highe~e |   .9071819   .1620318     5.60   0.000     .5896055    1.224758
ins3_vs_en~e |   1.365175   .7637747     1.79   0.074    -.1317956    2.862146
parent_sec~u |    .625599   .1357105     4.61   0.000     .3596114    .8915866
parent_hig~u |   1.041823   .6379798     1.63   0.102    -.2085947     2.29224
       _cons |   7.414201   .6573221    11.28   0.000     6.125873    8.702529
-------------+----------------------------------------------------------------
2            |
        male |   .0537835   .1062542     0.51   0.613    -.1544709     .262038
         exp |  -.9682699   .0449301   -21.55   0.000    -1.056331   -.8802086
      expsqr |   .0175077   .0010394    16.84   0.000     .0154705    .0195448
ins1_secge~e |  -10.43793   .8075062   -12.93   0.000    -12.02061   -8.855244
ins2_highe~e |   .2098414   .1901359     1.10   0.270    -.1628182    .5825009
ins3_vs_en~e |  -.8997782   .7434157    -1.21   0.226    -2.356846    .5572897
parent_sec~u |   .9215819   .1193565     7.72   0.000     .6876474    1.155516
parent_hig~u |   1.263334   .5748517     2.20   0.028     .1366457    2.390023
       _cons |   12.77734   .6300304    20.28   0.000      11.5425    14.01218
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       976
-------------+----------------------------------   F(9, 966)       =      6.99
       Model |   23.540012         9  2.61555689   Prob > F        =    0.0000
    Residual |  361.230592       966  .373944712   R-squared       =    0.0612
-------------+----------------------------------   Adj R-squared   =    0.0524
       Total |  384.770604       975  .394636517   Root MSE        =    .61151

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2645264    .044413     5.96   0.000     .1773693    .3516835
           exp |  -.0281053   .0240337    -1.17   0.243    -.0752697    .0190591
        expsqr |    .000424   .0006819     0.62   0.534    -.0009141    .0017622
     higheredu |   .1734914   .0488887     3.55   0.000     .0775511    .2694318
 parent_secedu |   .0669145   .0505456     1.32   0.186    -.0322774    .1661065
parent_highedu |   .0725558   .1501915     0.48   0.629    -.2221834    .3672949
           _m1 |  -.3154214   .2985789    -1.06   0.291    -.9013594    .2705167
           _m2 |   .0743696   .1045113     0.71   0.477    -.1307256    .2794649
           _m3 |  -.2647036   .2269714    -1.17   0.244    -.7101175    .1807102
         _cons |   7.965222   .1222065    65.18   0.000     7.725401    8.205043
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3945498          .        .       .            .           .
        rho1 |  -.5021578          .        .       .            .           .
        rho2 |   .1183981          .        .       .            .           .
        rho3 |   -.421414          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu  
> m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        976    8.238095     .628201    5.37836   9.645658
        male |        976    .7264344    .4460171          0          1
         exp |        976    12.90471    7.144669          1         32
      expsqr |        976    217.5256    231.5611          1       1024
   higheredu |        976    .5696721    .4953758          0          1
-------------+---------------------------------------------------------
parent_sec~u |        976    .2633197    .4406602          0          1
parent_hig~u |        976    .0184426    .1346145          0          1
          m1 |        976   -.2396998    .1030539  -.6486635  -.0203998
          m2 |        976     .791657    .6165953   .0131677   2.943417
          m3 |        976   -.3736038    .2576025  -.7260022   .3250637

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Non-specified Higheredu,) pva
> lue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) Parent Edu & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1992) + Prov
> incedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu prov
> incedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 166
> 67), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative 
> ins3_vs_entrant_relative  parent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood =  -3941.415
Iteration 1:  Log likelihood = -3025.5534
Iteration 2:  Log likelihood = -2944.8357
Iteration 3:  Log likelihood = -2939.4844
Iteration 4:  Log likelihood =  -2939.455
Iteration 5:  Log likelihood =  -2939.455

Multinomial logistic regression                   Number of obs   =       4758
                                                  LR chi2(16)     =    2003.92
                                                  Prob > chi2     =     0.0000
Log likelihood =  -2939.455                       Pseudo R2       =     0.2542

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0201461    .117312    -0.17   0.864    -.2500734    .2097811
         exp |   -.626201   .0486821   -12.86   0.000    -.7216162   -.5307859
      expsqr |   .0102008   .0011869     8.59   0.000     .0078746    .0125271
ins1_secge~e |  -8.307994   .8501551    -9.77   0.000    -9.974268   -6.641721
ins2_highe~e |   .9071819   .1620318     5.60   0.000     .5896055    1.224758
ins3_vs_en~e |   1.365175   .7637747     1.79   0.074    -.1317956    2.862146
parent_sec~u |    .625599   .1357105     4.61   0.000     .3596114    .8915866
parent_hig~u |   1.041823   .6379798     1.63   0.102    -.2085947     2.29224
       _cons |   7.414201   .6573221    11.28   0.000     6.125873    8.702529
-------------+----------------------------------------------------------------
2            |
        male |   .0537835   .1062542     0.51   0.613    -.1544709     .262038
         exp |  -.9682699   .0449301   -21.55   0.000    -1.056331   -.8802086
      expsqr |   .0175077   .0010394    16.84   0.000     .0154705    .0195448
ins1_secge~e |  -10.43793   .8075062   -12.93   0.000    -12.02061   -8.855244
ins2_highe~e |   .2098414   .1901359     1.10   0.270    -.1628182    .5825009
ins3_vs_en~e |  -.8997782   .7434157    -1.21   0.226    -2.356846    .5572897
parent_sec~u |   .9215819   .1193565     7.72   0.000     .6876474    1.155516
parent_hig~u |   1.263334   .5748517     2.20   0.028     .1366457    2.390023
       _cons |   12.77734   .6300304    20.28   0.000      11.5425    14.01218
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       976
-------------+----------------------------------   F(23, 952)      =      4.99
       Model |  41.4090546        23  1.80039368   Prob > F        =    0.0000
    Residual |  343.361549       952  .360673896   R-squared       =    0.1076
-------------+----------------------------------   Adj R-squared   =    0.0861
       Total |  384.770604       975  .394636517   Root MSE        =    .60056

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2527989   .0439669     5.75   0.000     .1665156    .3390822
           exp |  -.0057878   .0281051    -0.21   0.837    -.0609429    .0493673
        expsqr |  -.0001503    .000756    -0.20   0.842    -.0016338    .0013333
     higheredu |    .172177   .0500824     3.44   0.001     .0738923    .2704617
 parent_secedu |   .0268463   .0540337     0.50   0.619    -.0791927    .1328853
parent_highedu |    .095947   .1509873     0.64   0.525    -.2003593    .3922533
  provincedum2 |  -.3420942   .1719712    -1.99   0.047    -.6795806   -.0046078
  provincedum3 |  -.5232262   .1819416    -2.88   0.004    -.8802791   -.1661732
  provincedum4 |  -.4793594   .2214132    -2.16   0.031    -.9138737    -.044845
  provincedum5 |  -.1130833   .1429099    -0.79   0.429    -.3935382    .1673716
  provincedum6 |  -.1705909   .1589451    -1.07   0.283    -.4825143    .1413324
  provincedum7 |  -.2412481   .1634357    -1.48   0.140    -.5619841    .0794878
  provincedum8 |  -.4434204   .1608932    -2.76   0.006    -.7591667    -.127674
  provincedum9 |  -.0417778   .1459541    -0.29   0.775    -.3282068    .2446511
 provincedum10 |  -.1504502   .1479295    -1.02   0.309    -.4407559    .1398554
 provincedum11 |  -.2298434   .1575754    -1.46   0.145    -.5390787    .0793919
 provincedum12 |  -.3714968   .1779411    -2.09   0.037     -.720699   -.0222947
 provincedum13 |  -.3220958   .1595682    -2.02   0.044    -.6352419   -.0089497
 provincedum14 |  -.2374547   .1725605    -1.38   0.169    -.5760975    .1011882
 provincedum15 |  -.4456616   .1578604    -2.82   0.005    -.7554561   -.1358671
           _m1 |   .3636845   .4090584     0.89   0.374    -.4390759    1.166445
           _m2 |  -.0961193   .1327293    -0.72   0.469    -.3565951    .1643566
           _m3 |  -.3294894   .2401521    -1.37   0.170     -.800778    .1417992
         _cons |   8.338932   .2216065    37.63   0.000     7.904039    8.773826
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .384946          .        .       .            .           .
        rho1 |   .5861718          .        .       .            .           .
        rho2 |  -.1549211          .        .       .            .           .
        rho3 |  -.5310575          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> rovincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        976    8.238095     .628201    5.37836   9.645658
        male |        976    .7264344    .4460171          0          1
         exp |        976    12.90471    7.144669          1         32
      expsqr |        976    217.5256    231.5611          1       1024
   higheredu |        976    .5696721    .4953758          0          1
-------------+---------------------------------------------------------
parent_sec~u |        976    .2633197    .4406602          0          1
parent_hig~u |        976    .0184426    .1346145          0          1
provincedum2 |        976     .039959    .1959634          0          1
provincedum3 |        976    .0245902    .1549519          0          1
provincedum4 |        976    .0112705    .1056167          0          1
-------------+---------------------------------------------------------
provincedum5 |        976    .0860656    .2806046          0          1
provincedum6 |        976    .0717213    .2581582          0          1
provincedum7 |        976    .0727459    .2598521          0          1
provincedum8 |        976    .1260246    .3320472          0          1
provincedum9 |        976     .107582    .3100106          0          1
-------------+---------------------------------------------------------
provinced~10 |        976    .1034836    .3047456          0          1
provinced~11 |        976     .107582    .3100106          0          1
provinced~12 |        976     .022541    .1485109          0          1
provinced~13 |        976    .0491803    .2163552          0          1
provinced~14 |        976    .0481557     .214205          0          1
-------------+---------------------------------------------------------
provinced~15 |        976    .0809426    .2728868          0          1
          m1 |        976   -.2396998    .1030539  -.6486635  -.0203998
          m2 |        976     .791657    .6165953   .0131677   2.943417
          m3 |        976   -.3736038    .2576025  -.7260022   .3250637

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Non-specified Higheredu, Prov
> ince Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) Parent Party Membership & Specified higher education, Sec Voc + inrange(birthyear, 1971
> , 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=
> male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_
> relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3943.8986
Iteration 1:  Log likelihood = -3048.9239
Iteration 2:  Log likelihood = -2973.6874
Iteration 3:  Log likelihood = -2968.8368
Iteration 4:  Log likelihood = -2968.8123
Iteration 5:  Log likelihood = -2968.8123

Multinomial logistic regression                   Number of obs   =       4763
                                                  LR chi2(14)     =    1950.17
                                                  Prob > chi2     =     0.0000
Log likelihood = -2968.8123                       Pseudo R2       =     0.2472

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0161021   .1168382    -0.14   0.890    -.2451007    .2128965
         exp |  -.6137389   .0482994   -12.71   0.000    -.7084039   -.5190739
      expsqr |   .0097811   .0011772     8.31   0.000     .0074739    .0120884
ins1_secge~e |  -8.080565   .8467129    -9.54   0.000    -9.740092   -6.421038
ins2_highe~e |   .8450143   .1646406     5.13   0.000     .5223245    1.167704
ins3_vs_en~e |   1.022624   .7631241     1.34   0.180    -.4730718    2.518319
parent_par~r |   .5300473   .1392209     3.81   0.000     .2571794    .8029152
       _cons |   7.418157   .6547951    11.33   0.000     6.134782    8.701532
-------------+----------------------------------------------------------------
2            |
        male |   .0622379   .1051327     0.59   0.554    -.1438185    .2682942
         exp |  -.9519572   .0444263   -21.43   0.000    -1.039031   -.8648832
      expsqr |   .0169418   .0010261    16.51   0.000     .0149306    .0189529
ins1_secge~e |  -10.20928   .8023764   -12.72   0.000    -11.78191   -8.636648
ins2_highe~e |   .1388683    .191702     0.72   0.469    -.2368607    .5145973
ins3_vs_en~e |  -1.222146   .7367727    -1.66   0.097    -2.666194    .2219018
parent_par~r |   .6578424   .1234454     5.33   0.000     .4158939     .899791
       _cons |   12.81017   .6262191    20.46   0.000     11.58281    14.03754
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(10, 515)      =      5.58
       Model |  20.8679494        10  2.08679494   Prob > F        =    0.0000
    Residual |  192.618154       515  .374015833   R-squared       =    0.0977
-------------+----------------------------------   Adj R-squared   =    0.0802
       Total |  213.486103       525  .406640197   Root MSE        =    .61157

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3814976   .0614254     6.21   0.000     .2608224    .5021729
               exp |   .0630577   .0352289     1.79   0.074    -.0061523    .1322678
            expsqr |  -.0013748   .0009314    -1.48   0.141    -.0032046     .000455
        highvocedu |   .0471726   .0986338     0.48   0.633    -.1466014    .2409466
        highgenedu |    .147255   .2545538     0.58   0.563    -.3528366    .6473465
          adultedu |   .1714758   .1549176     1.11   0.269    -.1328724    .4758241
parent_partymember |   .0048969   .0778868     0.06   0.950     -.148118    .1579118
               _m1 |  -.2824473     .13096    -2.16   0.031     -.539729   -.0251657
               _m2 |   .1000032   .3116202     0.32   0.748    -.5121999    .7122063
               _m3 |   .1061819    .249262     0.43   0.670    -.3835135    .5958774
             _cons |   7.763052   .3807378    20.39   0.000     7.015061    8.511042
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4178994          .        .       .            .           .
        rho1 |  -.4369197          .        .       .            .           .
        rho2 |   .1546956          .        .       .            .           .
        rho3 |   .1642536          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        526    8.176781    .6376835   5.298317   9.721166
        male |        526    .7376426    .4403347          0          1
         exp |        526    14.89734    6.325527          2         32
      expsqr |        526    261.8669     218.597          4       1024
  highvocedu |        526    .0855513    .2799666          0          1
-------------+---------------------------------------------------------
  highgenedu |        526    .0114068     .106293          0          1
    adultedu |        526    .0323194    .1770153          0          1
parent_par~r |        526    .1711027    .3769571          0          1
          m1 |        526    1.312092    .3863108   .4055244   2.801401
          m2 |        526   -.3657955    .2081278  -.7260023  -.0086511
-------------+---------------------------------------------------------
          m3 |        526    -.489524    .2234435  -.7260007   1.241924

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Specified Higher
> edu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) Parent Party Membership & Specified higher education, Sec Voc + inrange(birthyear, 1971
> , 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearnin
> g, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3943.8986
Iteration 1:  Log likelihood = -3048.9239
Iteration 2:  Log likelihood = -2973.6874
Iteration 3:  Log likelihood = -2968.8368
Iteration 4:  Log likelihood = -2968.8123
Iteration 5:  Log likelihood = -2968.8123

Multinomial logistic regression                   Number of obs   =       4763
                                                  LR chi2(14)     =    1950.17
                                                  Prob > chi2     =     0.0000
Log likelihood = -2968.8123                       Pseudo R2       =     0.2472

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0161021   .1168382    -0.14   0.890    -.2451007    .2128965
         exp |  -.6137389   .0482994   -12.71   0.000    -.7084039   -.5190739
      expsqr |   .0097811   .0011772     8.31   0.000     .0074739    .0120884
ins1_secge~e |  -8.080565   .8467129    -9.54   0.000    -9.740092   -6.421038
ins2_highe~e |   .8450143   .1646406     5.13   0.000     .5223245    1.167704
ins3_vs_en~e |   1.022624   .7631241     1.34   0.180    -.4730718    2.518319
parent_par~r |   .5300473   .1392209     3.81   0.000     .2571794    .8029152
       _cons |   7.418157   .6547951    11.33   0.000     6.134782    8.701532
-------------+----------------------------------------------------------------
2            |
        male |   .0622379   .1051327     0.59   0.554    -.1438185    .2682942
         exp |  -.9519572   .0444263   -21.43   0.000    -1.039031   -.8648832
      expsqr |   .0169418   .0010261    16.51   0.000     .0149306    .0189529
ins1_secge~e |  -10.20928   .8023764   -12.72   0.000    -11.78191   -8.636648
ins2_highe~e |   .1388683    .191702     0.72   0.469    -.2368607    .5145973
ins3_vs_en~e |  -1.222146   .7367727    -1.66   0.097    -2.666194    .2219018
parent_par~r |   .6578424   .1234454     5.33   0.000     .4158939     .899791
       _cons |   12.81017   .6262191    20.46   0.000     11.58281    14.03754
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(24, 501)      =      4.03
       Model |  34.5506274        24  1.43960948   Prob > F        =    0.0000
    Residual |  178.935476       501  .357156639   R-squared       =    0.1618
-------------+----------------------------------   Adj R-squared   =    0.1217
       Total |  213.486103       525  .406640197   Root MSE        =    .59763

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3865356   .0616011     6.27   0.000     .2655073     .507564
               exp |   .0873922   .0439153     1.99   0.047     .0011113     .173673
            expsqr |  -.0019534   .0011634    -1.68   0.094    -.0042391    .0003323
        highvocedu |  -.0063898   .0996432    -0.06   0.949    -.2021597    .1893802
        highgenedu |   .1756062   .2541692     0.69   0.490    -.3237626    .6749751
          adultedu |   .1636746   .1529296     1.07   0.285    -.1367877    .4641369
parent_partymember |   .0154316   .0792011     0.19   0.846    -.1401756    .1710388
      provincedum2 |  -.2045745    .253996    -0.81   0.421     -.703603    .2944541
      provincedum3 |   .0836335   .2892354     0.29   0.773    -.4846304    .6518973
      provincedum4 |   .2344498   .2985315     0.79   0.433    -.3520782    .8209777
      provincedum5 |   .3689625   .2023372     1.82   0.069    -.0285715    .7664964
      provincedum6 |   .2206533   .2261606     0.98   0.330    -.2236868    .6649934
      provincedum7 |     .15175   .2360928     0.64   0.521     -.312104    .6156041
      provincedum8 |   -.040999   .2354018    -0.17   0.862    -.5034953    .4214974
      provincedum9 |   .3083779    .210822     1.46   0.144    -.1058261     .722582
     provincedum10 |   .0403757   .2147111     0.19   0.851    -.3814693    .4622208
     provincedum11 |   .1743001   .2207273     0.79   0.430     -.259365    .6079652
     provincedum12 |  -.1149688   .2211208    -0.52   0.603     -.549407    .3194695
     provincedum13 |  -.1677076   .2169276    -0.77   0.440    -.5939075    .2584923
     provincedum14 |   -.069761    .246752    -0.28   0.778    -.5545571    .4150352
     provincedum15 |  -.1221012   .2501801    -0.49   0.626    -.6136326    .3694301
               _m1 |  -.2845147   .2435792    -1.17   0.243    -.7630772    .1940478
               _m2 |   .1637455    .536655     0.31   0.760    -.8906261    1.218117
               _m3 |   .2929066   .2765017     1.06   0.290    -.2503391    .8361524
             _cons |   7.600846   .5823288    13.05   0.000     6.456738    8.744953
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3933211          .        .       .            .           .
        rho1 |  -.4536606          .        .       .            .           .
        rho2 |   .2610933          .        .       .            .           .
        rho3 |   .4670416          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(
> monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        526    8.176781    .6376835   5.298317   9.721166
        male |        526    .7376426    .4403347          0          1
         exp |        526    14.89734    6.325527          2         32
      expsqr |        526    261.8669     218.597          4       1024
  highvocedu |        526    .0855513    .2799666          0          1
-------------+---------------------------------------------------------
  highgenedu |        526    .0114068     .106293          0          1
    adultedu |        526    .0323194    .1770153          0          1
parent_par~r |        526    .1711027    .3769571          0          1
provincedum2 |        526     .026616    .1611115          0          1
provincedum3 |        526    .0171103    .1298058          0          1
-------------+---------------------------------------------------------
provincedum4 |        526    .0114068     .106293          0          1
provincedum5 |        526    .0703422    .2559663          0          1
provincedum6 |        526    .0627376    .2427213          0          1
provincedum7 |        526    .0722433    .2591369          0          1
provincedum8 |        526    .0988593    .2987572          0          1
-------------+---------------------------------------------------------
provincedum9 |        526    .0779468     .268343          0          1
provinced~10 |        526    .1159696    .3204932          0          1
provinced~11 |        526    .1254753    .3315724          0          1
provinced~12 |        526     .039924    .1959669          0          1
provinced~13 |        526    .0760456    .2653234          0          1
-------------+---------------------------------------------------------
provinced~14 |        526    .0475285     .212969          0          1
provinced~15 |        526    .0627376    .2427213          0          1
          m1 |        526    1.312092    .3863108   .4055244   2.801401
          m2 |        526   -.3657955    .2081278  -.7260023  -.0086511
          m3 |        526    -.489524    .2234435  -.7260007   1.241924

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Specified Higher
> edu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) Parent Party Membership & Combined higher education, Sec Voc + inrange(birthyear, 1971,
>  1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_partymember if inrange(bir
> thyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_
> secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_part
> ymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3943.8986
Iteration 1:  Log likelihood = -3048.9239
Iteration 2:  Log likelihood = -2973.6874
Iteration 3:  Log likelihood = -2968.8368
Iteration 4:  Log likelihood = -2968.8123
Iteration 5:  Log likelihood = -2968.8123

Multinomial logistic regression                   Number of obs   =       4763
                                                  LR chi2(14)     =    1950.17
                                                  Prob > chi2     =     0.0000
Log likelihood = -2968.8123                       Pseudo R2       =     0.2472

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0161021   .1168382    -0.14   0.890    -.2451007    .2128965
         exp |  -.6137389   .0482994   -12.71   0.000    -.7084039   -.5190739
      expsqr |   .0097811   .0011772     8.31   0.000     .0074739    .0120884
ins1_secge~e |  -8.080565   .8467129    -9.54   0.000    -9.740092   -6.421038
ins2_highe~e |   .8450143   .1646406     5.13   0.000     .5223245    1.167704
ins3_vs_en~e |   1.022624   .7631241     1.34   0.180    -.4730718    2.518319
parent_par~r |   .5300473   .1392209     3.81   0.000     .2571794    .8029152
       _cons |   7.418157   .6547951    11.33   0.000     6.134782    8.701532
-------------+----------------------------------------------------------------
2            |
        male |   .0622379   .1051327     0.59   0.554    -.1438185    .2682942
         exp |  -.9519572   .0444263   -21.43   0.000    -1.039031   -.8648832
      expsqr |   .0169418   .0010261    16.51   0.000     .0149306    .0189529
ins1_secge~e |  -10.20928   .8023764   -12.72   0.000    -11.78191   -8.636648
ins2_highe~e |   .1388683    .191702     0.72   0.469    -.2368607    .5145973
ins3_vs_en~e |  -1.222146   .7367727    -1.66   0.097    -2.666194    .2219018
parent_par~r |   .6578424   .1234454     5.33   0.000     .4158939     .899791
       _cons |   12.81017   .6262191    20.46   0.000     11.58281    14.03754
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(8, 517)       =      6.93
       Model |   20.664569         8  2.58307113   Prob > F        =    0.0000
    Residual |  192.821534       517  .372962349   R-squared       =    0.0968
-------------+----------------------------------   Adj R-squared   =    0.0828
       Total |  213.486103       525  .406640197   Root MSE        =    .61071

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3790902    .061209     6.19   0.000     .2588414     .499339
               exp |   .0628071    .035177     1.79   0.075    -.0063003    .1319145
            expsqr |  -.0013513   .0009295    -1.45   0.147    -.0031774    .0004748
         higheredu |   .0874988   .0818449     1.07   0.286    -.0732907    .2482883
parent_partymember |  -.0018813   .0771981    -0.02   0.981    -.1535419    .1497793
               _m1 |  -.2959469   .1289545    -2.29   0.022    -.5492862   -.0426076
               _m2 |   .1251956   .3086785     0.41   0.685    -.4812228     .731614
               _m3 |   .1215332   .2480407     0.49   0.624    -.3657584    .6088247
             _cons |   7.797966   .3763152    20.72   0.000     7.058671    8.537261
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4241438          .        .       .            .           .
        rho1 |  -.4544198          .        .       .            .           .
        rho2 |   .1922351          .        .       .            .           .
        rho3 |   .1866114          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_partymember  m1 m2 m3 i
> f inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_partymember m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        526    8.176781    .6376835   5.298317   9.721166
        male |        526    .7376426    .4403347          0          1
         exp |        526    14.89734    6.325527          2         32
      expsqr |        526    261.8669     218.597          4       1024
   higheredu |        526    .1292776    .3358263          0          1
-------------+---------------------------------------------------------
parent_par~r |        526    .1711027    .3769571          0          1
          m1 |        526    1.312092    .3863108   .4055244   2.801401
          m2 |        526   -.3657955    .2081278  -.7260023  -.0086511
          m3 |        526    -.489524    .2234435  -.7260007   1.241924

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Non-specified Hi
> gheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) Parent Party Membership & Combined higher education, Sec Voc + inrange(birthyear, 1971,
>  1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_partymember provincedum2-p
> rovincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3943.8986
Iteration 1:  Log likelihood = -3048.9239
Iteration 2:  Log likelihood = -2973.6874
Iteration 3:  Log likelihood = -2968.8368
Iteration 4:  Log likelihood = -2968.8123
Iteration 5:  Log likelihood = -2968.8123

Multinomial logistic regression                   Number of obs   =       4763
                                                  LR chi2(14)     =    1950.17
                                                  Prob > chi2     =     0.0000
Log likelihood = -2968.8123                       Pseudo R2       =     0.2472

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0161021   .1168382    -0.14   0.890    -.2451007    .2128965
         exp |  -.6137389   .0482994   -12.71   0.000    -.7084039   -.5190739
      expsqr |   .0097811   .0011772     8.31   0.000     .0074739    .0120884
ins1_secge~e |  -8.080565   .8467129    -9.54   0.000    -9.740092   -6.421038
ins2_highe~e |   .8450143   .1646406     5.13   0.000     .5223245    1.167704
ins3_vs_en~e |   1.022624   .7631241     1.34   0.180    -.4730718    2.518319
parent_par~r |   .5300473   .1392209     3.81   0.000     .2571794    .8029152
       _cons |   7.418157   .6547951    11.33   0.000     6.134782    8.701532
-------------+----------------------------------------------------------------
2            |
        male |   .0622379   .1051327     0.59   0.554    -.1438185    .2682942
         exp |  -.9519572   .0444263   -21.43   0.000    -1.039031   -.8648832
      expsqr |   .0169418   .0010261    16.51   0.000     .0149306    .0189529
ins1_secge~e |  -10.20928   .8023764   -12.72   0.000    -11.78191   -8.636648
ins2_highe~e |   .1388683    .191702     0.72   0.469    -.2368607    .5145973
ins3_vs_en~e |  -1.222146   .7367727    -1.66   0.097    -2.666194    .2219018
parent_par~r |   .6578424   .1234454     5.33   0.000     .4158939     .899791
       _cons |   12.81017   .6262191    20.46   0.000     11.58281    14.03754
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       526
-------------+----------------------------------   F(22, 503)      =      4.35
       Model |  34.1304457        22   1.5513839   Prob > F        =    0.0000
    Residual |  179.355658       503  .356571884   R-squared       =    0.1599
-------------+----------------------------------   Adj R-squared   =    0.1231
       Total |  213.486103       525  .406640197   Root MSE        =    .59714

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |    .384786   .0614655     6.26   0.000     .2640252    .5055468
               exp |   .0845455   .0437845     1.93   0.054    -.0014775    .1705685
            expsqr |  -.0018542   .0011586    -1.60   0.110    -.0041306    .0004221
         higheredu |   .0546542    .082121     0.67   0.506    -.1066883    .2159967
parent_partymember |   .0058756   .0786431     0.07   0.940    -.1486339    .1603851
      provincedum2 |  -.1906615   .2534458    -0.75   0.452    -.6886044    .3072813
      provincedum3 |   .0993654   .2878015     0.35   0.730    -.4660758    .6648065
      provincedum4 |   .2589178   .2972675     0.87   0.384    -.3251211    .8429566
      provincedum5 |   .3636562   .2021122     1.80   0.073    -.0334319    .7607444
      provincedum6 |   .2217043   .2259528     0.98   0.327    -.2222231    .6656318
      provincedum7 |   .1566249   .2358546     0.66   0.507    -.3067566    .6200065
      provincedum8 |  -.0266602   .2343923    -0.11   0.909    -.4871688    .4338484
      provincedum9 |   .3206411   .2102852     1.52   0.128    -.0925044    .7337867
     provincedum10 |    .048328     .21441     0.23   0.822    -.3729216    .4695775
     provincedum11 |   .1847565   .2203276     0.84   0.402    -.2481193    .6176323
     provincedum12 |  -.1123016   .2209133    -0.51   0.611     -.546328    .3217248
     provincedum13 |  -.1601264   .2166357    -0.74   0.460    -.5857487    .2654958
     provincedum14 |   -.052461   .2458973    -0.21   0.831    -.5355733    .4306513
     provincedum15 |  -.1143454   .2498679    -0.46   0.647    -.6052588    .3765679
               _m1 |  -.3108382    .241768    -1.29   0.199    -.7858377    .1641613
               _m2 |   .2192856   .5336958     0.41   0.681    -.8292621    1.267833
               _m3 |   .3122036   .2756588     1.13   0.258    -.2293808     .853788
             _cons |   7.676628    .577421    13.29   0.000     6.542174    8.811082
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4075681          .        .       .            .           .
        rho1 |  -.4868938          .        .       .            .           .
        rho2 |   .3434867          .        .       .            .           .
        rho3 |   .4890326          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum
> 2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 
> 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum2-provin
> cedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        526    8.176781    .6376835   5.298317   9.721166
        male |        526    .7376426    .4403347          0          1
         exp |        526    14.89734    6.325527          2         32
      expsqr |        526    261.8669     218.597          4       1024
   higheredu |        526    .1292776    .3358263          0          1
-------------+---------------------------------------------------------
parent_par~r |        526    .1711027    .3769571          0          1
provincedum2 |        526     .026616    .1611115          0          1
provincedum3 |        526    .0171103    .1298058          0          1
provincedum4 |        526    .0114068     .106293          0          1
provincedum5 |        526    .0703422    .2559663          0          1
-------------+---------------------------------------------------------
provincedum6 |        526    .0627376    .2427213          0          1
provincedum7 |        526    .0722433    .2591369          0          1
provincedum8 |        526    .0988593    .2987572          0          1
provincedum9 |        526    .0779468     .268343          0          1
provinced~10 |        526    .1159696    .3204932          0          1
-------------+---------------------------------------------------------
provinced~11 |        526    .1254753    .3315724          0          1
provinced~12 |        526     .039924    .1959669          0          1
provinced~13 |        526    .0760456    .2653234          0          1
provinced~14 |        526    .0475285     .212969          0          1
provinced~15 |        526    .0627376    .2427213          0          1
-------------+---------------------------------------------------------
          m1 |        526    1.312092    .3863108   .4055244   2.801401
          m2 |        526   -.3657955    .2081278  -.7260023  -.0086511
          m3 |        526    -.489524    .2234435  -.7260007   1.241924

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Non-specified Hi
> gheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) Parent Party Membership & Specified higher education, Sec Gen + inrange(birthyear, 1971
> , 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=
> male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_
> relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3943.8986
Iteration 1:  Log likelihood = -3048.9239
Iteration 2:  Log likelihood = -2973.6874
Iteration 3:  Log likelihood = -2968.8368
Iteration 4:  Log likelihood = -2968.8123
Iteration 5:  Log likelihood = -2968.8123

Multinomial logistic regression                   Number of obs   =       4763
                                                  LR chi2(14)     =    1950.17
                                                  Prob > chi2     =     0.0000
Log likelihood = -2968.8123                       Pseudo R2       =     0.2472

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0161021   .1168382    -0.14   0.890    -.2451007    .2128965
         exp |  -.6137389   .0482994   -12.71   0.000    -.7084039   -.5190739
      expsqr |   .0097811   .0011772     8.31   0.000     .0074739    .0120884
ins1_secge~e |  -8.080565   .8467129    -9.54   0.000    -9.740092   -6.421038
ins2_highe~e |   .8450143   .1646406     5.13   0.000     .5223245    1.167704
ins3_vs_en~e |   1.022624   .7631241     1.34   0.180    -.4730718    2.518319
parent_par~r |   .5300473   .1392209     3.81   0.000     .2571794    .8029152
       _cons |   7.418157   .6547951    11.33   0.000     6.134782    8.701532
-------------+----------------------------------------------------------------
2            |
        male |   .0622379   .1051327     0.59   0.554    -.1438185    .2682942
         exp |  -.9519572   .0444263   -21.43   0.000    -1.039031   -.8648832
      expsqr |   .0169418   .0010261    16.51   0.000     .0149306    .0189529
ins1_secge~e |  -10.20928   .8023764   -12.72   0.000    -11.78191   -8.636648
ins2_highe~e |   .1388683    .191702     0.72   0.469    -.2368607    .5145973
ins3_vs_en~e |  -1.222146   .7367727    -1.66   0.097    -2.666194    .2219018
parent_par~r |   .6578424   .1234454     5.33   0.000     .4158939     .899791
       _cons |   12.81017   .6262191    20.46   0.000     11.58281    14.03754
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       978
-------------+----------------------------------   F(10, 967)      =      6.64
       Model |  24.8931201        10  2.48931201   Prob > F        =    0.0000
    Residual |  362.345014       967  .374710459   R-squared       =    0.0643
-------------+----------------------------------   Adj R-squared   =    0.0546
       Total |  387.238134       977  .396354282   Root MSE        =    .61214

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2662865   .0446226     5.97   0.000     .1787182    .3538547
               exp |  -.0150098   .0242277    -0.62   0.536    -.0625548    .0325352
            expsqr |   .0002165   .0006755     0.32   0.749    -.0011091    .0015421
        highvocedu |   .1813544    .055533     3.27   0.001     .0723753    .2903336
        highgenedu |   .2477319   .0637196     3.89   0.000     .1226872    .3727766
          adultedu |  -.0056215   .0895765    -0.06   0.950    -.1814083    .1701652
parent_partymember |  -.0014031   .0519863    -0.03   0.978     -.103422    .1006159
               _m1 |  -.4442862   .3093178    -1.44   0.151    -1.051298    .1627252
               _m2 |   .0715548   .1016377     0.70   0.482    -.1279011    .2710106
               _m3 |   -.185417   .2267886    -0.82   0.414    -.6304716    .2596376
             _cons |   7.850792   .1321308    59.42   0.000     7.591496    8.110088
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4176955          .        .       .            .           .
        rho1 |  -.6874371          .        .       .            .           .
        rho2 |   .1107155          .        .       .            .           .
        rho3 |  -.2868928          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |        978    .7280164    .4452092          0          1
         exp |        978    12.93456    7.167238          1         32
      expsqr |        978    218.6196    232.5427          1       1024
  highvocedu |        978    .2607362    .4392609          0          1
-------------+---------------------------------------------------------
  highgenedu |        978    .2515337    .4341166          0          1
    adultedu |        978    .0552147    .2285158          0          1
parent_par~r |        978    .1891616    .3918373          0          1
          m1 |        978   -.2383783     .101106   -.634719  -.0213199
          m2 |        978    .8018076    .6118621   .0168104   2.962393
-------------+---------------------------------------------------------
          m3 |        978    -.382017    .2577805  -.7260022   .4302416

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Specified Higher
> edu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) Parent Party Membership & Specified higher education, Sec Gen + inrange(birthyear, 1971
> , 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearnin
> g, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3943.8986
Iteration 1:  Log likelihood = -3048.9239
Iteration 2:  Log likelihood = -2973.6874
Iteration 3:  Log likelihood = -2968.8368
Iteration 4:  Log likelihood = -2968.8123
Iteration 5:  Log likelihood = -2968.8123

Multinomial logistic regression                   Number of obs   =       4763
                                                  LR chi2(14)     =    1950.17
                                                  Prob > chi2     =     0.0000
Log likelihood = -2968.8123                       Pseudo R2       =     0.2472

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0161021   .1168382    -0.14   0.890    -.2451007    .2128965
         exp |  -.6137389   .0482994   -12.71   0.000    -.7084039   -.5190739
      expsqr |   .0097811   .0011772     8.31   0.000     .0074739    .0120884
ins1_secge~e |  -8.080565   .8467129    -9.54   0.000    -9.740092   -6.421038
ins2_highe~e |   .8450143   .1646406     5.13   0.000     .5223245    1.167704
ins3_vs_en~e |   1.022624   .7631241     1.34   0.180    -.4730718    2.518319
parent_par~r |   .5300473   .1392209     3.81   0.000     .2571794    .8029152
       _cons |   7.418157   .6547951    11.33   0.000     6.134782    8.701532
-------------+----------------------------------------------------------------
2            |
        male |   .0622379   .1051327     0.59   0.554    -.1438185    .2682942
         exp |  -.9519572   .0444263   -21.43   0.000    -1.039031   -.8648832
      expsqr |   .0169418   .0010261    16.51   0.000     .0149306    .0189529
ins1_secge~e |  -10.20928   .8023764   -12.72   0.000    -11.78191   -8.636648
ins2_highe~e |   .1388683    .191702     0.72   0.469    -.2368607    .5145973
ins3_vs_en~e |  -1.222146   .7367727    -1.66   0.097    -2.666194    .2219018
parent_par~r |   .6578424   .1234454     5.33   0.000     .4158939     .899791
       _cons |   12.81017   .6262191    20.46   0.000     11.58281    14.03754
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       978
-------------+----------------------------------   F(24, 953)      =      4.64
       Model |  40.5087053        24  1.68786272   Prob > F        =    0.0000
    Residual |  346.729428       953  .363829411   R-squared       =    0.1046
-------------+----------------------------------   Adj R-squared   =    0.0821
       Total |  387.238134       977  .396354282   Root MSE        =    .60318

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |    .256768    .044328     5.79   0.000     .1697762    .3437597
               exp |   .0038168   .0283654     0.13   0.893    -.0518492    .0594827
            expsqr |  -.0002491   .0007494    -0.33   0.740    -.0017199    .0012216
        highvocedu |   .1891492   .0567223     3.33   0.001     .0778341    .3004643
        highgenedu |   .2320512   .0655301     3.54   0.000     .1034512    .3606513
          adultedu |   .0096159    .089948     0.11   0.915    -.1669031    .1861349
parent_partymember |  -.0339523   .0526065    -0.65   0.519    -.1371904    .0692857
      provincedum2 |  -.2564741   .1731355    -1.48   0.139    -.5962449    .0832968
      provincedum3 |   -.414555    .180884    -2.29   0.022     -.769532    -.059578
      provincedum4 |  -.4371932    .222515    -1.96   0.050    -.8738692   -.0005172
      provincedum5 |  -.0557148   .1435981    -0.39   0.698    -.3375199    .2260902
      provincedum6 |  -.1250145   .1597251    -0.78   0.434    -.4384681    .1884392
      provincedum7 |  -.1777757   .1647769    -1.08   0.281    -.5011432    .1455919
      provincedum8 |  -.3669934   .1624189    -2.26   0.024    -.6857334   -.0482534
      provincedum9 |    .022732   .1467154     0.15   0.877    -.2651906    .3106545
     provincedum10 |   -.085837   .1490417    -0.58   0.565    -.3783248    .2066509
     provincedum11 |  -.1654355   .1585636    -1.04   0.297    -.4766097    .1457387
     provincedum12 |  -.2748637   .1792562    -1.53   0.126    -.6266462    .0769188
     provincedum13 |  -.2435587   .1605563    -1.52   0.130    -.5586434    .0715261
     provincedum14 |  -.1757194   .1740009    -1.01   0.313    -.5171886    .1657498
     provincedum15 |   -.370813    .158786    -2.34   0.020    -.6824236   -.0592023
               _m1 |   .1307692   .4224848     0.31   0.757    -.6983388    .9598771
               _m2 |  -.0677434   .1328707    -0.51   0.610    -.3284964    .1930095
               _m3 |  -.1981539   .2405318    -0.82   0.410     -.670187    .2738793
             _cons |   8.146772   .2307097    35.31   0.000     7.694014    8.599529
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3601726          .        .       .            .           .
        rho1 |   .2178964          .        .       .            .           .
        rho2 |  -.1128787          .        .       .            .           .
        rho3 |  -.3301774          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(
> monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        978    8.240976    .6295667    5.37836   9.645658
        male |        978    .7280164    .4452092          0          1
         exp |        978    12.93456    7.167238          1         32
      expsqr |        978    218.6196    232.5427          1       1024
  highvocedu |        978    .2607362    .4392609          0          1
-------------+---------------------------------------------------------
  highgenedu |        978    .2515337    .4341166          0          1
    adultedu |        978    .0552147    .2285158          0          1
parent_par~r |        978    .1891616    .3918373          0          1
provincedum2 |        978    .0398773     .195771          0          1
provincedum3 |        978    .0255624    .1579064          0          1
-------------+---------------------------------------------------------
provincedum4 |        978    .0112474    .1055098          0          1
provincedum5 |        978    .0858896    .2803443          0          1
provincedum6 |        978    .0715746    .2579142          0          1
provincedum7 |        978    .0725971    .2596068          0          1
provincedum8 |        978    .1267894    .3329071          0          1
-------------+---------------------------------------------------------
provincedum9 |        978     .107362    .3097313          0          1
provinced~10 |        978     .103272    .3044695          0          1
provinced~11 |        978     .107362    .3097313          0          1
provinced~12 |        978    .0224949    .1483623          0          1
provinced~13 |        978    .0490798    .2161451          0          1
-------------+---------------------------------------------------------
provinced~14 |        978    .0480573    .2139967          0          1
provinced~15 |        978    .0807771    .2726319          0          1
          m1 |        978   -.2383783     .101106   -.634719  -.0213199
          m2 |        978    .8018076    .6118621   .0168104   2.962393
          m3 |        978    -.382017    .2577805  -.7260022   .4302416

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Specified Higher
> edu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) Parent Party Membership & Combined higher education, Sec Gen + inrange(birthyear, 1971,
>  1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_partymember if inrange(bir
> thyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_
> secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_part
> ymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3943.8986
Iteration 1:  Log likelihood = -3048.9239
Iteration 2:  Log likelihood = -2973.6874
Iteration 3:  Log likelihood = -2968.8368
Iteration 4:  Log likelihood = -2968.8123
Iteration 5:  Log likelihood = -2968.8123

Multinomial logistic regression                   Number of obs   =       4763
                                                  LR chi2(14)     =    1950.17
                                                  Prob > chi2     =     0.0000
Log likelihood = -2968.8123                       Pseudo R2       =     0.2472

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0161021   .1168382    -0.14   0.890    -.2451007    .2128965
         exp |  -.6137389   .0482994   -12.71   0.000    -.7084039   -.5190739
      expsqr |   .0097811   .0011772     8.31   0.000     .0074739    .0120884
ins1_secge~e |  -8.080565   .8467129    -9.54   0.000    -9.740092   -6.421038
ins2_highe~e |   .8450143   .1646406     5.13   0.000     .5223245    1.167704
ins3_vs_en~e |   1.022624   .7631241     1.34   0.180    -.4730718    2.518319
parent_par~r |   .5300473   .1392209     3.81   0.000     .2571794    .8029152
       _cons |   7.418157   .6547951    11.33   0.000     6.134782    8.701532
-------------+----------------------------------------------------------------
2            |
        male |   .0622379   .1051327     0.59   0.554    -.1438185    .2682942
         exp |  -.9519572   .0444263   -21.43   0.000    -1.039031   -.8648832
      expsqr |   .0169418   .0010261    16.51   0.000     .0149306    .0189529
ins1_secge~e |  -10.20928   .8023764   -12.72   0.000    -11.78191   -8.636648
ins2_highe~e |   .1388683    .191702     0.72   0.469    -.2368607    .5145973
ins3_vs_en~e |  -1.222146   .7367727    -1.66   0.097    -2.666194    .2219018
parent_par~r |   .6578424   .1234454     5.33   0.000     .4158939     .899791
       _cons |   12.81017   .6262191    20.46   0.000     11.58281    14.03754
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       978
-------------+----------------------------------   F(8, 969)       =      7.43
       Model |   22.383348         8  2.79791851   Prob > F        =    0.0000
    Residual |  364.854786       969  .376527127   R-squared       =    0.0578
-------------+----------------------------------   Adj R-squared   =    0.0500
       Total |  387.238134       977  .396354282   Root MSE        =    .61362

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2695465    .044608     6.04   0.000     .1820071    .3570859
               exp |  -.0221261   .0241059    -0.92   0.359    -.0694319    .0251797
            expsqr |   .0003463   .0006748     0.51   0.608     -.000978    .0016706
         higheredu |   .1667927   .0491597     3.39   0.001     .0703209    .2632646
parent_partymember |   .0054546   .0520433     0.10   0.917     -.096676    .1075852
               _m1 |  -.3774508   .3077425    -1.23   0.220    -.9813695    .2264678
               _m2 |    .076064   .1018445     0.75   0.455    -.1237972    .2759253
               _m3 |  -.1629149   .2271691    -0.72   0.473     -.608715    .2828852
             _cons |   7.946337   .1254182    63.36   0.000     7.700214    8.192459
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .408027          .        .       .            .           .
        rho1 |  -.5909027          .        .       .            .           .
        rho2 |   .1190789          .        .       .            .           .
        rho3 |  -.2550447          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_partymember  m1 m2 m3 i
> f inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_partymember m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        978    8.240976    .6295667    5.37836   9.645658
        male |        978    .7280164    .4452092          0          1
         exp |        978    12.93456    7.167238          1         32
      expsqr |        978    218.6196    232.5427          1       1024
   higheredu |        978    .5674847    .4956784          0          1
-------------+---------------------------------------------------------
parent_par~r |        978    .1891616    .3918373          0          1
          m1 |        978   -.2383783     .101106   -.634719  -.0213199
          m2 |        978    .8018076    .6118621   .0168104   2.962393
          m3 |        978    -.382017    .2577805  -.7260022   .4302416

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Non-specified Hi
> gheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) Parent Party Membership & Combined higher education, Sec Gen + inrange(birthyear, 1971,
>  1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_partymember provincedum2-p
> rovincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3943.8986
Iteration 1:  Log likelihood = -3048.9239
Iteration 2:  Log likelihood = -2973.6874
Iteration 3:  Log likelihood = -2968.8368
Iteration 4:  Log likelihood = -2968.8123
Iteration 5:  Log likelihood = -2968.8123

Multinomial logistic regression                   Number of obs   =       4763
                                                  LR chi2(14)     =    1950.17
                                                  Prob > chi2     =     0.0000
Log likelihood = -2968.8123                       Pseudo R2       =     0.2472

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0161021   .1168382    -0.14   0.890    -.2451007    .2128965
         exp |  -.6137389   .0482994   -12.71   0.000    -.7084039   -.5190739
      expsqr |   .0097811   .0011772     8.31   0.000     .0074739    .0120884
ins1_secge~e |  -8.080565   .8467129    -9.54   0.000    -9.740092   -6.421038
ins2_highe~e |   .8450143   .1646406     5.13   0.000     .5223245    1.167704
ins3_vs_en~e |   1.022624   .7631241     1.34   0.180    -.4730718    2.518319
parent_par~r |   .5300473   .1392209     3.81   0.000     .2571794    .8029152
       _cons |   7.418157   .6547951    11.33   0.000     6.134782    8.701532
-------------+----------------------------------------------------------------
2            |
        male |   .0622379   .1051327     0.59   0.554    -.1438185    .2682942
         exp |  -.9519572   .0444263   -21.43   0.000    -1.039031   -.8648832
      expsqr |   .0169418   .0010261    16.51   0.000     .0149306    .0189529
ins1_secge~e |  -10.20928   .8023764   -12.72   0.000    -11.78191   -8.636648
ins2_highe~e |   .1388683    .191702     0.72   0.469    -.2368607    .5145973
ins3_vs_en~e |  -1.222146   .7367727    -1.66   0.097    -2.666194    .2219018
parent_par~r |   .6578424   .1234454     5.33   0.000     .4158939     .899791
       _cons |   12.81017   .6262191    20.46   0.000     11.58281    14.03754
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       978
-------------+----------------------------------   F(22, 955)      =      4.81
       Model |  38.6526788        22  1.75693994   Prob > F        =    0.0000
    Residual |  348.585455       955  .365010948   R-squared       =    0.0998
-------------+----------------------------------   Adj R-squared   =    0.0791
       Total |  387.238134       977  .396354282   Root MSE        =    .60416

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2595255   .0442844     5.86   0.000     .1726194    .3464315
               exp |  -.0003404   .0283416    -0.01   0.990    -.0559593    .0552786
            expsqr |  -.0001816     .00075    -0.24   0.809    -.0016535    .0012902
         higheredu |    .166902   .0505683     3.30   0.001     .0676642    .2661398
parent_partymember |  -.0289538    .052643    -0.55   0.582    -.1322632    .0743556
      provincedum2 |  -.2844224   .1726443    -1.65   0.100    -.6232284    .0543836
      provincedum3 |  -.4202372   .1808005    -2.32   0.020    -.7750493   -.0654251
      provincedum4 |  -.4503835   .2225595    -2.02   0.043    -.8871456   -.0136214
      provincedum5 |   -.065147    .143736    -0.45   0.650    -.3472218    .2169278
      provincedum6 |  -.1374813   .1596974    -0.86   0.390    -.4508795     .175917
      provincedum7 |  -.1975733   .1644577    -1.20   0.230    -.5203135    .1251669
      provincedum8 |  -.3871221   .1621194    -2.39   0.017    -.7052735   -.0689708
      provincedum9 |   .0061177   .1464929     0.04   0.967    -.2813675     .293603
     provincedum10 |  -.1075084   .1485533    -0.72   0.469     -.399037    .1840201
     provincedum11 |  -.1874667   .1584169    -1.18   0.237    -.4983522    .1234187
     provincedum12 |  -.3275315   .1780209    -1.84   0.066    -.6768888    .0218259
     provincedum13 |  -.2772271    .160045    -1.73   0.084    -.5913076    .0368533
     provincedum14 |  -.2065251   .1735327    -1.19   0.234    -.5470746    .1340243
     provincedum15 |  -.3924227   .1581928    -2.48   0.013    -.7028683   -.0819772
               _m1 |   .2153274   .4176725     0.52   0.606    -.6043345    1.034989
               _m2 |  -.0751489   .1329465    -0.57   0.572    -.3360499    .1857521
               _m3 |  -.1792395   .2407713    -0.74   0.457    -.6517414    .2932625
             _cons |   8.249205    .223206    36.96   0.000     7.811175    8.687236
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3692826          .        .       .            .           .
        rho1 |   .3543397          .        .       .            .           .
        rho2 |   -.123664          .        .       .            .           .
        rho3 |   -.294954          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum
> 2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 
> 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum2-provin
> cedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        978    8.240976    .6295667    5.37836   9.645658
        male |        978    .7280164    .4452092          0          1
         exp |        978    12.93456    7.167238          1         32
      expsqr |        978    218.6196    232.5427          1       1024
   higheredu |        978    .5674847    .4956784          0          1
-------------+---------------------------------------------------------
parent_par~r |        978    .1891616    .3918373          0          1
provincedum2 |        978    .0398773     .195771          0          1
provincedum3 |        978    .0255624    .1579064          0          1
provincedum4 |        978    .0112474    .1055098          0          1
provincedum5 |        978    .0858896    .2803443          0          1
-------------+---------------------------------------------------------
provincedum6 |        978    .0715746    .2579142          0          1
provincedum7 |        978    .0725971    .2596068          0          1
provincedum8 |        978    .1267894    .3329071          0          1
provincedum9 |        978     .107362    .3097313          0          1
provinced~10 |        978     .103272    .3044695          0          1
-------------+---------------------------------------------------------
provinced~11 |        978     .107362    .3097313          0          1
provinced~12 |        978    .0224949    .1483623          0          1
provinced~13 |        978    .0490798    .2161451          0          1
provinced~14 |        978    .0480573    .2139967          0          1
provinced~15 |        978    .0807771    .2726319          0          1
-------------+---------------------------------------------------------
          m1 |        978   -.2383783     .101106   -.634719  -.0213199
          m2 |        978    .8018076    .6118621   .0168104   2.962393
          m3 |        978    -.382017    .2577805  -.7260022   .4302416

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Non-specified Hi
> gheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) All Parent Indicators & Keyschool & Specified higher education, Sec Voc + inrange(birth
> year, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(m
> onthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_hi
> ghedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partym
> ember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -2783.7837
Iteration 2:  Log likelihood = -2703.0734
Iteration 3:  Log likelihood = -2687.5371
Iteration 4:  Log likelihood = -2686.5062
Iteration 5:  Log likelihood = -2686.4898
Iteration 6:  Log likelihood = -2686.4898

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(20)     =    2490.28
                                                  Prob > chi2     =     0.0000
Log likelihood = -2686.4898                       Pseudo R2       =     0.3167

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0181661   .1192711    -0.15   0.879    -.2519331    .2156009
         exp |  -.6703651   .0504673   -13.28   0.000    -.7692792    -.571451
      expsqr |   .0111759   .0012174     9.18   0.000     .0087898    .0135621
ins1_secge~e |  -8.542201   .8711606    -9.81   0.000    -10.24964   -6.834757
ins2_highe~e |   .9303805   .1674694     5.56   0.000     .6021465    1.258614
ins3_vs_en~e |   1.015819   .7760007     1.31   0.191    -.5051148    2.536752
parent_sec~u |   .5563453   .1414234     3.93   0.000     .2791605    .8335301
parent_hig~u |   .9023966   .6583018     1.37   0.170    -.3878513    2.192644
parent_par~r |   .3915548   .1482851     2.64   0.008     .1009214    .6821881
   Keyschool |   .3716069   .2957822     1.26   0.209    -.2081156    .9513293
       _cons |    7.93915   .6821007    11.64   0.000     6.602257    9.276043
-------------+----------------------------------------------------------------
2            |
        male |   .1904431   .1170344     1.63   0.104    -.0389402    .4198263
         exp |  -.9007425   .0486848   -18.50   0.000    -.9961629   -.8053221
      expsqr |   .0163079   .0011313    14.42   0.000     .0140906    .0185251
ins1_secge~e |  -9.889079   .8697765   -11.37   0.000    -11.59381   -8.184348
ins2_highe~e |   .2432199   .2022003     1.20   0.229    -.1530855    .6395252
ins3_vs_en~e |  -.4378407   .8028677    -0.55   0.586    -2.011432    1.135751
parent_sec~u |   .8888833   .1322373     6.72   0.000      .629703    1.148064
parent_hig~u |   1.016449   .6252262     1.63   0.104    -.2089714     2.24187
parent_par~r |   .3341541   .1417806     2.36   0.018     .0562693    .6120389
   Keyschool |   3.176745   .1827713    17.38   0.000      2.81852     3.53497
       _cons |   11.22643   .6797975    16.51   0.000     9.894051    12.55881
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(13, 511)      =      4.97
       Model |  23.9754705        13  1.84426696   Prob > F        =    0.0000
    Residual |  189.485593       511  .370813293   R-squared       =    0.1123
-------------+----------------------------------   Adj R-squared   =    0.0897
       Total |  213.461063       524  .407368441   Root MSE        =    .60894

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3910693   .0619872     6.31   0.000     .2692881    .5128505
               exp |   .0748579   .0328509     2.28   0.023     .0103184    .1393974
            expsqr |  -.0016994   .0008719    -1.95   0.052    -.0034124    .0000136
        highvocedu |   .0759283   .0990905     0.77   0.444    -.1187467    .2706033
        highgenedu |   .1745613   .2546667     0.69   0.493    -.3257613    .6748839
          adultedu |   .1866903   .1545753     1.21   0.228    -.1169909    .4903715
     parent_secedu |  -.0150679   .0780244    -0.19   0.847     -.168356    .1382201
    parent_highedu |   .0366445   .2629651     0.14   0.889    -.4799812    .5532702
parent_partymember |   .0033031   .0777519     0.04   0.966    -.1494495    .1560558
         Keyschool |   .6804639   .2065289     3.29   0.001     .2747136    1.086214
               _m1 |  -.2950542   .1242266    -2.38   0.018     -.539112   -.0509965
               _m2 |   .2701192    .328609     0.82   0.411    -.3754717    .9157101
               _m3 |   .0894993   .1956524     0.46   0.648    -.2948827    .4738813
             _cons |   7.679328   .3453367    22.24   0.000     7.000873    8.357782
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4251685          .        .       .            .           .
        rho1 |  -.4525029          .        .       .            .           .
        rho2 |   .4142619          .        .       .            .           .
        rho3 |   .1372585          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
  highvocedu |        525    .0857143    .2802087          0          1
-------------+---------------------------------------------------------
  highgenedu |        525    .0114286    .1063932          0          1
    adultedu |        525     .032381    .1771785          0          1
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
-------------+---------------------------------------------------------
   Keyschool |        525    .0342857    .1821356          0          1
          m1 |        525    1.247849    .4665644   .2888643   2.887776
          m2 |        525   -.3147634    .1884749  -.7248031   -.006865
          m3 |        525   -.4955776    .2337359   -.726001   1.893558

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Specif
> ied Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) All Parent Indicators & Keyschool & Specified higher education, Sec Voc + inrange(birth
> year, 1971, 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secg
> en_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu p
> arent_highedu parent_partymember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -2783.7837
Iteration 2:  Log likelihood = -2703.0734
Iteration 3:  Log likelihood = -2687.5371
Iteration 4:  Log likelihood = -2686.5062
Iteration 5:  Log likelihood = -2686.4898
Iteration 6:  Log likelihood = -2686.4898

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(20)     =    2490.28
                                                  Prob > chi2     =     0.0000
Log likelihood = -2686.4898                       Pseudo R2       =     0.3167

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0181661   .1192711    -0.15   0.879    -.2519331    .2156009
         exp |  -.6703651   .0504673   -13.28   0.000    -.7692792    -.571451
      expsqr |   .0111759   .0012174     9.18   0.000     .0087898    .0135621
ins1_secge~e |  -8.542201   .8711606    -9.81   0.000    -10.24964   -6.834757
ins2_highe~e |   .9303805   .1674694     5.56   0.000     .6021465    1.258614
ins3_vs_en~e |   1.015819   .7760007     1.31   0.191    -.5051148    2.536752
parent_sec~u |   .5563453   .1414234     3.93   0.000     .2791605    .8335301
parent_hig~u |   .9023966   .6583018     1.37   0.170    -.3878513    2.192644
parent_par~r |   .3915548   .1482851     2.64   0.008     .1009214    .6821881
   Keyschool |   .3716069   .2957822     1.26   0.209    -.2081156    .9513293
       _cons |    7.93915   .6821007    11.64   0.000     6.602257    9.276043
-------------+----------------------------------------------------------------
2            |
        male |   .1904431   .1170344     1.63   0.104    -.0389402    .4198263
         exp |  -.9007425   .0486848   -18.50   0.000    -.9961629   -.8053221
      expsqr |   .0163079   .0011313    14.42   0.000     .0140906    .0185251
ins1_secge~e |  -9.889079   .8697765   -11.37   0.000    -11.59381   -8.184348
ins2_highe~e |   .2432199   .2022003     1.20   0.229    -.1530855    .6395252
ins3_vs_en~e |  -.4378407   .8028677    -0.55   0.586    -2.011432    1.135751
parent_sec~u |   .8888833   .1322373     6.72   0.000      .629703    1.148064
parent_hig~u |   1.016449   .6252262     1.63   0.104    -.2089714     2.24187
parent_par~r |   .3341541   .1417806     2.36   0.018     .0562693    .6120389
   Keyschool |   3.176745   .1827713    17.38   0.000      2.81852     3.53497
       _cons |   11.22643   .6797975    16.51   0.000     9.894051    12.55881
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(27, 497)      =      3.78
       Model |  36.3498645        27  1.34629128   Prob > F        =    0.0000
    Residual |  177.111199       497  .356360561   R-squared       =    0.1703
-------------+----------------------------------   Adj R-squared   =    0.1252
       Total |  213.461063       524  .407368441   Root MSE        =    .59696

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .4020078    .064811     6.20   0.000     .2746705     .529345
               exp |   .0921844   .0369932     2.49   0.013      .019502    .1648668
            expsqr |  -.0020874   .0009996    -2.09   0.037    -.0040514   -.0001234
        highvocedu |   .0250091   .1005808     0.25   0.804    -.1726069    .2226252
        highgenedu |   .1983157   .2548441     0.78   0.437    -.3023889    .6990203
          adultedu |   .1812794    .153041     1.18   0.237    -.1194076    .4819665
     parent_secedu |  -.0286033    .081223    -0.35   0.725    -.1881861    .1309796
    parent_highedu |  -.0357799   .2674305    -0.13   0.894    -.5612136    .4896538
parent_partymember |   .0176781   .0808597     0.22   0.827    -.1411909     .176547
         Keyschool |   .5907412   .3237262     1.82   0.069    -.0452994    1.226782
      provincedum2 |  -.1518081     .24348    -0.62   0.533    -.6301851    .3265689
      provincedum3 |   .1033044   .2814404     0.37   0.714    -.4496553     .656264
      provincedum4 |   .2456179   .2972637     0.83   0.409    -.3384306    .8296664
      provincedum5 |   .3824882   .1913048     2.00   0.046     .0066222    .7583541
      provincedum6 |   .2765882   .2108813     1.31   0.190    -.1377405    .6909169
      provincedum7 |   .2014423   .2191837     0.92   0.359    -.2291985    .6320832
      provincedum8 |   .0105046   .2149043     0.05   0.961    -.4117283    .4327376
      provincedum9 |   .3429508   .1995291     1.72   0.086    -.0490737    .7349753
     provincedum10 |   .0935491   .2037483     0.46   0.646     -.306765    .4938633
     provincedum11 |   .2021325   .1994371     1.01   0.311    -.1897114    .5939763
     provincedum12 |  -.0655999   .2092659    -0.31   0.754    -.4767548     .345555
     provincedum13 |  -.1169334   .2068588    -0.57   0.572    -.5233589    .2894921
     provincedum14 |  -.0196899   .2247815    -0.09   0.930     -.461329    .4219493
     provincedum15 |  -.0695365   .2418337    -0.29   0.774     -.544679    .4056059
               _m1 |  -.3319072   .2362681    -1.40   0.161    -.7961147    .1323002
               _m2 |    .385343   .5533207     0.70   0.486    -.7017931    1.472479
               _m3 |   .2519081   .2157559     1.17   0.244    -.1719979    .6758142
             _cons |   7.579329   .4521231    16.76   0.000     6.691021    8.467637
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4233874          .        .       .            .           .
        rho1 |  -.5100911          .        .       .            .           .
        rho2 |   .5922138          .        .       .            .           .
        rho3 |   .3871446          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if in
> range(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
  highvocedu |        525    .0857143    .2802087          0          1
-------------+---------------------------------------------------------
  highgenedu |        525    .0114286    .1063932          0          1
    adultedu |        525     .032381    .1771785          0          1
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
-------------+---------------------------------------------------------
   Keyschool |        525    .0342857    .1821356          0          1
provincedum2 |        525    .0266667    .1612609          0          1
provincedum3 |        525    .0171429    .1299274          0          1
provincedum4 |        525    .0114286    .1063932          0          1
provincedum5 |        525    .0704762    .2561919          0          1
-------------+---------------------------------------------------------
provincedum6 |        525    .0628571    .2429373          0          1
provincedum7 |        525     .072381    .2593648          0          1
provincedum8 |        525    .0971429    .2964346          0          1
provincedum9 |        525    .0780952    .2685773          0          1
provinced~10 |        525    .1161905    .3207588          0          1
-------------+---------------------------------------------------------
provinced~11 |        525    .1257143    .3318433          0          1
provinced~12 |        525         .04    .1961461          0          1
provinced~13 |        525    .0761905    .2655557          0          1
provinced~14 |        525     .047619     .213162          0          1
provinced~15 |        525    .0628571    .2429373          0          1
-------------+---------------------------------------------------------
          m1 |        525    1.247849    .4665644   .2888643   2.887776
          m2 |        525   -.3147634    .1884749  -.7248031   -.006865
          m3 |        525   -.4955776    .2337359   -.726001   1.893558

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Specif
> ied Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) All Parent Indicators & Keyschool & Combined higher education, Sec Voc + inrange(birthy
> ear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 1
> 6667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relativ
> e ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymember Keyschool) dmf(
> 2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -2783.7837
Iteration 2:  Log likelihood = -2703.0734
Iteration 3:  Log likelihood = -2687.5371
Iteration 4:  Log likelihood = -2686.5062
Iteration 5:  Log likelihood = -2686.4898
Iteration 6:  Log likelihood = -2686.4898

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(20)     =    2490.28
                                                  Prob > chi2     =     0.0000
Log likelihood = -2686.4898                       Pseudo R2       =     0.3167

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0181661   .1192711    -0.15   0.879    -.2519331    .2156009
         exp |  -.6703651   .0504673   -13.28   0.000    -.7692792    -.571451
      expsqr |   .0111759   .0012174     9.18   0.000     .0087898    .0135621
ins1_secge~e |  -8.542201   .8711606    -9.81   0.000    -10.24964   -6.834757
ins2_highe~e |   .9303805   .1674694     5.56   0.000     .6021465    1.258614
ins3_vs_en~e |   1.015819   .7760007     1.31   0.191    -.5051148    2.536752
parent_sec~u |   .5563453   .1414234     3.93   0.000     .2791605    .8335301
parent_hig~u |   .9023966   .6583018     1.37   0.170    -.3878513    2.192644
parent_par~r |   .3915548   .1482851     2.64   0.008     .1009214    .6821881
   Keyschool |   .3716069   .2957822     1.26   0.209    -.2081156    .9513293
       _cons |    7.93915   .6821007    11.64   0.000     6.602257    9.276043
-------------+----------------------------------------------------------------
2            |
        male |   .1904431   .1170344     1.63   0.104    -.0389402    .4198263
         exp |  -.9007425   .0486848   -18.50   0.000    -.9961629   -.8053221
      expsqr |   .0163079   .0011313    14.42   0.000     .0140906    .0185251
ins1_secge~e |  -9.889079   .8697765   -11.37   0.000    -11.59381   -8.184348
ins2_highe~e |   .2432199   .2022003     1.20   0.229    -.1530855    .6395252
ins3_vs_en~e |  -.4378407   .8028677    -0.55   0.586    -2.011432    1.135751
parent_sec~u |   .8888833   .1322373     6.72   0.000      .629703    1.148064
parent_hig~u |   1.016449   .6252262     1.63   0.104    -.2089714     2.24187
parent_par~r |   .3341541   .1417806     2.36   0.018     .0562693    .6120389
   Keyschool |   3.176745   .1827713    17.38   0.000      2.81852     3.53497
       _cons |   11.22643   .6797975    16.51   0.000     9.894051    12.55881
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(11, 513)      =      5.85
       Model |  23.8088287        11  2.16443897   Prob > F        =    0.0000
    Residual |  189.652234       513  .369692465   R-squared       =    0.1115
-------------+----------------------------------   Adj R-squared   =    0.0925
       Total |  213.461063       524  .407368441   Root MSE        =    .60802

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3897109    .061838     6.30   0.000      .268224    .5111978
               exp |   .0751121   .0327985     2.29   0.022     .0106762     .139548
            expsqr |  -.0016888   .0008704    -1.94   0.053    -.0033989    .0000213
         higheredu |    .112906   .0821875     1.37   0.170    -.0485594    .2743714
     parent_secedu |  -.0146656   .0779037    -0.19   0.851    -.1677151    .1383838
    parent_highedu |   .0297077    .262326     0.11   0.910    -.4856577     .545073
parent_partymember |  -.0031158   .0770147    -0.04   0.968    -.1544187    .1481871
         Keyschool |   .6948215   .2042865     3.40   0.001     .2934804    1.096163
               _m1 |  -.3077175   .1220771    -2.52   0.012      -.54755   -.0678851
               _m2 |   .2981885   .3233253     0.92   0.357    -.3370161    .9333932
               _m3 |   .1034805    .194241     0.53   0.594    -.2781252    .4850862
             _cons |   7.705888   .3412181    22.58   0.000     7.035531    8.376244
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4325513          .        .       .            .           .
        rho1 |  -.4678788          .        .       .            .           .
        rho2 |   .4533902          .        .       .            .           .
        rho3 |   .1573402          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
   higheredu |        525    .1295238     .336099          0          1
-------------+---------------------------------------------------------
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
   Keyschool |        525    .0342857    .1821356          0          1
          m1 |        525    1.247849    .4665644   .2888643   2.887776
-------------+---------------------------------------------------------
          m2 |        525   -.3147634    .1884749  -.7248031   -.006865
          m3 |        525   -.4955776    .2337359   -.726001   1.893558

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Non-sp
> ecified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) All Parent Indicators & Keyschool & Combined higher education, Sec Voc + inrange(birthy
> ear, 1971, 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inr
> ange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative i
> ns2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_
> partymember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -2783.7837
Iteration 2:  Log likelihood = -2703.0734
Iteration 3:  Log likelihood = -2687.5371
Iteration 4:  Log likelihood = -2686.5062
Iteration 5:  Log likelihood = -2686.4898
Iteration 6:  Log likelihood = -2686.4898

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(20)     =    2490.28
                                                  Prob > chi2     =     0.0000
Log likelihood = -2686.4898                       Pseudo R2       =     0.3167

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0181661   .1192711    -0.15   0.879    -.2519331    .2156009
         exp |  -.6703651   .0504673   -13.28   0.000    -.7692792    -.571451
      expsqr |   .0111759   .0012174     9.18   0.000     .0087898    .0135621
ins1_secge~e |  -8.542201   .8711606    -9.81   0.000    -10.24964   -6.834757
ins2_highe~e |   .9303805   .1674694     5.56   0.000     .6021465    1.258614
ins3_vs_en~e |   1.015819   .7760007     1.31   0.191    -.5051148    2.536752
parent_sec~u |   .5563453   .1414234     3.93   0.000     .2791605    .8335301
parent_hig~u |   .9023966   .6583018     1.37   0.170    -.3878513    2.192644
parent_par~r |   .3915548   .1482851     2.64   0.008     .1009214    .6821881
   Keyschool |   .3716069   .2957822     1.26   0.209    -.2081156    .9513293
       _cons |    7.93915   .6821007    11.64   0.000     6.602257    9.276043
-------------+----------------------------------------------------------------
2            |
        male |   .1904431   .1170344     1.63   0.104    -.0389402    .4198263
         exp |  -.9007425   .0486848   -18.50   0.000    -.9961629   -.8053221
      expsqr |   .0163079   .0011313    14.42   0.000     .0140906    .0185251
ins1_secge~e |  -9.889079   .8697765   -11.37   0.000    -11.59381   -8.184348
ins2_highe~e |   .2432199   .2022003     1.20   0.229    -.1530855    .6395252
ins3_vs_en~e |  -.4378407   .8028677    -0.55   0.586    -2.011432    1.135751
parent_sec~u |   .8888833   .1322373     6.72   0.000      .629703    1.148064
parent_hig~u |   1.016449   .6252262     1.63   0.104    -.2089714     2.24187
parent_par~r |   .3341541   .1417806     2.36   0.018     .0562693    .6120389
   Keyschool |   3.176745   .1827713    17.38   0.000      2.81852     3.53497
       _cons |   11.22643   .6797975    16.51   0.000     9.894051    12.55881
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(25, 499)      =      4.05
       Model |  35.9898036        25  1.43959214   Prob > F        =    0.0000
    Residual |   177.47126       499  .355653827   R-squared       =    0.1686
-------------+----------------------------------   Adj R-squared   =    0.1269
       Total |  213.461063       524  .407368441   Root MSE        =    .59637

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .4020373   .0647265     6.21   0.000     .2748672    .5292074
               exp |   .0908611   .0369307     2.46   0.014     .0183023    .1634199
            expsqr |  -.0020218   .0009965    -2.03   0.043    -.0039796    -.000064
         higheredu |   .0819917    .082865     0.99   0.323    -.0808157     .244799
     parent_secedu |  -.0268995   .0811246    -0.33   0.740    -.1862875    .1324885
    parent_highedu |  -.0424835   .2670404    -0.16   0.874    -.5671456    .4821785
parent_partymember |   .0072672   .0801119     0.09   0.928    -.1501311    .1646655
         Keyschool |   .6247211    .320916     1.95   0.052     -.005792    1.255234
      provincedum2 |  -.1388788   .2427692    -0.57   0.568    -.6158546     .338097
      provincedum3 |   .1204973   .2800251     0.43   0.667    -.4296762    .6706708
      provincedum4 |    .269821   .2956135     0.91   0.362    -.3109796    .8506216
      provincedum5 |   .3783334   .1910419     1.98   0.048     .0029878    .7536789
      provincedum6 |   .2789918   .2106521     1.32   0.186    -.1348826    .6928663
      provincedum7 |   .2069104   .2188171     0.95   0.345    -.2230059    .6368268
      provincedum8 |   .0247621   .2140673     0.12   0.908    -.3958221    .4453463
      provincedum9 |   .3556809   .1989257     1.79   0.074    -.0351542     .746516
     provincedum10 |   .1022147   .2033153     0.50   0.615    -.2972447    .5016742
     provincedum11 |    .211904   .1988827     1.07   0.287    -.1788468    .6026547
     provincedum12 |  -.0623797   .2090266    -0.30   0.765    -.4730604     .348301
     provincedum13 |  -.1084535   .2064175    -0.53   0.600     -.514008     .297101
     provincedum14 |  -.0038159   .2239864    -0.02   0.986    -.4438885    .4362568
     provincedum15 |  -.0599647   .2413313    -0.25   0.804    -.5341153    .4141859
               _m1 |  -.3590541   .2338358    -1.54   0.125    -.8184781    .1003698
               _m2 |   .4495983    .547771     0.82   0.412    -.6266234     1.52582
               _m3 |   .2722307   .2145279     1.27   0.205    -.1492585      .69372
             _cons |   7.638143   .4468694    17.09   0.000     6.760166    8.516121
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4435135          .        .       .            .           .
        rho1 |  -.5391461          .        .       .            .           .
        rho2 |   .6751049          .        .       .            .           .
        rho3 |   .4087744          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971
> , 1992) & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
   higheredu |        525    .1295238     .336099          0          1
-------------+---------------------------------------------------------
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
   Keyschool |        525    .0342857    .1821356          0          1
provincedum2 |        525    .0266667    .1612609          0          1
-------------+---------------------------------------------------------
provincedum3 |        525    .0171429    .1299274          0          1
provincedum4 |        525    .0114286    .1063932          0          1
provincedum5 |        525    .0704762    .2561919          0          1
provincedum6 |        525    .0628571    .2429373          0          1
provincedum7 |        525     .072381    .2593648          0          1
-------------+---------------------------------------------------------
provincedum8 |        525    .0971429    .2964346          0          1
provincedum9 |        525    .0780952    .2685773          0          1
provinced~10 |        525    .1161905    .3207588          0          1
provinced~11 |        525    .1257143    .3318433          0          1
provinced~12 |        525         .04    .1961461          0          1
-------------+---------------------------------------------------------
provinced~13 |        525    .0761905    .2655557          0          1
provinced~14 |        525     .047619     .213162          0          1
provinced~15 |        525    .0628571    .2429373          0          1
          m1 |        525    1.247849    .4665644   .2888643   2.887776
          m2 |        525   -.3147634    .1884749  -.7248031   -.006865
-------------+---------------------------------------------------------
          m3 |        525   -.4955776    .2337359   -.726001   1.893558

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Non-sp
> ecified Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) All Parent Indicators & Keyschool & Specified higher education, Sec Gen + inrange(birth
> year, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(m
> onthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_hi
> ghedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partym
> ember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -2783.7837
Iteration 2:  Log likelihood = -2703.0734
Iteration 3:  Log likelihood = -2687.5371
Iteration 4:  Log likelihood = -2686.5062
Iteration 5:  Log likelihood = -2686.4898
Iteration 6:  Log likelihood = -2686.4898

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(20)     =    2490.28
                                                  Prob > chi2     =     0.0000
Log likelihood = -2686.4898                       Pseudo R2       =     0.3167

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0181661   .1192711    -0.15   0.879    -.2519331    .2156009
         exp |  -.6703651   .0504673   -13.28   0.000    -.7692792    -.571451
      expsqr |   .0111759   .0012174     9.18   0.000     .0087898    .0135621
ins1_secge~e |  -8.542201   .8711606    -9.81   0.000    -10.24964   -6.834757
ins2_highe~e |   .9303805   .1674694     5.56   0.000     .6021465    1.258614
ins3_vs_en~e |   1.015819   .7760007     1.31   0.191    -.5051148    2.536752
parent_sec~u |   .5563453   .1414234     3.93   0.000     .2791605    .8335301
parent_hig~u |   .9023966   .6583018     1.37   0.170    -.3878513    2.192644
parent_par~r |   .3915548   .1482851     2.64   0.008     .1009214    .6821881
   Keyschool |   .3716069   .2957822     1.26   0.209    -.2081156    .9513293
       _cons |    7.93915   .6821007    11.64   0.000     6.602257    9.276043
-------------+----------------------------------------------------------------
2            |
        male |   .1904431   .1170344     1.63   0.104    -.0389402    .4198263
         exp |  -.9007425   .0486848   -18.50   0.000    -.9961629   -.8053221
      expsqr |   .0163079   .0011313    14.42   0.000     .0140906    .0185251
ins1_secge~e |  -9.889079   .8697765   -11.37   0.000    -11.59381   -8.184348
ins2_highe~e |   .2432199   .2022003     1.20   0.229    -.1530855    .6395252
ins3_vs_en~e |  -.4378407   .8028677    -0.55   0.586    -2.011432    1.135751
parent_sec~u |   .8888833   .1322373     6.72   0.000      .629703    1.148064
parent_hig~u |   1.016449   .6252262     1.63   0.104    -.2089714     2.24187
parent_par~r |   .3341541   .1417806     2.36   0.018     .0562693    .6120389
   Keyschool |   3.176745   .1827713    17.38   0.000      2.81852     3.53497
       _cons |   11.22643   .6797975    16.51   0.000     9.894051    12.55881
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(13, 961)      =      5.63
       Model |  27.2149897        13  2.09346075   Prob > F        =    0.0000
    Residual |  357.524018       961  .372033318   R-squared       =    0.0707
-------------+----------------------------------   Adj R-squared   =    0.0582
       Total |  384.739008       974  .395009249   Root MSE        =    .60995

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2783577   .0453276     6.14   0.000     .1894052    .3673103
               exp |   -.005186   .0179383    -0.29   0.773    -.0403888    .0300168
            expsqr |  -.0000473   .0004992    -0.09   0.925    -.0010269    .0009323
        highvocedu |   .1803245   .0547368     3.29   0.001     .0729071    .2877418
        highgenedu |   .2264057   .0639668     3.54   0.000      .100875    .3519364
          adultedu |  -.0109571   .0889722    -0.12   0.902    -.1855592    .1636451
     parent_secedu |   .0642388     .05057     1.27   0.204    -.0350015    .1634791
    parent_highedu |   .0554179   .1507586     0.37   0.713    -.2404361     .351272
parent_partymember |   -.030126   .0531467    -0.57   0.571    -.1344228    .0741709
         Keyschool |     .36274   .1367087     2.65   0.008      .094458     .631022
               _m1 |  -.6728939   .3062356    -2.20   0.028    -1.273862   -.0719263
               _m2 |   .1123973    .099477     1.13   0.259    -.0828199    .3076145
               _m3 |  -.2665014   .1919833    -1.39   0.165    -.6432562    .1102534
             _cons |   7.553022   .1706854    44.25   0.000     7.218063    7.887981
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4549382          .        .       .            .           .
        rho1 |   -.997632          .        .       .            .           .
        rho2 |   .1666401          .        .       .            .           .
        rho3 |  -.3951148          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 200, 16667)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
  highvocedu |        975    .2615385    .4396981          0          1
-------------+---------------------------------------------------------
  highgenedu |        975    .2523077    .4345598          0          1
    adultedu |        975    .0553846    .2288468          0          1
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
-------------+---------------------------------------------------------
   Keyschool |        975    .4153846    .4930411          0          1
          m1 |        975   -.1982327    .1500301  -.6780148  -.0206687
          m2 |        975    .6784781    .6649561  -.0080056   2.923427
          m3 |        975   -.3142042    .2689641  -.7260023   .5047768

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Specif
> ied Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) All Parent Indicators & Keyschool & Specified higher education, Sec Gen + inrange(birth
> year, 1971, 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secg
> en_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu p
> arent_highedu parent_partymember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -2783.7837
Iteration 2:  Log likelihood = -2703.0734
Iteration 3:  Log likelihood = -2687.5371
Iteration 4:  Log likelihood = -2686.5062
Iteration 5:  Log likelihood = -2686.4898
Iteration 6:  Log likelihood = -2686.4898

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(20)     =    2490.28
                                                  Prob > chi2     =     0.0000
Log likelihood = -2686.4898                       Pseudo R2       =     0.3167

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0181661   .1192711    -0.15   0.879    -.2519331    .2156009
         exp |  -.6703651   .0504673   -13.28   0.000    -.7692792    -.571451
      expsqr |   .0111759   .0012174     9.18   0.000     .0087898    .0135621
ins1_secge~e |  -8.542201   .8711606    -9.81   0.000    -10.24964   -6.834757
ins2_highe~e |   .9303805   .1674694     5.56   0.000     .6021465    1.258614
ins3_vs_en~e |   1.015819   .7760007     1.31   0.191    -.5051148    2.536752
parent_sec~u |   .5563453   .1414234     3.93   0.000     .2791605    .8335301
parent_hig~u |   .9023966   .6583018     1.37   0.170    -.3878513    2.192644
parent_par~r |   .3915548   .1482851     2.64   0.008     .1009214    .6821881
   Keyschool |   .3716069   .2957822     1.26   0.209    -.2081156    .9513293
       _cons |    7.93915   .6821007    11.64   0.000     6.602257    9.276043
-------------+----------------------------------------------------------------
2            |
        male |   .1904431   .1170344     1.63   0.104    -.0389402    .4198263
         exp |  -.9007425   .0486848   -18.50   0.000    -.9961629   -.8053221
      expsqr |   .0163079   .0011313    14.42   0.000     .0140906    .0185251
ins1_secge~e |  -9.889079   .8697765   -11.37   0.000    -11.59381   -8.184348
ins2_highe~e |   .2432199   .2022003     1.20   0.229    -.1530855    .6395252
ins3_vs_en~e |  -.4378407   .8028677    -0.55   0.586    -2.011432    1.135751
parent_sec~u |   .8888833   .1322373     6.72   0.000      .629703    1.148064
parent_hig~u |   1.016449   .6252262     1.63   0.104    -.2089714     2.24187
parent_par~r |   .3341541   .1417806     2.36   0.018     .0562693    .6120389
   Keyschool |   3.176745   .1827713    17.38   0.000      2.81852     3.53497
       _cons |   11.22643   .6797975    16.51   0.000     9.894051    12.55881
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(27, 947)      =      4.55
       Model |  44.1737772        27  1.63606582   Prob > F        =    0.0000
    Residual |  340.565231       947  .359625376   R-squared       =    0.1148
-------------+----------------------------------   Adj R-squared   =    0.0896
       Total |  384.739008       974  .395009249   Root MSE        =    .59969

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2590537   .0453142     5.72   0.000     .1701258    .3479816
               exp |   -.001635   .0184217    -0.09   0.929     -.037787    .0345171
            expsqr |  -.0001663   .0005063    -0.33   0.743    -.0011599    .0008273
        highvocedu |   .1955577   .0550891     3.55   0.000     .0874469    .3036685
        highgenedu |   .2219465   .0644236     3.45   0.001     .0955169    .3483761
          adultedu |   .0188076   .0888322     0.21   0.832    -.1555232    .1931384
     parent_secedu |   .0375081   .0523468     0.72   0.474     -.065221    .1402373
    parent_highedu |     .08732    .151322     0.58   0.564    -.2096453    .3842852
parent_partymember |  -.0459093   .0527521    -0.87   0.384    -.1494338    .0576152
         Keyschool |   .1129602   .1826272     0.62   0.536    -.2454405     .471361
      provincedum2 |  -.2509457   .1674527    -1.50   0.134    -.5795669    .0776756
      provincedum3 |  -.4386798   .1800712    -2.44   0.015    -.7920646    -.085295
      provincedum4 |    -.39273   .2172941    -1.81   0.071    -.8191637    .0337037
      provincedum5 |  -.0466665   .1402086    -0.33   0.739    -.3218221     .228489
      provincedum6 |  -.1062262   .1504519    -0.71   0.480    -.4014838    .1890314
      provincedum7 |  -.1597073   .1541372    -1.04   0.300    -.4621972    .1427827
      provincedum8 |  -.3640103   .1473416    -2.47   0.014    -.6531641   -.0748564
      provincedum9 |   .0453451   .1398735     0.32   0.746    -.2291529     .319843
     provincedum10 |  -.0717134   .1405519    -0.51   0.610    -.3475425    .2041158
     provincedum11 |  -.1485932   .1451527    -1.02   0.306    -.4334513    .1362649
     provincedum12 |  -.2863572   .1787544    -1.60   0.109    -.6371577    .0644434
     provincedum13 |  -.2292676   .1572729    -1.46   0.145    -.5379112     .079376
     provincedum14 |  -.1608303   .1624642    -0.99   0.322    -.4796617    .1580011
     provincedum15 |  -.3573683   .1516683    -2.36   0.019    -.6550131   -.0597234
               _m1 |  -.0446536    .420236    -0.11   0.915     -.869355    .7800478
               _m2 |  -.0539445   .1335804    -0.40   0.686    -.3160922    .2082033
               _m3 |  -.3361038   .1993212    -1.69   0.092    -.7272662    .0550585
             _cons |   8.038432   .3205335    25.08   0.000     7.409394     8.66747
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3497954          .        .       .            .           .
        rho1 |  -.0755004          .        .       .            .           .
        rho2 |  -.0912095          .        .       .            .           .
        rho3 |  -.5682853          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if in
> range(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
  highvocedu |        975    .2615385    .4396981          0          1
-------------+---------------------------------------------------------
  highgenedu |        975    .2523077    .4345598          0          1
    adultedu |        975    .0553846    .2288468          0          1
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
-------------+---------------------------------------------------------
   Keyschool |        975    .4153846    .4930411          0          1
provincedum2 |        975         .04    .1960597          0          1
provincedum3 |        975    .0246154    .1550294          0          1
provincedum4 |        975    .0112821    .1056703          0          1
provincedum5 |        975    .0861538    .2807351          0          1
-------------+---------------------------------------------------------
provincedum6 |        975    .0717949    .2582804          0          1
provincedum7 |        975    .0728205     .259975          0          1
provincedum8 |        975    .1251282     .331034          0          1
provincedum9 |        975    .1076923    .3101505          0          1
provinced~10 |        975    .1035897     .304884          0          1
-------------+---------------------------------------------------------
provinced~11 |        975    .1076923    .3101505          0          1
provinced~12 |        975    .0225641    .1485854          0          1
provinced~13 |        975    .0492308    .2164605          0          1
provinced~14 |        975    .0482051    .2143094          0          1
provinced~15 |        975    .0810256    .2730145          0          1
-------------+---------------------------------------------------------
          m1 |        975   -.1982327    .1500301  -.6780148  -.0206687
          m2 |        975    .6784781    .6649561  -.0080056   2.923427
          m3 |        975   -.3142042    .2689641  -.7260023   .5047768

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Specif
> ied Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) All Parent Indicators & Keyschool & Combined higher education, Sec Gen + inrange(birthy
> ear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 1
> 6667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relativ
> e ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymember Keyschool) dmf(
> 2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -2783.7837
Iteration 2:  Log likelihood = -2703.0734
Iteration 3:  Log likelihood = -2687.5371
Iteration 4:  Log likelihood = -2686.5062
Iteration 5:  Log likelihood = -2686.4898
Iteration 6:  Log likelihood = -2686.4898

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(20)     =    2490.28
                                                  Prob > chi2     =     0.0000
Log likelihood = -2686.4898                       Pseudo R2       =     0.3167

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0181661   .1192711    -0.15   0.879    -.2519331    .2156009
         exp |  -.6703651   .0504673   -13.28   0.000    -.7692792    -.571451
      expsqr |   .0111759   .0012174     9.18   0.000     .0087898    .0135621
ins1_secge~e |  -8.542201   .8711606    -9.81   0.000    -10.24964   -6.834757
ins2_highe~e |   .9303805   .1674694     5.56   0.000     .6021465    1.258614
ins3_vs_en~e |   1.015819   .7760007     1.31   0.191    -.5051148    2.536752
parent_sec~u |   .5563453   .1414234     3.93   0.000     .2791605    .8335301
parent_hig~u |   .9023966   .6583018     1.37   0.170    -.3878513    2.192644
parent_par~r |   .3915548   .1482851     2.64   0.008     .1009214    .6821881
   Keyschool |   .3716069   .2957822     1.26   0.209    -.2081156    .9513293
       _cons |    7.93915   .6821007    11.64   0.000     6.602257    9.276043
-------------+----------------------------------------------------------------
2            |
        male |   .1904431   .1170344     1.63   0.104    -.0389402    .4198263
         exp |  -.9007425   .0486848   -18.50   0.000    -.9961629   -.8053221
      expsqr |   .0163079   .0011313    14.42   0.000     .0140906    .0185251
ins1_secge~e |  -9.889079   .8697765   -11.37   0.000    -11.59381   -8.184348
ins2_highe~e |   .2432199   .2022003     1.20   0.229    -.1530855    .6395252
ins3_vs_en~e |  -.4378407   .8028677    -0.55   0.586    -2.011432    1.135751
parent_sec~u |   .8888833   .1322373     6.72   0.000      .629703    1.148064
parent_hig~u |   1.016449   .6252262     1.63   0.104    -.2089714     2.24187
parent_par~r |   .3341541   .1417806     2.36   0.018     .0562693    .6120389
   Keyschool |   3.176745   .1827713    17.38   0.000      2.81852     3.53497
       _cons |   11.22643   .6797975    16.51   0.000     9.894051    12.55881
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(11, 963)      =      6.11
       Model |  25.0963634        11  2.28148758   Prob > F        =    0.0000
    Residual |  359.642645       963   .37346069   R-squared       =    0.0652
-------------+----------------------------------   Adj R-squared   =    0.0546
       Total |  384.739008       974  .395009249   Root MSE        =    .61111

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2835093   .0453159     6.26   0.000       .19458    .3724387
               exp |  -.0117883   .0175911    -0.67   0.503    -.0463096     .022733
            expsqr |   .0000714   .0004943     0.14   0.885    -.0008987    .0010414
         higheredu |   .1579065   .0481584     3.28   0.001     .0633989    .2524141
     parent_secedu |   .0689141   .0504675     1.37   0.172    -.0301249     .167953
    parent_highedu |   .0636542   .1508079     0.42   0.673    -.2322959    .3596043
parent_partymember |  -.0253957   .0532115    -0.48   0.633    -.1298195    .0790281
         Keyschool |   .3634507   .1369219     2.65   0.008      .094751    .6321504
               _m1 |  -.6108824   .3051198    -2.00   0.046    -1.209659    -.012106
               _m2 |   .1241262   .0995446     1.25   0.213    -.0712231    .3194755
               _m3 |  -.2374225   .1919265    -1.24   0.216    -.6140649    .1392199
             _cons |   7.633315   .1660852    45.96   0.000     7.307385    7.959246
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4434928          .        .       .            .           .
        rho1 |  -.9173062          .        .       .            .           .
        rho2 |   .1863889          .        .       .            .           .
        rho3 |  -.3565156          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
   higheredu |        975    .5692308     .495438          0          1
-------------+---------------------------------------------------------
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
   Keyschool |        975    .4153846    .4930411          0          1
          m1 |        975   -.1982327    .1500301  -.6780148  -.0206687
-------------+---------------------------------------------------------
          m2 |        975    .6784781    .6649561  -.0080056   2.923427
          m3 |        975   -.3142042    .2689641  -.7260023   .5047768

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Non-sp
> ecified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) All Parent Indicators & Keyschool & Combined higher education, Sec Gen + inrange(birthy
> ear, 1971, 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inr
> ange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative i
> ns2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_
> partymember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -3931.6318
Iteration 1:  Log likelihood = -2783.7837
Iteration 2:  Log likelihood = -2703.0734
Iteration 3:  Log likelihood = -2687.5371
Iteration 4:  Log likelihood = -2686.5062
Iteration 5:  Log likelihood = -2686.4898
Iteration 6:  Log likelihood = -2686.4898

Multinomial logistic regression                   Number of obs   =       4745
                                                  LR chi2(20)     =    2490.28
                                                  Prob > chi2     =     0.0000
Log likelihood = -2686.4898                       Pseudo R2       =     0.3167

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.0181661   .1192711    -0.15   0.879    -.2519331    .2156009
         exp |  -.6703651   .0504673   -13.28   0.000    -.7692792    -.571451
      expsqr |   .0111759   .0012174     9.18   0.000     .0087898    .0135621
ins1_secge~e |  -8.542201   .8711606    -9.81   0.000    -10.24964   -6.834757
ins2_highe~e |   .9303805   .1674694     5.56   0.000     .6021465    1.258614
ins3_vs_en~e |   1.015819   .7760007     1.31   0.191    -.5051148    2.536752
parent_sec~u |   .5563453   .1414234     3.93   0.000     .2791605    .8335301
parent_hig~u |   .9023966   .6583018     1.37   0.170    -.3878513    2.192644
parent_par~r |   .3915548   .1482851     2.64   0.008     .1009214    .6821881
   Keyschool |   .3716069   .2957822     1.26   0.209    -.2081156    .9513293
       _cons |    7.93915   .6821007    11.64   0.000     6.602257    9.276043
-------------+----------------------------------------------------------------
2            |
        male |   .1904431   .1170344     1.63   0.104    -.0389402    .4198263
         exp |  -.9007425   .0486848   -18.50   0.000    -.9961629   -.8053221
      expsqr |   .0163079   .0011313    14.42   0.000     .0140906    .0185251
ins1_secge~e |  -9.889079   .8697765   -11.37   0.000    -11.59381   -8.184348
ins2_highe~e |   .2432199   .2022003     1.20   0.229    -.1530855    .6395252
ins3_vs_en~e |  -.4378407   .8028677    -0.55   0.586    -2.011432    1.135751
parent_sec~u |   .8888833   .1322373     6.72   0.000      .629703    1.148064
parent_hig~u |   1.016449   .6252262     1.63   0.104    -.2089714     2.24187
parent_par~r |   .3341541   .1417806     2.36   0.018     .0562693    .6120389
   Keyschool |   3.176745   .1827713    17.38   0.000      2.81852     3.53497
       _cons |   11.22643   .6797975    16.51   0.000     9.894051    12.55881
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(25, 949)      =      4.73
       Model |  42.6419526        25   1.7056781   Prob > F        =    0.0000
    Residual |  342.097056       949  .360481618   R-squared       =    0.1108
-------------+----------------------------------   Adj R-squared   =    0.0874
       Total |  384.739008       974  .395009249   Root MSE        =     .6004

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2626325   .0452895     5.80   0.000     .1737533    .3515116
               exp |  -.0061014   .0181048    -0.34   0.736    -.0416315    .0294287
            expsqr |  -.0000926   .0005017    -0.18   0.854    -.0010771    .0008919
         higheredu |   .1688711   .0484743     3.48   0.001     .0737418    .2640004
     parent_secedu |    .038487   .0522344     0.74   0.461    -.0640213    .1409954
    parent_highedu |   .0994373   .1511744     0.66   0.511    -.1972375    .3961121
parent_partymember |   -.041482   .0527707    -0.79   0.432    -.1450427    .0620788
         Keyschool |   .0994333   .1827264     0.54   0.586    -.2591612    .4580277
      provincedum2 |  -.2739563   .1672069    -1.64   0.102    -.6020942    .0541816
      provincedum3 |  -.4430241   .1802057    -2.46   0.014    -.7966718   -.0893764
      provincedum4 |  -.3988953   .2175068    -1.83   0.067    -.8257452    .0279545
      provincedum5 |  -.0563669   .1402945    -0.40   0.688    -.3316902    .2189565
      provincedum6 |  -.1152841   .1505565    -0.77   0.444    -.4107463     .180178
      provincedum7 |  -.1759762   .1540235    -1.14   0.254    -.4782423    .1262899
      provincedum8 |  -.3788927   .1472902    -2.57   0.010    -.6679448   -.0898406
      provincedum9 |   .0339821   .1398968     0.24   0.808    -.2405607     .308525
     provincedum10 |  -.0885541   .1403446    -0.63   0.528    -.3639757    .1868674
     provincedum11 |  -.1671663   .1450458    -1.15   0.249    -.4518138    .1174812
     provincedum12 |  -.3388379   .1771461    -1.91   0.056    -.6864813    .0088055
     provincedum13 |  -.2613167   .1566732    -1.67   0.096    -.5687827    .0461493
     provincedum14 |  -.1856285   .1621958    -1.14   0.253    -.5039324    .1326753
     provincedum15 |  -.3729405   .1514786    -2.46   0.014    -.6702122   -.0756689
               _m1 |   .0360431   .4177116     0.09   0.931     -.783702    .8557883
               _m2 |   -.055528   .1337301    -0.42   0.678    -.3179688    .2069128
               _m3 |  -.3138883   .1992154    -1.58   0.115     -.704842    .0770654
             _cons |   8.133641   .3156448    25.77   0.000     7.514199    8.753084
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3514262          .        .       .            .           .
        rho1 |   .0608003          .        .       .            .           .
        rho2 |  -.0936688          .        .       .            .           .
        rho3 |  -.5294904          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971
> , 1992) & inrange(monthlyearning, 200, 16667)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
   higheredu |        975    .5692308     .495438          0          1
-------------+---------------------------------------------------------
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
   Keyschool |        975    .4153846    .4930411          0          1
provincedum2 |        975         .04    .1960597          0          1
-------------+---------------------------------------------------------
provincedum3 |        975    .0246154    .1550294          0          1
provincedum4 |        975    .0112821    .1056703          0          1
provincedum5 |        975    .0861538    .2807351          0          1
provincedum6 |        975    .0717949    .2582804          0          1
provincedum7 |        975    .0728205     .259975          0          1
-------------+---------------------------------------------------------
provincedum8 |        975    .1251282     .331034          0          1
provincedum9 |        975    .1076923    .3101505          0          1
provinced~10 |        975    .1035897     .304884          0          1
provinced~11 |        975    .1076923    .3101505          0          1
provinced~12 |        975    .0225641    .1485854          0          1
-------------+---------------------------------------------------------
provinced~13 |        975    .0492308    .2164605          0          1
provinced~14 |        975    .0482051    .2143094          0          1
provinced~15 |        975    .0810256    .2730145          0          1
          m1 |        975   -.1982327    .1500301  -.6780148  -.0206687
          m2 |        975    .6784781    .6649561  -.0080056   2.923427
-------------+---------------------------------------------------------
          m3 |        975   -.3142042    .2689641  -.7260023   .5047768

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Non-sp
> ecified Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rural/Selmlog Ru
> ral Parent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Rur
> al/Selmlog Rural Parent BothStages.log
  log type:  text
 closed on:   8 Aug 2024, 12:30:55
---------------------------------------------------------------------------------------------
