---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Mal
> e Exp controlled/Urban 1979 Higheredu ManualD MaleExp controlled.log
  log type:  text
 opened on:   6 Aug 2024, 17:18:27

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,431 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(33,372 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(5,190 real changes made)

. 
. *Step Two: Regressions (Three parts Ideally: Firstly rdrobust from birthmonth to earning; S
> econdly rdrobust from birthmonth to higheredu; Thirdly rdrobust*2 or rdrobust+OLS or ivregr
> ess from higheredu to earning. Each part has 6 sheets)
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       486         440            Kernel        =    Uniform
Eff. Number of obs |       486         440            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14303     .07938   1.8018   0.072   -.012555      .298618
    Bias-corrected |  .14721     .07938   1.8544   0.064   -.008381      .302792
            Robust |  .14721     .12593   1.1690   0.242   -.099611      .394022
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2714
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1280        1434            Kernel        =    Uniform
Eff. Number of obs |      1280        1434            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07145     .04967   1.4385   0.150   -.025901      .168794
    Bias-corrected |  .10416     .04967   2.0972   0.036    .006817      .201512
            Robust |  .10416     .07071   1.4731   0.141    -.03443      .242759
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16124
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8361        7763            Kernel        = Epanechnikov
Eff. Number of obs |      1832        2027            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.396      49.396
       BW bias (b) |    80.441      80.441
         rho (h/b) |     0.614       0.614
        Unique obs |       370         261

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04867     .04502   1.0810   0.280   -.039573      .136915
    Bias-corrected |  .05897     .04502   1.3097   0.190   -.029278       .14721
            Robust |  .05897     .05256   1.1220   0.262   -.044041      .161973
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        624
-------------------+----------------------            BW type       =     Manual
     Number of obs |       318         306            Kernel        =    Uniform
Eff. Number of obs |       318         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10056     .10214   0.9845   0.325   -.099635      .300758
    Bias-corrected |  .09063     .10214   0.8873   0.375   -.109569      .290823
            Robust |  .09063     .15609   0.5806   0.562   -.215301      .396555
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1836
-------------------+----------------------            BW type       =     Manual
     Number of obs |       831        1005            Kernel        =    Uniform
Eff. Number of obs |       831        1005            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11848     .06247   1.8966   0.058    -.00396      .240916
    Bias-corrected |  .08617     .06247   1.3794   0.168    -.03627      .208605
            Robust |  .08617     .09026   0.9547   0.340    -.09074      .263075
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10638
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4651        5987            Kernel        = Epanechnikov
Eff. Number of obs |      1167        1445            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.117      49.117
       BW bias (b) |    81.047      81.047
         rho (h/b) |     0.606       0.606
        Unique obs |       320         248

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08741     .05728   1.5260   0.127   -.024856      .199682
    Bias-corrected |  .10455     .05728   1.8253   0.068   -.007716      .216822
            Robust |  .10455      .0665   1.5723   0.116   -.025777      .234883
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       105         100            Kernel        =    Uniform
Eff. Number of obs |       105         100            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04422     .18015   -0.2454  0.806   -.397311      .308879
    Bias-corrected | -.04541     .18015   -0.2520  0.801   -.398503      .307688
            Robust | -.04541     .27373   -0.1659  0.868   -.581902      .491087
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14855     .10364   1.4334   0.152   -.054576      .351685
    Bias-corrected |  .07941     .10364   0.7662   0.444   -.123717      .282544
            Robust |  .07941     .15466   0.5135   0.608   -.223709      .382536
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2756
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1598            Kernel        = Epanechnikov
Eff. Number of obs |       467         510            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.610      56.610
       BW bias (b) |   101.341     101.341
         rho (h/b) |     0.559       0.559
        Unique obs |       236         243

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16132     .08708   1.8525   0.064   -.009354      .331993
    Bias-corrected |  .18385     .08708   2.1113   0.035    .013178      .354525
            Robust |  .18385     .10007   1.8373   0.066   -.012277      .379979
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15232     .12454   1.2231   0.221   -.091777      .396422
    Bias-corrected |  .14708     .12454   1.1809   0.238   -.097021      .391178
            Robust |  .14708     .18977   0.7751   0.438   -.224855      .519013
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         677            Kernel        =    Uniform
Eff. Number of obs |       528         677            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1078     .07778   1.3860   0.166    -.04464      .260246
    Bias-corrected |  .09202     .07778   1.1831   0.237   -.060424      .244462
            Robust |  .09202     .11219   0.8202   0.412   -.127879      .311917
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7882
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3493        4389            Kernel        = Epanechnikov
Eff. Number of obs |       870        1148            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.720      56.720
       BW bias (b) |    85.838      85.838
         rho (h/b) |     0.661       0.661
        Unique obs |       315         237

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03647     .06736   0.5414   0.588   -.095553       .16849
    Bias-corrected |  .04811     .06736   0.7142   0.475   -.083912      .180131
            Robust |  .04811     .07985   0.6025   0.547   -.108399      .204618
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       168         134            Kernel        =    Uniform
Eff. Number of obs |       168         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2243     .11914   1.8827   0.060   -.009202      .457802
    Bias-corrected |  .24596     .11914   2.0645   0.039    .012455      .479459
            Robust |  .24596     .18688   1.3161   0.188    -.12033      .612244
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        878
-------------------+----------------------            BW type       =     Manual
     Number of obs |       449         429            Kernel        =    Uniform
Eff. Number of obs |       449         429            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04979     .08108   -0.6141  0.539   -.208713      .109132
    Bias-corrected |  .14838     .08108   1.8299   0.067   -.010544      .307302
            Robust |  .14838     .11028   1.3455   0.178   -.067768      .364527
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5486
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3710        1776            Kernel        = Epanechnikov
Eff. Number of obs |       818         678            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.969      58.969
       BW bias (b) |    90.838      90.838
         rho (h/b) |     0.649       0.649
        Unique obs |       356         245

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04443     .06646   -0.6686  0.504   -.174686       .08582
    Bias-corrected | -.04186     .06646   -0.6298  0.529   -.172109      .088396
            Robust | -.04186     .07922   -0.5283  0.597   -.197128      .113415
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code
> )

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       486         440            Kernel        =    Uniform
Eff. Number of obs |       486         440            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14303      .1087   1.3158   0.188   -.070026      .356089
    Bias-corrected |  .14721      .1087   1.3542   0.176   -.065852      .360263
            Robust |  .14721     .18049   0.8156   0.415   -.206555      .500966
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code
> )

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2714
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1280        1434            Kernel        =    Uniform
Eff. Number of obs |      1280        1434            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07145     .06341   1.1268   0.260   -.052825      .195719
    Bias-corrected |  .10416     .06341   1.6428   0.100   -.020107      .228437
            Robust |  .10416     .09478   1.0990   0.272   -.081606      .289936
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16124
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8361        7763            Kernel        = Epanechnikov
Eff. Number of obs |      2120        2316            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.637      56.637
       BW bias (b) |    76.822      76.822
         rho (h/b) |     0.737       0.737
        Unique obs |       370         261
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04231     .06443   0.6567   0.511   -.083971      .168594
    Bias-corrected |  .06091     .06443   0.9454   0.344   -.065372      .187193
            Robust |  .06091     .07249   0.8402   0.401   -.081172      .202993
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster p
> rovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        624
-------------------+----------------------            BW type       =     Manual
     Number of obs |       318         306            Kernel        =    Uniform
Eff. Number of obs |       318         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10056     .13664   0.7360   0.462   -.167244      .368367
    Bias-corrected |  .09063     .13664   0.6633   0.507   -.177179      .358433
            Robust |  .09063     .22457   0.4036   0.687   -.349519      .530773
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster p
> rovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1836
-------------------+----------------------            BW type       =     Manual
     Number of obs |       831        1005            Kernel        =    Uniform
Eff. Number of obs |       831        1005            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11848     .07812   1.5166   0.129   -.034632      .271588
    Bias-corrected |  .08617     .07812   1.1030   0.270   -.066943      .239278
            Robust |  .08617     .11525   0.7477   0.455    -.13972      .312055
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code
> )
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10638
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4651        5987            Kernel        = Epanechnikov
Eff. Number of obs |      1382        1718            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.208      58.208
       BW bias (b) |    78.434      78.434
         rho (h/b) |     0.742       0.742
        Unique obs |       320         248
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07528     .07891   0.9541   0.340   -.079374      .229944
    Bias-corrected |  .10316     .07891   1.3073   0.191   -.051503      .257816
            Robust |  .10316     .08705   1.1850   0.236   -.067458      .273772
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       105         100            Kernel        =    Uniform
Eff. Number of obs |       105         100            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04422     .19554   -0.2261  0.821   -.427475      .339043
    Bias-corrected | -.04541     .19554   -0.2322  0.816   -.428666      .337852
            Robust | -.04541     .30897   -0.1470  0.883   -.650979      .560164
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14855     .11087   1.3399   0.180   -.068744      .365852
    Bias-corrected |  .07941     .11087   0.7163   0.474   -.137884      .296712
            Robust |  .07941     .18057   0.4398   0.660   -.274493      .433321
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2756
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1598            Kernel        = Epanechnikov
Eff. Number of obs |       449         491            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.527      54.527
       BW bias (b) |    93.930      93.930
         rho (h/b) |     0.581       0.581
        Unique obs |       236         243
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16401     .10611   1.5457   0.122   -.043955      .371977
    Bias-corrected |  .19174     .10611   1.8070   0.071   -.016231      .399701
            Robust |  .19174     .11907   1.6102   0.107   -.041642      .425112
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15232     .12887   1.1820   0.237   -.100263      .404909
    Bias-corrected |  .14708     .12887   1.1413   0.254   -.105507      .399665
            Robust |  .14708     .23861   0.6164   0.538   -.320588      .614746
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         677            Kernel        =    Uniform
Eff. Number of obs |       528         677            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1078     .07865   1.3707   0.170   -.046347      .261952
    Bias-corrected |  .09202     .07865   1.1700   0.242    -.06213      .246168
            Robust |  .09202     .11441   0.8043   0.421   -.132217      .316255
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7882
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3493        4389            Kernel        = Epanechnikov
Eff. Number of obs |      1097        1467            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.922      69.922
       BW bias (b) |    83.575      83.575
         rho (h/b) |     0.837       0.837
        Unique obs |       315         237
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01613     .07803   0.2067   0.836   -.136806      .169058
    Bias-corrected |  .03651     .07803   0.4679   0.640    -.11642      .189443
            Robust |  .03651     .08332   0.4382   0.661   -.126795      .199818
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       168         134            Kernel        =    Uniform
Eff. Number of obs |       168         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2243     .11736   1.9113   0.056   -.005717      .454317
    Bias-corrected |  .24596     .11736   2.0958   0.036     .01594      .475974
            Robust |  .24596     .16274   1.5114   0.131   -.073004      .564918
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        878
-------------------+----------------------            BW type       =     Manual
     Number of obs |       449         429            Kernel        =    Uniform
Eff. Number of obs |       449         429            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04979     .06234   -0.7987  0.424   -.171969      .072388
    Bias-corrected |  .14838     .06234   2.3803   0.017    .026201      .270558
            Robust |  .14838     .11503   1.2900   0.197   -.077066      .373824
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5486
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3710        1776            Kernel        = Epanechnikov
Eff. Number of obs |       828         691            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.856      59.856
       BW bias (b) |    89.374      89.374
         rho (h/b) |     0.670       0.670
        Unique obs |       356         245
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0434     .06376   -0.6806  0.496    -.16837      .081573
    Bias-corrected | -.04227     .06376   -0.6629  0.507   -.167238      .082704
            Robust | -.04227     .07154   -0.5908  0.555   -.182479      .097944
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        824
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         381            Kernel        =    Uniform
Eff. Number of obs |       443         381            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08591      .0941   0.9129   0.361   -.098528      .270348
    Bias-corrected | -.00957      .0941   -0.1017  0.919   -.194007      .174869
            Robust | -.00957     .17175   -0.0557  0.956   -.346189      .327052
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2612
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1237        1375            Kernel        =    Uniform
Eff. Number of obs |      1237        1375            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04102     .05334   0.7690   0.442   -.063523      .145557
    Bias-corrected |  .04424     .05334   0.8294   0.407   -.060303      .148777
            Robust |  .04424     .08064   0.5486   0.583   -.113812      .202286
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16022
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8318        7704            Kernel        = Epanechnikov
Eff. Number of obs |      1905        2095            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.882      52.882
       BW bias (b) |    83.998      83.998
         rho (h/b) |     0.630       0.630
        Unique obs |       369         260

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01454     .04601   0.3161   0.752   -.075637      .104725
    Bias-corrected |  .01674     .04601   0.3638   0.716    -.07344      .106922
            Robust |  .01674      .0553   0.3027   0.762   -.091639      .125122
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02796     .12373   0.2259   0.821   -.214558      .270468
    Bias-corrected | -.09196     .12373   -0.7432  0.457   -.334476       .15055
            Robust | -.09196     .22086   -0.4164  0.677   -.524834      .340907
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1756
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         960            Kernel        =    Uniform
Eff. Number of obs |       796         960            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09987     .06711   1.4881   0.137   -.031671      .231406
    Bias-corrected |  .02687     .06711   0.4004   0.689   -.104667      .158409
            Robust |  .02687     .10369   0.2592   0.796   -.176352      .230094
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10558
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4616        5942            Kernel        = Epanechnikov
Eff. Number of obs |      1160        1436            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.973      50.973
       BW bias (b) |    83.646      83.646
         rho (h/b) |     0.609       0.609
        Unique obs |       319         247

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06181     .05937   1.0411   0.298   -.054555      .178182
    Bias-corrected |  .07537     .05937   1.2694   0.204   -.040998       .19174
            Robust |  .07537     .07063   1.0671   0.286   -.063061      .213803
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07129     .21171   -0.3367  0.736   -.486224      .343653
    Bias-corrected | -.10941     .21171   -0.5168  0.605   -.524346      .305531
            Robust | -.10941     .39383   -0.2778  0.781   -.881301      .662487
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        604
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         312            Kernel        =    Uniform
Eff. Number of obs |       292         312            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17143     .10768   1.5921   0.111   -.039613      .382472
    Bias-corrected |  .10207     .10768   0.9479   0.343   -.108973      .313111
            Robust |  .10207     .16898   0.6040   0.546   -.229119      .433257
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2729
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1147        1582            Kernel        = Epanechnikov
Eff. Number of obs |       407         446            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.509      50.509
       BW bias (b) |    97.072      97.072
         rho (h/b) |     0.520       0.520
        Unique obs |       235         242

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17982     .09398   1.9133   0.056   -.004383      .364021
    Bias-corrected |  .20869     .09398   2.2205   0.026    .024483      .392887
            Robust |  .20869     .10761   1.9394   0.052   -.002217      .419587
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05329     .15416   0.3457   0.730   -.248857      .355443
    Bias-corrected | -.10006     .15416   -0.6491  0.516   -.402214      .202087
            Robust | -.10006     .27057   -0.3698  0.712   -.630376      .430249
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1152
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         648            Kernel        =    Uniform
Eff. Number of obs |       504         648            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06694     .08463   0.7909   0.429   -.098941      .232817
    Bias-corrected | -.00677     .08463   -0.0800  0.936   -.172648       .15911
            Robust | -.00677     .13198   -0.0513  0.959   -.265454      .251917
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7829
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3469        4360            Kernel        = Epanechnikov
Eff. Number of obs |       846        1119            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.385      56.385
       BW bias (b) |    89.311      89.311
         rho (h/b) |     0.631       0.631
        Unique obs |       314         236

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00539     .07184   -0.0751  0.940   -.146193      .135409
    Bias-corrected | -.00987     .07184   -0.1374  0.891   -.150671      .130931
            Robust | -.00987      .0858   -0.1150  0.908   -.178025      .158285
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         120            Kernel        =    Uniform
Eff. Number of obs |       160         120            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1686     .14415   1.1696   0.242   -.113927      .451131
    Bias-corrected |   .0661     .14415   0.4585   0.647   -.216434      .348625
            Robust |   .0661     .27434   0.2409   0.810   -.471594      .603785
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        856
-------------------+----------------------            BW type       =     Manual
     Number of obs |       441         415            Kernel        =    Uniform
Eff. Number of obs |       441         415            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09835     .08786   -1.1194  0.263   -.270547      .073846
    Bias-corrected |  .08873     .08786   1.0099   0.313   -.083471      .260923
            Robust |  .08873     .12828   0.6916   0.489   -.162706      .340158
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5464
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        1762            Kernel        = Epanechnikov
Eff. Number of obs |       820         677            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.928      59.928
       BW bias (b) |    95.388      95.388
         rho (h/b) |     0.628       0.628
        Unique obs |       355         244

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07919     .06993   -1.1324  0.257   -.216258      .057874
    Bias-corrected | -.08588     .06993   -1.2280  0.219   -.222942       .05119
            Robust | -.08588     .08394   -1.0230  0.306   -.250401      .078648
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        824
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         381            Kernel        =    Uniform
Eff. Number of obs |       443         381            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08591      .0948   0.9062   0.365   -.099903      .271723
    Bias-corrected | -.00957      .0948   -0.1009  0.920   -.195382      .176245
            Robust | -.00957      .1995   -0.0480  0.962   -.400577      .381439
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2612
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1237        1375            Kernel        =    Uniform
Eff. Number of obs |      1237        1375            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04102     .06291   0.6520   0.514   -.082283      .164317
    Bias-corrected |  .04424     .06291   0.7032   0.482   -.079063      .167537
            Robust |  .04424      .0938   0.4716   0.637   -.139614      .228088
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province
> _code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16022
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8318        7704            Kernel        = Epanechnikov
Eff. Number of obs |      2193        2377            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.344      59.344
       BW bias (b) |    77.558      77.558
         rho (h/b) |     0.765       0.765
        Unique obs |       369         260
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01231     .06148   0.2002   0.841   -.108185      .132807
    Bias-corrected |  .02015     .06148   0.3278   0.743   -.100347      .140646
            Robust |  .02015     .06987   0.2884   0.773   -.116789      .157089
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02796     .12132   0.2304   0.818   -.209825      .265736
    Bias-corrected | -.09196     .12132   -0.7580  0.448   -.329744      .145818
            Robust | -.09196     .27003   -0.3406  0.733   -.621216       .43729
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1756
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         960            Kernel        =    Uniform
Eff. Number of obs |       796         960            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09987     .07261   1.3754   0.169   -.042443      .242178
    Bias-corrected |  .02687     .07261   0.3701   0.711    -.11544      .169182
            Robust |  .02687     .10852   0.2476   0.804   -.185822      .239564
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nnclus
> ter province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10558
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4616        5942            Kernel        = Epanechnikov
Eff. Number of obs |      1373        1700            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.245      59.245
       BW bias (b) |    76.423      76.423
         rho (h/b) |     0.775       0.775
        Unique obs |       319         247
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0523     .07603   0.6879   0.492   -.096722      .201319
    Bias-corrected |  .07961     .07603   1.0470   0.295   -.069414      .228626
            Robust |  .07961      .0823   0.9673   0.333   -.081694      .240906
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07129     .17114   -0.4165  0.677    -.40671      .264138
    Bias-corrected | -.10941     .17114   -0.6393  0.523   -.444831      .226017
            Robust | -.10941     .38975   -0.2807  0.779   -.873296      .654482
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        604
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         312            Kernel        =    Uniform
Eff. Number of obs |       292         312            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17143     .09571   1.7911   0.073   -.016162       .35902
    Bias-corrected |  .10207     .09571   1.0664   0.286   -.085522       .28966
            Robust |  .10207     .15437   0.6612   0.508   -.200483       .40462
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2729
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1147        1582            Kernel        = Epanechnikov
Eff. Number of obs |       370         408            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.297      46.297
       BW bias (b) |    87.346      87.346
         rho (h/b) |     0.530       0.530
        Unique obs |       235         242
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17621     .09321   1.8906   0.059    -.00647        .3589
    Bias-corrected |  .20455     .09321   2.1945   0.028    .021861       .38723
            Robust |  .20455     .10622   1.9256   0.054   -.003645      .412736
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05329     .13699   0.3890   0.697   -.215195      .321781
    Bias-corrected | -.10006     .13699   -0.7305  0.465   -.368552      .168425
            Robust | -.10006     .30484   -0.3282  0.743   -.697537       .49741
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1152
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         648            Kernel        =    Uniform
Eff. Number of obs |       504         648            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06694     .08233   0.8130   0.416   -.094435      .228311
    Bias-corrected | -.00677     .08233   -0.0822  0.934   -.168142      .154604
            Robust | -.00677     .12927   -0.0524  0.958   -.260133      .246595
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7829
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3469        4360            Kernel        = Epanechnikov
Eff. Number of obs |      1127        1512            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    72.542      72.542
       BW bias (b) |    86.187      86.187
         rho (h/b) |     0.842       0.842
        Unique obs |       314         236
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01506     .08293   -0.1816  0.856   -.177606      .147481
    Bias-corrected | -.02123     .08293   -0.2560  0.798   -.183775      .141311
            Robust | -.02123     .09059   -0.2344  0.815   -.198794       .15633
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         120            Kernel        =    Uniform
Eff. Number of obs |       160         120            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1686     .14876   1.1334   0.257   -.122958      .460163
    Bias-corrected |   .0661     .14876   0.4443   0.657   -.225465      .357656
            Robust |   .0661     .22182   0.2980   0.766   -.368669       .50086
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        856
-------------------+----------------------            BW type       =     Manual
     Number of obs |       441         415            Kernel        =    Uniform
Eff. Number of obs |       441         415            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09835     .06407   -1.5351  0.125   -.223918      .027217
    Bias-corrected |  .08873     .06407   1.3849   0.166   -.036841      .214293
            Robust |  .08873     .12397   0.7157   0.474   -.154254      .331706
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5464
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        1762            Kernel        = Epanechnikov
Eff. Number of obs |       897         724            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.094      63.094
       BW bias (b) |    97.003      97.003
         rho (h/b) |     0.650       0.650
        Unique obs |       355         244
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07425     .06225   -1.1928  0.233    -.19625      .047752
    Bias-corrected | -.08172     .06225   -1.3129  0.189   -.203724      .040278
            Robust | -.08172     .07143   -1.1441  0.253   -.221719      .058273
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        720
-------------------+----------------------            BW type       =     Manual
     Number of obs |       396         324            Kernel        =    Uniform
Eff. Number of obs |       396         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06064     .12908   0.4698   0.639   -.192357      .313631
    Bias-corrected | -.22708     .12908   -1.7592  0.079   -.480073      .025916
            Robust | -.22708     .30714   -0.7393  0.460   -.829066      .374909
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2508
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1190        1318            Kernel        =    Uniform
Eff. Number of obs |      1190        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02679     .05935   0.4513   0.652   -.089535      .143107
    Bias-corrected |  .00529     .05935   0.0891   0.929   -.111034      .121609
            Robust |  .00529     .10039   0.0527   0.958    -.19148      .202056
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15918
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8271        7647            Kernel        = Epanechnikov
Eff. Number of obs |      1858        2038            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.202      52.202
       BW bias (b) |    85.446      85.446
         rho (h/b) |     0.611       0.611
        Unique obs |       368         259

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00183     .05044   -0.0363  0.971   -.100698      .097036
    Bias-corrected | -.00591     .05044   -0.1172  0.907   -.104779      .092955
            Robust | -.00591     .06149   -0.0961  0.923   -.126436      .114612
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01874     .17082   -0.1097  0.913   -.353537      .316048
    Bias-corrected | -.48049     .17082   -2.8129  0.005   -.815285       -.1457
            Robust | -.48049     .42279   -1.1365  0.256   -1.30914      .348157
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1685
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         925            Kernel        =    Uniform
Eff. Number of obs |       760         925            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10098     .07441   1.3570   0.175   -.044865      .246828
    Bias-corrected | -.00302     .07441   -0.0406  0.968   -.148867      .142826
            Robust | -.00302     .12934   -0.0234  0.981    -.25653      .250489
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4580        5907            Kernel        = Epanechnikov
Eff. Number of obs |      1124        1401            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.123      50.123
       BW bias (b) |    84.576      84.576
         rho (h/b) |     0.593       0.593
        Unique obs |       318         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05839     .06527   0.8946   0.371   -.069539      .186327
    Bias-corrected |  .07077     .06527   1.0842   0.278   -.057164      .198703
            Robust |  .07077      .0788   0.8981   0.369   -.083675      .225214
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17579     .26311   -0.6681  0.504    -.69147      .339899
    Bias-corrected | -.69797     .26311   -2.6528  0.008   -1.21366     -.182289
            Robust | -.69797     .66983   -1.0420  0.297   -2.01081      .614864
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         305            Kernel        =    Uniform
Eff. Number of obs |       281         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17184     .11537   1.4895   0.136   -.054272      .397961
    Bias-corrected |  .09686     .11537   0.8396   0.401   -.129253      .322979
            Robust |  .09686     .19245   0.5033   0.615    -.28033      .474056
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1136        1575            Kernel        = Epanechnikov
Eff. Number of obs |       396         439            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.755      50.755
       BW bias (b) |    98.822      98.822
         rho (h/b) |     0.514       0.514
        Unique obs |       234         241

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18235     .09881   1.8454   0.065   -.011323      .376016
    Bias-corrected |  .21233     .09881   2.1488   0.032     .01866      .405999
            Robust |  .21233     .11396   1.8632   0.062   -.011027      .435686
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05026     .22366   0.2247   0.822   -.388108      .488626
    Bias-corrected | -.40258     .22366   -1.7999  0.072   -.840944      .035791
            Robust | -.40258      .5402   -0.7452  0.456   -1.46136      .656206
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1099
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         620            Kernel        =    Uniform
Eff. Number of obs |       479         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06766      .0953   0.7100   0.478   -.119119      .254442
    Bias-corrected | -.04335      .0953   -0.4549  0.649   -.230133      .143429
            Robust | -.04335     .17135   -0.2530  0.800   -.379185      .292481
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7776
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3444        4332            Kernel        = Epanechnikov
Eff. Number of obs |       793        1036            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.029      54.029
       BW bias (b) |    89.203      89.203
         rho (h/b) |     0.606       0.606
        Unique obs |       313         235

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01268     .08039   -0.1578  0.875   -.170248      .144883
    Bias-corrected | -.02007     .08039   -0.2496  0.803   -.177635      .137496
            Robust | -.02007     .09733   -0.2062  0.837   -.210835      .170696
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        247
-------------------+----------------------            BW type       =     Manual
     Number of obs |       149          98            Kernel        =    Uniform
Eff. Number of obs |       149          98            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19786     .20791   0.9516   0.341   -.209645      .605358
    Bias-corrected |  .09042     .20791   0.4349   0.664   -.317079      .497925
            Robust |  .09042     .49763   0.1817   0.856   -.884909      1.06576
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       430         393            Kernel        =    Uniform
Eff. Number of obs |       430         393            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.14325     .10089   -1.4198  0.156   -.340996      .054494
    Bias-corrected |  .06129     .10089   0.6074   0.544   -.136459      .259031
            Robust |  .06129     .16813   0.3645   0.715   -.268235      .390807
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5431
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3691        1740            Kernel        = Epanechnikov
Eff. Number of obs |       846         682            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.611      61.611
       BW bias (b) |   102.637     102.637
         rho (h/b) |     0.600       0.600
        Unique obs |       354         243

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10389      .0757   -1.3723  0.170   -.252258      .044487
    Bias-corrected | -.11937      .0757   -1.5769  0.115   -.267746      .028999
            Robust | -.11937     .09197   -1.2979  0.194   -.299637       .06089
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        720
-------------------+----------------------            BW type       =     Manual
     Number of obs |       396         324            Kernel        =    Uniform
Eff. Number of obs |       396         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06064     .12426   0.4880   0.626   -.182906       .30418
    Bias-corrected | -.22708     .12426   -1.8275  0.068   -.470622      .016465
            Robust | -.22708     .33008   -0.6880  0.491   -.874015      .419858
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2508
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1190        1318            Kernel        =    Uniform
Eff. Number of obs |      1190        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02679     .06601   0.4058   0.685   -.102596      .156168
    Bias-corrected |  .00529     .06601   0.0801   0.936   -.124095       .13467
            Robust |  .00529     .10761   0.0491   0.961   -.205618      .216194
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province
> _code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15918
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8271        7647            Kernel        = Epanechnikov
Eff. Number of obs |      2067        2230            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.389      57.389
       BW bias (b) |    78.815      78.815
         rho (h/b) |     0.728       0.728
        Unique obs |       368         259
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00177     .06461   -0.0274  0.978    -.12841      .124875
    Bias-corrected | -.00335     .06461   -0.0519  0.959   -.129993      .123292
            Robust | -.00335     .07519   -0.0446  0.964   -.150716      .144015
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01874      .1597   -0.1174  0.907   -.331744      .294254
    Bias-corrected | -.48049      .1597   -3.0088  0.003   -.793492     -.167494
            Robust | -.48049     .43317   -1.1093  0.267   -1.32949      .368503
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1685
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         925            Kernel        =    Uniform
Eff. Number of obs |       760         925            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10098     .08015   1.2599   0.208   -.056115      .258078
    Bias-corrected | -.00302     .08015   -0.0377  0.970   -.160117      .154076
            Robust | -.00302     .14095   -0.0214  0.983   -.279274      .273234
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nnclus
> ter province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4580        5907            Kernel        = Epanechnikov
Eff. Number of obs |      1288        1599            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.762      57.762
       BW bias (b) |    79.821      79.821
         rho (h/b) |     0.724       0.724
        Unique obs |       318         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04978     .08303   0.5996   0.549   -.112954      .212513
    Bias-corrected |  .07061     .08303   0.8505   0.395   -.092121      .233346
            Robust |  .07061     .09453   0.7470   0.455   -.114663      .255887
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17579     .19675   -0.8935  0.372     -.5614      .209829
    Bias-corrected | -.69797     .19675   -3.5476  0.000   -1.08359     -.312359
            Robust | -.69797     .66152   -1.0551  0.291   -1.99453      .598586
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         305            Kernel        =    Uniform
Eff. Number of obs |       281         305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17184     .11429   1.5036   0.133   -.052153      .395842
    Bias-corrected |  .09686     .11429   0.8475   0.397   -.127135      .320861
            Robust |  .09686     .19703   0.4916   0.623   -.289315      .483041
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1136        1575            Kernel        = Epanechnikov
Eff. Number of obs |       365         408            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.151      47.151
       BW bias (b) |    93.499      93.499
         rho (h/b) |     0.504       0.504
        Unique obs |       234         241
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17964      .1081   1.6618   0.097   -.032228      .391511
    Bias-corrected |  .21091      .1081   1.9510   0.051   -.000964      .422775
            Robust |  .21091     .12268   1.7191   0.086   -.029549       .45136
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05026      .1772   0.2836   0.777   -.297055      .397573
    Bias-corrected | -.40258      .1772   -2.2718  0.023    -.74989     -.055263
            Robust | -.40258     .53488   -0.7527  0.452   -1.45092      .645766
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1099
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         620            Kernel        =    Uniform
Eff. Number of obs |       479         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06766      .0896   0.7552   0.450   -.107945      .243268
    Bias-corrected | -.04335      .0896   -0.4839  0.628   -.218959      .132255
            Robust | -.04335      .1669   -0.2598  0.795   -.370466      .283762
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7776
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3444        4332            Kernel        = Epanechnikov
Eff. Number of obs |       993        1344            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.972      66.972
       BW bias (b) |    88.804      88.804
         rho (h/b) |     0.754       0.754
        Unique obs |       313         235
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02955     .09011   -0.3279  0.743   -.206162       .14707
    Bias-corrected | -.04601     .09011   -0.5106  0.610   -.222625      .130607
            Robust | -.04601     .10232   -0.4497  0.653   -.246556      .154538
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        247
-------------------+----------------------            BW type       =     Manual
     Number of obs |       149          98            Kernel        =    Uniform
Eff. Number of obs |       149          98            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19786     .22131   0.8940   0.371   -.235913      .631625
    Bias-corrected |  .09042     .22131   0.4086   0.683   -.343346      .524192
            Robust |  .09042      .4874   0.1855   0.853   -.864859      1.04571
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       430         393            Kernel        =    Uniform
Eff. Number of obs |       430         393            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.14325     .07376   -1.9422  0.052   -.287812       .00131
    Bias-corrected |  .06129     .07376   0.8309   0.406   -.083275      .205847
            Robust |  .06129     .13758   0.4454   0.656   -.208375      .330948
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5431
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3691        1740            Kernel        = Epanechnikov
Eff. Number of obs |       912         719            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.029      65.029
       BW bias (b) |   106.672     106.672
         rho (h/b) |     0.610       0.610
        Unique obs |       354         243
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09879      .0649   -1.5221  0.128   -.225999      .028418
    Bias-corrected | -.11496      .0649   -1.7712  0.077   -.242165      .012251
            Robust | -.11496     .07719   -1.4892  0.136   -.266251      .036337
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *2_2) RDD Higheredu t
. 
. *2_2_1) rdrobust on higheredu, sheet 1, no province no omitting local variables
. 
. **2_2_1_1 Pooled 
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       486         440            Kernel        =    Uniform
Eff. Number of obs |       486         440            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03179     .03647   0.8718   0.383   -.039683      .103265
    Bias-corrected |  .04344     .03647   1.1913   0.234   -.028032      .114917
            Robust |  .04344     .05881   0.7387   0.460   -.071825       .15871
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", replace ctitle(no province no l
> ocal adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2714
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1280        1434            Kernel        =    Uniform
Eff. Number of obs |      1280        1434            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04083     .02173   1.8787   0.060   -.001767      .083421
    Bias-corrected |  .00597     .02173   0.2745   0.784   -.036628       .04856
            Robust |  .00597     .03221   0.1852   0.853   -.057161      .069093
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat != ., covs(male exp ex
> psqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16124
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8361        7763            Kernel        = Epanechnikov
Eff. Number of obs |      2200        2396            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.495      58.495
       BW bias (b) |   101.415     101.415
         rho (h/b) |     0.577       0.577
        Unique obs |       370         261

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01754     .01823   0.9622   0.336   -.018194      .053281
    Bias-corrected |  .01886     .01823   1.0343   0.301   -.016878      .054597
            Robust |  .01886     .02097   0.8995   0.368   -.022236      .059954
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & (educat
> ==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        624
-------------------+----------------------            BW type       =     Manual
     Number of obs |       318         306            Kernel        =    Uniform
Eff. Number of obs |       318         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02048     .04979   0.4113   0.681   -.077115      .118071
    Bias-corrected |  .02325     .04979   0.4669   0.641   -.074344      .120842
            Robust |  .02325     .07637   0.3044   0.761   -.126442       .17294
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & (educat
> ==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1836
-------------------+----------------------            BW type       =     Manual
     Number of obs |       831        1005            Kernel        =    Uniform
Eff. Number of obs |       831        1005            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05152     .03048   1.6904   0.091   -.008214      .111258
    Bias-corrected |  .00069     .03048   0.0225   0.982    -.05905      .060422
            Robust |  .00069     .04508   0.0152   0.988   -.087667       .08904
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat==2), covs
> (male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10638
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4651        5987            Kernel        = Epanechnikov
Eff. Number of obs |      1337        1658            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.281      56.281
       BW bias (b) |    88.251      88.251
         rho (h/b) |     0.638       0.638
        Unique obs |       320         248

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02752     .02603   1.0572   0.290   -.023501      .078548
    Bias-corrected |   .0252     .02603   0.9681   0.333   -.025822      .076227
            Robust |   .0252     .03083   0.8176   0.414   -.035217      .085623
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_3 SecVoc
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       105         100            Kernel        =    Uniform
Eff. Number of obs |       105         100            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04504     .08299   0.5427   0.587   -.117609      .207689
    Bias-corrected |  .16491     .08299   1.9872   0.047    .002264      .327562
            Robust |  .16491     .10231   1.6119   0.107   -.035605      .365431
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05996     .05612   1.0684   0.285   -.050033      .169948
    Bias-corrected |  .03992     .05612   0.7113   0.477   -.070072      .149909
            Robust |  .03992     .07748   0.5152   0.606   -.111935      .191772
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(male exp exp
> sqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2756
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1598            Kernel        = Epanechnikov
Eff. Number of obs |       569         594            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.777      69.777
       BW bias (b) |   119.272     119.272
         rho (h/b) |     0.585       0.585
        Unique obs |       236         243

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05521     .04459   1.2382   0.216   -.032184      .142597
    Bias-corrected |  .06121     .04459   1.3728   0.170   -.026182      .148599
            Robust |  .06121     .05169   1.1841   0.236   -.040106      .162524
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_4 SecGen
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0147     .05493   -0.2676  0.789   -.122365      .092969
    Bias-corrected | -.06147     .05493   -1.1190  0.263   -.169135      .046199
            Robust | -.06147     .08445   -0.7279  0.467    -.22698      .104043
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         677            Kernel        =    Uniform
Eff. Number of obs |       528         677            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05093      .0338   1.5067   0.132    -.01532      .117175
    Bias-corrected | -.01462      .0338   -0.4326  0.665   -.080869      .051625
            Robust | -.01462     .05068   -0.2885  0.773   -.113958      .084714
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(male exp exp
> sqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7882
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3493        4389            Kernel        = Epanechnikov
Eff. Number of obs |       789        1034            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    51.661      51.661
       BW bias (b) |    79.831      79.831
         rho (h/b) |     0.647       0.647
        Unique obs |       315         237

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01532     .02986   0.5128   0.608   -.043218      .073848
    Bias-corrected |  .00946     .02986   0.3166   0.752   -.049076      .067989
            Robust |  .00946     .03572   0.2648   0.791   -.060546      .079459
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_5 SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       168         134            Kernel        =    Uniform
Eff. Number of obs |       168         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        878
-------------------+----------------------            BW type       =     Manual
     Number of obs |       449         429            Kernel        =    Uniform
Eff. Number of obs |       449         429            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(male exp exp
> sqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5486
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3710        1776            Kernel        = Epanechnikov
Eff. Number of obs |      3709        1776            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       356         245

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *2_2_2) rdrobust on higheredu, sheet 2, province-clustered no omitting local variables
. 
. **2_2_2_1 Pooled 
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       486         440            Kernel        =    Uniform
Eff. Number of obs |       486         440            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03179     .04611   0.6895   0.491   -.058584      .122167
    Bias-corrected |  .04344     .04611   0.9421   0.346   -.046933      .133818
            Robust |  .04344      .0526   0.8260   0.409   -.059646      .146531
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", replace ctitle(province-cluster
> ed no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2714
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1280        1434            Kernel        =    Uniform
Eff. Number of obs |      1280        1434            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04083     .03202   1.2752   0.202   -.021922      .103576
    Bias-corrected |  .00597     .03202   0.1863   0.852   -.056783      .068715
            Robust |  .00597     .04082   0.1462   0.884   -.074032      .085964
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat != ., covs(male exp ex
> psqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16124
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8361        7763            Kernel        = Epanechnikov
Eff. Number of obs |      2572        2773            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.863      67.863
       BW bias (b) |   104.115     104.115
         rho (h/b) |     0.652       0.652
        Unique obs |       370         261
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01427     .02671   0.5342   0.593   -.038088      .066631
    Bias-corrected |  .01585     .02671   0.5933   0.553    -.03651      .068209
            Robust |  .01585      .0312   0.5080   0.611   -.045308      .077007
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & (educat
> ==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_c
> ode)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        624
-------------------+----------------------            BW type       =     Manual
     Number of obs |       318         306            Kernel        =    Uniform
Eff. Number of obs |       318         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02048     .05992   0.3418   0.733   -.096962      .137918
    Bias-corrected |  .02325     .05992   0.3880   0.698   -.094191      .140689
            Robust |  .02325     .06991   0.3326   0.739   -.113769      .160268
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & (educat
> ==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_c
> ode)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1836
-------------------+----------------------            BW type       =     Manual
     Number of obs |       831        1005            Kernel        =    Uniform
Eff. Number of obs |       831        1005            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05152     .04022   1.2810   0.200   -.027309      .130353
    Bias-corrected |  .00069     .04022   0.0171   0.986   -.078145      .079517
            Robust |  .00069     .05306   0.0129   0.990     -.1033      .104672
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat==2), covs
> (male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10638
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4651        5987            Kernel        = Epanechnikov
Eff. Number of obs |      1562        1955            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.268      65.268
       BW bias (b) |    86.828      86.828
         rho (h/b) |     0.752       0.752
        Unique obs |       320         248
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02208     .03475   0.6355   0.525   -.046024      .090188
    Bias-corrected |  .02098     .03475   0.6036   0.546    -.04713      .089081
            Robust |  .02098     .04118   0.5094   0.610   -.059728      .101678
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_3 SecVoc
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       105         100            Kernel        =    Uniform
Eff. Number of obs |       105         100            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04504     .09311   0.4837   0.629    -.13746       .22754
    Bias-corrected |  .16491     .09311   1.7711   0.077   -.017587      .347413
            Robust |  .16491     .09964   1.6552   0.098   -.030369      .360195
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05996      .0678   0.8844   0.377   -.072924       .19284
    Bias-corrected |  .03992      .0678   0.5888   0.556   -.092964        .1728
            Robust |  .03992     .07612   0.5244   0.600   -.109265      .189102
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(male exp exp
> sqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2756
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1598            Kernel        = Epanechnikov
Eff. Number of obs |       588         608            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.296      71.296
       BW bias (b) |   110.513     110.513
         rho (h/b) |     0.645       0.645
        Unique obs |       236         243
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0537     .06032   0.8903   0.373   -.064524      .171927
    Bias-corrected |   .0623     .06032   1.0329   0.302   -.055923      .180528
            Robust |   .0623      .0718   0.8677   0.386   -.078432      .203038
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_4 SecGen
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0147     .06619   -0.2221  0.824   -.144434      .115037
    Bias-corrected | -.06147     .06619   -0.9286  0.353   -.191204      .068267
            Robust | -.06147      .0709   -0.8669  0.386   -.200438      .077501
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         677            Kernel        =    Uniform
Eff. Number of obs |       528         677            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05093     .04453   1.1438   0.253   -.036342      .138198
    Bias-corrected | -.01462     .04453   -0.3284  0.743   -.101892      .072648
            Robust | -.01462     .06216   -0.2352  0.814   -.136454       .10721
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(male exp exp
> sqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7882
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3493        4389            Kernel        = Epanechnikov
Eff. Number of obs |       825        1082            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.126      53.126
       BW bias (b) |    76.753      76.753
         rho (h/b) |     0.692       0.692
        Unique obs |       315         237
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0137     .03768   0.3637   0.716   -.060149      .087556
    Bias-corrected |  .01097     .03768   0.2911   0.771   -.062884      .084821
            Robust |  .01097     .04503   0.2436   0.808   -.077289      .099226
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_5 SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       168         134            Kernel        =    Uniform
Eff. Number of obs |       168         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        878
-------------------+----------------------            BW type       =     Manual
     Number of obs |       449         429            Kernel        =    Uniform
Eff. Number of obs |       449         429            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(male exp exp
> sqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5486
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3710        1776            Kernel        = Epanechnikov
Eff. Number of obs |      3709        1776            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       356         245
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *2_2_3) rdrobust on higheredu, sheet 3, no province no Aug-Sep
. 
. **2_2_3_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        824
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         381            Kernel        =    Uniform
Eff. Number of obs |       443         381            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09053     .04259   2.1259   0.034    .007065      .174004
    Bias-corrected |  .22924     .04259   5.3830   0.000    .145776      .312714
            Robust |  .22924     .08033   2.8538   0.004    .071804      .386686
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", replace ctitle(no province no A
> ug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2612
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1237        1375            Kernel        =    Uniform
Eff. Number of obs |      1237        1375            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05984     .02308   2.5931   0.010    .014611      .105076
    Bias-corrected |  .04133     .02308   1.7908   0.073   -.003904       .08656
            Robust |  .04133     .03615   1.1431   0.253   -.029532      .112188
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat != .,
>  covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16022
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8318        7704            Kernel        = Epanechnikov
Eff. Number of obs |      1834        2013            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.710      50.710
       BW bias (b) |    94.685      94.685
         rho (h/b) |     0.536       0.536
        Unique obs |       369         260

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03743     .02039   1.8356   0.066   -.002537        .0774
    Bias-corrected |  .04143     .02039   2.0318   0.042    .001464      .081401
            Robust |  .04143     .02327   1.7805   0.075   -.004176      .087041
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1053     .06115   1.7220   0.085   -.014553      .225157
    Bias-corrected |   .2858     .06115   4.6736   0.000    .165941      .405651
            Robust |   .2858     .11135   2.5665   0.010    .067545      .504047
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1756
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         960            Kernel        =    Uniform
Eff. Number of obs |       796         960            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08197     .03291   2.4911   0.013    .017479      .146468
    Bias-corrected |  .05849     .03291   1.7774   0.076   -.006007      .122982
            Robust |  .05849      .0527   1.1099   0.267   -.044796       .16177
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (educat==1 |
>  educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10558
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4616        5942            Kernel        = Epanechnikov
Eff. Number of obs |      1202        1496            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.879      52.879
       BW bias (b) |    90.437      90.437
         rho (h/b) |     0.585       0.585
        Unique obs |       319         247

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05276     .02831   1.8634   0.062   -.002735      .108247
    Bias-corrected |  .05458     .02831   1.9278   0.054    -.00091      .110072
            Robust |  .05458     .03329   1.6396   0.101   -.010663      .119825
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04261     .13031   0.3270   0.744   -.212799      .298022
    Bias-corrected |  .32357     .13031   2.4830   0.013    .068157      .578978
            Robust |  .32357     .24931   1.2979   0.194   -.165063      .812197
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        604
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         312            Kernel        =    Uniform
Eff. Number of obs |       292         312            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05498     .06494   0.8467   0.397   -.072297      .182265
    Bias-corrected |  .02492     .06494   0.3837   0.701   -.102364      .152198
            Robust |  .02492     .10597   0.2351   0.814   -.182784      .232618
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==1, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2729
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1147        1582            Kernel        = Epanechnikov
Eff. Number of obs |       616         624            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    76.824      76.824
       BW bias (b) |   137.922     137.922
         rho (h/b) |     0.557       0.557
        Unique obs |       235         242

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04624     .04669   0.9904   0.322   -.045269      .137749
    Bias-corrected |  .05226     .04669   1.1194   0.263   -.039246      .143772
            Robust |  .05226     .05447   0.9595   0.337   -.054498      .159024
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10693      .0653   1.6375   0.102    -.02106      .234916
    Bias-corrected |  .24526      .0653   3.7559   0.000    .117277      .373252
            Robust |  .24526     .11407   2.1500   0.032    .021683      .468847
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1152
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         648            Kernel        =    Uniform
Eff. Number of obs |       504         648            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09793     .03607   2.7151   0.007    .027238      .168626
    Bias-corrected |  .07514     .03607   2.0832   0.037    .004445      .145833
            Robust |  .07514     .05815   1.2922   0.196    -.03883      .189108
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==2, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7829
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3469        4360            Kernel        = Epanechnikov
Eff. Number of obs |       780        1031            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.450      52.450
       BW bias (b) |    85.543      85.543
         rho (h/b) |     0.613       0.613
        Unique obs |       314         236

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04933     .03093   1.5950   0.111   -.011289      .109955
    Bias-corrected |  .04791     .03093   1.5489   0.121   -.012713       .10853
            Robust |  .04791     .03708   1.2920   0.196   -.024771      .120588
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         120            Kernel        =    Uniform
Eff. Number of obs |       160         120            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        856
-------------------+----------------------            BW type       =     Manual
     Number of obs |       441         415            Kernel        =    Uniform
Eff. Number of obs |       441         415            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==3, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5464
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        1762            Kernel        = Epanechnikov
Eff. Number of obs |      3701        1762            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       355         244

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *2_2_4) rdrobust on higheredu, sheet 4, province-clustered no Aug-Sep
. 
. **2_2_4_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provi
> nce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        824
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         381            Kernel        =    Uniform
Eff. Number of obs |       443         381            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09053     .06319   1.4327   0.152   -.033318      .214387
    Bias-corrected |  .22924     .06319   3.6278   0.000    .105392      .353098
            Robust |  .22924     .10863   2.1104   0.035    .016341      .442149
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", replace ctitle(province-cluster
> ed no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provi
> nce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2612
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1237        1375            Kernel        =    Uniform
Eff. Number of obs |      1237        1375            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05984     .03359   1.7818   0.075   -.005985      .125671
    Bias-corrected |  .04133     .03359   1.2305   0.219     -.0245      .107156
            Robust |  .04133     .04894   0.8445   0.398   -.054588      .137244
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat != .,
>  covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16022
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8318        7704            Kernel        = Epanechnikov
Eff. Number of obs |      2256        2421            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.570      60.570
       BW bias (b) |    97.997      97.997
         rho (h/b) |     0.618       0.618
        Unique obs |       369         260
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0284     .02888   0.9835   0.325   -.028201      .085007
    Bias-corrected |  .03226     .02888   1.1170   0.264   -.024346      .088862
            Robust |  .03226     .03395   0.9502   0.342   -.034281      .098796
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1053     .08164   1.2899   0.197   -.054704      .265308
    Bias-corrected |   .2858     .08164   3.5008   0.000     .12579      .445802
            Robust |   .2858     .15978   1.7887   0.074   -.027358       .59895
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1756
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         960            Kernel        =    Uniform
Eff. Number of obs |       796         960            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08197     .04317   1.8988   0.058   -.002639      .166585
    Bias-corrected |  .05849     .04317   1.3548   0.175   -.026125      .143099
            Robust |  .05849     .06518   0.8973   0.370   -.069262      .186237
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (educat==1 |
>  educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10558
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4616        5942            Kernel        = Epanechnikov
Eff. Number of obs |      1462        1829            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.629      62.629
       BW bias (b) |    92.455      92.455
         rho (h/b) |     0.677       0.677
        Unique obs |       319         247
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04168     .03683   1.1316   0.258    -.03051      .113861
    Bias-corrected |  .04563     .03683   1.2388   0.215    -.02656      .117811
            Robust |  .04563     .04384   1.0406   0.298   -.040309       .13156
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04261     .13753   0.3098   0.757   -.226949      .312172
    Bias-corrected |  .32357     .13753   2.3526   0.019    .054007      .593128
            Robust |  .32357     .25075   1.2904   0.197   -.167895       .81503
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        604
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         312            Kernel        =    Uniform
Eff. Number of obs |       292         312            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05498     .07374   0.7457   0.456    -.08954      .199508
    Bias-corrected |  .02492     .07374   0.3379   0.735   -.119607      .169441
            Robust |  .02492     .09896   0.2518   0.801   -.169043      .218878
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==1, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2729
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1147        1582            Kernel        = Epanechnikov
Eff. Number of obs |       622         636            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.673      77.673
       BW bias (b) |   125.957     125.957
         rho (h/b) |     0.617       0.617
        Unique obs |       235         242
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04631     .06088   0.7606   0.447   -.073018       .16563
    Bias-corrected |  .05061     .06088   0.8312   0.406   -.068718       .16993
            Robust |  .05061     .07349   0.6886   0.491   -.093441      .194653
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10693     .08465   1.2631   0.207   -.058991      .272847
    Bias-corrected |  .24526     .08465   2.8973   0.004    .079346      .411184
            Robust |  .24526     .14906   1.6454   0.100   -.046896      .537426
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1152
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         648            Kernel        =    Uniform
Eff. Number of obs |       504         648            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09793     .04716   2.0765   0.038    .005496      .190368
    Bias-corrected |  .07514     .04716   1.5932   0.111   -.017297      .167575
            Robust |  .07514     .07261   1.0348   0.301   -.067173       .21745
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==2, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7829
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3469        4360            Kernel        = Epanechnikov
Eff. Number of obs |       780        1031            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.831      52.831
       BW bias (b) |    81.803      81.803
         rho (h/b) |     0.646       0.646
        Unique obs |       314         236
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04861     .03911   1.2430   0.214    -.02804      .125268
    Bias-corrected |  .05158     .03911   1.3188   0.187   -.025076      .128232
            Robust |  .05158     .04689   1.0999   0.271   -.040334       .14349
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         120            Kernel        =    Uniform
Eff. Number of obs |       160         120            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        856
-------------------+----------------------            BW type       =     Manual
     Number of obs |       441         415            Kernel        =    Uniform
Eff. Number of obs |       441         415            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==3, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5464
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        1762            Kernel        = Epanechnikov
Eff. Number of obs |      3701        1762            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       355         244
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *2_2_5) rdrobust on higheredu, sheet 5, no province no July-Oct
. 
. **2_2_5_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        720
-------------------+----------------------            BW type       =     Manual
     Number of obs |       396         324            Kernel        =    Uniform
Eff. Number of obs |       396         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01846     .05153   0.3583   0.720   -.082529      .119454
    Bias-corrected |  .16196     .05153   3.1432   0.002    .060969      .262951
            Robust |  .16196     .11594   1.3970   0.162   -.065273      .389193
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", replace ctitle(no province no J
> uly-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2508
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1190        1318            Kernel        =    Uniform
Eff. Number of obs |      1190        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03762     .02468   1.5243   0.127   -.010753      .085999
    Bias-corrected | -.01998     .02468   -0.8097  0.418   -.068361      .028392
            Robust | -.01998     .04132   -0.4836  0.629   -.100976      .061007
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat != .,
>  covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15918
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8271        7647            Kernel        = Epanechnikov
Eff. Number of obs |      2030        2200            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.720      56.720
       BW bias (b) |   106.597     106.597
         rho (h/b) |     0.532       0.532
        Unique obs |       368         259

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01051      .0201   0.5229   0.601   -.028883      .049904
    Bias-corrected |  .01098      .0201   0.5462   0.585   -.028415      .050373
            Robust |  .01098     .02325   0.4723   0.637   -.034583      .056541
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00394     .07478   0.0527   0.958   -.142619      .150498
    Bias-corrected |  .18396     .07478   2.4601   0.014    .037397      .330514
            Robust |  .18396     .17414   1.0563   0.291   -.157359      .525269
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1685
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         925            Kernel        =    Uniform
Eff. Number of obs |       760         925            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05384     .03504   1.5367   0.124    -.01483      .122514
    Bias-corrected | -.02605     .03504   -0.7434  0.457   -.094718      .042625
            Robust | -.02605     .06039   -0.4313  0.666   -.144401      .092308
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (educat==1 |
>  educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4580        5907            Kernel        = Epanechnikov
Eff. Number of obs |      1096        1365            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.144      49.144
       BW bias (b) |    84.315      84.315
         rho (h/b) |     0.583       0.583
        Unique obs |       318         246

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02642     .03073   0.8599   0.390   -.033801      .086642
    Bias-corrected |  .02401     .03073   0.7816   0.434   -.036207      .084236
            Robust |  .02401     .03686   0.6515   0.515   -.048235      .096265
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04205     .14442   -0.2912  0.771   -.325102      .241006
    Bias-corrected |   .2997     .14442   2.0752   0.038    .016649      .582757
            Robust |   .2997     .33422   0.8967   0.370   -.355355      .954761
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         305            Kernel        =    Uniform
Eff. Number of obs |       281         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04559     .06715   0.6789   0.497   -.086028       .17721
    Bias-corrected | -.02046     .06715   -0.3047  0.761   -.152082      .111155
            Robust | -.02046     .11339   -0.1805  0.857   -.242711      .201784
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==1, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1136        1575            Kernel        = Epanechnikov
Eff. Number of obs |       566         585            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.419      71.419
       BW bias (b) |   126.241     126.241
         rho (h/b) |     0.566       0.566
        Unique obs |       234         241

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04423     .04928   0.8977   0.369   -.052347      .140815
    Bias-corrected |  .04644     .04928   0.9424   0.346   -.050143      .143019
            Robust |  .04644     .05839   0.7954   0.426   -.067995       .16087
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |     .01     .08501   0.1176   0.906   -.156617      .176609
    Bias-corrected |  .12076     .08501   1.4205   0.155   -.045855      .287371
            Robust |  .12076     .19328   0.6248   0.532   -.258064      .499581
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1099
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         620            Kernel        =    Uniform
Eff. Number of obs |       479         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06882     .03883   1.7722   0.076   -.007292      .144932
    Bias-corrected | -.01006     .03883   -0.2591  0.796   -.086173       .06605
            Robust | -.01006     .06898   -0.1459  0.884   -.145251      .125128
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==2, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7776
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3444        4332            Kernel        = Epanechnikov
Eff. Number of obs |       644         866            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.134      46.134
       BW bias (b) |    78.439      78.439
         rho (h/b) |     0.588       0.588
        Unique obs |       313         235

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0261     .03512   0.7432   0.457   -.042733      .094934
    Bias-corrected |  .02342     .03512   0.6669   0.505   -.045411      .092256
            Robust |  .02342      .0426   0.5498   0.582   -.060068      .106913
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        247
-------------------+----------------------            BW type       =     Manual
     Number of obs |       149          98            Kernel        =    Uniform
Eff. Number of obs |       149          98            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       430         393            Kernel        =    Uniform
Eff. Number of obs |       430         393            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==3, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5431
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3691        1740            Kernel        = Epanechnikov
Eff. Number of obs |      3690        1740            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       354         243

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *2_2_6) rdrobust on higheredu, sheet 6, province-clustered no July-Oct
. 
. **2_2_6_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provi
> nce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        720
-------------------+----------------------            BW type       =     Manual
     Number of obs |       396         324            Kernel        =    Uniform
Eff. Number of obs |       396         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01846     .05653   0.3266   0.744   -.092336      .129261
    Bias-corrected |  .16196     .05653   2.8650   0.004    .051161      .272759
            Robust |  .16196     .11883   1.3629   0.173   -.070946      .394866
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", replace ctitle(province-cluster
> ed no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provi
> nce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2508
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1190        1318            Kernel        =    Uniform
Eff. Number of obs |      1190        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03762     .02942   1.2789   0.201   -.020037      .095283
    Bias-corrected | -.01998     .02942   -0.6793  0.497   -.077645      .037676
            Robust | -.01998     .04328   -0.4618  0.644   -.104812      .064843
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat != .,
>  covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15918
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8271        7647            Kernel        = Epanechnikov
Eff. Number of obs |      2293        2488            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.321      62.321
       BW bias (b) |   106.843     106.843
         rho (h/b) |     0.583       0.583
        Unique obs |       368         259
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00868     .02466   0.3520   0.725   -.039645      .057004
    Bias-corrected |  .00884     .02466   0.3585   0.720   -.039486      .057163
            Robust |  .00884     .02863   0.3087   0.758   -.047285      .064962
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00394     .07434   0.0530   0.958   -.141773      .149651
    Bias-corrected |  .18396     .07434   2.4744   0.013    .038243      .329667
            Robust |  .18396     .16418   1.1204   0.263   -.137834      .505744
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1685
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         925            Kernel        =    Uniform
Eff. Number of obs |       760         925            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05384     .03934   1.3687   0.171   -.023258      .130941
    Bias-corrected | -.02605     .03934   -0.6621  0.508   -.103146      .051053
            Robust | -.02605     .06076   -0.4287  0.668   -.145133      .093041
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (educat==1 |
>  educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4580        5907            Kernel        = Epanechnikov
Eff. Number of obs |      1195        1486            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.613      53.613
       BW bias (b) |    81.467      81.467
         rho (h/b) |     0.658       0.658
        Unique obs |       318         246
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02468     .03407   0.7244   0.469   -.042095      .091455
    Bias-corrected |  .02519     .03407   0.7393   0.460   -.041586      .091963
            Robust |  .02519     .03961   0.6359   0.525   -.052447      .102824
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04205     .14678   -0.2865  0.775   -.329731      .245634
    Bias-corrected |   .2997     .14678   2.0419   0.041     .01202      .587385
            Robust |   .2997     .33767   0.8876   0.375   -.362114       .96152
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         305            Kernel        =    Uniform
Eff. Number of obs |       281         305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04559     .07391   0.6168   0.537   -.099278       .19046
    Bias-corrected | -.02046     .07391   -0.2769  0.782   -.165332      .124406
            Robust | -.02046     .10233   -0.2000  0.841   -.221021      .180095
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==1, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1136        1575            Kernel        = Epanechnikov
Eff. Number of obs |       566         585            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.652      71.652
       BW bias (b) |   120.853     120.853
         rho (h/b) |     0.593       0.593
        Unique obs |       234         241
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04398     .06069   0.7246   0.469    -.07498      .162931
    Bias-corrected |  .04796     .06069   0.7903   0.429   -.070991       .16692
            Robust |  .04796     .07289   0.6580   0.511   -.094903      .190833
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |     .01     .10585   0.0944   0.925   -.197459      .217451
    Bias-corrected |  .12076     .10585   1.1409   0.254   -.086697      .328213
            Robust |  .12076     .16396   0.7365   0.461   -.200595      .442111
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1099
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         620            Kernel        =    Uniform
Eff. Number of obs |       479         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06882     .04212   1.6340   0.102   -.013729      .151369
    Bias-corrected | -.01006     .04212   -0.2389  0.811    -.09261      .072488
            Robust | -.01006     .07643   -0.1316  0.895    -.15986      .139737
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==2, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7776
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3444        4332            Kernel        = Epanechnikov
Eff. Number of obs |       564         792            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    42.200      42.200
       BW bias (b) |    73.433      73.433
         rho (h/b) |     0.575       0.575
        Unique obs |       313         235
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03922      .0413   0.9496   0.342   -.041728      .120165
    Bias-corrected |  .04477      .0413   1.0840   0.278   -.036179      .125715
            Robust |  .04477     .04847   0.9237   0.356   -.050225      .139761
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        247
-------------------+----------------------            BW type       =     Manual
     Number of obs |       149          98            Kernel        =    Uniform
Eff. Number of obs |       149          98            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       430         393            Kernel        =    Uniform
Eff. Number of obs |       430         393            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==3, 
> covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5431
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3691        1740            Kernel        = Epanechnikov
Eff. Number of obs |      3690        1740            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       354         243
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Exp control
> led/Higheredu Sheet 6 results.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Mal
> e Exp controlled/Urban 1979 Higheredu ManualD MaleExp controlled.log
  log type:  text
 closed on:   6 Aug 2024, 17:19:47
---------------------------------------------------------------------------------------------
