---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Tenure/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.log
  log type:  text
 opened on:   8 Aug 2024, 12:37:19

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,408 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. **
. tab birthmonth, gen(birthmonthdum)

 birthmonth |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,879        8.22        8.22
          2 |      2,965        8.47       16.70
          3 |      2,870        8.20       24.89
          4 |      2,595        7.41       32.31
          5 |      2,663        7.61       39.92
          6 |      2,708        7.74       47.65
          7 |      2,646        7.56       55.21
          8 |      3,104        8.87       64.08
          9 |      3,121        8.92       72.99
         10 |      3,565       10.18       83.18
         11 |      3,001        8.57       91.75
         12 |      2,887        8.25      100.00
------------+-----------------------------------
      Total |     35,004      100.00

. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. *1)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu secgenhighedu secgenedu = t d td) if inrange(birthyear, 1971, 1992) & inrange(monthl
> yearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,830
                                                        F(17, 5812)   =  27.78
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0752
                                                        Adj R-squared = 0.0724
                                                        Root MSE      = 0.3268

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0087581   .0020735     4.22   0.000     .0046933    .0128229
      tenuresqr |  -.0002089   .0001007    -2.07   0.038    -.0004063   -.0000115
 birthmonthdum2 |  -.0002891   .0212375    -0.01   0.989    -.0419225    .0413443
 birthmonthdum3 |  -.0407888   .0215847    -1.89   0.059    -.0831028    .0015251
 birthmonthdum4 |  -.0265712   .0221904    -1.20   0.231    -.0700727    .0169303
 birthmonthdum5 |  -.0341789   .0214623    -1.59   0.111    -.0762531    .0078953
 birthmonthdum6 |   -.005156   .0213564    -0.24   0.809    -.0470226    .0367105
 birthmonthdum7 |   .0111407   .0219885     0.51   0.612     -.031965    .0542464
 birthmonthdum8 |   -.015568   .0210491    -0.74   0.460    -.0568321    .0256961
 birthmonthdum9 |   -.004923   .0205442    -0.24   0.811    -.0451972    .0353513
birthmonthdum10 |  -.0249041   .0200902    -1.24   0.215    -.0642883    .0144801
birthmonthdum11 |  -.0203065   .0210921    -0.96   0.336    -.0616549     .021042
birthmonthdum12 |  -.0176184   .0215661    -0.82   0.414    -.0598961    .0246592
           male |  -.0161682   .0088794    -1.82   0.069    -.0335751    .0012388
              t |   .0003643   .0002544     1.43   0.152    -.0001345     .000863
              d |  -.0416063   .0198436    -2.10   0.036    -.0805072   -.0027054
             td |   .0014758   .0002809     5.25   0.000     .0009251    .0020264
          _cons |   .0459305   .0236666     1.94   0.052    -.0004649    .0923258
---------------------------------------------------------------------------------

                                                        Number of obs =  5,830
                                                        F(17, 5812)   =  27.54
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0745
                                                        Adj R-squared = 0.0718
                                                        Root MSE      = 0.3116

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0068524    .001977     3.47   0.001     .0029766    .0107281
      tenuresqr |  -.0001872    .000096    -1.95   0.051    -.0003754    1.06e-06
 birthmonthdum2 |   .0116052   .0202499     0.57   0.567    -.0280923    .0513026
 birthmonthdum3 |  -.0274578   .0205809    -1.33   0.182    -.0678041    .0128885
 birthmonthdum4 |  -.0241808   .0211585    -1.14   0.253    -.0656594    .0172978
 birthmonthdum5 |  -.0242407   .0204643    -1.18   0.236    -.0643583     .015877
 birthmonthdum6 |    .002373   .0203633     0.12   0.907    -.0375467    .0422928
 birthmonthdum7 |    .015859   .0209661     0.76   0.449    -.0252423    .0569603
 birthmonthdum8 |  -.0067801   .0200703    -0.34   0.736    -.0461254    .0325652
 birthmonthdum9 |   .0000378   .0195889     0.00   0.998    -.0383637    .0384392
birthmonthdum10 |  -.0264793    .019156    -1.38   0.167    -.0640321    .0110735
birthmonthdum11 |  -.0156011   .0201113    -0.78   0.438    -.0550269    .0238246
birthmonthdum12 |   -.005807   .0205633    -0.28   0.778    -.0461187    .0345047
           male |  -.0111978   .0084665    -1.32   0.186    -.0277953    .0053997
              t |   .0001795   .0002426     0.74   0.459     -.000296    .0006551
              d |  -.0358499   .0189209    -1.89   0.058    -.0729419     .001242
             td |   .0015983   .0002678     5.97   0.000     .0010733    .0021233
          _cons |   .0275095   .0225661     1.22   0.223    -.0167284    .0717474
---------------------------------------------------------------------------------

                                                        Number of obs =  5,830
                                                        F(17, 5812)   =  22.18
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0609
                                                        Adj R-squared = 0.0582
                                                        Root MSE      = 0.3955

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .009149   .0025093     3.65   0.000     .0042299    .0140682
      tenuresqr |     -.0003   .0001219    -2.46   0.014    -.0005389   -.0000611
 birthmonthdum2 |   .0050658   .0257014     0.20   0.844    -.0453185      .05545
 birthmonthdum3 |  -.0282881   .0261215    -1.08   0.279    -.0794959    .0229198
 birthmonthdum4 |  -.0075849   .0268546    -0.28   0.778    -.0602299    .0450601
 birthmonthdum5 |   .0054774   .0259735     0.21   0.833    -.0454402    .0563951
 birthmonthdum6 |   .0227263   .0258453     0.88   0.379    -.0279402    .0733927
 birthmonthdum7 |   .0184159   .0266103     0.69   0.489    -.0337501    .0705819
 birthmonthdum8 |   .0193545   .0254734     0.76   0.447    -.0305829    .0692918
 birthmonthdum9 |   .0400396   .0248623     1.61   0.107    -.0086998     .088779
birthmonthdum10 |     -.0354   .0243129    -1.46   0.145    -.0830623    .0122623
birthmonthdum11 |  -.0016066   .0255255    -0.06   0.950     -.051646    .0484328
birthmonthdum12 |   .0035074   .0260991     0.13   0.893    -.0476565    .0546713
           male |  -.0076536   .0107458    -0.71   0.476    -.0287192    .0134121
              t |   .0001594   .0003079     0.52   0.605    -.0004442    .0007629
              d |  -.0487527   .0240145    -2.03   0.042    -.0958301   -.0016753
             td |   .0018981   .0003399     5.58   0.000     .0012317    .0025645
          _cons |   .0909173    .028641     3.17   0.002     .0347703    .1470644
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,830
                                                  Wald chi2(17)   =     236.38
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .96847

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   2.675649   5.034641     0.53   0.595    -7.192065    12.54336
  secgenhighedu |  -.2651279   10.13712    -0.03   0.979    -20.13352    19.60326
      secgenedu |  -2.250765   5.156413    -0.44   0.662    -12.35715    7.855619
         tenure |   .0270225   .0152306     1.77   0.076     -.002829     .056874
      tenuresqr |  -.0010667   .0005739    -1.86   0.063    -.0021915     .000058
 birthmonthdum2 |   .0350035   .1119849     0.31   0.755    -.1844828    .2544898
 birthmonthdum3 |  -.0059701   .0814409    -0.07   0.942    -.1655913    .1536512
 birthmonthdum4 |    .105549   .1179315     0.90   0.371    -.1255924    .3366905
 birthmonthdum5 |   .0671552   .1579637     0.43   0.671    -.2424479    .3767583
 birthmonthdum6 |   .1214858   .1054293     1.15   0.249    -.0851518    .3281235
 birthmonthdum7 |   .0552799   .0690404     0.80   0.423    -.0800367    .1905965
 birthmonthdum8 |   .1067905   .1334393     0.80   0.424    -.1547457    .3683266
 birthmonthdum9 |   .1076146   .2021583     0.53   0.594    -.2886085    .5038376
birthmonthdum10 |  -.0178431    .063827    -0.28   0.780    -.1429416    .1072555
birthmonthdum11 |   .0531091   .0945347     0.56   0.574    -.1321756    .2383937
birthmonthdum12 |    .046254   .0776399     0.60   0.551    -.1059173    .1984253
           male |   .3833741   .0330445    11.60   0.000     .3186081    .4481401
          _cons |   7.888246   .3384859    23.30   0.000     7.224826    8.551667
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  7.58806  (p = 0.0553)
  Wu-Hausman F(3,5809)            =  2.52353  (p = 0.0559)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   5.330  Chi-sq(17) P-value = 0.9967

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,830    8.108651     .663944   5.298317   9.721166
      tenure |      5,830    5.033791     5.59189         -1         32
   tenuresqr |      5,830    56.60292    115.6538          0       1024
birthmont~m2 |      5,830    .0835334    .2767106          0          1
birthmonth~3 |      5,830    .0778731    .2679947          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,830    .0699828      .25514          0          1
birthmonth~5 |      5,830    .0799314    .2712102          0          1
birthmonth~6 |      5,830    .0816467    .2738491          0          1
birthmonth~7 |      5,830    .0728988    .2599926          0          1
birthmonth~8 |      5,830     .086964    .2818064          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,830     .096741    .2956301          0          1
birthmont~10 |      5,830    .1063465     .308307          0          1
birthmont~11 |      5,830    .0857633    .2800382          0          1
birthmont~12 |      5,830    .0787307    .2693411          0          1
        male |      5,830    .6238422    .4844619          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 
> 1971, 1992) & inrange(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,830
                                                        F(31, 5798)   =  18.46
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0899
                                                        Adj R-squared = 0.0850
                                                        Root MSE      = 0.3246

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0082876   .0020825     3.98   0.000     .0042052    .0123701
      tenuresqr |  -.0001863   .0001006    -1.85   0.064    -.0003835    .0000109
 birthmonthdum2 |   .0025149   .0211073     0.12   0.905    -.0388632    .0438931
 birthmonthdum3 |  -.0388263   .0214493    -1.81   0.070     -.080875    .0032224
 birthmonthdum4 |  -.0266154   .0220546    -1.21   0.228    -.0698506    .0166198
 birthmonthdum5 |  -.0325801   .0213335    -1.53   0.127    -.0744016    .0092415
 birthmonthdum6 |  -.0054872   .0212223    -0.26   0.796    -.0470908    .0361163
 birthmonthdum7 |   .0172564   .0218744     0.79   0.430    -.0256256    .0601384
 birthmonthdum8 |  -.0108442    .020927    -0.52   0.604    -.0518689    .0301805
 birthmonthdum9 |  -.0023636    .020432    -0.12   0.908     -.042418    .0376909
birthmonthdum10 |  -.0208355   .0199863    -1.04   0.297    -.0600161     .018345
birthmonthdum11 |   -.018781   .0209647    -0.90   0.370    -.0598798    .0223177
birthmonthdum12 |  -.0124582    .021433    -0.58   0.561    -.0544748    .0295585
           male |  -.0163545   .0088472    -1.85   0.065    -.0336983    .0009894
   provincedum2 |    -.14388   .0349569    -4.12   0.000    -.2124087   -.0753514
   provincedum3 |  -.0399154   .0440788    -0.91   0.365    -.1263264    .0464956
   provincedum4 |  -.2171694   .0366592    -5.92   0.000    -.2890352   -.1453036
   provincedum5 |  -.1765211   .0279563    -6.31   0.000     -.231326   -.1217162
   provincedum6 |  -.1835378   .0286548    -6.41   0.000    -.2397119   -.1273637
   provincedum7 |   -.142073   .0287905    -4.93   0.000    -.1985132   -.0856328
   provincedum8 |   -.182756   .0271351    -6.74   0.000    -.2359509   -.1295611
   provincedum9 |  -.1940603   .0281857    -6.89   0.000    -.2493147   -.1388058
  provincedum10 |  -.1877293   .0286896    -6.54   0.000    -.2439715    -.131487
  provincedum11 |  -.1655056   .0280373    -5.90   0.000    -.2204691   -.1105421
  provincedum12 |   -.229047   .0328021    -6.98   0.000    -.2933515   -.1647426
  provincedum13 |  -.1959057    .029212    -6.71   0.000    -.2531722   -.1386392
  provincedum14 |  -.1729138   .0302121    -5.72   0.000    -.2321408   -.1136869
  provincedum15 |  -.1182607   .0304713    -3.88   0.000    -.1779959   -.0585255
              t |   .0003712   .0002536     1.46   0.143    -.0001259    .0008684
              d |  -.0432513   .0197541    -2.19   0.029    -.0819768   -.0045258
             td |   .0014831     .00028     5.30   0.000     .0009342    .0020321
          _cons |   .2144067   .0338865     6.33   0.000     .1479764     .280837
---------------------------------------------------------------------------------

                                                        Number of obs =  5,830
                                                        F(31, 5798)   =  17.68
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0864
                                                        Adj R-squared = 0.0815
                                                        Root MSE      = 0.3100

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0065023   .0019888     3.27   0.001     .0026036     .010401
      tenuresqr |  -.0001695   .0000961    -1.76   0.078    -.0003578    .0000188
 birthmonthdum2 |   .0143108   .0201574     0.71   0.478    -.0252053    .0538269
 birthmonthdum3 |  -.0258487   .0204841    -1.26   0.207    -.0660052    .0143078
 birthmonthdum4 |   -.024178   .0210621    -1.15   0.251    -.0654676    .0171116
 birthmonthdum5 |   -.023225   .0203735    -1.14   0.254    -.0631646    .0167146
 birthmonthdum6 |   .0020844   .0202673     0.10   0.918     -.037647    .0418158
 birthmonthdum7 |   .0206605     .02089     0.99   0.323    -.0202917    .0616128
 birthmonthdum8 |  -.0029493   .0199853    -0.15   0.883    -.0421279    .0362293
 birthmonthdum9 |   .0016542   .0195126     0.08   0.932    -.0365978    .0399061
birthmonthdum10 |  -.0233127   .0190869    -1.22   0.222    -.0607302    .0141047
birthmonthdum11 |  -.0144742   .0200213    -0.72   0.470    -.0537235    .0247751
birthmonthdum12 |  -.0013072   .0204685    -0.06   0.949    -.0414331    .0388187
           male |  -.0119053   .0084491    -1.41   0.159    -.0284687     .004658
   provincedum2 |  -.1120154   .0333839    -3.36   0.001    -.1774602   -.0465705
   provincedum3 |  -.0227696   .0420953    -0.54   0.589     -.105292    .0597529
   provincedum4 |  -.1767856   .0350096    -5.05   0.000    -.2454174   -.1081538
   provincedum5 |  -.1527984   .0266983    -5.72   0.000    -.2051371   -.1004598
   provincedum6 |  -.1481683   .0273653    -5.41   0.000    -.2018146    -.094522
   provincedum7 |  -.1170513    .027495    -4.26   0.000    -.1709517    -.063151
   provincedum8 |  -.1515324    .025914    -5.85   0.000    -.2023335   -.1007312
   provincedum9 |  -.1524384   .0269173    -5.66   0.000    -.2052064   -.0996705
  provincedum10 |  -.1524835   .0273985    -5.57   0.000    -.2061949   -.0987721
  provincedum11 |  -.1358947   .0267756    -5.08   0.000    -.1883848   -.0834046
  provincedum12 |  -.1908185    .031326    -6.09   0.000    -.2522293   -.1294078
  provincedum13 |  -.1604293   .0278975    -5.75   0.000    -.2151188   -.1057398
  provincedum14 |  -.1452835   .0288525    -5.04   0.000    -.2018452   -.0887218
  provincedum15 |  -.0856039   .0291001    -2.94   0.003     -.142651   -.0285568
              t |    .000183   .0002422     0.76   0.450    -.0002918    .0006578
              d |  -.0367721   .0188652    -1.95   0.051    -.0737549    .0002107
             td |   .0015997   .0002674     5.98   0.000     .0010755     .002124
          _cons |   .1655043   .0323616     5.11   0.000     .1020635    .2289452
---------------------------------------------------------------------------------

                                                        Number of obs =  5,830
                                                        F(31, 5798)   =  15.23
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0753
                                                        Adj R-squared = 0.0704
                                                        Root MSE      = 0.3930

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .008139    .002521     3.23   0.001      .003197     .013081
      tenuresqr |  -.0002615   .0001218    -2.15   0.032    -.0005002   -.0000227
 birthmonthdum2 |   .0062723   .0255515     0.25   0.806    -.0438181    .0563627
 birthmonthdum3 |  -.0287073   .0259655    -1.11   0.269    -.0796095    .0221948
 birthmonthdum4 |  -.0111552   .0266982    -0.42   0.676    -.0634936    .0411832
 birthmonthdum5 |   .0035375   .0258253     0.14   0.891    -.0470897    .0541646
 birthmonthdum6 |   .0203812   .0256906     0.79   0.428     -.029982    .0707445
 birthmonthdum7 |    .021732   .0264801     0.82   0.412    -.0301789    .0736428
 birthmonthdum8 |   .0197137   .0253332     0.78   0.436    -.0299488    .0693763
 birthmonthdum9 |   .0371759   .0247341     1.50   0.133     -.011312    .0856639
birthmonthdum10 |  -.0365539   .0241944    -1.51   0.131    -.0839841    .0108762
birthmonthdum11 |  -.0041251   .0253789    -0.16   0.871    -.0538772    .0456271
birthmonthdum12 |   .0060266   .0259457     0.23   0.816    -.0448367      .05689
           male |  -.0076901     .01071    -0.72   0.473    -.0286857    .0133055
   provincedum2 |   -.117432   .0423172    -2.78   0.006    -.2003895   -.0344745
   provincedum3 |  -.0339721   .0533597    -0.64   0.524    -.1385771    .0706329
   provincedum4 |  -.2405627   .0443779    -5.42   0.000      -.32756   -.1535654
   provincedum5 |  -.1743572   .0338426    -5.15   0.000    -.2407013   -.1080131
   provincedum6 |  -.1932822   .0346881    -5.57   0.000    -.2612839   -.1252805
   provincedum7 |   -.174628   .0348525    -5.01   0.000    -.2429518   -.1063042
   provincedum8 |  -.1805682   .0328484    -5.50   0.000    -.2449634    -.116173
   provincedum9 |  -.1419715   .0341202    -4.16   0.000    -.2088598   -.0750831
  provincedum10 |  -.0927491   .0347302    -2.67   0.008    -.1608333   -.0246649
  provincedum11 |  -.1517509   .0339406    -4.47   0.000    -.2182871   -.0852147
  provincedum12 |  -.2455837   .0397087    -6.18   0.000    -.3234276   -.1677398
  provincedum13 |    -.20813   .0353627    -5.89   0.000     -.277454   -.1388059
  provincedum14 |  -.1932487   .0365733    -5.28   0.000    -.2649459   -.1215514
  provincedum15 |  -.1215951   .0368871    -3.30   0.001    -.1939077   -.0492826
              t |   .0001038    .000307     0.34   0.735     -.000498    .0007057
              d |   -.048394   .0239134    -2.02   0.043    -.0952732   -.0015148
             td |   .0019468    .000339     5.74   0.000     .0012823    .0026113
          _cons |   .2546095   .0410214     6.21   0.000     .1741923    .3350268
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,830
                                                  Wald chi2(31)   =     428.68
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .82487

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |    2.93539   5.074249     0.58   0.563    -7.009954    12.88074
  secgenhighedu |  -1.510285   9.278055    -0.16   0.871    -19.69494    16.67437
      secgenedu |  -1.431695   4.042396    -0.35   0.723    -9.354645    6.491256
         tenure |   .0192379   .0116542     1.65   0.099    -.0036039    .0420796
      tenuresqr |  -.0007876   .0004036    -1.95   0.051    -.0015787    3.56e-06
 birthmonthdum2 |   .0395232   .1089725     0.36   0.717     -.174059    .2531055
 birthmonthdum3 |  -.0116708   .0789585    -0.15   0.882    -.1664267    .1430851
 birthmonthdum4 |   .0714813   .0820228     0.87   0.383    -.0892804     .232243
 birthmonthdum5 |   .0338916   .1065625     0.32   0.750     -.174967    .2427501
 birthmonthdum6 |   .0962027   .0737804     1.30   0.192    -.0484042    .2408096
 birthmonthdum7 |   .0597351   .0608519     0.98   0.326    -.0595324    .1790025
 birthmonthdum8 |   .0711324   .0875113     0.81   0.416    -.1003866    .2426515
 birthmonthdum9 |   .0577983   .1393167     0.41   0.678    -.2152575     .330854
birthmonthdum10 |  -.0350286   .0596554    -0.59   0.557    -.1519511    .0818939
birthmonthdum11 |   .0221324   .0644873     0.34   0.731    -.1042603    .1485252
birthmonthdum12 |    .034574   .0652112     0.53   0.596    -.0932377    .1623857
           male |   .3856551   .0268034    14.39   0.000     .3331214    .4381888
   provincedum2 |  -.2021527   .1398482    -1.45   0.148    -.4762501    .0719447
   provincedum3 |   -.088726   .1548934    -0.57   0.567    -.3923116    .2148596
   provincedum4 |  -.2757434   .3270243    -0.84   0.399    -.9166992    .3652123
   provincedum5 |  -.0300925   .1172932    -0.26   0.798     -.259983     .199798
   provincedum6 |  -.0107892   .2486988    -0.04   0.965    -.4982299    .4766516
   provincedum7 |  -.1481515   .2692179    -0.55   0.582    -.6758089     .379506
   provincedum8 |  -.1874301   .1704569    -1.10   0.272    -.5215195    .1466592
   provincedum9 |   .1856065   .1291168     1.44   0.151    -.0674578    .4386708
  provincedum10 |   .1263204   .2346209     0.54   0.590     -.333528    .5861689
  provincedum11 |  -.0927325   .1351346    -0.69   0.493    -.3575914    .1721264
  provincedum12 |  -.1999498   .2730453    -0.73   0.464    -.7351088    .3352092
  provincedum13 |  -.1897132    .251563    -0.75   0.451    -.6827676    .3033413
  provincedum14 |  -.3186753   .2270785    -1.40   0.161    -.7637409    .1263904
  provincedum15 |  -.2327089   .2455888    -0.95   0.343    -.7140542    .2486364
          _cons |   7.961576   .4321043    18.43   0.000     7.114667    8.808485
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  8.37307  (p = 0.0389)
  Wu-Hausman F(3,5795)            =  2.77826  (p = 0.0397)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  31.201  Chi-sq(31) P-value = 0.4561

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,830    8.108651     .663944   5.298317   9.721166
      tenure |      5,830    5.033791     5.59189         -1         32
   tenuresqr |      5,830    56.60292    115.6538          0       1024
birthmont~m2 |      5,830    .0835334    .2767106          0          1
birthmonth~3 |      5,830    .0778731    .2679947          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,830    .0699828      .25514          0          1
birthmonth~5 |      5,830    .0799314    .2712102          0          1
birthmonth~6 |      5,830    .0816467    .2738491          0          1
birthmonth~7 |      5,830    .0728988    .2599926          0          1
birthmonth~8 |      5,830     .086964    .2818064          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,830     .096741    .2956301          0          1
birthmont~10 |      5,830    .1063465     .308307          0          1
birthmont~11 |      5,830    .0857633    .2800382          0          1
birthmont~12 |      5,830    .0787307    .2693411          0          1
        male |      5,830    .6238422    .4844619          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,637
                                                        F(16, 3620)   =  14.29
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0594
                                                        Adj R-squared = 0.0552
                                                        Root MSE      = 0.3246

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .008889   .0025783     3.45   0.001     .0038339     .013944
      tenuresqr |  -.0002748   .0001225    -2.24   0.025     -.000515   -.0000347
 birthmonthdum2 |   .0039239   .0261126     0.15   0.881    -.0472729    .0551207
 birthmonthdum3 |  -.0164291   .0261979    -0.63   0.531    -.0677932     .034935
 birthmonthdum4 |  -.0170923   .0273303    -0.63   0.532    -.0706767    .0364921
 birthmonthdum5 |  -.0308095   .0264948    -1.16   0.245    -.0827558    .0211367
 birthmonthdum6 |   .0017598    .026201     0.07   0.946    -.0496104    .0531299
 birthmonthdum7 |   .0179914   .0274227     0.66   0.512     -.035774    .0717569
 birthmonthdum8 |  -.0035226   .0258165    -0.14   0.891    -.0541391    .0470938
 birthmonthdum9 |    -.00684   .0253248    -0.27   0.787    -.0564922    .0428123
birthmonthdum10 |  -.0099063    .024781    -0.40   0.689    -.0584924    .0386797
birthmonthdum11 |  -.0295477    .025581    -1.16   0.248    -.0797023    .0206068
birthmonthdum12 |  -.0004391   .0269284    -0.02   0.987    -.0532354    .0523573
              t |   .0004041   .0003079     1.31   0.189    -.0001996    .0010079
              d |  -.0319567   .0246814    -1.29   0.195    -.0803474     .016434
             td |   .0011386   .0003431     3.32   0.001     .0004659    .0018114
          _cons |   .0386203   .0279321     1.38   0.167     -.016144    .0933845
---------------------------------------------------------------------------------

                                                        Number of obs =  3,637
                                                        F(16, 3620)   =  14.95
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0620
                                                        Adj R-squared = 0.0579
                                                        Root MSE      = 0.3099

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0074084   .0024617     3.01   0.003     .0025819    .0122348
      tenuresqr |  -.0002493    .000117    -2.13   0.033    -.0004786   -.0000199
 birthmonthdum2 |   .0136134   .0249318     0.55   0.585    -.0352684    .0624952
 birthmonthdum3 |  -.0077646   .0250133    -0.31   0.756    -.0568062    .0412769
 birthmonthdum4 |  -.0256437   .0260945    -0.98   0.326    -.0768051    .0255177
 birthmonthdum5 |  -.0218266   .0252968    -0.86   0.388     -.071424    .0277708
 birthmonthdum6 |   .0008035   .0250162     0.03   0.974    -.0482438    .0498508
 birthmonthdum7 |   .0186232   .0261827     0.71   0.477    -.0327111    .0699575
 birthmonthdum8 |   .0025703   .0246492     0.10   0.917    -.0457574     .050898
 birthmonthdum9 |  -.0026636   .0241797    -0.11   0.912    -.0500707    .0447436
birthmonthdum10 |  -.0151626   .0236604    -0.64   0.522    -.0615517    .0312265
birthmonthdum11 |  -.0251455   .0244243    -1.03   0.303    -.0730322    .0227411
birthmonthdum12 |   .0112983   .0257108     0.44   0.660    -.0391107    .0617074
              t |   .0002662    .000294     0.91   0.365    -.0003103    .0008426
              d |  -.0353633   .0235653    -1.50   0.134    -.0815659    .0108394
             td |   .0013029   .0003276     3.98   0.000     .0006606    .0019453
          _cons |    .027309   .0266691     1.02   0.306     -.024979    .0795969
---------------------------------------------------------------------------------

                                                        Number of obs =  3,637
                                                        F(16, 3620)   =  12.04
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0505
                                                        Adj R-squared = 0.0463
                                                        Root MSE      = 0.3965

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0093977   .0031494     2.98   0.003      .003223    .0155724
      tenuresqr |   -.000344   .0001496    -2.30   0.022    -.0006374   -.0000506
 birthmonthdum2 |   .0131391   .0318964     0.41   0.680    -.0493976    .0756758
 birthmonthdum3 |  -.0151606   .0320006    -0.47   0.636    -.0779016    .0475805
 birthmonthdum4 |   -.029809   .0333839    -0.89   0.372    -.0952622    .0356441
 birthmonthdum5 |  -.0008546   .0323633    -0.03   0.979    -.0643068    .0625976
 birthmonthdum6 |   .0135583   .0320044     0.42   0.672    -.0491902    .0763067
 birthmonthdum7 |   .0038086   .0334967     0.11   0.909    -.0618657    .0694828
 birthmonthdum8 |   .0309593   .0315348     0.98   0.326    -.0308685     .092787
 birthmonthdum9 |   .0339123   .0309341     1.10   0.273    -.0267377    .0945624
birthmonthdum10 |  -.0383481   .0302698    -1.27   0.205    -.0976958    .0209995
birthmonthdum11 |  -.0058482    .031247    -0.19   0.852    -.0671117    .0554154
birthmonthdum12 |   .0057545   .0328929     0.17   0.861    -.0587361     .070245
              t |   .0000391   .0003761     0.10   0.917    -.0006984    .0007765
              d |  -.0423734   .0301482    -1.41   0.160    -.1014825    .0167357
             td |   .0018295   .0004191     4.36   0.000     .0010077    .0026513
          _cons |    .092092   .0341189     2.70   0.007     .0251977    .1589862
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,637
                                                  Wald chi2(16)   =      10.45
                                                  Prob > chi2     =     0.8422
                                                  R-squared       =          .
                                                  Root MSE        =      1.484

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.7642866   39.50932    -0.02   0.985    -78.20113    76.67256
  secgenhighedu |   5.682559   67.47749     0.08   0.933    -126.5709     137.936
      secgenedu |  -4.575947   24.05192    -0.19   0.849    -51.71684    42.56495
         tenure |   .0279347   .0767586     0.36   0.716    -.1225095    .1783789
      tenuresqr |  -.0009503   .0023343    -0.41   0.684    -.0055256    .0036249
 birthmonthdum2 |   .0079845    .469175     0.02   0.986    -.9115816    .9275505
 birthmonthdum3 |  -.1211087   .5029355    -0.24   0.810    -1.106844    .8646268
 birthmonthdum4 |   .0387414   .3661317     0.11   0.916    -.6788636    .7563464
 birthmonthdum5 |   .0508029   .2734586     0.19   0.853    -.4851661     .586772
 birthmonthdum6 |   .0931331   .3566005     0.26   0.794     -.605791    .7920571
 birthmonthdum7 |  -.0662566     .47968    -0.14   0.890    -1.006412    .8738989
 birthmonthdum8 |   .1663482   .4447105     0.37   0.708    -.7052684    1.037965
 birthmonthdum9 |   .1887385   .7296039     0.26   0.796    -1.241259    1.618736
birthmonthdum10 |  -.1006544   .3141399    -0.32   0.749    -.7163573    .5150485
birthmonthdum11 |   .1228252   .4099172     0.30   0.764    -.6805978    .9262482
birthmonthdum12 |  -.0054339   .6593543    -0.01   0.993    -1.297745    1.286877
          _cons |   8.519479   1.973844     4.32   0.000     4.650816    12.38814
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  15.4508  (p = 0.0015)
  Wu-Hausman F(3,3617)            =  5.14379  (p = 0.0015)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.218  Chi-sq(16) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,637    8.247407    .6411498   5.298317   9.721166
      tenure |      3,637    5.365961    5.832412         -1         32
   tenuresqr |      3,637    62.80121    123.4198          0       1024
birthmont~m2 |      3,637    .0830355    .2759738          0          1
birthmonth~3 |      3,637    .0816607    .2738848          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,637    .0698378    .2549085          0          1
birthmonth~5 |      3,637    .0783613    .2687762          0          1
birthmonth~6 |      3,637    .0819357    .2743044          0          1
birthmonth~7 |      3,637    .0692879     .253978          0          1
birthmonth~8 |      3,637    .0871597    .2821078          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,637    .0945834     .292679          0          1
birthmont~10 |      3,637    .1025571    .3034212          0          1
birthmont~11 |      3,637    .0901842    .2864849          0          1
birthmont~12 |      3,637    .0739621    .2617451          0          1
        male |      3,637           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971,
>  1992) & inrange(monthlyearning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,637
                                                        F(30, 3606)   =   9.57
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0738
                                                        Adj R-squared = 0.0660
                                                        Root MSE      = 0.3228

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0085181   .0025923     3.29   0.001     .0034356    .0136007
      tenuresqr |  -.0002608   .0001225    -2.13   0.033     -.000501   -.0000207
 birthmonthdum2 |   .0094413   .0259813     0.36   0.716    -.0414983    .0603809
 birthmonthdum3 |  -.0102769   .0260815    -0.39   0.694    -.0614128     .040859
 birthmonthdum4 |  -.0169267   .0272075    -0.62   0.534    -.0702703     .036417
 birthmonthdum5 |  -.0283405   .0263735    -1.07   0.283    -.0800489     .023368
 birthmonthdum6 |   .0027229    .026079     0.10   0.917    -.0484081     .053854
 birthmonthdum7 |   .0250676   .0273477     0.92   0.359    -.0285508    .0786861
 birthmonthdum8 |   .0036789   .0257136     0.14   0.886    -.0467358    .0540937
 birthmonthdum9 |  -.0019611   .0252225    -0.08   0.938    -.0514128    .0474906
birthmonthdum10 |  -.0062357   .0246946    -0.25   0.801    -.0546525    .0421812
birthmonthdum11 |  -.0266695   .0254788    -1.05   0.295    -.0766238    .0232847
birthmonthdum12 |    .004513   .0268111     0.17   0.866    -.0480533    .0570794
   provincedum2 |  -.1338615   .0442136    -3.03   0.002    -.2205477   -.0471753
   provincedum3 |   .0128279   .0546748     0.23   0.815    -.0943687    .1200245
   provincedum4 |  -.2094269   .0461655    -4.54   0.000      -.29994   -.1189138
   provincedum5 |  -.1758412   .0368139    -4.78   0.000    -.2480193   -.1036631
   provincedum6 |  -.1542382   .0373649    -4.13   0.000    -.2274966   -.0809798
   provincedum7 |  -.1392655   .0374374    -3.72   0.000     -.212666    -.065865
   provincedum8 |  -.1699354   .0356041    -4.77   0.000    -.2397417   -.1001292
   provincedum9 |  -.1576902   .0367996    -4.29   0.000    -.2298403   -.0855401
  provincedum10 |  -.1844689   .0374656    -4.92   0.000    -.2579249    -.111013
  provincedum11 |  -.1543531   .0367752    -4.20   0.000    -.2264554   -.0822508
  provincedum12 |  -.2222851   .0419736    -5.30   0.000    -.3045795   -.1399907
  provincedum13 |   -.176652   .0380748    -4.64   0.000    -.2513023   -.1020017
  provincedum14 |    -.16583   .0398739    -4.16   0.000    -.2440078   -.0876523
  provincedum15 |  -.1262638    .038688    -3.26   0.001    -.2021163   -.0504113
              t |   .0004269   .0003076     1.39   0.165    -.0001762    .0010299
              d |  -.0356513   .0246301    -1.45   0.148    -.0839416    .0126389
             td |   .0011315   .0003425     3.30   0.001     .0004601    .0018029
          _cons |   .1951192   .0426343     4.58   0.000     .1115294    .2787089
---------------------------------------------------------------------------------

                                                        Number of obs =  3,637
                                                        F(30, 3606)   =   9.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0744
                                                        Adj R-squared = 0.0667
                                                        Root MSE      = 0.3085

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0070589   .0024776     2.85   0.004     .0022013    .0119166
      tenuresqr |  -.0002359   .0001171    -2.02   0.044    -.0004654   -6.39e-06
 birthmonthdum2 |   .0184409   .0248318     0.74   0.458    -.0302448    .0671266
 birthmonthdum3 |  -.0022177   .0249274    -0.09   0.929     -.051091    .0466556
 birthmonthdum4 |  -.0258805   .0260037    -1.00   0.320    -.0768638    .0251029
 birthmonthdum5 |  -.0200802   .0252065    -0.80   0.426    -.0695007    .0293403
 birthmonthdum6 |   .0014015   .0249251     0.06   0.955    -.0474672    .0502702
 birthmonthdum7 |   .0238612   .0261376     0.91   0.361    -.0273848    .0751072
 birthmonthdum8 |   .0086383   .0245759     0.35   0.725    -.0395458    .0568223
 birthmonthdum9 |   .0013454   .0241065     0.06   0.955    -.0459183     .048609
birthmonthdum10 |  -.0125344    .023602    -0.53   0.595     -.058809    .0337401
birthmonthdum11 |  -.0230992   .0243514    -0.95   0.343    -.0708432    .0246448
birthmonthdum12 |    .015571   .0256248     0.61   0.543    -.0346695    .0658114
   provincedum2 |  -.1246496   .0422573    -2.95   0.003    -.2075003   -.0417989
   provincedum3 |   .0020725   .0522556     0.04   0.968     -.100381     .104526
   provincedum4 |  -.1853327   .0441228    -4.20   0.000     -.271841   -.0988245
   provincedum5 |   -.164608    .035185    -4.68   0.000    -.2335924   -.0956235
   provincedum6 |  -.1355989   .0357116    -3.80   0.000    -.2056159   -.0655819
   provincedum7 |  -.1349771   .0357809    -3.77   0.000    -.2051299   -.0648243
   provincedum8 |  -.1530612   .0340288    -4.50   0.000    -.2197788   -.0863436
   provincedum9 |  -.1339781   .0351713    -3.81   0.000    -.2029358   -.0650203
  provincedum10 |  -.1626563   .0358079    -4.54   0.000    -.2328621   -.0924505
  provincedum11 |  -.1390178   .0351481    -3.96   0.000    -.2079299   -.0701058
  provincedum12 |  -.2027106   .0401164    -5.05   0.000    -.2813638   -.1240575
  provincedum13 |  -.1601013   .0363901    -4.40   0.000    -.2314486    -.088754
  provincedum14 |  -.1485183   .0381097    -3.90   0.000     -.223237   -.0737997
  provincedum15 |  -.1112194   .0369762    -3.01   0.003    -.1837157   -.0387231
              t |   .0002831    .000294     0.96   0.336    -.0002933    .0008594
              d |  -.0384061   .0235403    -1.63   0.103    -.0845597    .0077475
             td |   .0012941   .0003273     3.95   0.000     .0006523    .0019358
          _cons |   .1689809   .0407479     4.15   0.000     .0890897    .2488721
---------------------------------------------------------------------------------

                                                        Number of obs =  3,637
                                                        F(30, 3606)   =   8.31
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0646
                                                        Adj R-squared = 0.0569
                                                        Root MSE      = 0.3943

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |     .00844   .0031671     2.66   0.008     .0022305    .0146495
      tenuresqr |   -.000315   .0001496    -2.11   0.035    -.0006084   -.0000217
 birthmonthdum2 |   .0160272   .0317424     0.50   0.614    -.0462077     .078262
 birthmonthdum3 |  -.0132205   .0318647    -0.41   0.678    -.0756952    .0492542
 birthmonthdum4 |  -.0338496   .0332405    -1.02   0.309    -.0990216    .0313224
 birthmonthdum5 |  -.0004457   .0322215    -0.01   0.989    -.0636199    .0627284
 birthmonthdum6 |   .0143655   .0318617     0.45   0.652    -.0481032    .0768343
 birthmonthdum7 |   .0099747   .0334117     0.30   0.765     -.055533    .0754824
 birthmonthdum8 |   .0338417   .0314154     1.08   0.281    -.0277519    .0954354
 birthmonthdum9 |   .0352822   .0308153     1.14   0.252    -.0251349    .0956993
birthmonthdum10 |  -.0404139   .0301704    -1.34   0.180    -.0995666    .0187389
birthmonthdum11 |  -.0076087   .0311284    -0.24   0.807    -.0686397    .0534224
birthmonthdum12 |   .0071256   .0327561     0.22   0.828    -.0570967    .0713479
   provincedum2 |  -.1268738   .0540175    -2.35   0.019    -.2327817   -.0209659
   provincedum3 |  -.0044485   .0667983    -0.07   0.947    -.1354147    .1265177
   provincedum4 |  -.2567979   .0564022    -4.55   0.000    -.3673813   -.1462146
   provincedum5 |  -.1565294   .0449769    -3.48   0.001    -.2447122   -.0683467
   provincedum6 |  -.1657864   .0456501    -3.63   0.000     -.255289   -.0762838
   provincedum7 |  -.1709144   .0457387    -3.74   0.000    -.2605907   -.0812382
   provincedum8 |  -.1565687    .043499    -3.60   0.000    -.2418537   -.0712837
   provincedum9 |  -.1073676   .0449595    -2.39   0.017    -.1955162    -.019219
  provincedum10 |  -.0940555   .0457732    -2.05   0.040    -.1837995   -.0043116
  provincedum11 |  -.1553727   .0449297    -3.46   0.001    -.2434629   -.0672825
  provincedum12 |  -.2297525   .0512808    -4.48   0.000    -.3302948   -.1292103
  provincedum13 |  -.2046075   .0465175    -4.40   0.000    -.2958107   -.1134044
  provincedum14 |  -.1912313   .0487155    -3.93   0.000    -.2867441   -.0957186
  provincedum15 |  -.1311403   .0472666    -2.77   0.006    -.2238123   -.0384684
              t |  -.0000152   .0003758    -0.04   0.968     -.000752    .0007216
              d |  -.0435983   .0300915    -1.45   0.147    -.1025964    .0153998
             td |   .0018801   .0004184     4.49   0.000     .0010598    .0027004
          _cons |   .2451163    .052088     4.71   0.000     .1429915    .3472411
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,637
                                                  Wald chi2(30)   =      31.72
                                                  Prob > chi2     =     0.3809
                                                  R-squared       =          .
                                                  Root MSE        =     1.4868

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -2.610388   32.66229    -0.08   0.936    -66.62729    61.40651
  secgenhighedu |   7.516807   51.96349     0.14   0.885    -94.32977    109.3634
      secgenedu |  -4.578181   16.66884    -0.27   0.784    -37.24851    28.09215
         tenure |   .0225253   .0519939     0.43   0.665    -.0793809    .1244314
      tenuresqr |  -.0007593   .0015707    -0.48   0.629    -.0038378    .0023192
 birthmonthdum2 |  -.0238484   .4075051    -0.06   0.953    -.8225437    .7748469
 birthmonthdum3 |  -.1544201   .4557742    -0.34   0.735    -1.047721    .7388809
 birthmonthdum4 |   .0280245   .2671493     0.10   0.916    -.4955784    .5516275
 birthmonthdum5 |   .0306306   .1742096     0.18   0.860    -.3108139     .372075
 birthmonthdum6 |   .0915582   .2768444     0.33   0.741    -.4510469    .6341633
 birthmonthdum7 |  -.0519588   .2941555    -0.18   0.860    -.6284929    .5245754
 birthmonthdum8 |   .1317896   .2601321     0.51   0.612    -.3780599    .6416392
 birthmonthdum9 |   .1564342   .4633799     0.34   0.736    -.7517737    1.064642
birthmonthdum10 |   -.128225   .2578707    -0.50   0.619    -.6336422    .3771922
birthmonthdum11 |   .0792938   .2376041     0.33   0.739    -.3864017    .5449894
birthmonthdum12 |  -.0446888   .5634685    -0.08   0.937    -1.149067    1.059689
   provincedum2 |  -.2150738   .2095156    -1.03   0.305    -.6257169    .1955692
   provincedum3 |  -.0756923   .3410433    -0.22   0.824    -.7441249    .5927403
   provincedum4 |  -.5556899   1.468342    -0.38   0.705    -3.433588    2.322208
   provincedum5 |   .0441665   .2965157     0.15   0.882    -.5369935    .6253266
   provincedum6 |  -.1220552    .750877    -0.16   0.871    -1.593747    1.349637
   provincedum7 |  -.1939514   .4020265    -0.48   0.629    -.9819089    .5940061
   provincedum8 |  -.1762757   .2551687    -0.69   0.490    -.6763971    .3238457
   provincedum9 |   .1748788   .2171289     0.81   0.421    -.2506861    .6004436
  provincedum10 |   .3368446   .9171875     0.37   0.713     -1.46081    2.134499
  provincedum11 |  -.1771778   .4176144    -0.42   0.671     -.995687    .6413314
  provincedum12 |  -.3150251   .5561844    -0.57   0.571    -1.405126    .7750763
  provincedum13 |  -.4116541   .8490241    -0.48   0.628    -2.075711    1.252402
  provincedum14 |  -.5110934   .8810585    -0.58   0.562    -2.237936     1.21575
  provincedum15 |  -.3380197   .5415532    -0.62   0.533    -1.399444    .7234052
          _cons |   8.717634   1.733209     5.03   0.000     5.320607    12.11466
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  14.4812  (p = 0.0023)
  Wu-Hausman F(3,3603)            =  4.80104  (p = 0.0024)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   3.441  Chi-sq(30) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,637    8.247407    .6411498   5.298317   9.721166
      tenure |      3,637    5.365961    5.832412         -1         32
   tenuresqr |      3,637    62.80121    123.4198          0       1024
birthmont~m2 |      3,637    .0830355    .2759738          0          1
birthmonth~3 |      3,637    .0816607    .2738848          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,637    .0698378    .2549085          0          1
birthmonth~5 |      3,637    .0783613    .2687762          0          1
birthmonth~6 |      3,637    .0819357    .2743044          0          1
birthmonth~7 |      3,637    .0692879     .253978          0          1
birthmonth~8 |      3,637    .0871597    .2821078          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,637    .0945834     .292679          0          1
birthmont~10 |      3,637    .1025571    .3034212          0          1
birthmont~11 |      3,637    .0901842    .2864849          0          1
birthmont~12 |      3,637    .0739621    .2617451          0          1
        male |      3,637           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,193
                                                        F(16, 2176)   =  16.48
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1081
                                                        Adj R-squared = 0.1015
                                                        Root MSE      = 0.3299

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0075836   .0035118     2.16   0.031     .0006968    .0144704
      tenuresqr |  -.0000207   .0001793    -0.12   0.908    -.0003723     .000331
 birthmonthdum2 |  -.0119034   .0366021    -0.33   0.745    -.0836821    .0598753
 birthmonthdum3 |  -.0918915   .0380198    -2.42   0.016    -.1664503   -.0173327
 birthmonthdum4 |  -.0539086   .0381774    -1.41   0.158    -.1287766    .0209594
 birthmonthdum5 |  -.0490297   .0368132    -1.33   0.183    -.1212224     .023163
 birthmonthdum6 |  -.0241271   .0369281    -0.65   0.514    -.0965452    .0482909
 birthmonthdum7 |  -.0120313   .0371802    -0.32   0.746    -.0849438    .0608811
 birthmonthdum8 |  -.0411405   .0364358    -1.13   0.259    -.1125931    .0303122
 birthmonthdum9 |  -.0145112   .0353688    -0.41   0.682    -.0838712    .0548489
birthmonthdum10 |  -.0576281   .0345597    -1.67   0.096    -.1254015    .0101454
birthmonthdum11 |  -.0037406   .0371784    -0.10   0.920    -.0766495    .0691682
birthmonthdum12 |  -.0535036   .0364392    -1.47   0.142    -.1249627    .0179556
              t |   .0003571    .000451     0.79   0.429    -.0005274    .0012416
              d |   -.057559   .0335452    -1.72   0.086    -.1233429     .008225
             td |   .0019616   .0004905     4.00   0.000     .0009997    .0029235
          _cons |   .0433101   .0405373     1.07   0.285    -.0361859     .122806
---------------------------------------------------------------------------------

                                                        Number of obs =  2,193
                                                        F(16, 2176)   =  15.20
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1006
                                                        Adj R-squared = 0.0939
                                                        Root MSE      = 0.3143

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0053318   .0033463     1.59   0.111    -.0012306    .0118942
      tenuresqr |  -.0000376   .0001709    -0.22   0.826    -.0003727    .0002975
 birthmonthdum2 |   .0052899   .0348778     0.15   0.879    -.0631073    .0736871
 birthmonthdum3 |  -.0675108   .0362286    -1.86   0.063    -.1385571    .0035356
 birthmonthdum4 |  -.0290453   .0363789    -0.80   0.425    -.1003863    .0422956
 birthmonthdum5 |  -.0342439   .0350789    -0.98   0.329    -.1030356    .0345477
 birthmonthdum6 |   .0000542   .0351884     0.00   0.999    -.0689522    .0690606
 birthmonthdum7 |   .0025281   .0354287     0.07   0.943    -.0669494    .0720056
 birthmonthdum8 |  -.0256403   .0347193    -0.74   0.460    -.0937267    .0424462
 birthmonthdum9 |  -.0041778   .0337025    -0.12   0.901    -.0702703    .0619147
birthmonthdum10 |   -.049695   .0329316    -1.51   0.131    -.1142756    .0148856
birthmonthdum11 |   .0026889   .0354269     0.08   0.940    -.0667852     .072163
birthmonthdum12 |   -.037881   .0347225    -1.09   0.275    -.1059737    .0302118
              t |   .0000584   .0004298     0.14   0.892    -.0007845    .0009012
              d |  -.0351151   .0319649    -1.10   0.272       -.0978    .0275698
             td |   .0020535   .0004674     4.39   0.000     .0011369      .00297
          _cons |   .0158027   .0386276     0.41   0.683    -.0599481    .0915536
---------------------------------------------------------------------------------

                                                        Number of obs =  2,193
                                                        F(16, 2176)   =  12.27
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0827
                                                        Adj R-squared = 0.0760
                                                        Root MSE      = 0.3942

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0085007   .0041971     2.03   0.043     .0002698    .0167315
      tenuresqr |  -.0002178   .0002143    -1.02   0.310     -.000638    .0002025
 birthmonthdum2 |  -.0086102   .0437453    -0.20   0.844    -.0943972    .0771768
 birthmonthdum3 |  -.0561241   .0454397    -1.24   0.217    -.1452338    .0329855
 birthmonthdum4 |   .0241673   .0456281     0.53   0.596    -.0653119    .1136465
 birthmonthdum5 |   .0118909   .0439976     0.27   0.787    -.0743909    .0981726
 birthmonthdum6 |   .0354794    .044135     0.80   0.422    -.0510717    .1220305
 birthmonthdum7 |   .0347861   .0444363     0.78   0.434    -.0523559    .1219281
 birthmonthdum8 |  -.0015967   .0435466    -0.04   0.971     -.086994    .0838006
 birthmonthdum9 |   .0444924   .0422713     1.05   0.293    -.0384039    .1273888
birthmonthdum10 |   -.034129   .0413043    -0.83   0.409     -.115129    .0468711
birthmonthdum11 |    .008051   .0444341     0.18   0.856    -.0790867    .0951887
birthmonthdum12 |  -.0039493   .0435506    -0.09   0.928    -.0893544    .0814558
              t |   .0004402   .0005391     0.82   0.414     -.000617    .0014973
              d |  -.0608173   .0400919    -1.52   0.129    -.1394397     .017805
             td |   .0018937   .0005862     3.23   0.001     .0007441    .0030433
          _cons |   .0848778   .0484486     1.75   0.080    -.0101325    .1798881
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,193
                                                  Wald chi2(16)   =      45.03
                                                  Prob > chi2     =     0.0001
                                                  R-squared       =          .
                                                  Root MSE        =      .7597

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .3304594   26.82985     0.01   0.990    -52.25509      52.916
  secgenhighedu |   1.629641   6.569602     0.25   0.804    -11.24654    14.50582
      secgenedu |  -1.459985   21.42712    -0.07   0.946    -43.45637     40.5364
         tenure |   .0438342   .0142082     3.09   0.002     .0159866    .0716817
      tenuresqr |  -.0018135   .0043893    -0.41   0.679    -.0104164    .0067894
 birthmonthdum2 |   .0030972   .1898308     0.02   0.987    -.3689643    .3751588
 birthmonthdum3 |   .0877402   .8851607     0.10   0.921    -1.647143    1.822623
 birthmonthdum4 |   .1771113   1.799079     0.10   0.922    -3.349019    3.703241
 birthmonthdum5 |    .085763   1.378742     0.06   0.950    -2.616522    2.788049
 birthmonthdum6 |   .1493585   1.407232     0.11   0.915    -2.608766    2.907483
 birthmonthdum7 |   .1240059   1.084663     0.11   0.909    -2.001895    2.249907
 birthmonthdum8 |   .0449269   .9268763     0.05   0.961    -1.771717    1.861571
 birthmonthdum9 |   .0396839    1.32124     0.03   0.976      -2.5499    2.629268
birthmonthdum10 |   .0568549   .5417422     0.10   0.916     -1.00494     1.11865
birthmonthdum11 |  -.0316085   .2996707    -0.11   0.916    -.6189523    .5557353
birthmonthdum12 |   .0021315   1.138742     0.00   0.999    -2.229763    2.234025
          _cons |    7.76889   .7585956    10.24   0.000      6.28207     9.25571
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  .414473  (p = 0.9372)
  Wu-Hausman F(3,2173)            =  .136924  (p = 0.9380)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  12.011  Chi-sq(16) P-value = 0.7432

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,193    7.878531    .6367446   5.298317   9.721166
      tenure |      2,193      4.4829    5.122389         -1         31
   tenuresqr |      2,193     46.3233    100.6615          0        961
birthmont~m2 |      2,193    .0843593    .2779893          0          1
birthmonth~3 |      2,193    .0715914     .257869          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,193    .0702234    .2555815          0          1
birthmonth~5 |      2,193    .0825353    .2752414          0          1
birthmonth~6 |      2,193    .0811674    .2731542          0          1
birthmonth~7 |      2,193    .0788874    .2696244          0          1
birthmonth~8 |      2,193    .0866393    .2813699          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,193    .1003192    .3004936          0          1
birthmont~10 |      2,193    .1126311    .3162134          0          1
birthmont~11 |      2,193    .0784314    .2689105          0          1
birthmont~12 |      2,193    .0866393    .2813699          0          1
        male |      2,193           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971,
>  1992) & inrange(monthlyearning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,193
                                                        F(30, 2162)   =  10.79
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1302
                                                        Adj R-squared = 0.1182
                                                        Root MSE      = 0.3268

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0067076   .0035215     1.90   0.057    -.0001984    .0136135
      tenuresqr |   .0000304   .0001791     0.17   0.865    -.0003209    .0003817
 birthmonthdum2 |  -.0181999   .0363631    -0.50   0.617    -.0895101    .0531104
 birthmonthdum3 |  -.0970099    .037777    -2.57   0.010     -.171093   -.0229269
 birthmonthdum4 |  -.0581999   .0379517    -1.53   0.125    -.1326255    .0162256
 birthmonthdum5 |  -.0525445   .0365946    -1.44   0.151    -.1243088    .0192199
 birthmonthdum6 |  -.0291776   .0366577    -0.80   0.426    -.1010656    .0427105
 birthmonthdum7 |  -.0135737   .0369227    -0.37   0.713    -.0859814     .058834
 birthmonthdum8 |   -.042406   .0362051    -1.17   0.242    -.1134064    .0285944
 birthmonthdum9 |  -.0193106   .0351805    -0.55   0.583    -.0883017    .0496806
birthmonthdum10 |  -.0582579   .0343134    -1.70   0.090    -.1255486    .0090327
birthmonthdum11 |  -.0135291   .0369329    -0.37   0.714    -.0859568    .0588986
birthmonthdum12 |  -.0511628   .0361798    -1.41   0.157    -.1221136     .019788
   provincedum2 |  -.1478282   .0581245    -2.54   0.011    -.2618139   -.0338425
   provincedum3 |   -.139942   .0756291    -1.85   0.064    -.2882554    .0083714
   provincedum4 |  -.2261534   .0613485    -3.69   0.000    -.3464616   -.1058451
   provincedum5 |  -.1810959   .0431467    -4.20   0.000    -.2657092   -.0964827
   provincedum6 |  -.2293536    .044852    -5.11   0.000    -.3173112    -.141396
   provincedum7 |  -.1410752   .0453272    -3.11   0.002    -.2299647   -.0521857
   provincedum8 |   -.201265   .0420793    -4.78   0.000    -.2837851   -.1187449
   provincedum9 |  -.2548786   .0440544    -5.79   0.000    -.3412721   -.1684852
  provincedum10 |  -.1893352   .0448361    -4.22   0.000    -.2772615   -.1014088
  provincedum11 |  -.1792421   .0435022    -4.12   0.000    -.2645527   -.0939316
  provincedum12 |  -.2370323   .0531088    -4.46   0.000     -.341182   -.1328826
  provincedum13 |  -.2225279   .0457389    -4.87   0.000    -.3122246   -.1328311
  provincedum14 |   -.189288   .0464775    -4.07   0.000    -.2804333   -.0981427
  provincedum15 |  -.0861715   .0510136    -1.69   0.091    -.1862123    .0138693
              t |   .0003526   .0004484     0.79   0.432    -.0005267     .001232
              d |  -.0551287   .0333163    -1.65   0.098     -.120464    .0102067
             td |    .001983   .0004881     4.06   0.000     .0010258    .0029402
          _cons |   .2324778   .0552394     4.21   0.000     .1241499    .3408058
---------------------------------------------------------------------------------

                                                        Number of obs =  2,193
                                                        F(30, 2162)   =   9.68
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1184
                                                        Adj R-squared = 0.1062
                                                        Root MSE      = 0.3122

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0047578   .0033641     1.41   0.157    -.0018394     .011355
      tenuresqr |   1.65e-06   .0001711     0.01   0.992    -.0003339    .0003372
 birthmonthdum2 |   .0008738   .0347376     0.03   0.980    -.0672487    .0689963
 birthmonthdum3 |  -.0732124   .0360883    -2.03   0.043    -.1439837   -.0024411
 birthmonthdum4 |  -.0336975   .0362551    -0.93   0.353     -.104796     .037401
 birthmonthdum5 |  -.0373214   .0349588    -1.07   0.286    -.1058777    .0312349
 birthmonthdum6 |  -.0045928    .035019    -0.13   0.896    -.0732673    .0640817
 birthmonthdum7 |   .0005059   .0352722     0.01   0.989     -.068665    .0696768
 birthmonthdum8 |  -.0273088   .0345866    -0.79   0.430    -.0951353    .0405176
 birthmonthdum9 |  -.0094804   .0336078    -0.28   0.778    -.0753874    .0564267
birthmonthdum10 |  -.0510938   .0327795    -1.56   0.119    -.1153764    .0131888
birthmonthdum11 |  -.0060489   .0352819    -0.17   0.864    -.0752389    .0631411
birthmonthdum12 |  -.0364355   .0345624    -1.05   0.292    -.1042146    .0313436
   provincedum2 |  -.0840654   .0555262    -1.51   0.130    -.1929556    .0248249
   provincedum3 |   -.080364   .0722483    -1.11   0.266    -.2220473    .0613194
   provincedum4 |  -.1652029   .0586061    -2.82   0.005     -.280133   -.0502727
   provincedum5 |  -.1432229   .0412179    -3.47   0.001    -.2240538   -.0623921
   provincedum6 |  -.1725122    .042847    -4.03   0.000    -.2565379   -.0884865
   provincedum7 |  -.0885971    .043301    -2.05   0.041    -.1735131   -.0036812
   provincedum8 |  -.1540389   .0401982    -3.83   0.000    -.2328701   -.0752076
   provincedum9 |  -.1901479   .0420851    -4.52   0.000    -.2726793   -.1076165
  provincedum10 |  -.1399448   .0428318    -3.27   0.001    -.2239405    -.055949
  provincedum11 |  -.1338045   .0415576    -3.22   0.001    -.2153015   -.0523076
  provincedum12 |  -.1726994   .0507347    -3.40   0.001    -.2721933   -.0732055
  provincedum13 |  -.1638086   .0436942    -3.75   0.000    -.2494956   -.0781215
  provincedum14 |  -.1482042   .0443999    -3.34   0.001    -.2352751   -.0611334
  provincedum15 |  -.0294606   .0487331    -0.60   0.546    -.1250293    .0661081
              t |    .000049   .0004284     0.11   0.909    -.0007911    .0008891
              d |   -.031276    .031827    -0.98   0.326    -.0936907    .0311386
             td |   .0020666   .0004663     4.43   0.000     .0011522     .002981
          _cons |   .1543226   .0527701     2.92   0.003     .0508373    .2578079
---------------------------------------------------------------------------------

                                                        Number of obs =  2,193
                                                        F(30, 2162)   =   8.39
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1043
                                                        Adj R-squared = 0.0918
                                                        Root MSE      = 0.3908

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0069763   .0042117     1.66   0.098     -.001283    .0152357
      tenuresqr |  -.0001372   .0002142    -0.64   0.522    -.0005574    .0002829
 birthmonthdum2 |  -.0126994   .0434895    -0.29   0.770    -.0979851    .0725862
 birthmonthdum3 |  -.0624764   .0451805    -1.38   0.167    -.1510782    .0261255
 birthmonthdum4 |   .0165002   .0453894     0.36   0.716    -.0725112    .1055117
 birthmonthdum5 |   .0047742   .0437665     0.11   0.913    -.0810545    .0906029
 birthmonthdum6 |   .0266365   .0438419     0.61   0.544    -.0593402    .1126132
 birthmonthdum7 |   .0286375   .0441588     0.65   0.517    -.0579607    .1152357
 birthmonthdum8 |  -.0101154   .0433006    -0.23   0.815    -.0950304    .0747997
 birthmonthdum9 |   .0296035   .0420752     0.70   0.482    -.0529085    .1121156
birthmonthdum10 |  -.0397887   .0410381    -0.97   0.332     -.120267    .0406896
birthmonthdum11 |  -.0025381    .044171    -0.06   0.954    -.0891602     .084084
birthmonthdum12 |  -.0017704   .0432703    -0.04   0.967    -.0866261    .0830854
   provincedum2 |   -.092135   .0695157    -1.33   0.185    -.2284596    .0441896
   provincedum3 |  -.0933223   .0904509    -1.03   0.302    -.2707022    .0840576
   provincedum4 |  -.2014184   .0733716    -2.75   0.006    -.3453047   -.0575321
   provincedum5 |  -.2074428   .0516025    -4.02   0.000    -.3086386    -.106247
   provincedum6 |  -.2408231   .0536421    -4.49   0.000    -.3460187   -.1356276
   provincedum7 |  -.1822461   .0542105    -3.36   0.001    -.2885562   -.0759359
   provincedum8 |  -.2222982    .050326    -4.42   0.000    -.3209907   -.1236058
   provincedum9 |  -.2044248   .0526882    -3.88   0.000    -.3077497      -.1011
  provincedum10 |  -.0934729   .0536231    -1.74   0.081    -.1986311    .0116852
  provincedum11 |  -.1466551   .0520278    -2.82   0.005    -.2486848   -.0446254
  provincedum12 |  -.2773413   .0635171    -4.37   0.000    -.4019023   -.1527804
  provincedum13 |  -.2165731   .0547028    -3.96   0.000    -.3238486   -.1092976
  provincedum14 |  -.2048579   .0555862    -3.69   0.000    -.3138659   -.0958499
  provincedum15 |   -.090949   .0610112    -1.49   0.136    -.2105958    .0286978
              t |   .0003889   .0005363     0.73   0.468    -.0006628    .0014407
              d |  -.0563456   .0398456    -1.41   0.157    -.1344853    .0217942
             td |   .0019495   .0005838     3.34   0.001     .0008047    .0030942
          _cons |   .2713316   .0660652     4.11   0.000     .1417736    .4008896
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,193
                                                  Wald chi2(30)   =      20.63
                                                  Prob > chi2     =     0.8990
                                                  R-squared       =          .
                                                  Root MSE        =     1.6195

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   4.237954   92.39689     0.05   0.963    -176.8566    185.3325
  secgenhighedu |   1.030079   11.29787     0.09   0.927    -21.11335    23.17351
      secgenedu |  -4.880831   84.27469    -0.06   0.954    -170.0562    160.2945
         tenure |   .0370176   .0233636     1.58   0.113    -.0087743    .0828095
      tenuresqr |  -.0021567   .0144945    -0.15   0.882    -.0305654    .0262521
 birthmonthdum2 |   .0359093   .6522262     0.06   0.956    -1.242431    1.314249
 birthmonthdum3 |   .2069985   3.077769     0.07   0.946    -5.825318    6.239315
 birthmonthdum4 |   .4268087   6.478532     0.07   0.947    -12.27088     13.1245
 birthmonthdum5 |   .2754572   4.941714     0.06   0.956    -9.410124    9.961039
 birthmonthdum6 |   .3400404   4.901715     0.07   0.945    -9.267144    9.947225
 birthmonthdum7 |   .2859749   3.676404     0.08   0.938    -6.919644    7.491594
 birthmonthdum8 |   .1429469   2.836677     0.05   0.960    -5.416838    5.702732
 birthmonthdum9 |   .1947693   4.203446     0.05   0.963    -8.043834    8.433373
birthmonthdum10 |   .1109641   1.605455     0.07   0.945    -3.035671    3.257599
birthmonthdum11 |   .0157976    1.00127     0.02   0.987    -1.946655     1.97825
birthmonthdum12 |   .1823348    4.26914     0.04   0.966    -8.185027    8.549696
   provincedum2 |  -.1083221   5.180521    -0.02   0.983    -10.26196    10.04531
   provincedum3 |   .0191344   4.394955     0.00   0.997     -8.59482    8.633089
   provincedum4 |  -.2790146   2.525533    -0.11   0.912    -5.228968    4.670939
   provincedum5 |  -.2297089   2.000051    -0.11   0.909    -4.149737    3.690319
   provincedum6 |  -.1744262   .6999434    -0.25   0.803     -1.54629    1.197438
   provincedum7 |  -.4464902   3.119438    -0.14   0.886    -6.560477    5.667497
   provincedum8 |  -.3970994   1.494515    -0.27   0.790    -3.326296    2.532097
   provincedum9 |   .3162171   4.703323     0.07   0.946    -8.902126    9.534561
  provincedum10 |   .3079498   8.418347     0.04   0.971    -16.19171    16.80761
  provincedum11 |  -.0245108   3.068349    -0.01   0.994    -6.038364    5.989342
  provincedum12 |  -.4202516   2.998149    -0.14   0.889    -6.296516    5.456012
  provincedum13 |  -.1573906   .9780494    -0.16   0.872    -2.074332    1.759551
  provincedum14 |  -.3751398   1.084099    -0.35   0.729    -2.499934    1.749655
  provincedum15 |  -.3389019   .4566774    -0.74   0.458    -1.233973    .5561694
          _cons |   8.100553    2.74832     2.95   0.003     2.713944    13.48716
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  .362297  (p = 0.9479)
  Wu-Hausman F(3,2159)            =  .118913  (p = 0.9490)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.596  Chi-sq(30) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,193    7.878531    .6367446   5.298317   9.721166
      tenure |      2,193      4.4829    5.122389         -1         31
   tenuresqr |      2,193     46.3233    100.6615          0        961
birthmont~m2 |      2,193    .0843593    .2779893          0          1
birthmonth~3 |      2,193    .0715914     .257869          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,193    .0702234    .2555815          0          1
birthmonth~5 |      2,193    .0825353    .2752414          0          1
birthmonth~6 |      2,193    .0811674    .2731542          0          1
birthmonth~7 |      2,193    .0788874    .2696244          0          1
birthmonth~8 |      2,193    .0866393    .2813699          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,193    .1003192    .3004936          0          1
birthmont~10 |      2,193    .1126311    .3162134          0          1
birthmont~11 |      2,193    .0784314    .2689105          0          1
birthmont~12 |      2,193    .0866393    .2813699          0          1
        male |      2,193           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning,
>  200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,830
                                                        F(17, 5812)   =  27.78
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0752
                                                        Adj R-squared = 0.0724
                                                        Root MSE      = 0.3268

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0087581   .0020735     4.22   0.000     .0046933    .0128229
      tenuresqr |  -.0002089   .0001007    -2.07   0.038    -.0004063   -.0000115
 birthmonthdum2 |  -.0002891   .0212375    -0.01   0.989    -.0419225    .0413443
 birthmonthdum3 |  -.0407888   .0215847    -1.89   0.059    -.0831028    .0015251
 birthmonthdum4 |  -.0265712   .0221904    -1.20   0.231    -.0700727    .0169303
 birthmonthdum5 |  -.0341789   .0214623    -1.59   0.111    -.0762531    .0078953
 birthmonthdum6 |   -.005156   .0213564    -0.24   0.809    -.0470226    .0367105
 birthmonthdum7 |   .0111407   .0219885     0.51   0.612     -.031965    .0542464
 birthmonthdum8 |   -.015568   .0210491    -0.74   0.460    -.0568321    .0256961
 birthmonthdum9 |   -.004923   .0205442    -0.24   0.811    -.0451972    .0353513
birthmonthdum10 |  -.0249041   .0200902    -1.24   0.215    -.0642883    .0144801
birthmonthdum11 |  -.0203065   .0210921    -0.96   0.336    -.0616549     .021042
birthmonthdum12 |  -.0176184   .0215661    -0.82   0.414    -.0598961    .0246592
           male |  -.0161682   .0088794    -1.82   0.069    -.0335751    .0012388
              t |   .0003643   .0002544     1.43   0.152    -.0001345     .000863
              d |  -.0416063   .0198436    -2.10   0.036    -.0805072   -.0027054
             td |   .0014758   .0002809     5.25   0.000     .0009251    .0020264
          _cons |   .0459305   .0236666     1.94   0.052    -.0004649    .0923258
---------------------------------------------------------------------------------

                                                        Number of obs =  5,830
                                                        F(17, 5812)   =  27.54
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0745
                                                        Adj R-squared = 0.0718
                                                        Root MSE      = 0.3116

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0068524    .001977     3.47   0.001     .0029766    .0107281
      tenuresqr |  -.0001872    .000096    -1.95   0.051    -.0003754    1.06e-06
 birthmonthdum2 |   .0116052   .0202499     0.57   0.567    -.0280923    .0513026
 birthmonthdum3 |  -.0274578   .0205809    -1.33   0.182    -.0678041    .0128885
 birthmonthdum4 |  -.0241808   .0211585    -1.14   0.253    -.0656594    .0172978
 birthmonthdum5 |  -.0242407   .0204643    -1.18   0.236    -.0643583     .015877
 birthmonthdum6 |    .002373   .0203633     0.12   0.907    -.0375467    .0422928
 birthmonthdum7 |    .015859   .0209661     0.76   0.449    -.0252423    .0569603
 birthmonthdum8 |  -.0067801   .0200703    -0.34   0.736    -.0461254    .0325652
 birthmonthdum9 |   .0000378   .0195889     0.00   0.998    -.0383637    .0384392
birthmonthdum10 |  -.0264793    .019156    -1.38   0.167    -.0640321    .0110735
birthmonthdum11 |  -.0156011   .0201113    -0.78   0.438    -.0550269    .0238246
birthmonthdum12 |   -.005807   .0205633    -0.28   0.778    -.0461187    .0345047
           male |  -.0111978   .0084665    -1.32   0.186    -.0277953    .0053997
              t |   .0001795   .0002426     0.74   0.459     -.000296    .0006551
              d |  -.0358499   .0189209    -1.89   0.058    -.0729419     .001242
             td |   .0015983   .0002678     5.97   0.000     .0010733    .0021233
          _cons |   .0275095   .0225661     1.22   0.223    -.0167284    .0717474
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,830
                                                  Wald chi2(16)   =     340.30
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .80683

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   4.145948   3.117345     1.33   0.184    -1.963937    10.25583
  secgenhighedu |  -4.340875   3.287804    -1.32   0.187    -10.78485    2.103102
         tenure |   .0216048    .007354     2.94   0.003     .0071911    .0360184
      tenuresqr |  -.0008558   .0002577    -3.32   0.001    -.0013609   -.0003506
 birthmonthdum2 |   .0704246   .0642922     1.10   0.273    -.0555858    .1964351
 birthmonthdum3 |   .0051641   .0644347     0.08   0.936    -.1211255    .1314537
 birthmonthdum4 |   .0628803   .0549612     1.14   0.253    -.0448417    .1706023
 birthmonthdum5 |   .0054782    .058832     0.09   0.926    -.1098304    .1207868
 birthmonthdum6 |   .0865526   .0571777     1.51   0.130    -.0255137    .1986189
 birthmonthdum7 |   .0612957   .0563599     1.09   0.277    -.0491676     .171759
 birthmonthdum8 |   .0569265   .0574542     0.99   0.322    -.0556816    .1695345
 birthmonthdum9 |   .0237256   .0522427     0.45   0.650    -.0786682    .1261193
birthmonthdum10 |   -.009641   .0508177    -0.19   0.850    -.1092419    .0899599
birthmonthdum11 |   .0225716   .0529683     0.43   0.670    -.0812444    .1263875
birthmonthdum12 |   .0394464   .0633634     0.62   0.534    -.0847435    .1636363
           male |   .3785659   .0259547    14.59   0.000     .3276955    .4294362
          _cons |   7.743074   .0524277   147.69   0.000     7.640317     7.84583
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  6.73998  (p = 0.0344)
  Wu-Hausman F(2,5811)            =  3.36289  (p = 0.0347)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .274518  (p = 0.6003)
  Basmann chi2(1)        =  .273683  (p = 0.6009)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   5.785  Chi-sq(17) P-value = 0.9945

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,830    8.108651     .663944   5.298317   9.721166
      tenure |      5,830    5.033791     5.59189         -1         32
   tenuresqr |      5,830    56.60292    115.6538          0       1024
birthmont~m2 |      5,830    .0835334    .2767106          0          1
birthmonth~3 |      5,830    .0778731    .2679947          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,830    .0699828      .25514          0          1
birthmonth~5 |      5,830    .0799314    .2712102          0          1
birthmonth~6 |      5,830    .0816467    .2738491          0          1
birthmonth~7 |      5,830    .0728988    .2599926          0          1
birthmonth~8 |      5,830     .086964    .2818064          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,830     .096741    .2956301          0          1
birthmont~10 |      5,830    .1063465     .308307          0          1
birthmont~11 |      5,830    .0857633    .2800382          0          1
birthmont~12 |      5,830    .0787307    .2693411          0          1
        male |      5,830    .6238422    .4844619          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992
> ) & inrange(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,830
                                                        F(31, 5798)   =  18.46
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0899
                                                        Adj R-squared = 0.0850
                                                        Root MSE      = 0.3246

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0082876   .0020825     3.98   0.000     .0042052    .0123701
      tenuresqr |  -.0001863   .0001006    -1.85   0.064    -.0003835    .0000109
 birthmonthdum2 |   .0025149   .0211073     0.12   0.905    -.0388632    .0438931
 birthmonthdum3 |  -.0388263   .0214493    -1.81   0.070     -.080875    .0032224
 birthmonthdum4 |  -.0266154   .0220546    -1.21   0.228    -.0698506    .0166198
 birthmonthdum5 |  -.0325801   .0213335    -1.53   0.127    -.0744016    .0092415
 birthmonthdum6 |  -.0054872   .0212223    -0.26   0.796    -.0470908    .0361163
 birthmonthdum7 |   .0172564   .0218744     0.79   0.430    -.0256256    .0601384
 birthmonthdum8 |  -.0108442    .020927    -0.52   0.604    -.0518689    .0301805
 birthmonthdum9 |  -.0023636    .020432    -0.12   0.908     -.042418    .0376909
birthmonthdum10 |  -.0208355   .0199863    -1.04   0.297    -.0600161     .018345
birthmonthdum11 |   -.018781   .0209647    -0.90   0.370    -.0598798    .0223177
birthmonthdum12 |  -.0124582    .021433    -0.58   0.561    -.0544748    .0295585
           male |  -.0163545   .0088472    -1.85   0.065    -.0336983    .0009894
   provincedum2 |    -.14388   .0349569    -4.12   0.000    -.2124087   -.0753514
   provincedum3 |  -.0399154   .0440788    -0.91   0.365    -.1263264    .0464956
   provincedum4 |  -.2171694   .0366592    -5.92   0.000    -.2890352   -.1453036
   provincedum5 |  -.1765211   .0279563    -6.31   0.000     -.231326   -.1217162
   provincedum6 |  -.1835378   .0286548    -6.41   0.000    -.2397119   -.1273637
   provincedum7 |   -.142073   .0287905    -4.93   0.000    -.1985132   -.0856328
   provincedum8 |   -.182756   .0271351    -6.74   0.000    -.2359509   -.1295611
   provincedum9 |  -.1940603   .0281857    -6.89   0.000    -.2493147   -.1388058
  provincedum10 |  -.1877293   .0286896    -6.54   0.000    -.2439715    -.131487
  provincedum11 |  -.1655056   .0280373    -5.90   0.000    -.2204691   -.1105421
  provincedum12 |   -.229047   .0328021    -6.98   0.000    -.2933515   -.1647426
  provincedum13 |  -.1959057    .029212    -6.71   0.000    -.2531722   -.1386392
  provincedum14 |  -.1729138   .0302121    -5.72   0.000    -.2321408   -.1136869
  provincedum15 |  -.1182607   .0304713    -3.88   0.000    -.1779959   -.0585255
              t |   .0003712   .0002536     1.46   0.143    -.0001259    .0008684
              d |  -.0432513   .0197541    -2.19   0.029    -.0819768   -.0045258
             td |   .0014831     .00028     5.30   0.000     .0009342    .0020321
          _cons |   .2144067   .0338865     6.33   0.000     .1479764     .280837
---------------------------------------------------------------------------------

                                                        Number of obs =  5,830
                                                        F(31, 5798)   =  17.68
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0864
                                                        Adj R-squared = 0.0815
                                                        Root MSE      = 0.3100

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0065023   .0019888     3.27   0.001     .0026036     .010401
      tenuresqr |  -.0001695   .0000961    -1.76   0.078    -.0003578    .0000188
 birthmonthdum2 |   .0143108   .0201574     0.71   0.478    -.0252053    .0538269
 birthmonthdum3 |  -.0258487   .0204841    -1.26   0.207    -.0660052    .0143078
 birthmonthdum4 |   -.024178   .0210621    -1.15   0.251    -.0654676    .0171116
 birthmonthdum5 |   -.023225   .0203735    -1.14   0.254    -.0631646    .0167146
 birthmonthdum6 |   .0020844   .0202673     0.10   0.918     -.037647    .0418158
 birthmonthdum7 |   .0206605     .02089     0.99   0.323    -.0202917    .0616128
 birthmonthdum8 |  -.0029493   .0199853    -0.15   0.883    -.0421279    .0362293
 birthmonthdum9 |   .0016542   .0195126     0.08   0.932    -.0365978    .0399061
birthmonthdum10 |  -.0233127   .0190869    -1.22   0.222    -.0607302    .0141047
birthmonthdum11 |  -.0144742   .0200213    -0.72   0.470    -.0537235    .0247751
birthmonthdum12 |  -.0013072   .0204685    -0.06   0.949    -.0414331    .0388187
           male |  -.0119053   .0084491    -1.41   0.159    -.0284687     .004658
   provincedum2 |  -.1120154   .0333839    -3.36   0.001    -.1774602   -.0465705
   provincedum3 |  -.0227696   .0420953    -0.54   0.589     -.105292    .0597529
   provincedum4 |  -.1767856   .0350096    -5.05   0.000    -.2454174   -.1081538
   provincedum5 |  -.1527984   .0266983    -5.72   0.000    -.2051371   -.1004598
   provincedum6 |  -.1481683   .0273653    -5.41   0.000    -.2018146    -.094522
   provincedum7 |  -.1170513    .027495    -4.26   0.000    -.1709517    -.063151
   provincedum8 |  -.1515324    .025914    -5.85   0.000    -.2023335   -.1007312
   provincedum9 |  -.1524384   .0269173    -5.66   0.000    -.2052064   -.0996705
  provincedum10 |  -.1524835   .0273985    -5.57   0.000    -.2061949   -.0987721
  provincedum11 |  -.1358947   .0267756    -5.08   0.000    -.1883848   -.0834046
  provincedum12 |  -.1908185    .031326    -6.09   0.000    -.2522293   -.1294078
  provincedum13 |  -.1604293   .0278975    -5.75   0.000    -.2151188   -.1057398
  provincedum14 |  -.1452835   .0288525    -5.04   0.000    -.2018452   -.0887218
  provincedum15 |  -.0856039   .0291001    -2.94   0.003     -.142651   -.0285568
              t |    .000183   .0002422     0.76   0.450    -.0002918    .0006578
              d |  -.0367721   .0188652    -1.95   0.051    -.0737549    .0002107
             td |   .0015997   .0002674     5.98   0.000     .0010755     .002124
          _cons |   .1655043   .0323616     5.11   0.000     .1020635    .2289452
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,830
                                                  Wald chi2(30)   =     439.30
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .81472

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   4.325075   3.177851     1.36   0.174    -1.903398    10.55355
  secgenhighedu |  -4.566961   3.363406    -1.36   0.175    -11.15912    2.025194
         tenure |   .0160214   .0072138     2.22   0.026     .0018826    .0301602
      tenuresqr |  -.0006785   .0002576    -2.63   0.008    -.0011834   -.0001735
 birthmonthdum2 |   .0701839   .0653713     1.07   0.283    -.0579415    .1983093
 birthmonthdum3 |   .0039879   .0646144     0.06   0.951     -.122654    .1306299
 birthmonthdum4 |   .0503308   .0555349     0.91   0.365    -.0585155    .1591772
 birthmonthdum5 |   .0025704   .0587221     0.04   0.965    -.1125228    .1176636
 birthmonthdum6 |   .0803091   .0578431     1.39   0.165    -.0330613    .1936795
 birthmonthdum7 |   .0672705   .0563095     1.19   0.232    -.0430942    .1776352
 birthmonthdum8 |   .0478966   .0572013     0.84   0.402    -.0642158     .160009
 birthmonthdum9 |   .0121497   .0522338     0.23   0.816    -.0902267     .114526
birthmonthdum10 |  -.0251064   .0520198    -0.48   0.629    -.1270632    .0768505
birthmonthdum11 |   .0096326   .0533081     0.18   0.857    -.0948492    .1141145
birthmonthdum12 |    .038498   .0634723     0.61   0.544    -.0859054    .1629015
           male |    .382906   .0253392    15.11   0.000     .3332421    .4325699
   provincedum2 |  -.1772969   .1194752    -1.48   0.138    -.4114639    .0568701
   provincedum3 |   -.055297    .121302    -0.46   0.648    -.2930445    .1824505
   provincedum4 |  -.1708427   .1369222    -1.25   0.212    -.4392053    .0975199
   provincedum5 |   -.002406   .0863694    -0.03   0.978     -.171687    .1668749
   provincedum6 |   .0674673   .1127395     0.60   0.550    -.1534981    .2884327
   provincedum7 |  -.0588815    .093425    -0.63   0.529    -.2419911     .124228
   provincedum8 |  -.1386115   .0990446    -1.40   0.162    -.3327354    .0555124
   provincedum9 |   .1924416   .1260954     1.53   0.127    -.0547008     .439584
  provincedum10 |   .0532902   .1105514     0.48   0.630    -.1633865     .269967
  provincedum11 |  -.0607031   .0991775    -0.61   0.540    -.2550875    .1336813
  provincedum12 |  -.1137816    .122413    -0.93   0.353    -.3537067    .1261435
  provincedum13 |  -.1102283   .1122541    -0.98   0.326    -.3302423    .1097858
  provincedum14 |  -.2461818   .0971185    -2.53   0.011    -.4365306   -.0558331
  provincedum15 |   -.156374   .1162792    -1.34   0.179    -.3842771    .0715291
          _cons |   7.815361   .1260133    62.02   0.000     7.568379    8.062342
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =   7.9991  (p = 0.0183)
  Wu-Hausman F(2,5797)            =  3.98237  (p = 0.0187)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .128581  (p = 0.7199)
  Basmann chi2(1)        =  .127878  (p = 0.7206)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  13.878  Chi-sq(31) P-value = 0.9966

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,830    8.108651     .663944   5.298317   9.721166
      tenure |      5,830    5.033791     5.59189         -1         32
   tenuresqr |      5,830    56.60292    115.6538          0       1024
birthmont~m2 |      5,830    .0835334    .2767106          0          1
birthmonth~3 |      5,830    .0778731    .2679947          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,830    .0699828      .25514          0          1
birthmonth~5 |      5,830    .0799314    .2712102          0          1
birthmonth~6 |      5,830    .0816467    .2738491          0          1
birthmonth~7 |      5,830    .0728988    .2599926          0          1
birthmonth~8 |      5,830     .086964    .2818064          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,830     .096741    .2956301          0          1
birthmont~10 |      5,830    .1063465     .308307          0          1
birthmont~11 |      5,830    .0857633    .2800382          0          1
birthmont~12 |      5,830    .0787307    .2693411          0          1
        male |      5,830    .6238422    .4844619          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200,
>  16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,637
                                                        F(16, 3620)   =  14.29
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0594
                                                        Adj R-squared = 0.0552
                                                        Root MSE      = 0.3246

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .008889   .0025783     3.45   0.001     .0038339     .013944
      tenuresqr |  -.0002748   .0001225    -2.24   0.025     -.000515   -.0000347
 birthmonthdum2 |   .0039239   .0261126     0.15   0.881    -.0472729    .0551207
 birthmonthdum3 |  -.0164291   .0261979    -0.63   0.531    -.0677932     .034935
 birthmonthdum4 |  -.0170923   .0273303    -0.63   0.532    -.0706767    .0364921
 birthmonthdum5 |  -.0308095   .0264948    -1.16   0.245    -.0827558    .0211367
 birthmonthdum6 |   .0017598    .026201     0.07   0.946    -.0496104    .0531299
 birthmonthdum7 |   .0179914   .0274227     0.66   0.512     -.035774    .0717569
 birthmonthdum8 |  -.0035226   .0258165    -0.14   0.891    -.0541391    .0470938
 birthmonthdum9 |    -.00684   .0253248    -0.27   0.787    -.0564922    .0428123
birthmonthdum10 |  -.0099063    .024781    -0.40   0.689    -.0584924    .0386797
birthmonthdum11 |  -.0295477    .025581    -1.16   0.248    -.0797023    .0206068
birthmonthdum12 |  -.0004391   .0269284    -0.02   0.987    -.0532354    .0523573
              t |   .0004041   .0003079     1.31   0.189    -.0001996    .0010079
              d |  -.0319567   .0246814    -1.29   0.195    -.0803474     .016434
             td |   .0011386   .0003431     3.32   0.001     .0004659    .0018114
          _cons |   .0386203   .0279321     1.38   0.167     -.016144    .0933845
---------------------------------------------------------------------------------

                                                        Number of obs =  3,637
                                                        F(16, 3620)   =  14.95
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0620
                                                        Adj R-squared = 0.0579
                                                        Root MSE      = 0.3099

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0074084   .0024617     3.01   0.003     .0025819    .0122348
      tenuresqr |  -.0002493    .000117    -2.13   0.033    -.0004786   -.0000199
 birthmonthdum2 |   .0136134   .0249318     0.55   0.585    -.0352684    .0624952
 birthmonthdum3 |  -.0077646   .0250133    -0.31   0.756    -.0568062    .0412769
 birthmonthdum4 |  -.0256437   .0260945    -0.98   0.326    -.0768051    .0255177
 birthmonthdum5 |  -.0218266   .0252968    -0.86   0.388     -.071424    .0277708
 birthmonthdum6 |   .0008035   .0250162     0.03   0.974    -.0482438    .0498508
 birthmonthdum7 |   .0186232   .0261827     0.71   0.477    -.0327111    .0699575
 birthmonthdum8 |   .0025703   .0246492     0.10   0.917    -.0457574     .050898
 birthmonthdum9 |  -.0026636   .0241797    -0.11   0.912    -.0500707    .0447436
birthmonthdum10 |  -.0151626   .0236604    -0.64   0.522    -.0615517    .0312265
birthmonthdum11 |  -.0251455   .0244243    -1.03   0.303    -.0730322    .0227411
birthmonthdum12 |   .0112983   .0257108     0.44   0.660    -.0391107    .0617074
              t |   .0002662    .000294     0.91   0.365    -.0003103    .0008426
              d |  -.0353633   .0235653    -1.50   0.134    -.0815659    .0108394
             td |   .0013029   .0003276     3.98   0.000     .0006606    .0019453
          _cons |    .027309   .0266691     1.02   0.306     -.024979    .0795969
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,637
                                                  Wald chi2(15)   =      23.15
                                                  Prob > chi2     =     0.0809
                                                  R-squared       =          .
                                                  Root MSE        =      .9952

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   6.664877   4.033175     1.65   0.098    -1.240001    14.56976
  secgenhighedu |  -7.101164   4.148547    -1.71   0.087    -15.23217    1.029839
         tenure |   .0136087   .0099872     1.36   0.173     -.005966    .0331833
      tenuresqr |  -.0005211   .0004014    -1.30   0.194    -.0013078    .0002656
 birthmonthdum2 |   .0935773   .0892809     1.05   0.295    -.0814102    .2685647
 birthmonthdum3 |  -.0287028   .0875382    -0.33   0.743    -.2002744    .1428688
 birthmonthdum4 |  -.0258488   .0919364    -0.28   0.779    -.2060409    .1543433
 birthmonthdum5 |    .005191    .088212     0.06   0.953    -.1677013    .1780834
 birthmonthdum6 |   .0292348   .0803674     0.36   0.716    -.1282825     .186752
 birthmonthdum7 |   .0218351    .084031     0.26   0.795    -.1428625    .1865328
 birthmonthdum8 |   .0850968   .0831613     1.02   0.306    -.0778963    .2480899
 birthmonthdum9 |   .0517488   .0789628     0.66   0.512    -.1030154    .2065131
birthmonthdum10 |  -.0453386    .079769    -0.57   0.570     -.201683    .1110058
birthmonthdum11 |   .0481579    .079361     0.61   0.544    -.1073868    .2037027
birthmonthdum12 |   .1170183   .0959944     1.22   0.223    -.0711273    .3051639
          _cons |   8.144478   .0701733   116.06   0.000     8.006941    8.282015
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  14.9336  (p = 0.0006)
  Wu-Hausman F(2,3619)            =  7.46047  (p = 0.0006)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .080486  (p = 0.7766)
  Basmann chi2(1)        =  .080111  (p = 0.7771)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   2.876  Chi-sq(16) P-value = 0.9999

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,637    8.247407    .6411498   5.298317   9.721166
      tenure |      3,637    5.365961    5.832412         -1         32
   tenuresqr |      3,637    62.80121    123.4198          0       1024
birthmont~m2 |      3,637    .0830355    .2759738          0          1
birthmonth~3 |      3,637    .0816607    .2738848          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,637    .0698378    .2549085          0          1
birthmonth~5 |      3,637    .0783613    .2687762          0          1
birthmonth~6 |      3,637    .0819357    .2743044          0          1
birthmonth~7 |      3,637    .0692879     .253978          0          1
birthmonth~8 |      3,637    .0871597    .2821078          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,637    .0945834     .292679          0          1
birthmont~10 |      3,637    .1025571    .3034212          0          1
birthmont~11 |      3,637    .0901842    .2864849          0          1
birthmont~12 |      3,637    .0739621    .2617451          0          1
        male |      3,637           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & i
> nrange(monthlyearning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,637
                                                        F(30, 3606)   =   9.57
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0738
                                                        Adj R-squared = 0.0660
                                                        Root MSE      = 0.3228

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0085181   .0025923     3.29   0.001     .0034356    .0136007
      tenuresqr |  -.0002608   .0001225    -2.13   0.033     -.000501   -.0000207
 birthmonthdum2 |   .0094413   .0259813     0.36   0.716    -.0414983    .0603809
 birthmonthdum3 |  -.0102769   .0260815    -0.39   0.694    -.0614128     .040859
 birthmonthdum4 |  -.0169267   .0272075    -0.62   0.534    -.0702703     .036417
 birthmonthdum5 |  -.0283405   .0263735    -1.07   0.283    -.0800489     .023368
 birthmonthdum6 |   .0027229    .026079     0.10   0.917    -.0484081     .053854
 birthmonthdum7 |   .0250676   .0273477     0.92   0.359    -.0285508    .0786861
 birthmonthdum8 |   .0036789   .0257136     0.14   0.886    -.0467358    .0540937
 birthmonthdum9 |  -.0019611   .0252225    -0.08   0.938    -.0514128    .0474906
birthmonthdum10 |  -.0062357   .0246946    -0.25   0.801    -.0546525    .0421812
birthmonthdum11 |  -.0266695   .0254788    -1.05   0.295    -.0766238    .0232847
birthmonthdum12 |    .004513   .0268111     0.17   0.866    -.0480533    .0570794
   provincedum2 |  -.1338615   .0442136    -3.03   0.002    -.2205477   -.0471753
   provincedum3 |   .0128279   .0546748     0.23   0.815    -.0943687    .1200245
   provincedum4 |  -.2094269   .0461655    -4.54   0.000      -.29994   -.1189138
   provincedum5 |  -.1758412   .0368139    -4.78   0.000    -.2480193   -.1036631
   provincedum6 |  -.1542382   .0373649    -4.13   0.000    -.2274966   -.0809798
   provincedum7 |  -.1392655   .0374374    -3.72   0.000     -.212666    -.065865
   provincedum8 |  -.1699354   .0356041    -4.77   0.000    -.2397417   -.1001292
   provincedum9 |  -.1576902   .0367996    -4.29   0.000    -.2298403   -.0855401
  provincedum10 |  -.1844689   .0374656    -4.92   0.000    -.2579249    -.111013
  provincedum11 |  -.1543531   .0367752    -4.20   0.000    -.2264554   -.0822508
  provincedum12 |  -.2222851   .0419736    -5.30   0.000    -.3045795   -.1399907
  provincedum13 |   -.176652   .0380748    -4.64   0.000    -.2513023   -.1020017
  provincedum14 |    -.16583   .0398739    -4.16   0.000    -.2440078   -.0876523
  provincedum15 |  -.1262638    .038688    -3.26   0.001    -.2021163   -.0504113
              t |   .0004269   .0003076     1.39   0.165    -.0001762    .0010299
              d |  -.0356513   .0246301    -1.45   0.148    -.0839416    .0126389
             td |   .0011315   .0003425     3.30   0.001     .0004601    .0018029
          _cons |   .1951192   .0426343     4.58   0.000     .1115294    .2787089
---------------------------------------------------------------------------------

                                                        Number of obs =  3,637
                                                        F(30, 3606)   =   9.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0744
                                                        Adj R-squared = 0.0667
                                                        Root MSE      = 0.3085

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0070589   .0024776     2.85   0.004     .0022013    .0119166
      tenuresqr |  -.0002359   .0001171    -2.02   0.044    -.0004654   -6.39e-06
 birthmonthdum2 |   .0184409   .0248318     0.74   0.458    -.0302448    .0671266
 birthmonthdum3 |  -.0022177   .0249274    -0.09   0.929     -.051091    .0466556
 birthmonthdum4 |  -.0258805   .0260037    -1.00   0.320    -.0768638    .0251029
 birthmonthdum5 |  -.0200802   .0252065    -0.80   0.426    -.0695007    .0293403
 birthmonthdum6 |   .0014015   .0249251     0.06   0.955    -.0474672    .0502702
 birthmonthdum7 |   .0238612   .0261376     0.91   0.361    -.0273848    .0751072
 birthmonthdum8 |   .0086383   .0245759     0.35   0.725    -.0395458    .0568223
 birthmonthdum9 |   .0013454   .0241065     0.06   0.955    -.0459183     .048609
birthmonthdum10 |  -.0125344    .023602    -0.53   0.595     -.058809    .0337401
birthmonthdum11 |  -.0230992   .0243514    -0.95   0.343    -.0708432    .0246448
birthmonthdum12 |    .015571   .0256248     0.61   0.543    -.0346695    .0658114
   provincedum2 |  -.1246496   .0422573    -2.95   0.003    -.2075003   -.0417989
   provincedum3 |   .0020725   .0522556     0.04   0.968     -.100381     .104526
   provincedum4 |  -.1853327   .0441228    -4.20   0.000     -.271841   -.0988245
   provincedum5 |   -.164608    .035185    -4.68   0.000    -.2335924   -.0956235
   provincedum6 |  -.1355989   .0357116    -3.80   0.000    -.2056159   -.0655819
   provincedum7 |  -.1349771   .0357809    -3.77   0.000    -.2051299   -.0648243
   provincedum8 |  -.1530612   .0340288    -4.50   0.000    -.2197788   -.0863436
   provincedum9 |  -.1339781   .0351713    -3.81   0.000    -.2029358   -.0650203
  provincedum10 |  -.1626563   .0358079    -4.54   0.000    -.2328621   -.0924505
  provincedum11 |  -.1390178   .0351481    -3.96   0.000    -.2079299   -.0701058
  provincedum12 |  -.2027106   .0401164    -5.05   0.000    -.2813638   -.1240575
  provincedum13 |  -.1601013   .0363901    -4.40   0.000    -.2314486    -.088754
  provincedum14 |  -.1485183   .0381097    -3.90   0.000     -.223237   -.0737997
  provincedum15 |  -.1112194   .0369762    -3.01   0.003    -.1837157   -.0387231
              t |   .0002831    .000294     0.96   0.336    -.0002933    .0008594
              d |  -.0384061   .0235403    -1.63   0.103    -.0845597    .0077475
             td |   .0012941   .0003273     3.95   0.000     .0006523    .0019358
          _cons |   .1689809   .0407479     4.15   0.000     .0890897    .2488721
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,637
                                                  Wald chi2(29)   =      77.46
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .95021

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   6.205183   3.867194     1.60   0.109    -1.374379    13.78474
  secgenhighedu |  -6.651761   3.991608    -1.67   0.096    -14.47517    1.171646
         tenure |   .0088411   .0095011     0.93   0.352    -.0097808    .0274629
      tenuresqr |  -.0003606    .000383    -0.94   0.346    -.0011113    .0003901
 birthmonthdum2 |   .0820095   .0845709     0.97   0.332    -.0837464    .2477654
 birthmonthdum3 |   -.034434   .0830399    -0.41   0.678    -.1971892    .1283212
 birthmonthdum4 |  -.0346682   .0887086    -0.39   0.696    -.2085338    .1391974
 birthmonthdum5 |  -.0011255   .0832808    -0.01   0.989    -.1643529    .1621019
 birthmonthdum6 |   .0230789   .0768999     0.30   0.764    -.1276421    .1737999
 birthmonthdum7 |   .0210375   .0805655     0.26   0.794    -.1368679     .178943
 birthmonthdum8 |   .0688097   .0785016     0.88   0.381    -.0850507      .22267
 birthmonthdum9 |   .0333105   .0749721     0.44   0.657    -.1136321    .1802531
birthmonthdum10 |  -.0657392   .0775869    -0.85   0.397    -.2178066    .0863283
birthmonthdum11 |    .022658   .0754416     0.30   0.764    -.1252048    .1705207
birthmonthdum12 |   .1050632   .0908642     1.16   0.248    -.0730273    .2831537
   provincedum2 |  -.2185411    .133658    -1.64   0.102     -.480506    .0434239
   provincedum3 |  -.1366579   .1654751    -0.83   0.409    -.4609831    .1876674
   provincedum4 |  -.1584029   .1612784    -0.98   0.326    -.4745027    .1576969
   provincedum5 |  -.0203801   .1155549    -0.18   0.860    -.2468635    .2061033
   provincedum6 |   .0768876   .1264579     0.61   0.543    -.1709653    .3247405
   provincedum7 |  -.0949545   .1138024    -0.83   0.404    -.3180031    .1280941
   provincedum8 |  -.1279442   .1180953    -1.08   0.279    -.3594067    .1035183
   provincedum9 |   .1592815   .1339368     1.19   0.234    -.1032297    .4217928
  provincedum10 |   .0912918   .1308586     0.70   0.485    -.1651864      .34777
  provincedum11 |  -.0742953   .1179923    -0.63   0.529    -.3055561    .1569654
  provincedum12 |  -.1748506   .1412801    -1.24   0.216    -.4517546    .1020534
  provincedum13 |  -.1847241   .1248696    -1.48   0.139    -.4294639    .0600158
  provincedum14 |  -.2756221   .1297879    -2.12   0.034    -.5300018   -.0212425
  provincedum15 |  -.1990664   .1234727    -1.61   0.107    -.4410683    .0429356
          _cons |   8.245258   .1370738    60.15   0.000     7.976599    8.513918
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  14.1046  (p = 0.0009)
  Wu-Hausman F(2,3605)            =  7.01748  (p = 0.0009)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .184688  (p = 0.6674)
  Basmann chi2(1)        =  .183123  (p = 0.6687)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   5.033  Chi-sq(30) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,637    8.247407    .6411498   5.298317   9.721166
      tenure |      3,637    5.365961    5.832412         -1         32
   tenuresqr |      3,637    62.80121    123.4198          0       1024
birthmont~m2 |      3,637    .0830355    .2759738          0          1
birthmonth~3 |      3,637    .0816607    .2738848          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,637    .0698378    .2549085          0          1
birthmonth~5 |      3,637    .0783613    .2687762          0          1
birthmonth~6 |      3,637    .0819357    .2743044          0          1
birthmonth~7 |      3,637    .0692879     .253978          0          1
birthmonth~8 |      3,637    .0871597    .2821078          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,637    .0945834     .292679          0          1
birthmont~10 |      3,637    .1025571    .3034212          0          1
birthmont~11 |      3,637    .0901842    .2864849          0          1
birthmont~12 |      3,637    .0739621    .2617451          0          1
        male |      3,637           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200,
>  16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,193
                                                        F(16, 2176)   =  16.48
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1081
                                                        Adj R-squared = 0.1015
                                                        Root MSE      = 0.3299

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0075836   .0035118     2.16   0.031     .0006968    .0144704
      tenuresqr |  -.0000207   .0001793    -0.12   0.908    -.0003723     .000331
 birthmonthdum2 |  -.0119034   .0366021    -0.33   0.745    -.0836821    .0598753
 birthmonthdum3 |  -.0918915   .0380198    -2.42   0.016    -.1664503   -.0173327
 birthmonthdum4 |  -.0539086   .0381774    -1.41   0.158    -.1287766    .0209594
 birthmonthdum5 |  -.0490297   .0368132    -1.33   0.183    -.1212224     .023163
 birthmonthdum6 |  -.0241271   .0369281    -0.65   0.514    -.0965452    .0482909
 birthmonthdum7 |  -.0120313   .0371802    -0.32   0.746    -.0849438    .0608811
 birthmonthdum8 |  -.0411405   .0364358    -1.13   0.259    -.1125931    .0303122
 birthmonthdum9 |  -.0145112   .0353688    -0.41   0.682    -.0838712    .0548489
birthmonthdum10 |  -.0576281   .0345597    -1.67   0.096    -.1254015    .0101454
birthmonthdum11 |  -.0037406   .0371784    -0.10   0.920    -.0766495    .0691682
birthmonthdum12 |  -.0535036   .0364392    -1.47   0.142    -.1249627    .0179556
              t |   .0003571    .000451     0.79   0.429    -.0005274    .0012416
              d |   -.057559   .0335452    -1.72   0.086    -.1233429     .008225
             td |   .0019616   .0004905     4.00   0.000     .0009997    .0029235
          _cons |   .0433101   .0405373     1.07   0.285    -.0361859     .122806
---------------------------------------------------------------------------------

                                                        Number of obs =  2,193
                                                        F(16, 2176)   =  15.20
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1006
                                                        Adj R-squared = 0.0939
                                                        Root MSE      = 0.3143

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0053318   .0033463     1.59   0.111    -.0012306    .0118942
      tenuresqr |  -.0000376   .0001709    -0.22   0.826    -.0003727    .0002975
 birthmonthdum2 |   .0052899   .0348778     0.15   0.879    -.0631073    .0736871
 birthmonthdum3 |  -.0675108   .0362286    -1.86   0.063    -.1385571    .0035356
 birthmonthdum4 |  -.0290453   .0363789    -0.80   0.425    -.1003863    .0422956
 birthmonthdum5 |  -.0342439   .0350789    -0.98   0.329    -.1030356    .0345477
 birthmonthdum6 |   .0000542   .0351884     0.00   0.999    -.0689522    .0690606
 birthmonthdum7 |   .0025281   .0354287     0.07   0.943    -.0669494    .0720056
 birthmonthdum8 |  -.0256403   .0347193    -0.74   0.460    -.0937267    .0424462
 birthmonthdum9 |  -.0041778   .0337025    -0.12   0.901    -.0702703    .0619147
birthmonthdum10 |   -.049695   .0329316    -1.51   0.131    -.1142756    .0148856
birthmonthdum11 |   .0026889   .0354269     0.08   0.940    -.0667852     .072163
birthmonthdum12 |   -.037881   .0347225    -1.09   0.275    -.1059737    .0302118
              t |   .0000584   .0004298     0.14   0.892    -.0007845    .0009012
              d |  -.0351151   .0319649    -1.10   0.272       -.0978    .0275698
             td |   .0020535   .0004674     4.39   0.000     .0011369      .00297
          _cons |   .0158027   .0386276     0.41   0.683    -.0599481    .0915536
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,193
                                                  Wald chi2(15)   =      60.85
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      .6535

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.482575   2.958073    -0.50   0.616    -7.280291     4.31514
  secgenhighedu |   1.997384   3.222172     0.62   0.535    -4.317957    8.312726
         tenure |   .0431657   .0088411     4.88   0.000     .0258376    .0604939
      tenuresqr |  -.0015157   .0003547    -4.27   0.000    -.0022109   -.0008206
 birthmonthdum2 |    -.00787   .0865707    -0.09   0.928    -.1775454    .1618054
 birthmonthdum3 |   .0278536   .0903264     0.31   0.758    -.1491829    .2048902
 birthmonthdum4 |   .0547728   .0979544     0.56   0.576    -.1372142    .2467598
 birthmonthdum5 |  -.0079743   .0785753    -0.10   0.919    -.1619791    .1460305
 birthmonthdum6 |   .0537944   .0989412     0.54   0.587    -.1401268    .2477156
 birthmonthdum7 |    .050398    .083709     0.60   0.547    -.1136686    .2144646
 birthmonthdum8 |  -.0179144   .0793467    -0.23   0.821     -.173431    .1376023
 birthmonthdum9 |  -.0501509   .0739736    -0.68   0.498    -.1951364    .0948346
birthmonthdum10 |   .0203447   .0686409     0.30   0.767    -.1141891    .1548785
birthmonthdum11 |  -.0511378   .0752513    -0.68   0.497    -.1986277    .0963521
birthmonthdum12 |  -.0752093   .0785822    -0.96   0.339    -.2292276    .0788091
          _cons |   7.717445   .0633236   121.87   0.000     7.593333    7.841557
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .431209  (p = 0.8061)
  Wu-Hausman F(2,2175)            =  .213877  (p = 0.8075)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .006274  (p = 0.9369)
  Basmann chi2(1)        =  .006226  (p = 0.9371)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  14.684  Chi-sq(16) P-value = 0.5479

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,193    7.878531    .6367446   5.298317   9.721166
      tenure |      2,193      4.4829    5.122389         -1         31
   tenuresqr |      2,193     46.3233    100.6615          0        961
birthmont~m2 |      2,193    .0843593    .2779893          0          1
birthmonth~3 |      2,193    .0715914     .257869          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,193    .0702234    .2555815          0          1
birthmonth~5 |      2,193    .0825353    .2752414          0          1
birthmonth~6 |      2,193    .0811674    .2731542          0          1
birthmonth~7 |      2,193    .0788874    .2696244          0          1
birthmonth~8 |      2,193    .0866393    .2813699          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,193    .1003192    .3004936          0          1
birthmont~10 |      2,193    .1126311    .3162134          0          1
birthmont~11 |      2,193    .0784314    .2689105          0          1
birthmont~12 |      2,193    .0866393    .2813699          0          1
        male |      2,193           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & i
> nrange(monthlyearning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,193
                                                        F(30, 2162)   =  10.79
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1302
                                                        Adj R-squared = 0.1182
                                                        Root MSE      = 0.3268

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0067076   .0035215     1.90   0.057    -.0001984    .0136135
      tenuresqr |   .0000304   .0001791     0.17   0.865    -.0003209    .0003817
 birthmonthdum2 |  -.0181999   .0363631    -0.50   0.617    -.0895101    .0531104
 birthmonthdum3 |  -.0970099    .037777    -2.57   0.010     -.171093   -.0229269
 birthmonthdum4 |  -.0581999   .0379517    -1.53   0.125    -.1326255    .0162256
 birthmonthdum5 |  -.0525445   .0365946    -1.44   0.151    -.1243088    .0192199
 birthmonthdum6 |  -.0291776   .0366577    -0.80   0.426    -.1010656    .0427105
 birthmonthdum7 |  -.0135737   .0369227    -0.37   0.713    -.0859814     .058834
 birthmonthdum8 |   -.042406   .0362051    -1.17   0.242    -.1134064    .0285944
 birthmonthdum9 |  -.0193106   .0351805    -0.55   0.583    -.0883017    .0496806
birthmonthdum10 |  -.0582579   .0343134    -1.70   0.090    -.1255486    .0090327
birthmonthdum11 |  -.0135291   .0369329    -0.37   0.714    -.0859568    .0588986
birthmonthdum12 |  -.0511628   .0361798    -1.41   0.157    -.1221136     .019788
   provincedum2 |  -.1478282   .0581245    -2.54   0.011    -.2618139   -.0338425
   provincedum3 |   -.139942   .0756291    -1.85   0.064    -.2882554    .0083714
   provincedum4 |  -.2261534   .0613485    -3.69   0.000    -.3464616   -.1058451
   provincedum5 |  -.1810959   .0431467    -4.20   0.000    -.2657092   -.0964827
   provincedum6 |  -.2293536    .044852    -5.11   0.000    -.3173112    -.141396
   provincedum7 |  -.1410752   .0453272    -3.11   0.002    -.2299647   -.0521857
   provincedum8 |   -.201265   .0420793    -4.78   0.000    -.2837851   -.1187449
   provincedum9 |  -.2548786   .0440544    -5.79   0.000    -.3412721   -.1684852
  provincedum10 |  -.1893352   .0448361    -4.22   0.000    -.2772615   -.1014088
  provincedum11 |  -.1792421   .0435022    -4.12   0.000    -.2645527   -.0939316
  provincedum12 |  -.2370323   .0531088    -4.46   0.000     -.341182   -.1328826
  provincedum13 |  -.2225279   .0457389    -4.87   0.000    -.3122246   -.1328311
  provincedum14 |   -.189288   .0464775    -4.07   0.000    -.2804333   -.0981427
  provincedum15 |  -.0861715   .0510136    -1.69   0.091    -.1862123    .0138693
              t |   .0003526   .0004484     0.79   0.432    -.0005267     .001232
              d |  -.0551287   .0333163    -1.65   0.098     -.120464    .0102067
             td |    .001983   .0004881     4.06   0.000     .0010258    .0029402
          _cons |   .2324778   .0552394     4.21   0.000     .1241499    .3408058
---------------------------------------------------------------------------------

                                                        Number of obs =  2,193
                                                        F(30, 2162)   =   9.68
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1184
                                                        Adj R-squared = 0.1062
                                                        Root MSE      = 0.3122

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0047578   .0033641     1.41   0.157    -.0018394     .011355
      tenuresqr |   1.65e-06   .0001711     0.01   0.992    -.0003339    .0003372
 birthmonthdum2 |   .0008738   .0347376     0.03   0.980    -.0672487    .0689963
 birthmonthdum3 |  -.0732124   .0360883    -2.03   0.043    -.1439837   -.0024411
 birthmonthdum4 |  -.0336975   .0362551    -0.93   0.353     -.104796     .037401
 birthmonthdum5 |  -.0373214   .0349588    -1.07   0.286    -.1058777    .0312349
 birthmonthdum6 |  -.0045928    .035019    -0.13   0.896    -.0732673    .0640817
 birthmonthdum7 |   .0005059   .0352722     0.01   0.989     -.068665    .0696768
 birthmonthdum8 |  -.0273088   .0345866    -0.79   0.430    -.0951353    .0405176
 birthmonthdum9 |  -.0094804   .0336078    -0.28   0.778    -.0753874    .0564267
birthmonthdum10 |  -.0510938   .0327795    -1.56   0.119    -.1153764    .0131888
birthmonthdum11 |  -.0060489   .0352819    -0.17   0.864    -.0752389    .0631411
birthmonthdum12 |  -.0364355   .0345624    -1.05   0.292    -.1042146    .0313436
   provincedum2 |  -.0840654   .0555262    -1.51   0.130    -.1929556    .0248249
   provincedum3 |   -.080364   .0722483    -1.11   0.266    -.2220473    .0613194
   provincedum4 |  -.1652029   .0586061    -2.82   0.005     -.280133   -.0502727
   provincedum5 |  -.1432229   .0412179    -3.47   0.001    -.2240538   -.0623921
   provincedum6 |  -.1725122    .042847    -4.03   0.000    -.2565379   -.0884865
   provincedum7 |  -.0885971    .043301    -2.05   0.041    -.1735131   -.0036812
   provincedum8 |  -.1540389   .0401982    -3.83   0.000    -.2328701   -.0752076
   provincedum9 |  -.1901479   .0420851    -4.52   0.000    -.2726793   -.1076165
  provincedum10 |  -.1399448   .0428318    -3.27   0.001    -.2239405    -.055949
  provincedum11 |  -.1338045   .0415576    -3.22   0.001    -.2153015   -.0523076
  provincedum12 |  -.1726994   .0507347    -3.40   0.001    -.2721933   -.0732055
  provincedum13 |  -.1638086   .0436942    -3.75   0.000    -.2494956   -.0781215
  provincedum14 |  -.1482042   .0443999    -3.34   0.001    -.2352751   -.0611334
  provincedum15 |  -.0294606   .0487331    -0.60   0.546    -.1250293    .0661081
              t |    .000049   .0004284     0.11   0.909    -.0007911    .0008891
              d |   -.031276    .031827    -0.98   0.326    -.0936907    .0311386
             td |   .0020666   .0004663     4.43   0.000     .0011522     .002981
          _cons |   .1543226   .0527701     2.92   0.003     .0508373    .2578079
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,193
                                                  Wald chi2(29)   =     137.87
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0315
                                                  Root MSE        =     .62648

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   -1.09766   2.728955    -0.40   0.688    -6.446313    4.250994
  secgenhighedu |   1.508894   2.978697     0.51   0.612    -4.329245    7.347032
         tenure |   .0363883    .008001     4.55   0.000     .0207067    .0520699
      tenuresqr |  -.0013188   .0003458    -3.81   0.000    -.0019965   -.0006411
 birthmonthdum2 |   .0003111    .084397     0.00   0.997    -.1651039    .1657261
 birthmonthdum3 |   .0291916   .0840201     0.35   0.728    -.1354848     .193868
 birthmonthdum4 |   .0518479    .091147     0.57   0.569     -.126797    .2304928
 birthmonthdum5 |  -.0105243   .0751933    -0.14   0.889    -.1579004    .1368518
 birthmonthdum6 |    .056497   .0931899     0.61   0.544    -.1261518    .2391458
 birthmonthdum7 |   .0733812   .0789093     0.93   0.352    -.0812781    .2280405
 birthmonthdum8 |  -.0209573   .0749883    -0.28   0.780    -.1679317    .1260171
 birthmonthdum9 |  -.0484503   .0700739    -0.69   0.489    -.1857926    .0888921
birthmonthdum10 |   .0185054   .0657411     0.28   0.778    -.1103448    .1473556
birthmonthdum11 |  -.0411727   .0722907    -0.57   0.569    -.1828599    .1005144
birthmonthdum12 |  -.0646664   .0741319    -0.87   0.383    -.2099622    .0806294
   provincedum2 |   -.407037   .1876889    -2.17   0.030    -.7749005   -.0391736
   provincedum3 |  -.2336027   .2018332    -1.16   0.247    -.6291885    .1619831
   provincedum4 |  -.4229203   .1748798    -2.42   0.016    -.7656784   -.0801622
   provincedum5 |  -.1150267   .1088581    -1.06   0.291    -.3283848    .0983313
   provincedum6 |  -.1399777   .1427268    -0.98   0.327    -.4197171    .1397617
   provincedum7 |  -.2672154   .1493888    -1.79   0.074     -.560012    .0255812
   provincedum8 |  -.3125128   .1226244    -2.55   0.011    -.5528523   -.0721734
   provincedum9 |   .0448189   .1556173     0.29   0.773    -.2601854    .3498233
  provincedum10 |  -.1792032   .1321813    -1.36   0.175    -.4382738    .0798673
  provincedum11 |  -.2012194   .1255609    -1.60   0.109    -.4473144    .0448755
  provincedum12 |  -.2484681   .1691453    -1.47   0.142    -.5799868    .0830506
  provincedum13 |  -.2093933   .1499971    -1.40   0.163    -.5033823    .0845956
  provincedum14 |  -.3148481   .1170399    -2.69   0.007    -.5442421   -.0854542
  provincedum15 |  -.3406816     .17626    -1.93   0.053    -.6861449    .0047817
          _cons |   7.943101   .1558245    50.97   0.000     7.637691    8.248511
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .286112  (p = 0.8667)
  Wu-Hausman F(2,2161)            =  .140987  (p = 0.8685)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .022415  (p = 0.8810)
  Basmann chi2(1)        =  .022098  (p = 0.8818)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  48.425  Chi-sq(30) P-value = 0.0180

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,193    7.878531    .6367446   5.298317   9.721166
      tenure |      2,193      4.4829    5.122389         -1         31
   tenuresqr |      2,193     46.3233    100.6615          0        961
birthmont~m2 |      2,193    .0843593    .2779893          0          1
birthmonth~3 |      2,193    .0715914     .257869          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,193    .0702234    .2555815          0          1
birthmonth~5 |      2,193    .0825353    .2752414          0          1
birthmonth~6 |      2,193    .0811674    .2731542          0          1
birthmonth~7 |      2,193    .0788874    .2696244          0          1
birthmonth~8 |      2,193    .0866393    .2813699          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,193    .1003192    .3004936          0          1
birthmont~10 |      2,193    .1126311    .3162134          0          1
birthmont~11 |      2,193    .0784314    .2689105          0          1
birthmont~12 |      2,193    .0866393    .2813699          0          1
        male |      2,193           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667) &
>  educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,830
                                                        F(17, 5812)   =  27.78
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0752
                                                        Adj R-squared = 0.0724
                                                        Root MSE      = 0.3268

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0087581   .0020735     4.22   0.000     .0046933    .0128229
      tenuresqr |  -.0002089   .0001007    -2.07   0.038    -.0004063   -.0000115
 birthmonthdum2 |  -.0002891   .0212375    -0.01   0.989    -.0419225    .0413443
 birthmonthdum3 |  -.0407888   .0215847    -1.89   0.059    -.0831028    .0015251
 birthmonthdum4 |  -.0265712   .0221904    -1.20   0.231    -.0700727    .0169303
 birthmonthdum5 |  -.0341789   .0214623    -1.59   0.111    -.0762531    .0078953
 birthmonthdum6 |   -.005156   .0213564    -0.24   0.809    -.0470226    .0367105
 birthmonthdum7 |   .0111407   .0219885     0.51   0.612     -.031965    .0542464
 birthmonthdum8 |   -.015568   .0210491    -0.74   0.460    -.0568321    .0256961
 birthmonthdum9 |   -.004923   .0205442    -0.24   0.811    -.0451972    .0353513
birthmonthdum10 |  -.0249041   .0200902    -1.24   0.215    -.0642883    .0144801
birthmonthdum11 |  -.0203065   .0210921    -0.96   0.336    -.0616549     .021042
birthmonthdum12 |  -.0176184   .0215661    -0.82   0.414    -.0598961    .0246592
           male |  -.0161682   .0088794    -1.82   0.069    -.0335751    .0012388
              t |   .0003643   .0002544     1.43   0.152    -.0001345     .000863
              d |  -.0416063   .0198436    -2.10   0.036    -.0805072   -.0027054
             td |   .0014758   .0002809     5.25   0.000     .0009251    .0020264
          _cons |   .0459305   .0236666     1.94   0.052    -.0004649    .0923258
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,830
                                                  Wald chi2(15)   =     548.78
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0888
                                                  Root MSE        =     .63373

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |    .032997   .0913976     0.36   0.718     -.146139    .2121331
         tenure |   .0285749   .0040213     7.11   0.000     .0206933    .0364566
      tenuresqr |  -.0009492   .0001947    -4.88   0.000    -.0013307   -.0005676
 birthmonthdum2 |   .0211887   .0411358     0.52   0.606     -.059436    .1018133
 birthmonthdum3 |  -.0423703   .0419731    -1.01   0.313     -.124636    .0398954
 birthmonthdum4 |   .0590541   .0431094     1.37   0.171    -.0254388     .143547
 birthmonthdum5 |  -.0280381   .0416867    -0.67   0.501    -.1097424    .0536663
 birthmonthdum6 |   .0571426   .0413622     1.38   0.167    -.0239258    .1382109
 birthmonthdum7 |   .0411257   .0426108     0.97   0.334    -.0423899    .1246412
 birthmonthdum8 |   .0243113   .0407434     0.60   0.551    -.0555442    .1041668
 birthmonthdum9 |    .006629   .0397537     0.17   0.868    -.0712869    .0845448
birthmonthdum10 |   .0048783   .0389691     0.13   0.900    -.0714998    .0812564
birthmonthdum11 |   .0095005    .040871     0.23   0.816    -.0706051    .0896061
birthmonthdum12 |  -.0060363    .041771    -0.14   0.885     -.087906    .0758333
           male |   .3603108   .0172528    20.88   0.000      .326496    .3941256
          _cons |   7.777739   .0356435   218.21   0.000     7.707879    7.847599
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  3.33689  (p = 0.0677)
  Wu-Hausman F(1,5813)            =  3.32906  (p = 0.0681)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  3.27051  (p = 0.1949)
  Basmann chi2(2)        =  3.26225  (p = 0.1957)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  21.174  Chi-sq(17) P-value = 0.2186

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,830    8.108651     .663944   5.298317   9.721166
      tenure |      5,830    5.033791     5.59189         -1         32
   tenuresqr |      5,830    56.60292    115.6538          0       1024
birthmont~m2 |      5,830    .0835334    .2767106          0          1
birthmonth~3 |      5,830    .0778731    .2679947          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,830    .0699828      .25514          0          1
birthmonth~5 |      5,830    .0799314    .2712102          0          1
birthmonth~6 |      5,830    .0816467    .2738491          0          1
birthmonth~7 |      5,830    .0728988    .2599926          0          1
birthmonth~8 |      5,830     .086964    .2818064          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,830     .096741    .2956301          0          1
birthmont~10 |      5,830    .1063465     .308307          0          1
birthmont~11 |      5,830    .0857633    .2800382          0          1
birthmont~12 |      5,830    .0787307    .2693411          0          1
        male |      5,830    .6238422    .4844619          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(m
> onthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,830
                                                        F(31, 5798)   =  18.46
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0899
                                                        Adj R-squared = 0.0850
                                                        Root MSE      = 0.3246

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0082876   .0020825     3.98   0.000     .0042052    .0123701
      tenuresqr |  -.0001863   .0001006    -1.85   0.064    -.0003835    .0000109
 birthmonthdum2 |   .0025149   .0211073     0.12   0.905    -.0388632    .0438931
 birthmonthdum3 |  -.0388263   .0214493    -1.81   0.070     -.080875    .0032224
 birthmonthdum4 |  -.0266154   .0220546    -1.21   0.228    -.0698506    .0166198
 birthmonthdum5 |  -.0325801   .0213335    -1.53   0.127    -.0744016    .0092415
 birthmonthdum6 |  -.0054872   .0212223    -0.26   0.796    -.0470908    .0361163
 birthmonthdum7 |   .0172564   .0218744     0.79   0.430    -.0256256    .0601384
 birthmonthdum8 |  -.0108442    .020927    -0.52   0.604    -.0518689    .0301805
 birthmonthdum9 |  -.0023636    .020432    -0.12   0.908     -.042418    .0376909
birthmonthdum10 |  -.0208355   .0199863    -1.04   0.297    -.0600161     .018345
birthmonthdum11 |   -.018781   .0209647    -0.90   0.370    -.0598798    .0223177
birthmonthdum12 |  -.0124582    .021433    -0.58   0.561    -.0544748    .0295585
           male |  -.0163545   .0088472    -1.85   0.065    -.0336983    .0009894
   provincedum2 |    -.14388   .0349569    -4.12   0.000    -.2124087   -.0753514
   provincedum3 |  -.0399154   .0440788    -0.91   0.365    -.1263264    .0464956
   provincedum4 |  -.2171694   .0366592    -5.92   0.000    -.2890352   -.1453036
   provincedum5 |  -.1765211   .0279563    -6.31   0.000     -.231326   -.1217162
   provincedum6 |  -.1835378   .0286548    -6.41   0.000    -.2397119   -.1273637
   provincedum7 |   -.142073   .0287905    -4.93   0.000    -.1985132   -.0856328
   provincedum8 |   -.182756   .0271351    -6.74   0.000    -.2359509   -.1295611
   provincedum9 |  -.1940603   .0281857    -6.89   0.000    -.2493147   -.1388058
  provincedum10 |  -.1877293   .0286896    -6.54   0.000    -.2439715    -.131487
  provincedum11 |  -.1655056   .0280373    -5.90   0.000    -.2204691   -.1105421
  provincedum12 |   -.229047   .0328021    -6.98   0.000    -.2933515   -.1647426
  provincedum13 |  -.1959057    .029212    -6.71   0.000    -.2531722   -.1386392
  provincedum14 |  -.1729138   .0302121    -5.72   0.000    -.2321408   -.1136869
  provincedum15 |  -.1182607   .0304713    -3.88   0.000    -.1779959   -.0585255
              t |   .0003712   .0002536     1.46   0.143    -.0001259    .0008684
              d |  -.0432513   .0197541    -2.19   0.029    -.0819768   -.0045258
             td |   .0014831     .00028     5.30   0.000     .0009342    .0020321
          _cons |   .2144067   .0338865     6.33   0.000     .1479764     .280837
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,830
                                                  Wald chi2(29)   =     743.78
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1142
                                                  Root MSE        =     .62482

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .0130506   .0905924     0.14   0.885    -.1645071    .1906084
         tenure |   .0227871   .0040006     5.70   0.000     .0149461    .0306281
      tenuresqr |  -.0007559   .0001927    -3.92   0.000    -.0011336   -.0003782
 birthmonthdum2 |   .0180659   .0405821     0.45   0.656    -.0614737    .0976054
 birthmonthdum3 |  -.0442576   .0413887    -1.07   0.285    -.1253781    .0368629
 birthmonthdum4 |   .0464808   .0425347     1.09   0.274    -.0368857    .1298474
 birthmonthdum5 |  -.0299281   .0411242    -0.73   0.467      -.11053    .0506739
 birthmonthdum6 |   .0494743   .0407989     1.21   0.225    -.0304901    .1294387
 birthmonthdum7 |   .0502582   .0421019     1.19   0.233    -.0322599    .1327764
 birthmonthdum8 |   .0168087    .040201     0.42   0.676    -.0619838    .0956013
 birthmonthdum9 |  -.0020688   .0392454    -0.05   0.958    -.0789885    .0748508
birthmonthdum10 |  -.0064201   .0384732    -0.17   0.867    -.0818261    .0689859
birthmonthdum11 |  -.0023167   .0403216    -0.06   0.954    -.0813456    .0767122
birthmonthdum12 |    -.00739   .0412041    -0.18   0.858    -.0881486    .0733686
           male |   .3664553   .0170677    21.47   0.000     .3330032    .3999075
   provincedum2 |  -.2855741   .0682312    -4.19   0.000    -.4193049   -.1518433
   provincedum3 |  -.1226114    .084904    -1.44   0.149    -.2890203    .0437974
   provincedum4 |  -.3030324   .0738391    -4.10   0.000    -.4477544   -.1583104
   provincedum5 |  -.0654959   .0558363    -1.17   0.241     -.174933    .0439411
   provincedum6 |  -.0476668   .0569814    -0.84   0.403    -.1593483    .0640147
   provincedum7 |  -.1356916   .0570218    -2.38   0.017    -.2474522    -.023931
   provincedum8 |  -.2324533   .0544101    -4.27   0.000     -.339095   -.1258115
   provincedum9 |   .0532956   .0563493     0.95   0.344     -.057147    .1637383
  provincedum10 |  -.0573169   .0573194    -1.00   0.317    -.1696609    .0550271
  provincedum11 |  -.1530112   .0553807    -2.76   0.006    -.2615553   -.0444672
  provincedum12 |  -.2312339   .0664287    -3.48   0.000    -.3614318   -.1010359
  provincedum13 |  -.2220482   .0585029    -3.80   0.000    -.3367118   -.1073846
  provincedum14 |  -.3247168   .0598325    -5.43   0.000    -.4419864   -.2074472
  provincedum15 |  -.2747744   .0589944    -4.66   0.000    -.3904013   -.1591476
          _cons |   7.945358   .0628376   126.44   0.000     7.822199    8.068517
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  4.25926  (p = 0.0390)
  Wu-Hausman F(1,5799)            =  4.23971  (p = 0.0395)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  3.35339  (p = 0.1870)
  Basmann chi2(2)        =  3.33691  (p = 0.1885)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  82.308  Chi-sq(31) P-value = 0.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,830    8.108651     .663944   5.298317   9.721166
      tenure |      5,830    5.033791     5.59189         -1         32
   tenuresqr |      5,830    56.60292    115.6538          0       1024
birthmont~m2 |      5,830    .0835334    .2767106          0          1
birthmonth~3 |      5,830    .0778731    .2679947          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,830    .0699828      .25514          0          1
birthmonth~5 |      5,830    .0799314    .2712102          0          1
birthmonth~6 |      5,830    .0816467    .2738491          0          1
birthmonth~7 |      5,830    .0728988    .2599926          0          1
birthmonth~8 |      5,830     .086964    .2818064          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,830     .096741    .2956301          0          1
birthmont~10 |      5,830    .1063465     .308307          0          1
birthmont~11 |      5,830    .0857633    .2800382          0          1
birthmont~12 |      5,830    .0787307    .2693411          0          1
        male |      5,830    .6238422    .4844619          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667) & mal
> e == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,637
                                                        F(16, 3620)   =  14.29
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0594
                                                        Adj R-squared = 0.0552
                                                        Root MSE      = 0.3246

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .008889   .0025783     3.45   0.001     .0038339     .013944
      tenuresqr |  -.0002748   .0001225    -2.24   0.025     -.000515   -.0000347
 birthmonthdum2 |   .0039239   .0261126     0.15   0.881    -.0472729    .0551207
 birthmonthdum3 |  -.0164291   .0261979    -0.63   0.531    -.0677932     .034935
 birthmonthdum4 |  -.0170923   .0273303    -0.63   0.532    -.0706767    .0364921
 birthmonthdum5 |  -.0308095   .0264948    -1.16   0.245    -.0827558    .0211367
 birthmonthdum6 |   .0017598    .026201     0.07   0.946    -.0496104    .0531299
 birthmonthdum7 |   .0179914   .0274227     0.66   0.512     -.035774    .0717569
 birthmonthdum8 |  -.0035226   .0258165    -0.14   0.891    -.0541391    .0470938
 birthmonthdum9 |    -.00684   .0253248    -0.27   0.787    -.0564922    .0428123
birthmonthdum10 |  -.0099063    .024781    -0.40   0.689    -.0584924    .0386797
birthmonthdum11 |  -.0295477    .025581    -1.16   0.248    -.0797023    .0206068
birthmonthdum12 |  -.0004391   .0269284    -0.02   0.987    -.0532354    .0523573
              t |   .0004041   .0003079     1.31   0.189    -.0001996    .0010079
              d |  -.0319567   .0246814    -1.29   0.195    -.0803474     .016434
             td |   .0011386   .0003431     3.32   0.001     .0004659    .0018114
          _cons |   .0386203   .0279321     1.38   0.167     -.016144    .0933845
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,637
                                                  Wald chi2(14)   =      47.93
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .64645

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.2294259   .1364951    -1.68   0.093    -.4969513    .0380996
         tenure |   .0239844   .0051559     4.65   0.000     .0138791    .0340897
      tenuresqr |  -.0007534   .0002454    -3.07   0.002    -.0012343   -.0002724
 birthmonthdum2 |   .0256782   .0519557     0.49   0.621     -.076153    .1275095
 birthmonthdum3 |  -.0880158   .0522174    -1.69   0.092      -.19036    .0143285
 birthmonthdum4 |   .0382604   .0545388     0.70   0.483    -.0686337    .1451545
 birthmonthdum5 |   -.052527   .0529482    -0.99   0.321    -.1563035    .0512495
 birthmonthdum6 |   .0364943   .0521313     0.70   0.484    -.0656812    .1386697
 birthmonthdum7 |   .0171332   .0545546     0.31   0.753    -.0897919    .1240582
 birthmonthdum8 |   .0405767    .051309     0.79   0.429     -.059987    .1411404
 birthmonthdum9 |   .0260283   .0503544     0.52   0.605    -.0726645    .1247211
birthmonthdum10 |   -.003813    .049361    -0.08   0.938    -.1005588    .0929328
birthmonthdum11 |   .0277316   .0509642     0.54   0.586    -.0721564    .1276197
birthmonthdum12 |   .0329127   .0535673     0.61   0.539    -.0720774    .1379028
          _cons |   8.187131   .0426117   192.13   0.000     8.103614    8.270648
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  7.30602  (p = 0.0069)
  Wu-Hausman F(1,3621)            =  7.28852  (p = 0.0070)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =   7.1349  (p = 0.0282)
  Basmann chi2(2)        =  7.11551  (p = 0.0285)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  16.244  Chi-sq(16) P-value = 0.4360

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,637    8.247407    .6411498   5.298317   9.721166
      tenure |      3,637    5.365961    5.832412         -1         32
   tenuresqr |      3,637    62.80121    123.4198          0       1024
birthmont~m2 |      3,637    .0830355    .2759738          0          1
birthmonth~3 |      3,637    .0816607    .2738848          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,637    .0698378    .2549085          0          1
birthmonth~5 |      3,637    .0783613    .2687762          0          1
birthmonth~6 |      3,637    .0819357    .2743044          0          1
birthmonth~7 |      3,637    .0692879     .253978          0          1
birthmonth~8 |      3,637    .0871597    .2821078          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,637    .0945834     .292679          0          1
birthmont~10 |      3,637    .1025571    .3034212          0          1
birthmont~11 |      3,637    .0901842    .2864849          0          1
birthmont~12 |      3,637    .0739621    .2617451          0          1
        male |      3,637           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthl
> yearning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,637
                                                        F(30, 3606)   =   9.57
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0738
                                                        Adj R-squared = 0.0660
                                                        Root MSE      = 0.3228

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0085181   .0025923     3.29   0.001     .0034356    .0136007
      tenuresqr |  -.0002608   .0001225    -2.13   0.033     -.000501   -.0000207
 birthmonthdum2 |   .0094413   .0259813     0.36   0.716    -.0414983    .0603809
 birthmonthdum3 |  -.0102769   .0260815    -0.39   0.694    -.0614128     .040859
 birthmonthdum4 |  -.0169267   .0272075    -0.62   0.534    -.0702703     .036417
 birthmonthdum5 |  -.0283405   .0263735    -1.07   0.283    -.0800489     .023368
 birthmonthdum6 |   .0027229    .026079     0.10   0.917    -.0484081     .053854
 birthmonthdum7 |   .0250676   .0273477     0.92   0.359    -.0285508    .0786861
 birthmonthdum8 |   .0036789   .0257136     0.14   0.886    -.0467358    .0540937
 birthmonthdum9 |  -.0019611   .0252225    -0.08   0.938    -.0514128    .0474906
birthmonthdum10 |  -.0062357   .0246946    -0.25   0.801    -.0546525    .0421812
birthmonthdum11 |  -.0266695   .0254788    -1.05   0.295    -.0766238    .0232847
birthmonthdum12 |    .004513   .0268111     0.17   0.866    -.0480533    .0570794
   provincedum2 |  -.1338615   .0442136    -3.03   0.002    -.2205477   -.0471753
   provincedum3 |   .0128279   .0546748     0.23   0.815    -.0943687    .1200245
   provincedum4 |  -.2094269   .0461655    -4.54   0.000      -.29994   -.1189138
   provincedum5 |  -.1758412   .0368139    -4.78   0.000    -.2480193   -.1036631
   provincedum6 |  -.1542382   .0373649    -4.13   0.000    -.2274966   -.0809798
   provincedum7 |  -.1392655   .0374374    -3.72   0.000     -.212666    -.065865
   provincedum8 |  -.1699354   .0356041    -4.77   0.000    -.2397417   -.1001292
   provincedum9 |  -.1576902   .0367996    -4.29   0.000    -.2298403   -.0855401
  provincedum10 |  -.1844689   .0374656    -4.92   0.000    -.2579249    -.111013
  provincedum11 |  -.1543531   .0367752    -4.20   0.000    -.2264554   -.0822508
  provincedum12 |  -.2222851   .0419736    -5.30   0.000    -.3045795   -.1399907
  provincedum13 |   -.176652   .0380748    -4.64   0.000    -.2513023   -.1020017
  provincedum14 |    -.16583   .0398739    -4.16   0.000    -.2440078   -.0876523
  provincedum15 |  -.1262638    .038688    -3.26   0.001    -.2021163   -.0504113
              t |   .0004269   .0003076     1.39   0.165    -.0001762    .0010299
              d |  -.0356513   .0246301    -1.45   0.148    -.0839416    .0126389
             td |   .0011315   .0003425     3.30   0.001     .0004601    .0018029
          _cons |   .1951192   .0426343     4.58   0.000     .1115294    .2787089
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,637
                                                  Wald chi2(28)   =     166.67
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0155
                                                  Root MSE        =     .63607

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.2304087   .1355653    -1.70   0.089    -.4961119    .0352945
         tenure |    .018239   .0051185     3.56   0.000     .0082069    .0282711
      tenuresqr |   -.000569   .0002423    -2.35   0.019     -.001044    -.000094
 birthmonthdum2 |   .0216705    .051161     0.42   0.672    -.0786032    .1219442
 birthmonthdum3 |  -.0870098   .0514189    -1.69   0.091     -.187789    .0137694
 birthmonthdum4 |   .0282652   .0537319     0.53   0.599    -.0770474    .1335778
 birthmonthdum5 |  -.0502413   .0521405    -0.96   0.335    -.1524349    .0519523
 birthmonthdum6 |   .0322418   .0513454     0.63   0.530    -.0683933    .1328768
 birthmonthdum7 |   .0270242   .0538772     0.50   0.616    -.0785733    .1326216
 birthmonthdum8 |   .0333242   .0505791     0.66   0.510    -.0658089    .1324574
 birthmonthdum9 |   .0143016   .0496023     0.29   0.773    -.0829172    .1115203
birthmonthdum10 |  -.0206112   .0486706    -0.42   0.672    -.1160039    .0747815
birthmonthdum11 |    .009239   .0502124     0.18   0.854    -.0891755    .1076534
birthmonthdum12 |   .0298183   .0527832     0.56   0.572    -.0736349    .1332715
   provincedum2 |   -.253942   .0883339    -2.87   0.004    -.4270733   -.0808108
   provincedum3 |  -.0720433   .1076859    -0.67   0.503    -.2831037    .1390171
   provincedum4 |  -.2815479   .0959607    -2.93   0.003    -.4696274   -.0934684
   provincedum5 |  -.0580721   .0758566    -0.77   0.444    -.2067484    .0906041
   provincedum6 |  -.0167132    .075843    -0.22   0.826    -.1653627    .1319363
   provincedum7 |  -.0920988   .0761712    -1.21   0.227    -.2413915     .057194
   provincedum8 |  -.2029764   .0730823    -2.78   0.005    -.3462149   -.0597378
   provincedum9 |   .0362069   .0747953     0.48   0.628    -.1103891    .1828029
  provincedum10 |  -.0124762    .077044    -0.16   0.871    -.1634797    .1385274
  provincedum11 |  -.1416688   .0742032    -1.91   0.056    -.2871043    .0037668
  provincedum12 |  -.2614531   .0879428    -2.97   0.003    -.4338178   -.0890883
  provincedum13 |  -.2592313   .0780463    -3.32   0.001    -.4121991   -.1062635
  provincedum14 |  -.3528689   .0811504    -4.35   0.000    -.5119207   -.1938171
  provincedum15 |   -.273011   .0771313    -3.54   0.000    -.4241856   -.1218364
          _cons |   8.348322   .0818871   101.95   0.000     8.187826    8.508818
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  7.31202  (p = 0.0068)
  Wu-Hausman F(1,3607)            =  7.26632  (p = 0.0071)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  6.60943  (p = 0.0367)
  Basmann chi2(2)        =  6.56503  (p = 0.0375)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  65.361  Chi-sq(30) P-value = 0.0002

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,637    8.247407    .6411498   5.298317   9.721166
      tenure |      3,637    5.365961    5.832412         -1         32
   tenuresqr |      3,637    62.80121    123.4198          0       1024
birthmont~m2 |      3,637    .0830355    .2759738          0          1
birthmonth~3 |      3,637    .0816607    .2738848          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,637    .0698378    .2549085          0          1
birthmonth~5 |      3,637    .0783613    .2687762          0          1
birthmonth~6 |      3,637    .0819357    .2743044          0          1
birthmonth~7 |      3,637    .0692879     .253978          0          1
birthmonth~8 |      3,637    .0871597    .2821078          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,637    .0945834     .292679          0          1
birthmont~10 |      3,637    .1025571    .3034212          0          1
birthmont~11 |      3,637    .0901842    .2864849          0          1
birthmont~12 |      3,637    .0739621    .2617451          0          1
        male |      3,637           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667) & mal
> e == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,193
                                                        F(16, 2176)   =  16.48
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1081
                                                        Adj R-squared = 0.1015
                                                        Root MSE      = 0.3299

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0075836   .0035118     2.16   0.031     .0006968    .0144704
      tenuresqr |  -.0000207   .0001793    -0.12   0.908    -.0003723     .000331
 birthmonthdum2 |  -.0119034   .0366021    -0.33   0.745    -.0836821    .0598753
 birthmonthdum3 |  -.0918915   .0380198    -2.42   0.016    -.1664503   -.0173327
 birthmonthdum4 |  -.0539086   .0381774    -1.41   0.158    -.1287766    .0209594
 birthmonthdum5 |  -.0490297   .0368132    -1.33   0.183    -.1212224     .023163
 birthmonthdum6 |  -.0241271   .0369281    -0.65   0.514    -.0965452    .0482909
 birthmonthdum7 |  -.0120313   .0371802    -0.32   0.746    -.0849438    .0608811
 birthmonthdum8 |  -.0411405   .0364358    -1.13   0.259    -.1125931    .0303122
 birthmonthdum9 |  -.0145112   .0353688    -0.41   0.682    -.0838712    .0548489
birthmonthdum10 |  -.0576281   .0345597    -1.67   0.096    -.1254015    .0101454
birthmonthdum11 |  -.0037406   .0371784    -0.10   0.920    -.0766495    .0691682
birthmonthdum12 |  -.0535036   .0364392    -1.47   0.142    -.1249627    .0179556
              t |   .0003571    .000451     0.79   0.429    -.0005274    .0012416
              d |   -.057559   .0335452    -1.72   0.086    -.1233429     .008225
             td |   .0019616   .0004905     4.00   0.000     .0009997    .0029235
          _cons |   .0433101   .0405373     1.07   0.285    -.0361859     .122806
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,193
                                                  Wald chi2(14)   =      67.25
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0525
                                                  Root MSE        =     .61966

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .3494518   .1187792     2.94   0.003     .1166489    .5822548
         tenure |   .0397656   .0065748     6.05   0.000     .0268792    .0526521
      tenuresqr |  -.0015419   .0003339    -4.62   0.000    -.0021963   -.0008874
 birthmonthdum2 |   .0215657   .0686367     0.31   0.753    -.1129598    .1560913
 birthmonthdum3 |   .0583768   .0718039     0.81   0.416    -.0823562    .1991098
 birthmonthdum4 |   .0933528   .0717242     1.30   0.193    -.0472241    .2339298
 birthmonthdum5 |   .0103284   .0690462     0.15   0.881    -.1249997    .1456565
 birthmonthdum6 |   .0952096   .0691982     1.38   0.169    -.0404164    .2308356
 birthmonthdum7 |    .075239   .0696879     1.08   0.280    -.0613467    .2118247
 birthmonthdum8 |   .0027284    .068291     0.04   0.968    -.1311195    .1365763
 birthmonthdum9 |   -.035013   .0662106    -0.53   0.597    -.1647834    .0947574
birthmonthdum10 |   .0240535   .0648388     0.37   0.711    -.1030281    .1511352
birthmonthdum11 |  -.0412798    .069743    -0.59   0.554    -.1779735     .095414
birthmonthdum12 |  -.0556543   .0682454    -0.82   0.415    -.1894128    .0781042
          _cons |   7.704008   .0564168   136.56   0.000     7.593433    7.814583
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .150916  (p = 0.6977)
  Wu-Hausman F(1,2177)            =  .149825  (p = 0.6987)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .434355  (p = 0.8048)
  Basmann chi2(2)        =  .431073  (p = 0.8061)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  21.249  Chi-sq(16) P-value = 0.1691

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,193    7.878531    .6367446   5.298317   9.721166
      tenure |      2,193      4.4829    5.122389         -1         31
   tenuresqr |      2,193     46.3233    100.6615          0        961
birthmont~m2 |      2,193    .0843593    .2779893          0          1
birthmonth~3 |      2,193    .0715914     .257869          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,193    .0702234    .2555815          0          1
birthmonth~5 |      2,193    .0825353    .2752414          0          1
birthmonth~6 |      2,193    .0811674    .2731542          0          1
birthmonth~7 |      2,193    .0788874    .2696244          0          1
birthmonth~8 |      2,193    .0866393    .2813699          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,193    .1003192    .3004936          0          1
birthmont~10 |      2,193    .1126311    .3162134          0          1
birthmont~11 |      2,193    .0784314    .2689105          0          1
birthmont~12 |      2,193    .0866393    .2813699          0          1
        male |      2,193           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthly
> earning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,193
                                                        F(30, 2162)   =  10.79
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1302
                                                        Adj R-squared = 0.1182
                                                        Root MSE      = 0.3268

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0067076   .0035215     1.90   0.057    -.0001984    .0136135
      tenuresqr |   .0000304   .0001791     0.17   0.865    -.0003209    .0003817
 birthmonthdum2 |  -.0181999   .0363631    -0.50   0.617    -.0895101    .0531104
 birthmonthdum3 |  -.0970099    .037777    -2.57   0.010     -.171093   -.0229269
 birthmonthdum4 |  -.0581999   .0379517    -1.53   0.125    -.1326255    .0162256
 birthmonthdum5 |  -.0525445   .0365946    -1.44   0.151    -.1243088    .0192199
 birthmonthdum6 |  -.0291776   .0366577    -0.80   0.426    -.1010656    .0427105
 birthmonthdum7 |  -.0135737   .0369227    -0.37   0.713    -.0859814     .058834
 birthmonthdum8 |   -.042406   .0362051    -1.17   0.242    -.1134064    .0285944
 birthmonthdum9 |  -.0193106   .0351805    -0.55   0.583    -.0883017    .0496806
birthmonthdum10 |  -.0582579   .0343134    -1.70   0.090    -.1255486    .0090327
birthmonthdum11 |  -.0135291   .0369329    -0.37   0.714    -.0859568    .0588986
birthmonthdum12 |  -.0511628   .0361798    -1.41   0.157    -.1221136     .019788
   provincedum2 |  -.1478282   .0581245    -2.54   0.011    -.2618139   -.0338425
   provincedum3 |   -.139942   .0756291    -1.85   0.064    -.2882554    .0083714
   provincedum4 |  -.2261534   .0613485    -3.69   0.000    -.3464616   -.1058451
   provincedum5 |  -.1810959   .0431467    -4.20   0.000    -.2657092   -.0964827
   provincedum6 |  -.2293536    .044852    -5.11   0.000    -.3173112    -.141396
   provincedum7 |  -.1410752   .0453272    -3.11   0.002    -.2299647   -.0521857
   provincedum8 |   -.201265   .0420793    -4.78   0.000    -.2837851   -.1187449
   provincedum9 |  -.2548786   .0440544    -5.79   0.000    -.3412721   -.1684852
  provincedum10 |  -.1893352   .0448361    -4.22   0.000    -.2772615   -.1014088
  provincedum11 |  -.1792421   .0435022    -4.12   0.000    -.2645527   -.0939316
  provincedum12 |  -.2370323   .0531088    -4.46   0.000     -.341182   -.1328826
  provincedum13 |  -.2225279   .0457389    -4.87   0.000    -.3122246   -.1328311
  provincedum14 |   -.189288   .0464775    -4.07   0.000    -.2804333   -.0981427
  provincedum15 |  -.0861715   .0510136    -1.69   0.091    -.1862123    .0138693
              t |   .0003526   .0004484     0.79   0.432    -.0005267     .001232
              d |  -.0551287   .0333163    -1.65   0.098     -.120464    .0102067
             td |    .001983   .0004881     4.06   0.000     .0010258    .0029402
          _cons |   .2324778   .0552394     4.21   0.000     .1241499    .3408058
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,193
                                                  Wald chi2(28)   =     145.82
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0860
                                                  Root MSE        =      .6086

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .2833884   .1165047     2.43   0.015     .0550434    .5117335
         tenure |   .0341845   .0065231     5.24   0.000     .0213993    .0469696
      tenuresqr |  -.0013506   .0003303    -4.09   0.000     -.001998   -.0007032
 birthmonthdum2 |   .0244879   .0676193     0.36   0.717    -.1080434    .1570192
 birthmonthdum3 |   .0504169   .0707484     0.71   0.476    -.0882474    .1890811
 birthmonthdum4 |   .0796412   .0707065     1.13   0.260    -.0589411    .2182234
 birthmonthdum5 |   .0033247   .0680481     0.05   0.961    -.1300472    .1366965
 birthmonthdum6 |   .0875999   .0681021     1.29   0.198    -.0458777    .2210775
 birthmonthdum7 |   .0912141   .0686059     1.33   0.184     -.043251    .2256792
 birthmonthdum8 |  -.0063829   .0672731    -0.09   0.924    -.1382358      .12547
 birthmonthdum9 |   -.038402   .0652898    -0.59   0.556    -.1663677    .0895636
birthmonthdum10 |   .0198674   .0638116     0.31   0.756     -.105201    .1449358
birthmonthdum11 |  -.0335205   .0686773    -0.49   0.625    -.1681254    .1010845
birthmonthdum12 |  -.0511177   .0671657    -0.76   0.447      -.18276    .0805247
   provincedum2 |  -.3310852   .1096776    -3.02   0.003    -.5460494    -.116121
   provincedum3 |   -.163034   .1418787    -1.15   0.251    -.4411111    .1150431
   provincedum4 |  -.3593043   .1182299    -3.04   0.002    -.5910306    -.127578
   provincedum5 |  -.0806577   .0826987    -0.98   0.329    -.2427442    .0814288
   provincedum6 |  -.0834398   .0864214    -0.97   0.334    -.2528226     .085943
   provincedum7 |  -.2064156   .0864062    -2.39   0.017    -.3757687   -.0370625
   provincedum8 |  -.2672487   .0815817    -3.28   0.001    -.4271459   -.1073516
   provincedum9 |    .109654   .0859905     1.28   0.202    -.0588842    .2781922
  provincedum10 |  -.1295221   .0860892    -1.50   0.132    -.2982538    .0392096
  provincedum11 |  -.1547646   .0833169    -1.86   0.063    -.3180626    .0085334
  provincedum12 |  -.1815879   .1027126    -1.77   0.077    -.3829009     .019725
  provincedum13 |  -.1490338   .0885105    -1.68   0.092    -.3225111    .0244436
  provincedum14 |  -.2777638   .0887118    -3.13   0.002    -.4516358   -.1038919
  provincedum15 |  -.2663546   .0948773    -2.81   0.005    -.4523106   -.0803986
          _cons |   7.882017   .0958783    82.21   0.000       7.6941    8.069935
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .058821  (p = 0.8084)
  Wu-Hausman F(1,2163)            =  .058018  (p = 0.8097)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .295653  (p = 0.8626)
  Basmann chi2(2)        =  .291513  (p = 0.8644)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  54.179  Chi-sq(30) P-value = 0.0044

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,193    7.878531    .6367446   5.298317   9.721166
      tenure |      2,193      4.4829    5.122389         -1         31
   tenuresqr |      2,193     46.3233    100.6615          0        961
birthmont~m2 |      2,193    .0843593    .2779893          0          1
birthmonth~3 |      2,193    .0715914     .257869          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,193    .0702234    .2555815          0          1
birthmonth~5 |      2,193    .0825353    .2752414          0          1
birthmonth~6 |      2,193    .0811674    .2731542          0          1
birthmonth~7 |      2,193    .0788874    .2696244          0          1
birthmonth~8 |      2,193    .0866393    .2813699          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,193    .1003192    .3004936          0          1
birthmont~10 |      2,193    .1126311    .3162134          0          1
birthmont~11 |      2,193    .0784314    .2689105          0          1
birthmont~12 |      2,193    .0866393    .2813699          0          1
        male |      2,193           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Tenure/Rural/IV Rural ATF&Birth Tenure 1979 1971-1992.log
  log type:  text
 closed on:   8 Aug 2024, 12:37:35
---------------------------------------------------------------------------------------------
