---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Tenure/Rural/IV Rural ATF&Birth Tenure 1979 3years.log
  log type:  text
 opened on:   8 Aug 2024, 12:36:56

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,408 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. **
. tab birthmonth, gen(birthmonthdum)

 birthmonth |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,879        8.22        8.22
          2 |      2,965        8.47       16.70
          3 |      2,870        8.20       24.89
          4 |      2,595        7.41       32.31
          5 |      2,663        7.61       39.92
          6 |      2,708        7.74       47.65
          7 |      2,646        7.56       55.21
          8 |      3,104        8.87       64.08
          9 |      3,121        8.92       72.99
         10 |      3,565       10.18       83.18
         11 |      3,001        8.57       91.75
         12 |      2,887        8.25      100.00
------------+-----------------------------------
      Total |     35,004      100.00

. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. local months = 36

. 
. 
. *1)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu secgenhighedu secgenedu = t d td) if inrange(t, -`months', `months'-1) & inrange(mon
> thlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,189
                                                        F(17, 1171)   =   2.43
                                                        Prob > F      = 0.0010
                                                        R-squared     = 0.0341
                                                        Adj R-squared = 0.0201
                                                        Root MSE      = 0.2466

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .012347   .0036748     3.36   0.001     .0051372    .0195569
      tenuresqr |  -.0003625   .0001878    -1.93   0.054    -.0007311    5.98e-06
 birthmonthdum2 |  -.0519136   .0367712    -1.41   0.158    -.1240583    .0202311
 birthmonthdum3 |  -.0792986   .0402342    -1.97   0.049    -.1582378   -.0003594
 birthmonthdum4 |  -.0603157   .0399046    -1.51   0.131    -.1386082    .0179768
 birthmonthdum5 |  -.0661439    .037753    -1.75   0.080     -.140215    .0079272
 birthmonthdum6 |  -.0696383   .0373013    -1.87   0.062    -.1428231    .0035465
 birthmonthdum7 |  -.0698195   .0391012    -1.79   0.074    -.1465357    .0068967
 birthmonthdum8 |  -.0700634   .0374932    -1.87   0.062    -.1436248    .0034979
 birthmonthdum9 |  -.0520916   .0360381    -1.45   0.149    -.1227981    .0186149
birthmonthdum10 |  -.0908467   .0362303    -2.51   0.012    -.1619303   -.0197631
birthmonthdum11 |  -.0722882   .0375862    -1.92   0.055     -.146032    .0014555
birthmonthdum12 |  -.1007841   .0379606    -2.65   0.008    -.1752624   -.0263057
           male |   .0151591   .0149266     1.02   0.310    -.0141268     .044445
              t |  -.0010452   .0009739    -1.07   0.283    -.0029559    .0008655
              d |  -.0048036   .0297559    -0.16   0.872    -.0631844    .0535773
             td |   .0028737    .001381     2.08   0.038     .0001641    .0055833
          _cons |   .0507626   .0382986     1.33   0.185    -.0243789    .1259041
---------------------------------------------------------------------------------

                                                        Number of obs =  1,189
                                                        F(17, 1171)   =   1.94
                                                        Prob > F      = 0.0121
                                                        R-squared     = 0.0274
                                                        Adj R-squared = 0.0133
                                                        Root MSE      = 0.2123

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0076898   .0031631     2.43   0.015     .0014838    .0138957
      tenuresqr |  -.0002443   .0001617    -1.51   0.131    -.0005615    .0000729
 birthmonthdum2 |  -.0333145   .0316508    -1.05   0.293    -.0954131    .0287841
 birthmonthdum3 |  -.0653433   .0346316    -1.89   0.059    -.1332903    .0026036
 birthmonthdum4 |  -.0439871   .0343479    -1.28   0.201    -.1113774    .0234032
 birthmonthdum5 |  -.0472516   .0324959    -1.45   0.146    -.1110084    .0165051
 birthmonthdum6 |  -.0627386   .0321071    -1.95   0.051    -.1257325    .0002553
 birthmonthdum7 |  -.0618931   .0336564    -1.84   0.066    -.1279266    .0041404
 birthmonthdum8 |  -.0593084   .0322723    -1.84   0.066    -.1226263    .0040096
 birthmonthdum9 |  -.0482395   .0310198    -1.56   0.120    -.1091002    .0126211
birthmonthdum10 |  -.1047983   .0311853    -3.36   0.001    -.1659835    -.043613
birthmonthdum11 |  -.0652326   .0323523    -2.02   0.044    -.1287075   -.0017576
birthmonthdum12 |  -.0725722   .0326746    -2.22   0.027    -.1366794   -.0084649
           male |    .017069   .0128481     1.33   0.184    -.0081389    .0422768
              t |   -.001093   .0008382    -1.30   0.193    -.0027376    .0005517
              d |   .0024061   .0256124     0.09   0.925    -.0478453    .0526574
             td |   .0024338   .0011887     2.05   0.041     .0001015     .004766
          _cons |   .0418355   .0329655     1.27   0.205    -.0228427    .1065136
---------------------------------------------------------------------------------

                                                        Number of obs =  1,189
                                                        F(17, 1171)   =   1.44
                                                        Prob > F      = 0.1111
                                                        R-squared     = 0.0204
                                                        Adj R-squared = 0.0062
                                                        Root MSE      = 0.3330

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0113459   .0049615     2.29   0.022     .0016115    .0210804
      tenuresqr |  -.0004311   .0002536    -1.70   0.089    -.0009286    .0000665
 birthmonthdum2 |  -.0066463   .0496468    -0.13   0.894    -.1040529    .0907604
 birthmonthdum3 |  -.0427592   .0543225    -0.79   0.431    -.1493395     .063821
 birthmonthdum4 |   .0035698   .0538775     0.07   0.947    -.1021373    .1092769
 birthmonthdum5 |  -.0006848   .0509725    -0.01   0.989    -.1006924    .0993228
 birthmonthdum6 |  -.0133008   .0503626    -0.26   0.792    -.1121117    .0855102
 birthmonthdum7 |   .0002557   .0527927     0.00   0.996    -.1033231    .1038346
 birthmonthdum8 |  -.0379624   .0506217    -0.75   0.453    -.1372817    .0613569
 birthmonthdum9 |   .0221408   .0486571     0.46   0.649    -.0733241    .1176056
birthmonthdum10 |  -.0950663   .0489166    -1.94   0.052    -.1910403    .0009076
birthmonthdum11 |  -.0047647   .0507472    -0.09   0.925    -.1043303    .0948009
birthmonthdum12 |  -.0523975   .0512527    -1.02   0.307    -.1529549    .0481599
           male |   .0071319   .0201533     0.35   0.723    -.0324087    .0466724
              t |  -.0011772   .0013149    -0.90   0.371    -.0037569    .0014026
              d |  -.0451884   .0401751    -1.12   0.261    -.1240116    .0336349
             td |   .0033143   .0018646     1.78   0.076     -.000344    .0069727
          _cons |   .0984643   .0517091     1.90   0.057    -.0029885    .1999171
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,189
                                                  Wald chi2(17)   =      86.48
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .92852

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -3.549152   10.70813    -0.33   0.740     -24.5367    17.43839
  secgenhighedu |   5.475391   13.21429     0.41   0.679    -20.42414    31.37492
      secgenedu |   .3290928   1.512584     0.22   0.828    -2.635518    3.293703
         tenure |   .0281164   .0396163     0.71   0.478    -.0495301    .1057629
      tenuresqr |  -.0010206   .0011672    -0.87   0.382    -.0033082     .001267
 birthmonthdum2 |   .1283281    .199962     0.64   0.521    -.2635902    .5202464
 birthmonthdum3 |   .1356845   .2024348     0.67   0.503    -.2610804    .5324494
 birthmonthdum4 |   .1000179   .1988711     0.50   0.615    -.2897623    .4897982
 birthmonthdum5 |   .0028084   .2025502     0.01   0.989    -.3941826    .3997995
 birthmonthdum6 |   .3221399   .2237851     1.44   0.150    -.1164709    .7607506
 birthmonthdum7 |   .0988908   .2274379     0.43   0.664    -.3468793     .544661
 birthmonthdum8 |   .1634775   .1899772     0.86   0.390    -.2088709    .5358259
 birthmonthdum9 |   .0109993   .2199744     0.05   0.960    -.4201426    .4421413
birthmonthdum10 |   .3434381   .4562654     0.75   0.452    -.5508257    1.237702
birthmonthdum11 |   .1232304    .225315     0.55   0.584    -.3183788    .5648397
birthmonthdum12 |   .0611436   .2540493     0.24   0.810    -.4367838     .559071
           male |   .4276165   .0890428     4.80   0.000     .2530958    .6021372
          _cons |   7.560916   .1955729    38.66   0.000       7.1776    7.944232
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  1.45473  (p = 0.6928)
  Wu-Hausman F(3,1168)            =  .476931  (p = 0.6984)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   3.103  Chi-sq(17) P-value = 0.9999

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,189    8.124603    .6771347   5.298317   9.721166
      tenure |      1,189    6.067283    6.017554          0         28
   tenuresqr |      1,189    72.99243    118.1597          0        784
birthmont~m2 |      1,189    .0941968    .2922252          0          1
birthmonth~3 |      1,189    .0639193     .244712          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,189    .0656013    .2476881          0          1
birthmonth~5 |      1,189    .0841043    .2776609          0          1
birthmonth~6 |      1,189    .0908326    .2874919          0          1
birthmonth~7 |      1,189    .0731707    .2605261          0          1
birthmonth~8 |      1,189    .0891505    .2850808          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,189    .1084945    .3111348          0          1
birthmont~10 |      1,189    .1009251    .3013563          0          1
birthmont~11 |      1,189    .0841043    .2776609          0          1
birthmont~12 |      1,189    .0815812    .2738407          0          1
        male |      1,189    .6291001     .483249          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months
> ', `months'-1) & inrange(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,189
                                                        F(31, 1157)   =   2.98
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0740
                                                        Adj R-squared = 0.0492
                                                        Root MSE      = 0.2430

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0107092   .0036891     2.90   0.004     .0034711    .0179473
      tenuresqr |  -.0002894   .0001873    -1.55   0.123     -.000657    .0000781
 birthmonthdum2 |  -.0677581   .0366299    -1.85   0.065    -.1396265    .0041102
 birthmonthdum3 |  -.0897308   .0398912    -2.25   0.025    -.1679979   -.0114637
 birthmonthdum4 |  -.0733228   .0395134    -1.86   0.064    -.1508488    .0042031
 birthmonthdum5 |  -.0733684    .037397    -1.96   0.050    -.1467419    5.08e-06
 birthmonthdum6 |  -.0858027   .0372286    -2.30   0.021    -.1588459   -.0127595
 birthmonthdum7 |  -.0718736   .0386872    -1.86   0.063    -.1477786    .0040314
 birthmonthdum8 |  -.0698399   .0372799    -1.87   0.061    -.1429836    .0033039
 birthmonthdum9 |  -.0627556   .0358016    -1.75   0.080     -.132999    .0074878
birthmonthdum10 |  -.0976273   .0360265    -2.71   0.007    -.1683119   -.0269427
birthmonthdum11 |  -.0841713    .037291    -2.26   0.024    -.1573369   -.0110058
birthmonthdum12 |  -.1120704   .0376771    -2.97   0.003    -.1859934   -.0381474
           male |   .0155364   .0147443     1.05   0.292    -.0133922     .044465
   provincedum2 |  -.2498546   .0601894    -4.15   0.000    -.3679473    -.131762
   provincedum3 |  -.1945647   .0737234    -2.64   0.008    -.3392113   -.0499182
   provincedum4 |  -.2380757   .0613645    -3.88   0.000    -.3584738   -.1176777
   provincedum5 |  -.1245393   .0486739    -2.56   0.011    -.2200383   -.0290403
   provincedum6 |  -.1655078   .0507419    -3.26   0.001    -.2650642   -.0659514
   provincedum7 |  -.2184843    .048568    -4.50   0.000    -.3137755   -.1231931
   provincedum8 |  -.1932669   .0472671    -4.09   0.000    -.2860057   -.1005282
   provincedum9 |  -.2262274   .0491474    -4.60   0.000    -.3226553   -.1297994
  provincedum10 |  -.1073571   .0502235    -2.14   0.033    -.2058965   -.0088178
  provincedum11 |  -.1934483   .0498328    -3.88   0.000    -.2912211   -.0956754
  provincedum12 |  -.1830984   .0585393    -3.13   0.002    -.2979535   -.0682433
  provincedum13 |  -.2392246   .0516719    -4.63   0.000    -.3406057   -.1378436
  provincedum14 |  -.1917969   .0510572    -3.76   0.000    -.2919719   -.0916219
  provincedum15 |  -.1734007   .0547306    -3.17   0.002    -.2807831   -.0660184
              t |  -.0013054   .0009656    -1.35   0.177       -.0032    .0005892
              d |   .0047707   .0295393     0.16   0.872    -.0531858    .0627272
             td |   .0029798   .0013683     2.18   0.030     .0002952    .0056644
          _cons |   .2405826   .0569933     4.22   0.000     .1287609    .3524043
---------------------------------------------------------------------------------

                                                        Number of obs =  1,189
                                                        F(31, 1157)   =   2.45
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0616
                                                        Adj R-squared = 0.0365
                                                        Root MSE      = 0.2098

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .006461   .0031855     2.03   0.043      .000211    .0127111
      tenuresqr |  -.0001936   .0001618    -1.20   0.232     -.000511    .0001237
 birthmonthdum2 |  -.0455428   .0316296    -1.44   0.150    -.1076005     .016515
 birthmonthdum3 |  -.0749619   .0344457    -2.18   0.030    -.1425449   -.0073789
 birthmonthdum4 |  -.0539256   .0341195    -1.58   0.114    -.1208686    .0130174
 birthmonthdum5 |  -.0539456    .032292    -1.67   0.095     -.117303    .0094118
 birthmonthdum6 |  -.0760724   .0321466    -2.37   0.018    -.1391446   -.0130002
 birthmonthdum7 |  -.0638204   .0334061    -1.91   0.056    -.1293637    .0017229
 birthmonthdum8 |  -.0590439   .0321909    -1.83   0.067    -.1222029    .0041151
 birthmonthdum9 |  -.0569691   .0309144    -1.84   0.066    -.1176237    .0036855
birthmonthdum10 |  -.1114153   .0311086    -3.58   0.000    -.1724508   -.0503798
birthmonthdum11 |  -.0770728   .0322005    -2.39   0.017    -.1402506    -.013895
birthmonthdum12 |   -.080117   .0325338    -2.46   0.014    -.1439489   -.0162851
           male |   .0166857   .0127316     1.31   0.190    -.0082939    .0416653
   provincedum2 |  -.2158162   .0519731    -4.15   0.000    -.3177882   -.1138442
   provincedum3 |  -.1525801   .0636595    -2.40   0.017    -.2774811    -.027679
   provincedum4 |  -.2109811   .0529877    -3.98   0.000    -.3149438   -.1070184
   provincedum5 |  -.1366282   .0420295    -3.25   0.001    -.2190908   -.0541656
   provincedum6 |  -.1428143   .0438152    -3.26   0.001    -.2287804   -.0568482
   provincedum7 |  -.1945571    .041938    -4.64   0.000    -.2768402    -.112274
   provincedum8 |  -.1830419   .0408147    -4.48   0.000     -.263121   -.1029628
   provincedum9 |  -.1933226   .0424383    -4.56   0.000    -.2765873   -.1100579
  provincedum10 |  -.1178091   .0433676    -2.72   0.007     -.202897   -.0327213
  provincedum11 |  -.1766563   .0430302    -4.11   0.000    -.2610823   -.0922302
  provincedum12 |  -.1869665   .0505482    -3.70   0.000    -.2861429   -.0877901
  provincedum13 |  -.2184417   .0446182    -4.90   0.000    -.3059834      -.1309
  provincedum14 |  -.1749885   .0440874    -3.97   0.000    -.2614887   -.0884882
  provincedum15 |  -.1619586   .0472594    -3.43   0.001    -.2546824   -.0692349
              t |  -.0013976   .0008338    -1.68   0.094    -.0030336    .0002383
              d |    .011654   .0255069     0.46   0.648     -.038391     .061699
             td |   .0026185   .0011815     2.22   0.027     .0003004    .0049366
          _cons |   .2159895   .0492132     4.39   0.000     .1194324    .3125466
---------------------------------------------------------------------------------

                                                        Number of obs =  1,189
                                                        F(31, 1157)   =   2.48
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0622
                                                        Adj R-squared = 0.0371
                                                        Root MSE      = 0.3278

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0092685   .0049773     1.86   0.063     -.000497    .0190341
      tenuresqr |  -.0003455   .0002527    -1.37   0.172    -.0008414    .0001504
 birthmonthdum2 |  -.0171938   .0494207    -0.35   0.728     -.114158    .0797705
 birthmonthdum3 |  -.0558156   .0538208    -1.04   0.300     -.161413    .0497818
 birthmonthdum4 |   -.011592   .0533112    -0.22   0.828    -.1161894    .0930054
 birthmonthdum5 |  -.0046521   .0504557    -0.09   0.927     -.103647    .0943428
 birthmonthdum6 |  -.0218318   .0502286    -0.43   0.664    -.1203811    .0767176
 birthmonthdum7 |   -.007727   .0521965    -0.15   0.882    -.1101374    .0946835
 birthmonthdum8 |  -.0410458   .0502977    -0.82   0.415    -.1397308    .0576391
 birthmonthdum9 |   .0058408   .0483033     0.12   0.904    -.0889311    .1006127
birthmonthdum10 |  -.1080128   .0486067    -2.22   0.026    -.2033799   -.0126458
birthmonthdum11 |   -.013943   .0503127    -0.28   0.782    -.1126574    .0847714
birthmonthdum12 |  -.0640954   .0508336    -1.26   0.208    -.1638317     .035641
           male |   .0076269   .0198929     0.38   0.701    -.0314033    .0466571
   provincedum2 |  -.1854647   .0812071    -2.28   0.023    -.3447944    -.026135
   provincedum3 |  -.1083726    .099467    -1.09   0.276    -.3035285    .0867834
   provincedum4 |  -.2885229   .0827924    -3.48   0.001    -.4509631   -.1260828
   provincedum5 |  -.1326348   .0656705    -2.02   0.044    -.2614813   -.0037883
   provincedum6 |  -.1665681   .0684605    -2.43   0.015    -.3008887   -.0322474
   provincedum7 |  -.2347473   .0655275    -3.58   0.000    -.3633134   -.1061812
   provincedum8 |  -.1843651   .0637723    -2.89   0.004    -.3094874   -.0592427
   provincedum9 |  -.1583802   .0663092    -2.39   0.017      -.28848   -.0282804
  provincedum10 |  -.0114044   .0677612    -0.17   0.866    -.1443529    .1215441
  provincedum11 |  -.1853103   .0672341    -2.76   0.006    -.3172247    -.053396
  provincedum12 |  -.2656036   .0789808    -3.36   0.001    -.4205652   -.1106421
  provincedum13 |  -.2456283   .0697153    -3.52   0.000    -.3824108   -.1088457
  provincedum14 |  -.2068385   .0688859    -3.00   0.003    -.3419939   -.0716832
  provincedum15 |  -.1486825   .0738421    -2.01   0.044    -.2935619    -.003803
              t |  -.0016123   .0013028    -1.24   0.216    -.0041685    .0009439
              d |  -.0332018   .0398541    -0.83   0.405    -.1113963    .0449927
             td |   .0037312   .0018461     2.02   0.043     .0001092    .0073532
          _cons |   .2742051   .0768948     3.57   0.000     .1233361    .4250741
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,189
                                                  Wald chi2(31)   =     129.44
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .85183

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -2.786102   8.313018    -0.34   0.738    -19.07932    13.50711
  secgenhighedu |   4.314895   9.888221     0.44   0.663    -15.06566    23.69545
      secgenedu |   .4987575   1.465912     0.34   0.734    -2.374377    3.371892
         tenure |   .0183342    .033169     0.55   0.580    -.0466759    .0833444
      tenuresqr |  -.0006434   .0009653    -0.67   0.505    -.0025353    .0012485
 birthmonthdum2 |   .1100775   .2012045     0.55   0.584    -.2842761    .5044311
 birthmonthdum3 |   .1106651   .1936177     0.57   0.568    -.2688186    .4901488
 birthmonthdum4 |    .062622   .1973006     0.32   0.751      -.32408     .449324
 birthmonthdum5 |   -.011385    .195305    -0.06   0.954    -.3941758    .3714058
 birthmonthdum6 |   .2850816   .2105491     1.35   0.176    -.1275871    .6977503
 birthmonthdum7 |   .0646053   .1986381     0.33   0.745    -.3247181    .4539288
 birthmonthdum8 |   .1216525   .1690076     0.72   0.472    -.2095963    .4529014
 birthmonthdum9 |  -.0358427   .1960285    -0.18   0.855    -.4200515     .348366
birthmonthdum10 |   .2891089   .3352499     0.86   0.388    -.3679689    .9461867
birthmonthdum11 |   .0854736   .2128154     0.40   0.688    -.3316368    .5025841
birthmonthdum12 |    .030947   .2605536     0.12   0.905    -.4797288    .5416227
           male |   .4380926   .0672597     6.51   0.000     .3062661    .5699191
   provincedum2 |  -.0400814   .4298356    -0.09   0.926    -.8825437    .8023808
   provincedum3 |  -.1935382   .4158105    -0.47   0.642    -1.008512    .6214355
   provincedum4 |  -.0743347   .4387156    -0.17   0.865    -.9342016    .7855321
   provincedum5 |   .1453414   .3765585     0.39   0.700    -.5926996    .8833824
   provincedum6 |   .1114425   .3065511     0.36   0.716    -.4893865    .7122716
   provincedum7 |   .0320745   .3743081     0.09   0.932    -.7015558    .7657049
   provincedum8 |  -.0169855   .3728517    -0.05   0.964    -.7477613    .7137903
   provincedum9 |   .1428878   .3782508     0.38   0.706    -.5984701    .8842457
  provincedum10 |   .0481664   .3854184     0.12   0.901    -.7072398    .8035727
  provincedum11 |   .0225626   .3519203     0.06   0.949    -.6671885    .7123137
  provincedum12 |   -.016237   .4525876    -0.04   0.971    -.9032924    .8708183
  provincedum13 |   .1116256   .4191289     0.27   0.790     -.709852    .9331031
  provincedum14 |  -.1230585   .3522459    -0.35   0.727    -.8134478    .5673308
  provincedum15 |  -.2678215   .3433936    -0.78   0.435    -.9408606    .4052176
          _cons |   7.577967   .4729149    16.02   0.000      6.65107    8.504863
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  2.24391  (p = 0.5234)
  Wu-Hausman F(3,1154)            =  .727326  (p = 0.5357)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  10.724  Chi-sq(31) P-value = 0.9997

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,189    8.124603    .6771347   5.298317   9.721166
      tenure |      1,189    6.067283    6.017554          0         28
   tenuresqr |      1,189    72.99243    118.1597          0        784
birthmont~m2 |      1,189    .0941968    .2922252          0          1
birthmonth~3 |      1,189    .0639193     .244712          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,189    .0656013    .2476881          0          1
birthmonth~5 |      1,189    .0841043    .2776609          0          1
birthmonth~6 |      1,189    .0908326    .2874919          0          1
birthmonth~7 |      1,189    .0731707    .2605261          0          1
birthmonth~8 |      1,189    .0891505    .2850808          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,189    .1084945    .3111348          0          1
birthmont~10 |      1,189    .1009251    .3013563          0          1
birthmont~11 |      1,189    .0841043    .2776609          0          1
birthmont~12 |      1,189    .0815812    .2738407          0          1
        male |      1,189    .6291001     .483249          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthly
> earning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(16, 731)    =   1.10
                                                        Prob > F      = 0.3543
                                                        R-squared     = 0.0234
                                                        Adj R-squared = 0.0021
                                                        Root MSE      = 0.2631

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0120251   .0048907     2.46   0.014     .0024236    .0216266
      tenuresqr |  -.0004028   .0002437    -1.65   0.099    -.0008812    .0000755
 birthmonthdum2 |  -.0268338   .0485269    -0.55   0.580    -.1221025    .0684349
 birthmonthdum3 |  -.0074812   .0534227    -0.14   0.889    -.1123614    .0973989
 birthmonthdum4 |   .0179546   .0521746     0.34   0.731    -.0844754    .1203846
 birthmonthdum5 |  -.0207926   .0497188    -0.42   0.676    -.1184013    .0768161
 birthmonthdum6 |  -.0341445    .049361    -0.69   0.489    -.1310507    .0627617
 birthmonthdum7 |  -.0655038   .0513896    -1.27   0.203    -.1663927     .035385
 birthmonthdum8 |   .0130503   .0497895     0.26   0.793    -.0846971    .1107978
 birthmonthdum9 |   -.008881   .0470035    -0.19   0.850     -.101159    .0833969
birthmonthdum10 |  -.0579177   .0486554    -1.19   0.234    -.1534387    .0376033
birthmonthdum11 |  -.0211754   .0494013    -0.43   0.668    -.1181608      .07581
birthmonthdum12 |   -.047036   .0505804    -0.93   0.353    -.1463361    .0522641
              t |  -.0011336   .0012783    -0.89   0.375    -.0036432    .0013759
              d |   .0207664   .0403131     0.52   0.607    -.0583768    .0999097
             td |   .0016158   .0018784     0.86   0.390    -.0020719    .0053036
          _cons |   .0268916   .0479778     0.56   0.575    -.0672991    .1210824
---------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(16, 731)    =   1.31
                                                        Prob > F      = 0.1861
                                                        R-squared     = 0.0278
                                                        Adj R-squared = 0.0065
                                                        Root MSE      = 0.2296

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0090426   .0042685     2.12   0.034     .0006626    .0174226
      tenuresqr |  -.0003299   .0002127    -1.55   0.121    -.0007474    .0000876
 birthmonthdum2 |  -.0261626   .0423534    -0.62   0.537    -.1093114    .0569861
 birthmonthdum3 |  -.0292143   .0466263    -0.63   0.531    -.1207518    .0623232
 birthmonthdum4 |  -.0003239   .0455371    -0.01   0.994     -.089723    .0890751
 birthmonthdum5 |  -.0189604   .0433937    -0.44   0.662    -.1041515    .0662307
 birthmonthdum6 |  -.0631966   .0430814    -1.47   0.143    -.1477746    .0213813
 birthmonthdum7 |  -.0979403   .0448519    -2.18   0.029    -.1859943   -.0098864
 birthmonthdum8 |  -.0170259   .0434554    -0.39   0.695    -.1023381    .0682863
 birthmonthdum9 |  -.0330203   .0410238    -0.80   0.421    -.1135588    .0475182
birthmonthdum10 |  -.1000508   .0424655    -2.36   0.019    -.1834198   -.0166818
birthmonthdum11 |  -.0356184   .0431166    -0.83   0.409    -.1202655    .0490286
birthmonthdum12 |  -.0459323   .0441456    -1.04   0.298    -.1325996     .040735
              t |  -.0010494   .0011157    -0.94   0.347    -.0032397    .0011409
              d |   .0190031   .0351845     0.54   0.589    -.0500717    .0880779
             td |   .0012305   .0016395     0.75   0.453    -.0019881    .0044491
          _cons |   .0438689   .0418742     1.05   0.295    -.0383391    .1260769
---------------------------------------------------------------------------------

                                                       Number of obs =     748
                                                       F(16, 731)    =    0.91
                                                       Prob > F      =  0.5560
                                                       R-squared     =  0.0196
                                                       Adj R-squared = -0.0019
                                                       Root MSE      =  0.3409

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0117917   .0063368     1.86   0.063    -.0006488    .0242323
      tenuresqr |  -.0005258   .0003157    -1.67   0.096    -.0011457     .000094
 birthmonthdum2 |  -.0007604   .0628756    -0.01   0.990    -.1241988    .1226779
 birthmonthdum3 |  -.0427419   .0692191    -0.62   0.537    -.1786338    .0931499
 birthmonthdum4 |   .0021868    .067602     0.03   0.974    -.1305305     .134904
 birthmonthdum5 |   .0039323     .06442     0.06   0.951     -.122538    .1304026
 birthmonthdum6 |  -.0330455   .0639564    -0.52   0.606    -.1586056    .0925146
 birthmonthdum7 |  -.0451539   .0665849    -0.68   0.498    -.1758743    .0855664
 birthmonthdum8 |  -.0131698   .0645116    -0.20   0.838    -.1398199    .1134803
 birthmonthdum9 |     .01268   .0609018     0.21   0.835    -.1068833    .1322434
birthmonthdum10 |  -.1119194   .0630422    -1.78   0.076    -.2356847    .0118459
birthmonthdum11 |    .034133   .0640086     0.53   0.594    -.0915297    .1597957
birthmonthdum12 |  -.0520839   .0655363    -0.79   0.427    -.1807457     .076578
              t |  -.0011327   .0016562    -0.68   0.494    -.0043843    .0021189
              d |  -.0160503   .0522331    -0.31   0.759    -.1185951    .0864946
             td |   .0015266   .0024339     0.63   0.531    -.0032516    .0063048
          _cons |   .1138386   .0621642     1.83   0.067    -.0082031    .2358803
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(16)   =       2.53
                                                  Prob > chi2     =     0.9999
                                                  R-squared       =          .
                                                  Root MSE        =     1.8171

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   12.13053   31.22222     0.39   0.698     -49.0639    73.32496
  secgenhighedu |  -15.00867   41.41549    -0.36   0.717    -96.18154    66.16419
      secgenedu |   1.604829   6.323368     0.25   0.800    -10.78874     13.9984
         tenure |  -.0231162   .1036209    -0.22   0.823    -.2262095    .1799771
      tenuresqr |   .0008044   .0036834     0.22   0.827     -.006415    .0080237
 birthmonthdum2 |   .0529305   .4705333     0.11   0.910    -.8692977    .9751587
 birthmonthdum3 |  -.2430914   .8952811    -0.27   0.786     -1.99781    1.511627
 birthmonthdum4 |  -.1400672   .6995406    -0.20   0.841    -1.511142    1.231007
 birthmonthdum5 |  -.0762727   .4166757    -0.18   0.855     -.892942    .7403967
 birthmonthdum6 |  -.2740618   1.517122    -0.18   0.857    -3.247566    2.699442
 birthmonthdum7 |  -.6611193   1.955411    -0.34   0.735    -4.493655    3.171417
 birthmonthdum8 |   -.324566   1.132966    -0.29   0.775    -2.545138    1.896006
 birthmonthdum9 |   -.552578   1.228269    -0.45   0.653    -2.959942    1.854786
birthmonthdum10 |  -.5665846   1.928597    -0.29   0.769    -4.346564    3.213395
birthmonthdum11 |  -.3455591   1.062734    -0.33   0.745     -2.42848    1.737362
birthmonthdum12 |   .0662694   .5430755     0.12   0.903    -.9981391    1.130678
          _cons |   8.373933    .805385    10.40   0.000     6.795407    9.952458
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  1.31567  (p = 0.7254)
  Wu-Hausman F(3,728)             =  .427583  (p = 0.7333)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.203  Chi-sq(16) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.300732    .6406061   5.298317   9.721166
      tenure |        748     6.51738    6.276193          0         28
   tenuresqr |        748    81.81417    126.4402          0        784
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0628342    .2428269          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748     .092246    .2895665          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748     .078877    .2697271          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `m
> onths'-1) & inrange(monthlyearning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =   1.56
                                                        Prob > F      = 0.0292
                                                        R-squared     = 0.0614
                                                        Adj R-squared = 0.0221
                                                        Root MSE      = 0.2604

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0103423   .0049559     2.09   0.037     .0006124    .0200722
      tenuresqr |  -.0003329   .0002453    -1.36   0.175    -.0008145    .0001488
 birthmonthdum2 |  -.0391509   .0488943    -0.80   0.424    -.1351439    .0568421
 birthmonthdum3 |  -.0146501   .0532856    -0.27   0.783    -.1192645    .0899644
 birthmonthdum4 |   .0003229   .0519968     0.01   0.995    -.1017613    .1024071
 birthmonthdum5 |  -.0288717   .0497019    -0.58   0.561    -.1264503    .0687068
 birthmonthdum6 |  -.0556697   .0496287    -1.12   0.262    -.1531047    .0417653
 birthmonthdum7 |  -.0590502   .0511942    -1.15   0.249    -.1595588    .0414583
 birthmonthdum8 |   .0049053   .0496984     0.10   0.921    -.0926665    .1024771
 birthmonthdum9 |  -.0238372   .0468731    -0.51   0.611    -.1158621    .0681876
birthmonthdum10 |  -.0620202   .0485313    -1.28   0.202    -.1573006    .0332602
birthmonthdum11 |  -.0385651   .0495297    -0.78   0.436    -.1358057    .0586755
birthmonthdum12 |  -.0559084    .050376    -1.11   0.267    -.1548104    .0429936
   provincedum2 |  -.2756759   .0822875    -3.35   0.001    -.4372292   -.1141226
   provincedum3 |  -.1909416   .0976738    -1.95   0.051    -.3827025    .0008193
   provincedum4 |  -.2635215   .0805607    -3.27   0.001    -.4216844   -.1053585
   provincedum5 |   -.142799   .0639306    -2.23   0.026    -.2683126   -.0172855
   provincedum6 |  -.1843325   .0662884    -2.78   0.006    -.3144752   -.0541899
   provincedum7 |  -.2263884   .0631291    -3.59   0.000    -.3503285   -.1024483
   provincedum8 |  -.2043268   .0620146    -3.29   0.001    -.3260787   -.0825748
   provincedum9 |  -.2492004   .0639693    -3.90   0.000      -.37479   -.1236108
  provincedum10 |  -.1344925   .0661633    -2.03   0.042    -.2643895   -.0045956
  provincedum11 |  -.1958669   .0653655    -3.00   0.003    -.3241976   -.0675363
  provincedum12 |  -.1766421   .0779645    -2.27   0.024    -.3297081   -.0235761
  provincedum13 |  -.2531467   .0681442    -3.71   0.000    -.3869327   -.1193608
  provincedum14 |  -.2240705     .06736    -3.33   0.001    -.3563169   -.0918241
  provincedum15 |  -.2111724   .0702686    -3.01   0.003    -.3491293   -.0732156
              t |  -.0013665   .0012765    -1.07   0.285    -.0038727    .0011397
              d |   .0258667   .0403377     0.64   0.522    -.0533275    .1050609
             td |    .001681   .0018821     0.89   0.372    -.0020141    .0053761
          _cons |   .2376402    .073671     3.23   0.001     .0930036    .3822768
---------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =   1.52
                                                        Prob > F      = 0.0380
                                                        R-squared     = 0.0598
                                                        Adj R-squared = 0.0205
                                                        Root MSE      = 0.2280

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0080086   .0043388     1.85   0.065    -.0005097    .0165268
      tenuresqr |  -.0002925   .0002148    -1.36   0.174    -.0007142    .0001291
 birthmonthdum2 |  -.0368146   .0428054    -0.86   0.390    -.1208535    .0472243
 birthmonthdum3 |  -.0377682   .0466499    -0.81   0.418     -.129355    .0538185
 birthmonthdum4 |  -.0158614   .0455216    -0.35   0.728     -.105233    .0735101
 birthmonthdum5 |  -.0272216   .0435124    -0.63   0.532    -.1126486    .0582054
 birthmonthdum6 |  -.0799281   .0434484    -1.84   0.066    -.1652293    .0053732
 birthmonthdum7 |  -.0955773    .044819    -2.13   0.033    -.1835694   -.0075852
 birthmonthdum8 |  -.0223918   .0435094    -0.51   0.607    -.1078129    .0630293
 birthmonthdum9 |  -.0459164   .0410359    -1.12   0.264    -.1264813    .0346484
birthmonthdum10 |  -.1065755   .0424876    -2.51   0.012    -.1899905   -.0231604
birthmonthdum11 |   -.052917   .0433617    -1.22   0.223    -.1380481    .0322141
birthmonthdum12 |  -.0526046   .0441026    -1.19   0.233    -.1391902    .0339811
   provincedum2 |  -.2296104   .0720402    -3.19   0.001    -.3710453   -.0881756
   provincedum3 |  -.1291911   .0855104    -1.51   0.131    -.2970718    .0386895
   provincedum4 |  -.2212558   .0705283    -3.14   0.002    -.3597225    -.082789
   provincedum5 |  -.1438632   .0559693    -2.57   0.010    -.2537464   -.0339799
   provincedum6 |  -.1324822   .0580335    -2.28   0.023     -.246418   -.0185464
   provincedum7 |  -.1906298   .0552676    -3.45   0.001    -.2991355   -.0821242
   provincedum8 |   -.177921   .0542919    -3.28   0.001    -.2845111    -.071331
   provincedum9 |  -.1979101   .0560031    -3.53   0.000    -.3078599   -.0879604
  provincedum10 |  -.1199366   .0579239    -2.07   0.039    -.2336573   -.0062158
  provincedum11 |  -.1766447   .0572255    -3.09   0.002    -.2889942   -.0642952
  provincedum12 |  -.1784544   .0682555    -2.61   0.009    -.3124589   -.0444499
  provincedum13 |  -.2224791   .0596581    -3.73   0.000    -.3396045   -.1053536
  provincedum14 |  -.1807969   .0589716    -3.07   0.002    -.2965745   -.0650193
  provincedum15 |  -.1650215    .061518    -2.68   0.007    -.2857984   -.0442446
              t |  -.0013669   .0011176    -1.22   0.222    -.0035609    .0008272
              d |   .0251882   .0353144     0.71   0.476    -.0441438    .0945203
             td |   .0014398   .0016477     0.87   0.383    -.0017952    .0046748
          _cons |   .2206997   .0644966     3.42   0.001     .0940749    .3473246
---------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =   1.53
                                                        Prob > F      = 0.0352
                                                        R-squared     = 0.0603
                                                        Adj R-squared = 0.0209
                                                        Root MSE      = 0.3370

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0098285   .0064125     1.53   0.126     -.002761    .0224179
      tenuresqr |  -.0004504   .0003174    -1.42   0.156    -.0010736    .0001728
 birthmonthdum2 |  -.0049891   .0632638    -0.08   0.937    -.1291936    .1192154
 birthmonthdum3 |  -.0531858   .0689457    -0.77   0.441    -.1885455    .0821739
 birthmonthdum4 |  -.0189903   .0672782    -0.28   0.778    -.1510761    .1130956
 birthmonthdum5 |  -.0034318   .0643088    -0.05   0.957    -.1296878    .1228242
 birthmonthdum6 |  -.0385096   .0642141    -0.60   0.549    -.1645798    .0875606
 birthmonthdum7 |  -.0501576   .0662397    -0.76   0.449    -.1802046    .0798895
 birthmonthdum8 |  -.0197083   .0643043    -0.31   0.759    -.1459556     .106539
 birthmonthdum9 |  -.0049143   .0606486    -0.08   0.935    -.1239844    .1141558
birthmonthdum10 |  -.1241572   .0627942    -1.98   0.048    -.2474397   -.0008748
birthmonthdum11 |   .0208594    .064086     0.33   0.745    -.1049593    .1466781
birthmonthdum12 |  -.0615583    .065181    -0.94   0.345    -.1895267    .0664101
   provincedum2 |   -.209247    .106471    -1.97   0.050    -.4182793   -.0002148
   provincedum3 |  -.1137997   .1263792    -0.90   0.368    -.3619173    .1343179
   provincedum4 |  -.3029064   .1042367    -2.91   0.004     -.507552   -.0982608
   provincedum5 |  -.1284809   .0827192    -1.55   0.121    -.2908818    .0339199
   provincedum6 |  -.1579579     .08577    -1.84   0.066    -.3263483    .0104324
   provincedum7 |  -.2330764   .0816822    -2.85   0.004    -.3934413   -.0727115
   provincedum8 |  -.1690688   .0802402    -2.11   0.035    -.3266025    -.011535
   provincedum9 |  -.1704607   .0827693    -2.06   0.040    -.3329599   -.0079616
  provincedum10 |  -.0124315   .0856081    -0.15   0.885     -.180504    .1556409
  provincedum11 |   -.208039   .0845758    -2.46   0.014    -.3740848   -.0419932
  provincedum12 |  -.2653472   .1008775    -2.63   0.009    -.4633979   -.0672965
  provincedum13 |  -.2359143   .0881711    -2.68   0.008    -.4090187   -.0628099
  provincedum14 |  -.2019595   .0871565    -2.32   0.021    -.3730719   -.0308471
  provincedum15 |  -.1680661   .0909199    -1.85   0.065    -.3465672    .0104349
              t |  -.0015656   .0016517    -0.95   0.344    -.0048083    .0016771
              d |  -.0014916   .0521926    -0.03   0.977    -.1039603     .100977
             td |   .0017695   .0024353     0.73   0.468    -.0030116    .0065506
          _cons |   .2914487   .0953222     3.06   0.002     .1043047    .4785926
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(30)   =       3.96
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =     2.4149

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   16.65899   49.92507     0.33   0.739    -81.19235    114.5103
  secgenhighedu |  -19.96023    61.5515    -0.32   0.746     -140.599    100.6785
      secgenedu |   3.099865   10.89408     0.28   0.776    -18.25213    24.45186
         tenure |    -.04887   .1406208    -0.35   0.728    -.3244817    .2267416
      tenuresqr |   .0015948   .0043836     0.36   0.716    -.0069968    .0101865
 birthmonthdum2 |    .049295   .6547406     0.08   0.940    -1.233973    1.332563
 birthmonthdum3 |  -.3168222   1.278024    -0.25   0.804    -2.821704     2.18806
 birthmonthdum4 |  -.2120646   .9697467    -0.22   0.827    -2.112733    1.688604
 birthmonthdum5 |  -.0939146   .5818855    -0.16   0.872    -1.234389     1.04656
 birthmonthdum6 |  -.3550409   1.988688    -0.18   0.858    -4.252798    3.542716
 birthmonthdum7 |  -.8419478   2.647884    -0.32   0.751    -6.031704    4.347809
 birthmonthdum8 |  -.4315014   1.559362    -0.28   0.782    -3.487795    2.624792
 birthmonthdum9 |  -.6690282   1.707298    -0.39   0.695    -4.015272    2.677215
birthmonthdum10 |  -.6951253   2.493829    -0.28   0.780    -5.582939    4.192689
birthmonthdum11 |  -.5401334   1.661508    -0.33   0.745    -3.796629    2.716362
birthmonthdum12 |   .1603976   .6788035     0.24   0.813    -1.170033    1.490828
   provincedum2 |   .3947335   2.712966     0.15   0.884    -4.922582    5.712049
   provincedum3 |   .8449217   3.101833     0.27   0.785    -5.234559    6.924403
   provincedum4 |   .5440879   3.214311     0.17   0.866    -5.755846    6.844021
   provincedum5 |  -.1558485   1.431612    -0.11   0.913    -2.961757     2.65006
   provincedum6 |    .894039   2.892843     0.31   0.757    -4.775829    6.563907
   provincedum7 |    .530687   2.499565     0.21   0.832    -4.368371    5.429745
   provincedum8 |   .1201288   1.872348     0.06   0.949    -3.549606    3.789864
   provincedum9 |   .7151515   2.656365     0.27   0.788    -4.491229    5.921532
  provincedum10 |   -.194628   1.480368    -0.13   0.895    -3.096095     2.70684
  provincedum11 |   .2164053   1.885964     0.11   0.909    -3.480016    3.912827
  provincedum12 |  -.2090943    1.78458    -0.12   0.907    -3.706808    3.288619
  provincedum13 |   .2327846   2.346084     0.10   0.921    -4.365455    4.831024
  provincedum14 |   .3683098   2.601589     0.14   0.887    -4.730712    5.467331
  provincedum15 |   .2328447   2.536802     0.09   0.927    -4.739196    5.204885
          _cons |   8.008692   2.470569     3.24   0.001     3.166467    12.85092
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  1.78599  (p = 0.6180)
  Wu-Hausman F(3,714)             =  .569628  (p = 0.6351)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.217  Chi-sq(30) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.300732    .6406061   5.298317   9.721166
      tenure |        748     6.51738    6.276193          0         28
   tenuresqr |        748    81.81417    126.4402          0        784
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0628342    .2428269          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748     .092246    .2895665          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748     .078877    .2697271          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthly
> earning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    441
                                                        F(16, 424)    =   3.64
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1209
                                                        Adj R-squared = 0.0877
                                                        Root MSE      = 0.2126

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0120971     .00549     2.20   0.028     .0013062     .022888
      tenuresqr |  -.0001918   .0002993    -0.64   0.522    -.0007801    .0003965
 birthmonthdum2 |  -.1133772   .0540877    -2.10   0.037    -.2196905   -.0070639
 birthmonthdum3 |  -.2194377   .0589818    -3.72   0.000    -.3353708   -.1035046
 birthmonthdum4 |  -.2262241   .0599203    -3.78   0.000     -.344002   -.1084463
 birthmonthdum5 |   -.166634   .0559259    -2.98   0.003    -.2765606   -.0567074
 birthmonthdum6 |  -.1408991   .0548778    -2.57   0.011    -.2487654   -.0330328
 birthmonthdum7 |  -.0898742    .057975    -1.55   0.122    -.2038283    .0240799
 birthmonthdum8 |  -.2275421   .0546619    -4.16   0.000    -.3349841      -.1201
 birthmonthdum9 |  -.1486218   .0542764    -2.74   0.006    -.2553062   -.0419374
birthmonthdum10 |  -.1683652   .0521835    -3.23   0.001    -.2709358   -.0657946
birthmonthdum11 |  -.1723717   .0558954    -3.08   0.002    -.2822383    -.062505
birthmonthdum12 |  -.2071853   .0549597    -3.77   0.000    -.3152127    -.099158
              t |   -.000273    .001482    -0.18   0.854     -.003186      .00264
              d |   -.062149   .0428228    -1.45   0.147    -.1463204    .0220224
             td |   .0043403   .0019593     2.22   0.027     .0004891    .0081915
          _cons |   .1494871   .0565447     2.64   0.009     .0383442      .26063
---------------------------------------------------------------------------------

                                                        Number of obs =    441
                                                        F(16, 424)    =   2.69
                                                        Prob > F      = 0.0004
                                                        R-squared     = 0.0922
                                                        Adj R-squared = 0.0579
                                                        Root MSE      = 0.1761

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0048664   .0045483     1.07   0.285    -.0040737    .0138065
      tenuresqr |  -.0000255    .000248    -0.10   0.918    -.0005129    .0004619
 birthmonthdum2 |   -.054215   .0448108    -1.21   0.227    -.1422939     .033864
 birthmonthdum3 |  -.1308686   .0488655    -2.68   0.008    -.2269174   -.0348198
 birthmonthdum4 |   -.135593    .049643    -2.73   0.007    -.2331701   -.0380159
 birthmonthdum5 |  -.1070309   .0463338    -2.31   0.021    -.1981034   -.0159584
 birthmonthdum6 |  -.0661226   .0454654    -1.45   0.147    -.1554882     .023243
 birthmonthdum7 |  -.0024978   .0480314    -0.05   0.959     -.096907    .0919114
 birthmonthdum8 |  -.1376431   .0452866    -3.04   0.003    -.2266572    -.048629
 birthmonthdum9 |  -.0850327   .0449672    -1.89   0.059    -.1734191    .0033537
birthmonthdum10 |  -.1228282   .0432332    -2.84   0.005    -.2078063   -.0378501
birthmonthdum11 |   -.118707   .0463085    -2.56   0.011    -.2097299   -.0276842
birthmonthdum12 |  -.1230132   .0455332    -2.70   0.007    -.2125122   -.0335142
              t |  -.0006742   .0012278    -0.55   0.583    -.0030876    .0017392
              d |  -.0365679    .035478    -1.03   0.303    -.1063026    .0331668
             td |   .0039753   .0016233     2.45   0.015     .0007847     .007166
          _cons |   .0838704   .0468464     1.79   0.074    -.0082098    .1759505
---------------------------------------------------------------------------------

                                                        Number of obs =    441
                                                        F(16, 424)    =   1.42
                                                        Prob > F      = 0.1267
                                                        R-squared     = 0.0510
                                                        Adj R-squared = 0.0151
                                                        Root MSE      = 0.3204

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0085791    .008274     1.04   0.300    -.0076841    .0248424
      tenuresqr |  -.0000907   .0004511    -0.20   0.841    -.0009773    .0007959
 birthmonthdum2 |  -.0179958   .0815168    -0.22   0.825    -.1782231    .1422315
 birthmonthdum3 |  -.0394995   .0888929    -0.44   0.657    -.2142251    .1352261
 birthmonthdum4 |   .0001716   .0903073     0.00   0.998    -.1773341    .1776774
 birthmonthdum5 |  -.0136989   .0842873    -0.16   0.871    -.1793719    .1519741
 birthmonthdum6 |   .0284838   .0827076     0.34   0.731    -.1340841    .1910517
 birthmonthdum7 |   .0874161   .0873754     1.00   0.318    -.0843268    .2591591
 birthmonthdum8 |  -.0793161   .0823823    -0.96   0.336    -.2412446    .0826123
 birthmonthdum9 |   .0321858   .0818013     0.39   0.694    -.1286008    .1929724
birthmonthdum10 |  -.0729428    .078647    -0.93   0.354    -.2275293    .0816437
birthmonthdum11 |  -.0705247   .0842414    -0.84   0.403    -.2361074     .095058
birthmonthdum12 |  -.0527746    .082831    -0.64   0.524    -.2155852     .110036
              t |  -.0012643   .0022336    -0.57   0.572    -.0056546     .003126
              d |  -.0861488   .0645393    -1.33   0.183    -.2130055     .040708
             td |   .0058778    .002953     1.99   0.047     .0000736    .0116821
          _cons |   .0879725   .0852199     1.03   0.303    -.0795335    .2554786
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        441
                                                  Wald chi2(16)   =       3.28
                                                  Prob > chi2     =     0.9997
                                                  R-squared       =          .
                                                  Root MSE        =     2.1128

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -14.16121   24.93587    -0.57   0.570    -63.03462     34.7122
  secgenhighedu |   12.75275   25.80067     0.49   0.621    -37.81563    63.32113
      secgenedu |   2.715321   6.242736     0.43   0.664    -9.520217    14.95086
         tenure |   .1687219   .1645496     1.03   0.305    -.1537894    .4912331
      tenuresqr |  -.0063024    .004908    -1.28   0.199    -.0159219    .0033171
 birthmonthdum2 |  -.7063818   1.538402    -0.46   0.646    -3.721595    2.308831
 birthmonthdum3 |  -1.296212    2.25313    -0.58   0.565    -5.712265    3.119841
 birthmonthdum4 |  -1.398696   2.501493    -0.56   0.576    -6.301532     3.50414
 birthmonthdum5 |  -.9203881   1.686596    -0.55   0.585    -4.226056     2.38528
 birthmonthdum6 |  -.9867995   2.108658    -0.47   0.640    -5.119694    3.146095
 birthmonthdum7 |  -1.363557   2.517447    -0.54   0.588    -6.297662    3.570548
 birthmonthdum8 |  -1.145274    2.11148    -0.54   0.588    -5.283698    2.993151
 birthmonthdum9 |  -.9946194   1.962058    -0.51   0.612    -4.840183    2.850944
birthmonthdum10 |  -.5234247   1.214541    -0.43   0.666    -2.903882    1.857032
birthmonthdum11 |  -.7024592   1.405005    -0.50   0.617    -3.456218      2.0513
birthmonthdum12 |  -1.371156   2.129616    -0.64   0.520    -5.545127    2.802814
          _cons |   8.224803   1.196037     6.88   0.000     5.880613    10.56899
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  4.57971  (p = 0.2053)
  Wu-Hausman F(3,421)             =  1.47263  (p = 0.2214)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.374  Chi-sq(16) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        441    7.825861    .6317342   5.298317   9.472705
      tenure |        441    5.303855    5.474171          0         25
   tenuresqr |        441    58.02948    100.9859          0        625
birthmont~m2 |        441    .0952381    .2938769          0          1
birthmonth~3 |        441    .0657596     .248143          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        441    .0612245    .2400139          0          1
birthmonth~5 |        441    .0839002     .277553          0          1
birthmonth~6 |        441    .0907029    .2875124          0          1
birthmonth~7 |        441    .0702948    .2559335          0          1
birthmonth~8 |        441    .0952381    .2938769          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        441    .0997732    .3000378          0          1
birthmont~10 |        441    .1156463    .3201635          0          1
birthmont~11 |        441    .0793651    .2706147          0          1
birthmont~12 |        441    .0861678    .2809304          0          1
        male |        441           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `m
> onths'-1) & inrange(monthlyearning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    441
                                                        F(30, 410)    =   2.85
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1725
                                                        Adj R-squared = 0.1119
                                                        Root MSE      = 0.2098

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0102091   .0055271     1.85   0.065    -.0006558    .0210741
      tenuresqr |  -.0001236   .0003001    -0.41   0.681    -.0007134    .0004663
 birthmonthdum2 |  -.1376349    .054747    -2.51   0.012    -.2452547   -.0300152
 birthmonthdum3 |  -.2388399    .059756    -4.00   0.000    -.3563063   -.1213735
 birthmonthdum4 |  -.2376352   .0604137    -3.93   0.000    -.3563944    -.118876
 birthmonthdum5 |  -.1769959   .0563483    -3.14   0.002    -.2877634   -.0662283
 birthmonthdum6 |  -.1617493   .0559101    -2.89   0.004    -.2716555   -.0518432
 birthmonthdum7 |  -.1065083   .0581272    -1.83   0.068    -.2207727    .0077562
 birthmonthdum8 |  -.2382514   .0564446    -4.22   0.000    -.3492085   -.1272944
 birthmonthdum9 |  -.1653919    .055813    -2.96   0.003    -.2751072   -.0556767
birthmonthdum10 |  -.1882217   .0533169    -3.53   0.000    -.2930302   -.0834131
birthmonthdum11 |  -.1827372   .0560931    -3.26   0.001     -.293003   -.0724713
birthmonthdum12 |  -.2296491    .056083    -4.09   0.000    -.3398953   -.1194029
   provincedum2 |  -.1840297   .0876349    -2.10   0.036    -.3562995   -.0117599
   provincedum3 |  -.2134446   .1117379    -1.91   0.057    -.4330953    .0062061
   provincedum4 |  -.1790654    .093845    -1.91   0.057    -.3635428    .0054119
   provincedum5 |   -.072098   .0750056    -0.96   0.337    -.2195416    .0753456
   provincedum6 |  -.1124591   .0793453    -1.42   0.157    -.2684334    .0435152
   provincedum7 |  -.1787618   .0759662    -2.35   0.019    -.3280936     -.02943
   provincedum8 |  -.1628256   .0734336    -2.22   0.027    -.3071791   -.0184722
   provincedum9 |  -.1330286   .0774985    -1.72   0.087    -.2853727    .0193155
  provincedum10 |  -.0332043   .0773342    -0.43   0.668    -.1852252    .1188166
  provincedum11 |  -.1494991   .0780354    -1.92   0.056    -.3028984    .0039002
  provincedum12 |  -.1600192   .0882597    -1.81   0.071    -.3335173    .0134788
  provincedum13 |  -.1755776   .0793296    -2.21   0.027    -.3315211    -.019634
  provincedum14 |  -.1158439   .0792125    -1.46   0.144    -.2715572    .0398695
  provincedum15 |  -.0619036   .0885697    -0.70   0.485    -.2360109    .1122038
              t |  -.0005415   .0015014    -0.36   0.719    -.0034928    .0024099
              d |  -.0567476   .0436799    -1.30   0.195     -.142612    .0291169
             td |   .0047334   .0019525     2.42   0.016     .0008953    .0085715
          _cons |   .2928445    .085694     3.42   0.001       .12439    .4612989
---------------------------------------------------------------------------------

                                                        Number of obs =    441
                                                        F(30, 410)    =   2.14
                                                        Prob > F      = 0.0006
                                                        R-squared     = 0.1352
                                                        Adj R-squared = 0.0719
                                                        Root MSE      = 0.1748

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0031144   .0046064     0.68   0.499    -.0059407    .0121696
      tenuresqr |   .0000408   .0002501     0.16   0.871    -.0004508    .0005324
 birthmonthdum2 |  -.0771767   .0456277    -1.69   0.092    -.1668702    .0125167
 birthmonthdum3 |  -.1520626   .0498024    -3.05   0.002    -.2499625   -.0541626
 birthmonthdum4 |  -.1454595   .0503505    -2.89   0.004    -.2444369   -.0464821
 birthmonthdum5 |  -.1167808   .0469623    -2.49   0.013    -.2090977   -.0244639
 birthmonthdum6 |  -.0848457   .0465971    -1.82   0.069    -.1764447    .0067533
 birthmonthdum7 |  -.0164941   .0484449    -0.34   0.734    -.1117254    .0787373
 birthmonthdum8 |   -.150724   .0470426    -3.20   0.001    -.2431989   -.0582492
 birthmonthdum9 |  -.1015188   .0465162    -2.18   0.030    -.1929588   -.0100789
birthmonthdum10 |   -.139573   .0444358    -3.14   0.002    -.2269235   -.0522224
birthmonthdum11 |  -.1303486   .0467496    -2.79   0.006    -.2222474   -.0384498
birthmonthdum12 |  -.1418217   .0467413    -3.03   0.003    -.2337041   -.0499393
   provincedum2 |  -.1853388   .0730375    -2.54   0.012    -.3289135   -.0417641
   provincedum3 |  -.2103474   .0931257    -2.26   0.024    -.3934107    -.027284
   provincedum4 |  -.1811765   .0782132    -2.32   0.021    -.3349254   -.0274277
   provincedum5 |  -.1150226   .0625119    -1.84   0.066    -.2379064    .0078613
   provincedum6 |  -.1484493   .0661287    -2.24   0.025    -.2784428   -.0184557
   provincedum7 |  -.1856109   .0633124    -2.93   0.004    -.3100684   -.0611534
   provincedum8 |  -.1864733   .0612018    -3.05   0.002    -.3067817   -.0661649
   provincedum9 |  -.1459068   .0645896    -2.26   0.024    -.2728749   -.0189388
  provincedum10 |  -.0946353   .0644526    -1.47   0.143     -.221334    .0320634
  provincedum11 |  -.1540007    .065037    -2.37   0.018    -.2818482   -.0261532
  provincedum12 |   -.177168   .0735582    -2.41   0.016    -.3217664   -.0325696
  provincedum13 |  -.1859969   .0661157    -2.81   0.005    -.3159649   -.0560289
  provincedum14 |    -.15479   .0660181    -2.34   0.020    -.2845661   -.0250139
  provincedum15 |  -.1323862   .0738166    -1.79   0.074    -.2774924      .01272
              t |  -.0011375   .0012513    -0.91   0.364    -.0035973    .0013222
              d |  -.0246845   .0364041    -0.68   0.498    -.0962464    .0468775
             td |   .0044336   .0016272     2.72   0.007     .0012348    .0076324
          _cons |   .2468637   .0714199     3.46   0.001     .1064687    .3872586
---------------------------------------------------------------------------------

                                                        Number of obs =    441
                                                        F(30, 410)    =   1.54
                                                        Prob > F      = 0.0370
                                                        R-squared     = 0.1012
                                                        Adj R-squared = 0.0354
                                                        Root MSE      = 0.3171

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0055524   .0083556     0.66   0.507    -.0108727    .0219775
      tenuresqr |   .0000562   .0004536     0.12   0.901    -.0008355    .0009479
 birthmonthdum2 |  -.0317046   .0827638    -0.38   0.702    -.1943989    .1309897
 birthmonthdum3 |  -.0529803   .0903362    -0.59   0.558    -.2305602    .1245997
 birthmonthdum4 |  -.0073554   .0913304    -0.08   0.936    -.1868897    .1721789
 birthmonthdum5 |  -.0084085   .0851845    -0.10   0.921    -.1758614    .1590445
 birthmonthdum6 |   .0146324   .0845221     0.17   0.863    -.1515183    .1807831
 birthmonthdum7 |   .0857615   .0878738     0.98   0.330    -.0869779     .258501
 birthmonthdum8 |  -.0924348   .0853303    -1.08   0.279    -.2601742    .0753046
 birthmonthdum9 |   .0145234   .0843753     0.17   0.863    -.1513388    .1803856
birthmonthdum10 |  -.0910737   .0806018    -1.13   0.259    -.2495181    .0673707
birthmonthdum11 |  -.0650388   .0847988    -0.77   0.444    -.2317334    .1016558
birthmonthdum12 |  -.0687369   .0847836    -0.81   0.418    -.2354017    .0979279
   provincedum2 |  -.1469645   .1324822    -1.11   0.268    -.4073936    .1134645
   provincedum3 |  -.1061724   .1689199    -0.63   0.530    -.4382296    .2258847
   provincedum4 |  -.2440226   .1418703    -1.72   0.086    -.5229065    .0348612
   provincedum5 |   -.131822   .1133899    -1.16   0.246      -.35472     .091076
   provincedum6 |  -.1745389   .1199503    -1.46   0.146    -.4103332    .0612555
   provincedum7 |  -.2349616    .114842    -2.05   0.041    -.4607141   -.0092091
   provincedum8 |  -.1930113   .1110134    -1.74   0.083    -.4112377    .0252151
   provincedum9 |  -.1068245   .1171585    -0.91   0.362    -.3371308    .1234818
  provincedum10 |   .0040931     .11691     0.04   0.972    -.2257247    .2339109
  provincedum11 |  -.1453683   .1179701    -1.23   0.219      -.37727    .0865333
  provincedum12 |  -.2503309   .1334267    -1.88   0.061    -.5126167     .011955
  provincedum13 |    -.24242   .1199267    -2.02   0.044    -.4781679   -.0066721
  provincedum14 |  -.2095479   .1197496    -1.75   0.081    -.4449478    .0258519
  provincedum15 |    -.07537   .1338953    -0.56   0.574    -.3385769    .1878369
              t |  -.0020258   .0022697    -0.89   0.373    -.0064875    .0024359
              d |  -.0675689   .0660331    -1.02   0.307    -.1973745    .0622367
             td |   .0066931   .0029516     2.27   0.024     .0008909    .0124953
          _cons |    .245009    .129548     1.89   0.059    -.0096522    .4996702
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        441
                                                  Wald chi2(30)   =       8.09
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =      1.726

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -11.21489   13.55776    -0.83   0.408    -37.78761    15.35783
  secgenhighedu |   9.991491   14.51972     0.69   0.491    -18.46663    38.44961
      secgenedu |   2.400376   4.775107     0.50   0.615    -6.958661    11.75941
         tenure |   .1447726   .0999991     1.45   0.148     -.051222    .3407672
      tenuresqr |  -.0057522   .0034101    -1.69   0.092    -.0124359    .0009315
 birthmonthdum2 |   -.647731   .9721803    -0.67   0.505    -2.553169    1.257707
 birthmonthdum3 |  -1.116373   1.404797    -0.79   0.427    -3.869726    1.636979
 birthmonthdum4 |  -1.179491   1.591415    -0.74   0.459    -4.298608    1.939625
 birthmonthdum5 |  -.8347754   1.167681    -0.71   0.475    -3.123389    1.453838
 birthmonthdum6 |  -.8471783   1.311083    -0.65   0.518    -3.416853    1.722497
 birthmonthdum7 |  -1.187875   1.479907    -0.80   0.422    -4.088439    1.712689
 birthmonthdum8 |  -.9212508   1.262493    -0.73   0.466    -3.395691     1.55319
 birthmonthdum9 |  -.8636466   1.260526    -0.69   0.493    -3.334231    1.606938
birthmonthdum10 |  -.4532186   .8964387    -0.51   0.613    -2.210206    1.303769
birthmonthdum11 |  -.6336746   1.004538    -0.63   0.528    -2.602533    1.335184
birthmonthdum12 |  -1.238563   1.367496    -0.91   0.365    -3.918807     1.44168
   provincedum2 |  -.5213479   .9564882    -0.55   0.586     -2.39603    1.353335
   provincedum3 |  -.9655866   1.300673    -0.74   0.458    -3.514858    1.583685
   provincedum4 |  -.2767922   1.014619    -0.27   0.785    -2.265409    1.711825
   provincedum5 |   .2434423   .9641503     0.25   0.801    -1.646257    2.133142
   provincedum6 |   .2588905   1.023176     0.25   0.800    -1.746498    2.264279
   provincedum7 |  -.2276115     .89943    -0.25   0.800    -1.990462    1.535239
   provincedum8 |  -.1288533   .9704345    -0.13   0.894     -2.03087    1.773163
   provincedum9 |  -.1714311    .842222    -0.20   0.839    -1.822156    1.479294
  provincedum10 |   .1702406   1.081408     0.16   0.875    -1.949279    2.289761
  provincedum11 |  -.3628262   .7944862    -0.46   0.648     -1.91999    1.194338
  provincedum12 |  -.0547071     1.0437    -0.05   0.958    -2.100321    1.990907
  provincedum13 |   .0499244   .9474789     0.05   0.958      -1.8071    1.906949
  provincedum14 |   .0757749   1.088221     0.07   0.944    -2.057098    2.208648
  provincedum15 |    .072188   1.284616     0.06   0.955    -2.445613    2.589989
          _cons |   8.233947   1.101451     7.48   0.000     6.075142    10.39275
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  6.15965  (p = 0.1041)
  Wu-Hausman F(3,407)             =  1.92176  (p = 0.1254)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.905  Chi-sq(30) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        441    7.825861    .6317342   5.298317   9.472705
      tenure |        441    5.303855    5.474171          0         25
   tenuresqr |        441    58.02948    100.9859          0        625
birthmont~m2 |        441    .0952381    .2938769          0          1
birthmonth~3 |        441    .0657596     .248143          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        441    .0612245    .2400139          0          1
birthmonth~5 |        441    .0839002     .277553          0          1
birthmonth~6 |        441    .0907029    .2875124          0          1
birthmonth~7 |        441    .0702948    .2559335          0          1
birthmonth~8 |        441    .0952381    .2938769          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        441    .0997732    .3000378          0          1
birthmont~10 |        441    .1156463    .3201635          0          1
birthmont~11 |        441    .0793651    .2706147          0          1
birthmont~12 |        441    .0861678    .2809304          0          1
        male |        441           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearni
> ng, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,189
                                                        F(17, 1171)   =   2.43
                                                        Prob > F      = 0.0010
                                                        R-squared     = 0.0341
                                                        Adj R-squared = 0.0201
                                                        Root MSE      = 0.2466

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .012347   .0036748     3.36   0.001     .0051372    .0195569
      tenuresqr |  -.0003625   .0001878    -1.93   0.054    -.0007311    5.98e-06
 birthmonthdum2 |  -.0519136   .0367712    -1.41   0.158    -.1240583    .0202311
 birthmonthdum3 |  -.0792986   .0402342    -1.97   0.049    -.1582378   -.0003594
 birthmonthdum4 |  -.0603157   .0399046    -1.51   0.131    -.1386082    .0179768
 birthmonthdum5 |  -.0661439    .037753    -1.75   0.080     -.140215    .0079272
 birthmonthdum6 |  -.0696383   .0373013    -1.87   0.062    -.1428231    .0035465
 birthmonthdum7 |  -.0698195   .0391012    -1.79   0.074    -.1465357    .0068967
 birthmonthdum8 |  -.0700634   .0374932    -1.87   0.062    -.1436248    .0034979
 birthmonthdum9 |  -.0520916   .0360381    -1.45   0.149    -.1227981    .0186149
birthmonthdum10 |  -.0908467   .0362303    -2.51   0.012    -.1619303   -.0197631
birthmonthdum11 |  -.0722882   .0375862    -1.92   0.055     -.146032    .0014555
birthmonthdum12 |  -.1007841   .0379606    -2.65   0.008    -.1752624   -.0263057
           male |   .0151591   .0149266     1.02   0.310    -.0141268     .044445
              t |  -.0010452   .0009739    -1.07   0.283    -.0029559    .0008655
              d |  -.0048036   .0297559    -0.16   0.872    -.0631844    .0535773
             td |   .0028737    .001381     2.08   0.038     .0001641    .0055833
          _cons |   .0507626   .0382986     1.33   0.185    -.0243789    .1259041
---------------------------------------------------------------------------------

                                                        Number of obs =  1,189
                                                        F(17, 1171)   =   1.94
                                                        Prob > F      = 0.0121
                                                        R-squared     = 0.0274
                                                        Adj R-squared = 0.0133
                                                        Root MSE      = 0.2123

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0076898   .0031631     2.43   0.015     .0014838    .0138957
      tenuresqr |  -.0002443   .0001617    -1.51   0.131    -.0005615    .0000729
 birthmonthdum2 |  -.0333145   .0316508    -1.05   0.293    -.0954131    .0287841
 birthmonthdum3 |  -.0653433   .0346316    -1.89   0.059    -.1332903    .0026036
 birthmonthdum4 |  -.0439871   .0343479    -1.28   0.201    -.1113774    .0234032
 birthmonthdum5 |  -.0472516   .0324959    -1.45   0.146    -.1110084    .0165051
 birthmonthdum6 |  -.0627386   .0321071    -1.95   0.051    -.1257325    .0002553
 birthmonthdum7 |  -.0618931   .0336564    -1.84   0.066    -.1279266    .0041404
 birthmonthdum8 |  -.0593084   .0322723    -1.84   0.066    -.1226263    .0040096
 birthmonthdum9 |  -.0482395   .0310198    -1.56   0.120    -.1091002    .0126211
birthmonthdum10 |  -.1047983   .0311853    -3.36   0.001    -.1659835    -.043613
birthmonthdum11 |  -.0652326   .0323523    -2.02   0.044    -.1287075   -.0017576
birthmonthdum12 |  -.0725722   .0326746    -2.22   0.027    -.1366794   -.0084649
           male |    .017069   .0128481     1.33   0.184    -.0081389    .0422768
              t |   -.001093   .0008382    -1.30   0.193    -.0027376    .0005517
              d |   .0024061   .0256124     0.09   0.925    -.0478453    .0526574
             td |   .0024338   .0011887     2.05   0.041     .0001015     .004766
          _cons |   .0418355   .0329655     1.27   0.205    -.0228427    .1065136
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,189
                                                  Wald chi2(16)   =      85.20
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .93523

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -3.657127   10.77389    -0.34   0.734    -24.77356    17.45931
  secgenhighedu |   5.926996   13.14452     0.45   0.652    -19.83579    31.68978
         tenure |   .0295041   .0393819     0.75   0.454     -.047683    .1066912
      tenuresqr |  -.0010773   .0011459    -0.94   0.347    -.0033233    .0011687
 birthmonthdum2 |   .1373931   .1969859     0.70   0.486    -.2486921    .5234783
 birthmonthdum3 |   .1439896   .2002394     0.72   0.472    -.2484724    .5364516
 birthmonthdum4 |   .1155698   .1869217     0.62   0.536    -.2507901    .4819297
 birthmonthdum5 |    .018233   .1911087     0.10   0.924    -.3563331     .392799
 birthmonthdum6 |   .3400789   .2095448     1.62   0.105    -.0706214    .7507792
 birthmonthdum7 |   .1201047   .2069618     0.58   0.562    -.2855329    .5257424
 birthmonthdum8 |   .1722333    .187007     0.92   0.357    -.1942937    .5387602
 birthmonthdum9 |   .0372195   .1853543     0.20   0.841    -.3260683    .4005073
birthmonthdum10 |   .3498986    .458587     0.76   0.445    -.5489154    1.248713
birthmonthdum11 |   .1435218   .2065883     0.69   0.487    -.2613838    .5484274
birthmonthdum12 |   .0667717   .2545545     0.26   0.793     -.432146    .5656893
           male |   .4245141   .0885285     4.80   0.000     .2510013    .5980268
          _cons |   7.572854   .1890741    40.05   0.000     7.202276    7.943433
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.36365  (p = 0.5057)
  Wu-Hausman F(2,1170)            =    .6717  (p = 0.5110)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =   .04666  (p = 0.8290)
  Basmann chi2(1)        =  .045956  (p = 0.8303)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   3.151  Chi-sq(17) P-value = 0.9999

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,189    8.124603    .6771347   5.298317   9.721166
      tenure |      1,189    6.067283    6.017554          0         28
   tenuresqr |      1,189    72.99243    118.1597          0        784
birthmont~m2 |      1,189    .0941968    .2922252          0          1
birthmonth~3 |      1,189    .0639193     .244712          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,189    .0656013    .2476881          0          1
birthmonth~5 |      1,189    .0841043    .2776609          0          1
birthmonth~6 |      1,189    .0908326    .2874919          0          1
birthmonth~7 |      1,189    .0731707    .2605261          0          1
birthmonth~8 |      1,189    .0891505    .2850808          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,189    .1084945    .3111348          0          1
birthmont~10 |      1,189    .1009251    .3013563          0          1
birthmont~11 |      1,189    .0841043    .2776609          0          1
birthmont~12 |      1,189    .0815812    .2738407          0          1
        male |      1,189    .6291001     .483249          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months
> '-1) & inrange(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,189
                                                        F(31, 1157)   =   2.98
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0740
                                                        Adj R-squared = 0.0492
                                                        Root MSE      = 0.2430

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0107092   .0036891     2.90   0.004     .0034711    .0179473
      tenuresqr |  -.0002894   .0001873    -1.55   0.123     -.000657    .0000781
 birthmonthdum2 |  -.0677581   .0366299    -1.85   0.065    -.1396265    .0041102
 birthmonthdum3 |  -.0897308   .0398912    -2.25   0.025    -.1679979   -.0114637
 birthmonthdum4 |  -.0733228   .0395134    -1.86   0.064    -.1508488    .0042031
 birthmonthdum5 |  -.0733684    .037397    -1.96   0.050    -.1467419    5.08e-06
 birthmonthdum6 |  -.0858027   .0372286    -2.30   0.021    -.1588459   -.0127595
 birthmonthdum7 |  -.0718736   .0386872    -1.86   0.063    -.1477786    .0040314
 birthmonthdum8 |  -.0698399   .0372799    -1.87   0.061    -.1429836    .0033039
 birthmonthdum9 |  -.0627556   .0358016    -1.75   0.080     -.132999    .0074878
birthmonthdum10 |  -.0976273   .0360265    -2.71   0.007    -.1683119   -.0269427
birthmonthdum11 |  -.0841713    .037291    -2.26   0.024    -.1573369   -.0110058
birthmonthdum12 |  -.1120704   .0376771    -2.97   0.003    -.1859934   -.0381474
           male |   .0155364   .0147443     1.05   0.292    -.0133922     .044465
   provincedum2 |  -.2498546   .0601894    -4.15   0.000    -.3679473    -.131762
   provincedum3 |  -.1945647   .0737234    -2.64   0.008    -.3392113   -.0499182
   provincedum4 |  -.2380757   .0613645    -3.88   0.000    -.3584738   -.1176777
   provincedum5 |  -.1245393   .0486739    -2.56   0.011    -.2200383   -.0290403
   provincedum6 |  -.1655078   .0507419    -3.26   0.001    -.2650642   -.0659514
   provincedum7 |  -.2184843    .048568    -4.50   0.000    -.3137755   -.1231931
   provincedum8 |  -.1932669   .0472671    -4.09   0.000    -.2860057   -.1005282
   provincedum9 |  -.2262274   .0491474    -4.60   0.000    -.3226553   -.1297994
  provincedum10 |  -.1073571   .0502235    -2.14   0.033    -.2058965   -.0088178
  provincedum11 |  -.1934483   .0498328    -3.88   0.000    -.2912211   -.0956754
  provincedum12 |  -.1830984   .0585393    -3.13   0.002    -.2979535   -.0682433
  provincedum13 |  -.2392246   .0516719    -4.63   0.000    -.3406057   -.1378436
  provincedum14 |  -.1917969   .0510572    -3.76   0.000    -.2919719   -.0916219
  provincedum15 |  -.1734007   .0547306    -3.17   0.002    -.2807831   -.0660184
              t |  -.0013054   .0009656    -1.35   0.177       -.0032    .0005892
              d |   .0047707   .0295393     0.16   0.872    -.0531858    .0627272
             td |   .0029798   .0013683     2.18   0.030     .0002952    .0056644
          _cons |   .2405826   .0569933     4.22   0.000     .1287609    .3524043
---------------------------------------------------------------------------------

                                                        Number of obs =  1,189
                                                        F(31, 1157)   =   2.45
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0616
                                                        Adj R-squared = 0.0365
                                                        Root MSE      = 0.2098

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .006461   .0031855     2.03   0.043      .000211    .0127111
      tenuresqr |  -.0001936   .0001618    -1.20   0.232     -.000511    .0001237
 birthmonthdum2 |  -.0455428   .0316296    -1.44   0.150    -.1076005     .016515
 birthmonthdum3 |  -.0749619   .0344457    -2.18   0.030    -.1425449   -.0073789
 birthmonthdum4 |  -.0539256   .0341195    -1.58   0.114    -.1208686    .0130174
 birthmonthdum5 |  -.0539456    .032292    -1.67   0.095     -.117303    .0094118
 birthmonthdum6 |  -.0760724   .0321466    -2.37   0.018    -.1391446   -.0130002
 birthmonthdum7 |  -.0638204   .0334061    -1.91   0.056    -.1293637    .0017229
 birthmonthdum8 |  -.0590439   .0321909    -1.83   0.067    -.1222029    .0041151
 birthmonthdum9 |  -.0569691   .0309144    -1.84   0.066    -.1176237    .0036855
birthmonthdum10 |  -.1114153   .0311086    -3.58   0.000    -.1724508   -.0503798
birthmonthdum11 |  -.0770728   .0322005    -2.39   0.017    -.1402506    -.013895
birthmonthdum12 |   -.080117   .0325338    -2.46   0.014    -.1439489   -.0162851
           male |   .0166857   .0127316     1.31   0.190    -.0082939    .0416653
   provincedum2 |  -.2158162   .0519731    -4.15   0.000    -.3177882   -.1138442
   provincedum3 |  -.1525801   .0636595    -2.40   0.017    -.2774811    -.027679
   provincedum4 |  -.2109811   .0529877    -3.98   0.000    -.3149438   -.1070184
   provincedum5 |  -.1366282   .0420295    -3.25   0.001    -.2190908   -.0541656
   provincedum6 |  -.1428143   .0438152    -3.26   0.001    -.2287804   -.0568482
   provincedum7 |  -.1945571    .041938    -4.64   0.000    -.2768402    -.112274
   provincedum8 |  -.1830419   .0408147    -4.48   0.000     -.263121   -.1029628
   provincedum9 |  -.1933226   .0424383    -4.56   0.000    -.2765873   -.1100579
  provincedum10 |  -.1178091   .0433676    -2.72   0.007     -.202897   -.0327213
  provincedum11 |  -.1766563   .0430302    -4.11   0.000    -.2610823   -.0922302
  provincedum12 |  -.1869665   .0505482    -3.70   0.000    -.2861429   -.0877901
  provincedum13 |  -.2184417   .0446182    -4.90   0.000    -.3059834      -.1309
  provincedum14 |  -.1749885   .0440874    -3.97   0.000    -.2614887   -.0884882
  provincedum15 |  -.1619586   .0472594    -3.43   0.001    -.2546824   -.0692349
              t |  -.0013976   .0008338    -1.68   0.094    -.0030336    .0002383
              d |    .011654   .0255069     0.46   0.648     -.038391     .061699
             td |   .0026185   .0011815     2.22   0.027     .0003004    .0049366
          _cons |   .2159895   .0492132     4.39   0.000     .1194324    .3125466
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,189
                                                  Wald chi2(30)   =     124.75
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      .8673

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -3.079944   8.418177    -0.37   0.714    -19.57927    13.41938
  secgenhighedu |   5.155022    9.74883     0.53   0.597    -13.95233    24.26238
         tenure |   .0204208   .0331891     0.62   0.538    -.0446287    .0854703
      tenuresqr |  -.0007201   .0009557    -0.75   0.451    -.0025931     .001153
 birthmonthdum2 |   .1227488   .2013183     0.61   0.542    -.2718279    .5173255
 birthmonthdum3 |   .1218956   .1942479     0.63   0.530    -.2588232    .5026144
 birthmonthdum4 |    .082508   .1918668     0.43   0.667    -.2935441      .45856
 birthmonthdum5 |   .0125144   .1855452     0.07   0.946    -.3511476    .3761764
 birthmonthdum6 |    .315678    .193836     1.63   0.103    -.0642335    .6955896
 birthmonthdum7 |   .0947808   .1809669     0.52   0.600    -.2599079    .4494695
 birthmonthdum8 |   .1340513   .1680289     0.80   0.425    -.1952793     .463382
 birthmonthdum9 |   .0008448   .1666798     0.01   0.996    -.3258416    .3275313
birthmonthdum10 |   .3008694   .3395187     0.89   0.376    -.3645751    .9663139
birthmonthdum11 |    .119035   .1919988     0.62   0.535    -.2572758    .4953458
birthmonthdum12 |   .0348997   .2650213     0.13   0.895    -.4845325    .5543319
           male |   .4333292   .0669811     6.47   0.000     .3020487    .5646096
   provincedum2 |  -.0253863   .4354262    -0.06   0.954    -.8788059    .8280333
   provincedum3 |  -.1768174   .4203941    -0.42   0.674    -1.000775    .6471398
   provincedum4 |   -.111054   .4329561    -0.26   0.798    -.9596325    .7375244
   provincedum5 |   .1559125   .3820892     0.41   0.683    -.5929687    .9047936
   provincedum6 |   .0982056   .3095941     0.32   0.751    -.5085876    .7049989
   provincedum7 |    .012995   .3768041     0.03   0.972    -.7255275    .7515174
   provincedum8 |  -.0120159    .379331    -0.03   0.975     -.755491    .7314592
   provincedum9 |   .1576736   .3825694     0.41   0.680    -.5921486    .9074959
  provincedum10 |   .1093844   .3470318     0.32   0.753    -.5707855    .7895543
  provincedum11 |   .0175049   .3579912     0.05   0.961    -.6841449    .7191547
  provincedum12 |  -.0476946   .4510883    -0.11   0.916    -.9318115    .8364223
  provincedum13 |   .1008519   .4255204     0.24   0.813    -.7331528    .9348565
  provincedum14 |  -.1361355   .3565012    -0.38   0.703    -.8348649     .562594
  provincedum15 |  -.2586477     .34855    -0.74   0.458    -.9417932    .4244977
          _cons |   7.594995   .4787989    15.86   0.000     6.656566    8.533423
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.99766  (p = 0.3683)
  Wu-Hausman F(2,1156)            =  .972742  (p = 0.3784)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .111669  (p = 0.7383)
  Basmann chi2(1)        =  .108674  (p = 0.7417)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.415  Chi-sq(31) P-value = 0.9999

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,189    8.124603    .6771347   5.298317   9.721166
      tenure |      1,189    6.067283    6.017554          0         28
   tenuresqr |      1,189    72.99243    118.1597          0        784
birthmont~m2 |      1,189    .0941968    .2922252          0          1
birthmonth~3 |      1,189    .0639193     .244712          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,189    .0656013    .2476881          0          1
birthmonth~5 |      1,189    .0841043    .2776609          0          1
birthmonth~6 |      1,189    .0908326    .2874919          0          1
birthmonth~7 |      1,189    .0731707    .2605261          0          1
birthmonth~8 |      1,189    .0891505    .2850808          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,189    .1084945    .3111348          0          1
birthmont~10 |      1,189    .1009251    .3013563          0          1
birthmont~11 |      1,189    .0841043    .2776609          0          1
birthmont~12 |      1,189    .0815812    .2738407          0          1
        male |      1,189    .6291001     .483249          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 2
> 00, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(16, 731)    =   1.10
                                                        Prob > F      = 0.3543
                                                        R-squared     = 0.0234
                                                        Adj R-squared = 0.0021
                                                        Root MSE      = 0.2631

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0120251   .0048907     2.46   0.014     .0024236    .0216266
      tenuresqr |  -.0004028   .0002437    -1.65   0.099    -.0008812    .0000755
 birthmonthdum2 |  -.0268338   .0485269    -0.55   0.580    -.1221025    .0684349
 birthmonthdum3 |  -.0074812   .0534227    -0.14   0.889    -.1123614    .0973989
 birthmonthdum4 |   .0179546   .0521746     0.34   0.731    -.0844754    .1203846
 birthmonthdum5 |  -.0207926   .0497188    -0.42   0.676    -.1184013    .0768161
 birthmonthdum6 |  -.0341445    .049361    -0.69   0.489    -.1310507    .0627617
 birthmonthdum7 |  -.0655038   .0513896    -1.27   0.203    -.1663927     .035385
 birthmonthdum8 |   .0130503   .0497895     0.26   0.793    -.0846971    .1107978
 birthmonthdum9 |   -.008881   .0470035    -0.19   0.850     -.101159    .0833969
birthmonthdum10 |  -.0579177   .0486554    -1.19   0.234    -.1534387    .0376033
birthmonthdum11 |  -.0211754   .0494013    -0.43   0.668    -.1181608      .07581
birthmonthdum12 |   -.047036   .0505804    -0.93   0.353    -.1463361    .0522641
              t |  -.0011336   .0012783    -0.89   0.375    -.0036432    .0013759
              d |   .0207664   .0403131     0.52   0.607    -.0583768    .0999097
             td |   .0016158   .0018784     0.86   0.390    -.0020719    .0053036
          _cons |   .0268916   .0479778     0.56   0.575    -.0672991    .1210824
---------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(16, 731)    =   1.31
                                                        Prob > F      = 0.1861
                                                        R-squared     = 0.0278
                                                        Adj R-squared = 0.0065
                                                        Root MSE      = 0.2296

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0090426   .0042685     2.12   0.034     .0006626    .0174226
      tenuresqr |  -.0003299   .0002127    -1.55   0.121    -.0007474    .0000876
 birthmonthdum2 |  -.0261626   .0423534    -0.62   0.537    -.1093114    .0569861
 birthmonthdum3 |  -.0292143   .0466263    -0.63   0.531    -.1207518    .0623232
 birthmonthdum4 |  -.0003239   .0455371    -0.01   0.994     -.089723    .0890751
 birthmonthdum5 |  -.0189604   .0433937    -0.44   0.662    -.1041515    .0662307
 birthmonthdum6 |  -.0631966   .0430814    -1.47   0.143    -.1477746    .0213813
 birthmonthdum7 |  -.0979403   .0448519    -2.18   0.029    -.1859943   -.0098864
 birthmonthdum8 |  -.0170259   .0434554    -0.39   0.695    -.1023381    .0682863
 birthmonthdum9 |  -.0330203   .0410238    -0.80   0.421    -.1135588    .0475182
birthmonthdum10 |  -.1000508   .0424655    -2.36   0.019    -.1834198   -.0166818
birthmonthdum11 |  -.0356184   .0431166    -0.83   0.409    -.1202655    .0490286
birthmonthdum12 |  -.0459323   .0441456    -1.04   0.298    -.1325996     .040735
              t |  -.0010494   .0011157    -0.94   0.347    -.0032397    .0011409
              d |   .0190031   .0351845     0.54   0.589    -.0500717    .0880779
             td |   .0012305   .0016395     0.75   0.453    -.0019881    .0044491
          _cons |   .0438689   .0418742     1.05   0.295    -.0383391    .1260769
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(15)   =       7.32
                                                  Prob > chi2     =     0.9481
                                                  R-squared       =          .
                                                  Root MSE        =     1.0551

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   6.189048   11.99526     0.52   0.606    -17.32123    29.69933
  secgenhighedu |  -6.814567   15.06141    -0.45   0.651    -36.33438    22.70525
         tenure |  -.0077227    .048783    -0.16   0.874    -.1033355    .0878902
      tenuresqr |   .0003173   .0018255     0.17   0.862    -.0032607    .0038953
 birthmonthdum2 |    .110175   .2397787     0.46   0.646    -.3597827    .5801327
 birthmonthdum3 |  -.1125172   .4254344    -0.26   0.791    -.9463532    .7213188
 birthmonthdum4 |  -.0251087   .3095382    -0.08   0.935    -.6317925    .5815752
 birthmonthdum5 |  -.0348469   .2226065    -0.16   0.876    -.4711476    .4014538
 birthmonthdum6 |   -.007095    .634785    -0.01   0.991    -1.251251    1.237061
 birthmonthdum7 |  -.3165419   .8171022    -0.39   0.698    -1.918033    1.284949
 birthmonthdum8 |  -.1210641   .4647609    -0.26   0.794    -1.031979    .7898506
 birthmonthdum9 |  -.3094005   .4462157    -0.69   0.488    -1.183967    .5651663
birthmonthdum10 |  -.2717417   .8938695    -0.30   0.761    -2.023694     1.48021
birthmonthdum11 |  -.1276551   .3636519    -0.35   0.726    -.8403997    .5850895
birthmonthdum12 |   .0794457   .3138929     0.25   0.800    -.5357731    .6946645
          _cons |    8.34555   .4631169    18.02   0.000     7.437857    9.253242
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .782333  (p = 0.6763)
  Wu-Hausman F(2,730)             =  .382153  (p = 0.6825)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .191043  (p = 0.6621)
  Basmann chi2(1)        =  .186749  (p = 0.6656)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.582  Chi-sq(16) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.300732    .6406061   5.298317   9.721166
      tenure |        748     6.51738    6.276193          0         28
   tenuresqr |        748    81.81417    126.4402          0        784
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0628342    .2428269          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748     .092246    .2895665          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748     .078877    .2697271          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) 
> & inrange(monthlyearning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =   1.56
                                                        Prob > F      = 0.0292
                                                        R-squared     = 0.0614
                                                        Adj R-squared = 0.0221
                                                        Root MSE      = 0.2604

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0103423   .0049559     2.09   0.037     .0006124    .0200722
      tenuresqr |  -.0003329   .0002453    -1.36   0.175    -.0008145    .0001488
 birthmonthdum2 |  -.0391509   .0488943    -0.80   0.424    -.1351439    .0568421
 birthmonthdum3 |  -.0146501   .0532856    -0.27   0.783    -.1192645    .0899644
 birthmonthdum4 |   .0003229   .0519968     0.01   0.995    -.1017613    .1024071
 birthmonthdum5 |  -.0288717   .0497019    -0.58   0.561    -.1264503    .0687068
 birthmonthdum6 |  -.0556697   .0496287    -1.12   0.262    -.1531047    .0417653
 birthmonthdum7 |  -.0590502   .0511942    -1.15   0.249    -.1595588    .0414583
 birthmonthdum8 |   .0049053   .0496984     0.10   0.921    -.0926665    .1024771
 birthmonthdum9 |  -.0238372   .0468731    -0.51   0.611    -.1158621    .0681876
birthmonthdum10 |  -.0620202   .0485313    -1.28   0.202    -.1573006    .0332602
birthmonthdum11 |  -.0385651   .0495297    -0.78   0.436    -.1358057    .0586755
birthmonthdum12 |  -.0559084    .050376    -1.11   0.267    -.1548104    .0429936
   provincedum2 |  -.2756759   .0822875    -3.35   0.001    -.4372292   -.1141226
   provincedum3 |  -.1909416   .0976738    -1.95   0.051    -.3827025    .0008193
   provincedum4 |  -.2635215   .0805607    -3.27   0.001    -.4216844   -.1053585
   provincedum5 |   -.142799   .0639306    -2.23   0.026    -.2683126   -.0172855
   provincedum6 |  -.1843325   .0662884    -2.78   0.006    -.3144752   -.0541899
   provincedum7 |  -.2263884   .0631291    -3.59   0.000    -.3503285   -.1024483
   provincedum8 |  -.2043268   .0620146    -3.29   0.001    -.3260787   -.0825748
   provincedum9 |  -.2492004   .0639693    -3.90   0.000      -.37479   -.1236108
  provincedum10 |  -.1344925   .0661633    -2.03   0.042    -.2643895   -.0045956
  provincedum11 |  -.1958669   .0653655    -3.00   0.003    -.3241976   -.0675363
  provincedum12 |  -.1766421   .0779645    -2.27   0.024    -.3297081   -.0235761
  provincedum13 |  -.2531467   .0681442    -3.71   0.000    -.3869327   -.1193608
  provincedum14 |  -.2240705     .06736    -3.33   0.001    -.3563169   -.0918241
  provincedum15 |  -.2111724   .0702686    -3.01   0.003    -.3491293   -.0732156
              t |  -.0013665   .0012765    -1.07   0.285    -.0038727    .0011397
              d |   .0258667   .0403377     0.64   0.522    -.0533275    .1050609
             td |    .001681   .0018821     0.89   0.372    -.0020141    .0053761
          _cons |   .2376402    .073671     3.23   0.001     .0930036    .3822768
---------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =   1.52
                                                        Prob > F      = 0.0380
                                                        R-squared     = 0.0598
                                                        Adj R-squared = 0.0205
                                                        Root MSE      = 0.2280

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0080086   .0043388     1.85   0.065    -.0005097    .0165268
      tenuresqr |  -.0002925   .0002148    -1.36   0.174    -.0007142    .0001291
 birthmonthdum2 |  -.0368146   .0428054    -0.86   0.390    -.1208535    .0472243
 birthmonthdum3 |  -.0377682   .0466499    -0.81   0.418     -.129355    .0538185
 birthmonthdum4 |  -.0158614   .0455216    -0.35   0.728     -.105233    .0735101
 birthmonthdum5 |  -.0272216   .0435124    -0.63   0.532    -.1126486    .0582054
 birthmonthdum6 |  -.0799281   .0434484    -1.84   0.066    -.1652293    .0053732
 birthmonthdum7 |  -.0955773    .044819    -2.13   0.033    -.1835694   -.0075852
 birthmonthdum8 |  -.0223918   .0435094    -0.51   0.607    -.1078129    .0630293
 birthmonthdum9 |  -.0459164   .0410359    -1.12   0.264    -.1264813    .0346484
birthmonthdum10 |  -.1065755   .0424876    -2.51   0.012    -.1899905   -.0231604
birthmonthdum11 |   -.052917   .0433617    -1.22   0.223    -.1380481    .0322141
birthmonthdum12 |  -.0526046   .0441026    -1.19   0.233    -.1391902    .0339811
   provincedum2 |  -.2296104   .0720402    -3.19   0.001    -.3710453   -.0881756
   provincedum3 |  -.1291911   .0855104    -1.51   0.131    -.2970718    .0386895
   provincedum4 |  -.2212558   .0705283    -3.14   0.002    -.3597225    -.082789
   provincedum5 |  -.1438632   .0559693    -2.57   0.010    -.2537464   -.0339799
   provincedum6 |  -.1324822   .0580335    -2.28   0.023     -.246418   -.0185464
   provincedum7 |  -.1906298   .0552676    -3.45   0.001    -.2991355   -.0821242
   provincedum8 |   -.177921   .0542919    -3.28   0.001    -.2845111    -.071331
   provincedum9 |  -.1979101   .0560031    -3.53   0.000    -.3078599   -.0879604
  provincedum10 |  -.1199366   .0579239    -2.07   0.039    -.2336573   -.0062158
  provincedum11 |  -.1766447   .0572255    -3.09   0.002    -.2889942   -.0642952
  provincedum12 |  -.1784544   .0682555    -2.61   0.009    -.3124589   -.0444499
  provincedum13 |  -.2224791   .0596581    -3.73   0.000    -.3396045   -.1053536
  provincedum14 |  -.1807969   .0589716    -3.07   0.002    -.2965745   -.0650193
  provincedum15 |  -.1650215    .061518    -2.68   0.007    -.2857984   -.0442446
              t |  -.0013669   .0011176    -1.22   0.222    -.0035609    .0008272
              d |   .0251882   .0353144     0.71   0.476    -.0441438    .0945203
             td |   .0014398   .0016477     0.87   0.383    -.0017952    .0046748
          _cons |   .2206997   .0644966     3.42   0.001     .0940749    .3473246
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(29)   =      25.87
                                                  Prob > chi2     =     0.6322
                                                  R-squared       =          .
                                                  Root MSE        =     .93512

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |    5.27296   11.56098     0.46   0.648    -17.38613    27.93205
  secgenhighedu |   -5.00668   12.40869    -0.40   0.687    -29.32726     19.3139
         tenure |  -.0215375    .039769    -0.54   0.588    -.0994833    .0564084
      tenuresqr |   .0008445    .001356     0.62   0.533    -.0018132    .0035023
 birthmonthdum2 |   .1442797   .2181116     0.66   0.508    -.2832111    .5717705
 birthmonthdum3 |  -.0770638   .3721024    -0.21   0.836    -.8063711    .6522436
 birthmonthdum4 |  -.0268709   .2783829    -0.10   0.923    -.5724914    .5187496
 birthmonthdum5 |  -.0211549   .2024042    -0.10   0.917    -.4178597      .37555
 birthmonthdum6 |   .0950736   .4667054     0.20   0.839    -.8196523    1.009799
 birthmonthdum7 |  -.2341221   .6059025    -0.39   0.699    -1.421669    .9534249
 birthmonthdum8 |  -.0896676   .3849849    -0.23   0.816    -.8442242     .664889
 birthmonthdum9 |  -.2613602   .3595758    -0.73   0.467    -.9661158    .4433954
birthmonthdum10 |  -.1930967   .6824977    -0.28   0.777    -1.530768    1.144574
birthmonthdum11 |   -.125988   .3103301    -0.41   0.685    -.7342239    .4822478
birthmonthdum12 |   .1189498    .256733     0.46   0.643    -.3842376    .6221371
   provincedum2 |    .039997   .9330657     0.04   0.966    -1.788778    1.868772
   provincedum3 |   .2443352    .880172     0.28   0.781     -1.48077    1.969441
   provincedum4 |  -.0900325   .8969671    -0.10   0.920    -1.848056    1.667991
   provincedum5 |  -.0275911   .5261753    -0.05   0.958    -1.058876    1.003694
   provincedum6 |   .2834633   .7512879     0.38   0.706    -1.189034     1.75596
   provincedum7 |   .0814929   .7504504     0.11   0.914    -1.389363    1.552349
   provincedum8 |  -.0653161   .6796985    -0.10   0.923    -1.397501    1.266869
   provincedum9 |   .3067539   .8655631     0.35   0.723    -1.389719    2.003226
  provincedum10 |   .0308199   .4842351     0.06   0.949    -.9182635    .9799032
  provincedum11 |  -.0267499   .6510413    -0.04   0.967    -1.302767    1.249268
  provincedum12 |  -.3753262   .6529743    -0.57   0.565    -1.655132      .90448
  provincedum13 |  -.0535523    .820671    -0.07   0.948    -1.662038    1.554933
  provincedum14 |  -.0981763   .7822351    -0.13   0.900    -1.631329    1.434976
  provincedum15 |  -.2231366   .7615243    -0.29   0.770    -1.715697    1.269424
          _cons |   8.300969    .870084     9.54   0.000     6.595636     10.0063
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .535149  (p = 0.7652)
  Wu-Hausman F(2,716)             =  .256311  (p = 0.7740)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .539953  (p = 0.4625)
  Basmann chi2(1)        =  .517949  (p = 0.4717)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.839  Chi-sq(30) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.300732    .6406061   5.298317   9.721166
      tenure |        748     6.51738    6.276193          0         28
   tenuresqr |        748    81.81417    126.4402          0        784
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0628342    .2428269          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748     .092246    .2895665          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748     .078877    .2697271          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 2
> 00, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    441
                                                        F(16, 424)    =   3.64
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1209
                                                        Adj R-squared = 0.0877
                                                        Root MSE      = 0.2126

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0120971     .00549     2.20   0.028     .0013062     .022888
      tenuresqr |  -.0001918   .0002993    -0.64   0.522    -.0007801    .0003965
 birthmonthdum2 |  -.1133772   .0540877    -2.10   0.037    -.2196905   -.0070639
 birthmonthdum3 |  -.2194377   .0589818    -3.72   0.000    -.3353708   -.1035046
 birthmonthdum4 |  -.2262241   .0599203    -3.78   0.000     -.344002   -.1084463
 birthmonthdum5 |   -.166634   .0559259    -2.98   0.003    -.2765606   -.0567074
 birthmonthdum6 |  -.1408991   .0548778    -2.57   0.011    -.2487654   -.0330328
 birthmonthdum7 |  -.0898742    .057975    -1.55   0.122    -.2038283    .0240799
 birthmonthdum8 |  -.2275421   .0546619    -4.16   0.000    -.3349841      -.1201
 birthmonthdum9 |  -.1486218   .0542764    -2.74   0.006    -.2553062   -.0419374
birthmonthdum10 |  -.1683652   .0521835    -3.23   0.001    -.2709358   -.0657946
birthmonthdum11 |  -.1723717   .0558954    -3.08   0.002    -.2822383    -.062505
birthmonthdum12 |  -.2071853   .0549597    -3.77   0.000    -.3152127    -.099158
              t |   -.000273    .001482    -0.18   0.854     -.003186      .00264
              d |   -.062149   .0428228    -1.45   0.147    -.1463204    .0220224
             td |   .0043403   .0019593     2.22   0.027     .0004891    .0081915
          _cons |   .1494871   .0565447     2.64   0.009     .0383442      .26063
---------------------------------------------------------------------------------

                                                        Number of obs =    441
                                                        F(16, 424)    =   2.69
                                                        Prob > F      = 0.0004
                                                        R-squared     = 0.0922
                                                        Adj R-squared = 0.0579
                                                        Root MSE      = 0.1761

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0048664   .0045483     1.07   0.285    -.0040737    .0138065
      tenuresqr |  -.0000255    .000248    -0.10   0.918    -.0005129    .0004619
 birthmonthdum2 |   -.054215   .0448108    -1.21   0.227    -.1422939     .033864
 birthmonthdum3 |  -.1308686   .0488655    -2.68   0.008    -.2269174   -.0348198
 birthmonthdum4 |   -.135593    .049643    -2.73   0.007    -.2331701   -.0380159
 birthmonthdum5 |  -.1070309   .0463338    -2.31   0.021    -.1981034   -.0159584
 birthmonthdum6 |  -.0661226   .0454654    -1.45   0.147    -.1554882     .023243
 birthmonthdum7 |  -.0024978   .0480314    -0.05   0.959     -.096907    .0919114
 birthmonthdum8 |  -.1376431   .0452866    -3.04   0.003    -.2266572    -.048629
 birthmonthdum9 |  -.0850327   .0449672    -1.89   0.059    -.1734191    .0033537
birthmonthdum10 |  -.1228282   .0432332    -2.84   0.005    -.2078063   -.0378501
birthmonthdum11 |   -.118707   .0463085    -2.56   0.011    -.2097299   -.0276842
birthmonthdum12 |  -.1230132   .0455332    -2.70   0.007    -.2125122   -.0335142
              t |  -.0006742   .0012278    -0.55   0.583    -.0030876    .0017392
              d |  -.0365679    .035478    -1.03   0.303    -.1063026    .0331668
             td |   .0039753   .0016233     2.45   0.015     .0007847     .007166
          _cons |   .0838704   .0468464     1.79   0.074    -.0082098    .1759505
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        441
                                                  Wald chi2(15)   =       9.26
                                                  Prob > chi2     =     0.8633
                                                  R-squared       =          .
                                                  Root MSE        =       1.22

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -8.010616   11.85999    -0.68   0.499    -31.25578    15.23455
  secgenhighedu |   8.934765   14.00975     0.64   0.524    -18.52384    36.39337
         tenure |   .1347729   .0836492     1.61   0.107    -.0291764    .2987223
      tenuresqr |  -.0053875   .0025606    -2.10   0.035    -.0104061   -.0003688
 birthmonthdum2 |  -.2529789   .6533225    -0.39   0.699    -1.533467     1.02751
 birthmonthdum3 |  -.5572466   .8545805    -0.65   0.514    -2.232194      1.1177
 birthmonthdum4 |   -.532381   .8739286    -0.61   0.542     -2.24525    1.180488
 birthmonthdum5 |  -.3358169   .5884113    -0.57   0.568    -1.489082    .8174479
 birthmonthdum6 |  -.2901523   .7920003    -0.37   0.714    -1.842444     1.26214
 birthmonthdum7 |  -.5971067   1.038189    -0.58   0.565    -2.631921    1.437707
 birthmonthdum8 |  -.4913316   .8560905    -0.57   0.566    -2.169238    1.186575
 birthmonthdum9 |   -.296688   .6520116    -0.46   0.649    -1.574607    .9812313
birthmonthdum10 |  -.1477842   .4931197    -0.30   0.764    -1.114281    .8187126
birthmonthdum11 |  -.2694074   .5724526    -0.47   0.638    -1.391394    .8525791
birthmonthdum12 |  -.7010532   .8490137    -0.83   0.409    -2.365089     .962983
          _cons |   7.902634   .5422709    14.57   0.000     6.839802    8.965465
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  2.28045  (p = 0.3197)
  Wu-Hausman F(2,423)             =  1.09937  (p = 0.3340)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .567374  (p = 0.4513)
  Basmann chi2(1)        =  .546205  (p = 0.4599)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.603  Chi-sq(16) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        441    7.825861    .6317342   5.298317   9.472705
      tenure |        441    5.303855    5.474171          0         25
   tenuresqr |        441    58.02948    100.9859          0        625
birthmont~m2 |        441    .0952381    .2938769          0          1
birthmonth~3 |        441    .0657596     .248143          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        441    .0612245    .2400139          0          1
birthmonth~5 |        441    .0839002     .277553          0          1
birthmonth~6 |        441    .0907029    .2875124          0          1
birthmonth~7 |        441    .0702948    .2559335          0          1
birthmonth~8 |        441    .0952381    .2938769          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        441    .0997732    .3000378          0          1
birthmont~10 |        441    .1156463    .3201635          0          1
birthmont~11 |        441    .0793651    .2706147          0          1
birthmont~12 |        441    .0861678    .2809304          0          1
        male |        441           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) 
> & inrange(monthlyearning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    441
                                                        F(30, 410)    =   2.85
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1725
                                                        Adj R-squared = 0.1119
                                                        Root MSE      = 0.2098

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0102091   .0055271     1.85   0.065    -.0006558    .0210741
      tenuresqr |  -.0001236   .0003001    -0.41   0.681    -.0007134    .0004663
 birthmonthdum2 |  -.1376349    .054747    -2.51   0.012    -.2452547   -.0300152
 birthmonthdum3 |  -.2388399    .059756    -4.00   0.000    -.3563063   -.1213735
 birthmonthdum4 |  -.2376352   .0604137    -3.93   0.000    -.3563944    -.118876
 birthmonthdum5 |  -.1769959   .0563483    -3.14   0.002    -.2877634   -.0662283
 birthmonthdum6 |  -.1617493   .0559101    -2.89   0.004    -.2716555   -.0518432
 birthmonthdum7 |  -.1065083   .0581272    -1.83   0.068    -.2207727    .0077562
 birthmonthdum8 |  -.2382514   .0564446    -4.22   0.000    -.3492085   -.1272944
 birthmonthdum9 |  -.1653919    .055813    -2.96   0.003    -.2751072   -.0556767
birthmonthdum10 |  -.1882217   .0533169    -3.53   0.000    -.2930302   -.0834131
birthmonthdum11 |  -.1827372   .0560931    -3.26   0.001     -.293003   -.0724713
birthmonthdum12 |  -.2296491    .056083    -4.09   0.000    -.3398953   -.1194029
   provincedum2 |  -.1840297   .0876349    -2.10   0.036    -.3562995   -.0117599
   provincedum3 |  -.2134446   .1117379    -1.91   0.057    -.4330953    .0062061
   provincedum4 |  -.1790654    .093845    -1.91   0.057    -.3635428    .0054119
   provincedum5 |   -.072098   .0750056    -0.96   0.337    -.2195416    .0753456
   provincedum6 |  -.1124591   .0793453    -1.42   0.157    -.2684334    .0435152
   provincedum7 |  -.1787618   .0759662    -2.35   0.019    -.3280936     -.02943
   provincedum8 |  -.1628256   .0734336    -2.22   0.027    -.3071791   -.0184722
   provincedum9 |  -.1330286   .0774985    -1.72   0.087    -.2853727    .0193155
  provincedum10 |  -.0332043   .0773342    -0.43   0.668    -.1852252    .1188166
  provincedum11 |  -.1494991   .0780354    -1.92   0.056    -.3028984    .0039002
  provincedum12 |  -.1600192   .0882597    -1.81   0.071    -.3335173    .0134788
  provincedum13 |  -.1755776   .0793296    -2.21   0.027    -.3315211    -.019634
  provincedum14 |  -.1158439   .0792125    -1.46   0.144    -.2715572    .0398695
  provincedum15 |  -.0619036   .0885697    -0.70   0.485    -.2360109    .1122038
              t |  -.0005415   .0015014    -0.36   0.719    -.0034928    .0024099
              d |  -.0567476   .0436799    -1.30   0.195     -.142612    .0291169
             td |   .0047334   .0019525     2.42   0.016     .0008953    .0085715
          _cons |   .2928445    .085694     3.42   0.001       .12439    .4612989
---------------------------------------------------------------------------------

                                                        Number of obs =    441
                                                        F(30, 410)    =   2.14
                                                        Prob > F      = 0.0006
                                                        R-squared     = 0.1352
                                                        Adj R-squared = 0.0719
                                                        Root MSE      = 0.1748

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0031144   .0046064     0.68   0.499    -.0059407    .0121696
      tenuresqr |   .0000408   .0002501     0.16   0.871    -.0004508    .0005324
 birthmonthdum2 |  -.0771767   .0456277    -1.69   0.092    -.1668702    .0125167
 birthmonthdum3 |  -.1520626   .0498024    -3.05   0.002    -.2499625   -.0541626
 birthmonthdum4 |  -.1454595   .0503505    -2.89   0.004    -.2444369   -.0464821
 birthmonthdum5 |  -.1167808   .0469623    -2.49   0.013    -.2090977   -.0244639
 birthmonthdum6 |  -.0848457   .0465971    -1.82   0.069    -.1764447    .0067533
 birthmonthdum7 |  -.0164941   .0484449    -0.34   0.734    -.1117254    .0787373
 birthmonthdum8 |   -.150724   .0470426    -3.20   0.001    -.2431989   -.0582492
 birthmonthdum9 |  -.1015188   .0465162    -2.18   0.030    -.1929588   -.0100789
birthmonthdum10 |   -.139573   .0444358    -3.14   0.002    -.2269235   -.0522224
birthmonthdum11 |  -.1303486   .0467496    -2.79   0.006    -.2222474   -.0384498
birthmonthdum12 |  -.1418217   .0467413    -3.03   0.003    -.2337041   -.0499393
   provincedum2 |  -.1853388   .0730375    -2.54   0.012    -.3289135   -.0417641
   provincedum3 |  -.2103474   .0931257    -2.26   0.024    -.3934107    -.027284
   provincedum4 |  -.1811765   .0782132    -2.32   0.021    -.3349254   -.0274277
   provincedum5 |  -.1150226   .0625119    -1.84   0.066    -.2379064    .0078613
   provincedum6 |  -.1484493   .0661287    -2.24   0.025    -.2784428   -.0184557
   provincedum7 |  -.1856109   .0633124    -2.93   0.004    -.3100684   -.0611534
   provincedum8 |  -.1864733   .0612018    -3.05   0.002    -.3067817   -.0661649
   provincedum9 |  -.1459068   .0645896    -2.26   0.024    -.2728749   -.0189388
  provincedum10 |  -.0946353   .0644526    -1.47   0.143     -.221334    .0320634
  provincedum11 |  -.1540007    .065037    -2.37   0.018    -.2818482   -.0261532
  provincedum12 |   -.177168   .0735582    -2.41   0.016    -.3217664   -.0325696
  provincedum13 |  -.1859969   .0661157    -2.81   0.005    -.3159649   -.0560289
  provincedum14 |    -.15479   .0660181    -2.34   0.020    -.2845661   -.0250139
  provincedum15 |  -.1323862   .0738166    -1.79   0.074    -.2774924      .01272
              t |  -.0011375   .0012513    -0.91   0.364    -.0035973    .0013222
              d |  -.0246845   .0364041    -0.68   0.498    -.0962464    .0468775
             td |   .0044336   .0016272     2.72   0.007     .0012348    .0076324
          _cons |   .2468637   .0714199     3.46   0.001     .1064687    .3872586
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        441
                                                  Wald chi2(29)   =      14.65
                                                  Prob > chi2     =     0.9876
                                                  R-squared       =          .
                                                  Root MSE        =     1.2625

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |    -8.4136    9.04053    -0.93   0.352    -26.13271    9.305514
  secgenhighedu |   9.766365   10.61556     0.92   0.358    -11.03974    30.57247
         tenure |   .1291456   .0695212     1.86   0.063    -.0071134    .2654045
      tenuresqr |  -.0051949   .0023589    -2.20   0.028    -.0098182   -.0005716
 birthmonthdum2 |  -.3397017   .5520717    -0.62   0.538    -1.421742    .7423389
 birthmonthdum3 |  -.6055864   .7095409    -0.85   0.393    -1.996261    .7850882
 birthmonthdum4 |  -.5640022   .7435908    -0.76   0.448    -2.021413     .893409
 birthmonthdum5 |  -.3735379   .5282684    -0.71   0.480    -1.408925     .661849
 birthmonthdum6 |  -.3655978    .654706    -0.56   0.577    -1.648798    .9176025
 birthmonthdum7 |  -.6967799   .8131091    -0.86   0.391    -2.290445    .8968847
 birthmonthdum8 |   -.504536   .6964972    -0.72   0.469    -1.869645    .8605734
 birthmonthdum9 |   -.359932   .5593765    -0.64   0.520     -1.45629    .7364259
birthmonthdum10 |  -.1637021   .5024747    -0.33   0.745    -1.148534    .8211302
birthmonthdum11 |  -.2861725   .5331208    -0.54   0.591     -1.33107    .7587251
birthmonthdum12 |  -.7791365   .7440621    -1.05   0.295    -2.237471    .6791984
   provincedum2 |  -.4143755   .6820989    -0.61   0.544    -1.751265    .9225137
   provincedum3 |  -.6357089   .8214249    -0.77   0.439    -2.245672    .9742543
   provincedum4 |  -.4127109   .7153167    -0.58   0.564    -1.814706    .9892841
   provincedum5 |   .1036359   .6752601     0.15   0.878     -1.21985    1.427121
   provincedum6 |   .1195089    .720409     0.17   0.868    -1.292467    1.531485
   provincedum7 |  -.3349463   .6390905    -0.52   0.600    -1.587541    .9176481
   provincedum8 |  -.1758254   .7065369    -0.25   0.803    -1.560612    1.208961
   provincedum9 |  -.0925545   .6052668    -0.15   0.878    -1.278856    1.093747
  provincedum10 |   .2486588   .7827343     0.32   0.751    -1.285472     1.78279
  provincedum11 |  -.3402721   .5802084    -0.59   0.558     -1.47746    .7969154
  provincedum12 |  -.2450424   .7114165    -0.34   0.731    -1.639393    1.149308
  provincedum13 |  -.0834445   .6653183    -0.13   0.900    -1.387444    1.220555
  provincedum14 |  -.1366839   .7335039    -0.19   0.852    -1.574325    1.300957
  provincedum15 |   .0299388   .9376336     0.03   0.975    -1.807789    1.867667
          _cons |   8.076098   .7722348    10.46   0.000     6.562546    9.589651
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  4.00947  (p = 0.1347)
  Wu-Hausman F(2,409)             =  1.87633  (p = 0.1545)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .472291  (p = 0.4919)
  Basmann chi2(1)        =  .439562  (p = 0.5073)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.489  Chi-sq(30) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        441    7.825861    .6317342   5.298317   9.472705
      tenure |        441    5.303855    5.474171          0         25
   tenuresqr |        441    58.02948    100.9859          0        625
birthmont~m2 |        441    .0952381    .2938769          0          1
birthmonth~3 |        441    .0657596     .248143          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        441    .0612245    .2400139          0          1
birthmonth~5 |        441    .0839002     .277553          0          1
birthmonth~6 |        441    .0907029    .2875124          0          1
birthmonth~7 |        441    .0702948    .2559335          0          1
birthmonth~8 |        441    .0952381    .2938769          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        441    .0997732    .3000378          0          1
birthmont~10 |        441    .1156463    .3201635          0          1
birthmont~11 |        441    .0793651    .2706147          0          1
birthmont~12 |        441    .0861678    .2809304          0          1
        male |        441           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667
> ) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,189
                                                        F(17, 1171)   =   2.43
                                                        Prob > F      = 0.0010
                                                        R-squared     = 0.0341
                                                        Adj R-squared = 0.0201
                                                        Root MSE      = 0.2466

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .012347   .0036748     3.36   0.001     .0051372    .0195569
      tenuresqr |  -.0003625   .0001878    -1.93   0.054    -.0007311    5.98e-06
 birthmonthdum2 |  -.0519136   .0367712    -1.41   0.158    -.1240583    .0202311
 birthmonthdum3 |  -.0792986   .0402342    -1.97   0.049    -.1582378   -.0003594
 birthmonthdum4 |  -.0603157   .0399046    -1.51   0.131    -.1386082    .0179768
 birthmonthdum5 |  -.0661439    .037753    -1.75   0.080     -.140215    .0079272
 birthmonthdum6 |  -.0696383   .0373013    -1.87   0.062    -.1428231    .0035465
 birthmonthdum7 |  -.0698195   .0391012    -1.79   0.074    -.1465357    .0068967
 birthmonthdum8 |  -.0700634   .0374932    -1.87   0.062    -.1436248    .0034979
 birthmonthdum9 |  -.0520916   .0360381    -1.45   0.149    -.1227981    .0186149
birthmonthdum10 |  -.0908467   .0362303    -2.51   0.012    -.1619303   -.0197631
birthmonthdum11 |  -.0722882   .0375862    -1.92   0.055     -.146032    .0014555
birthmonthdum12 |  -.1007841   .0379606    -2.65   0.008    -.1752624   -.0263057
           male |   .0151591   .0149266     1.02   0.310    -.0141268     .044445
              t |  -.0010452   .0009739    -1.07   0.283    -.0029559    .0008655
              d |  -.0048036   .0297559    -0.16   0.872    -.0631844    .0535773
             td |   .0028737    .001381     2.08   0.038     .0001641    .0055833
          _cons |   .0507626   .0382986     1.33   0.185    -.0243789    .1259041
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,189
                                                  Wald chi2(15)   =     159.30
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .68314

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   1.141069   1.231612     0.93   0.354    -1.272846    3.554985
         tenure |    .015671   .0180378     0.87   0.385    -.0196824    .0510245
      tenuresqr |  -.0007765   .0006806    -1.14   0.254    -.0021104    .0005574
 birthmonthdum2 |   .1865627   .1198312     1.56   0.119    -.0483022    .4214276
 birthmonthdum3 |   .1314737   .1448534     0.91   0.364    -.1524337    .4153812
 birthmonthdum4 |    .139591    .130875     1.07   0.286    -.1169194    .3961013
 birthmonthdum5 |   .0502664   .1295923     0.39   0.698    -.2037298    .3042627
 birthmonthdum6 |   .2942106   .1338172     2.20   0.028     .0319338    .5564875
 birthmonthdum7 |   .0797673   .1363239     0.59   0.558    -.1874227    .3469573
 birthmonthdum8 |   .1497707    .131664     1.14   0.255     -.108286    .4078274
 birthmonthdum9 |   -.002953   .1187269    -0.02   0.980    -.2356534    .2297473
birthmonthdum10 |   .1650325   .1500808     1.10   0.271    -.1291204    .4591855
birthmonthdum11 |   .1050228   .1374123     0.76   0.445    -.1643004     .374346
birthmonthdum12 |   .1195947   .1650799     0.72   0.469    -.2039558    .4431453
           male |   .4531192   .0451042    10.05   0.000     .3647166    .5415218
          _cons |   7.605126   .1278325    59.49   0.000     7.354579    7.855674
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .920289  (p = 0.3374)
  Wu-Hausman F(1,1172)            =  .907834  (p = 0.3409)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .468512  (p = 0.7912)
  Basmann chi2(2)        =  .461601  (p = 0.7939)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  14.698  Chi-sq(17) P-value = 0.6172

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,189    8.124603    .6771347   5.298317   9.721166
      tenure |      1,189    6.067283    6.017554          0         28
   tenuresqr |      1,189    72.99243    118.1597          0        784
birthmont~m2 |      1,189    .0941968    .2922252          0          1
birthmonth~3 |      1,189    .0639193     .244712          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,189    .0656013    .2476881          0          1
birthmonth~5 |      1,189    .0841043    .2776609          0          1
birthmonth~6 |      1,189    .0908326    .2874919          0          1
birthmonth~7 |      1,189    .0731707    .2605261          0          1
birthmonth~8 |      1,189    .0891505    .2850808          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,189    .1084945    .3111348          0          1
birthmont~10 |      1,189    .1009251    .3013563          0          1
birthmont~11 |      1,189    .0841043    .2776609          0          1
birthmont~12 |      1,189    .0815812    .2738407          0          1
        male |      1,189    .6291001     .483249          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu  = t d td ) if inrange(t, -`months', `months'-1) & inrang
> e(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,189
                                                        F(31, 1157)   =   2.98
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0740
                                                        Adj R-squared = 0.0492
                                                        Root MSE      = 0.2430

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0107092   .0036891     2.90   0.004     .0034711    .0179473
      tenuresqr |  -.0002894   .0001873    -1.55   0.123     -.000657    .0000781
 birthmonthdum2 |  -.0677581   .0366299    -1.85   0.065    -.1396265    .0041102
 birthmonthdum3 |  -.0897308   .0398912    -2.25   0.025    -.1679979   -.0114637
 birthmonthdum4 |  -.0733228   .0395134    -1.86   0.064    -.1508488    .0042031
 birthmonthdum5 |  -.0733684    .037397    -1.96   0.050    -.1467419    5.08e-06
 birthmonthdum6 |  -.0858027   .0372286    -2.30   0.021    -.1588459   -.0127595
 birthmonthdum7 |  -.0718736   .0386872    -1.86   0.063    -.1477786    .0040314
 birthmonthdum8 |  -.0698399   .0372799    -1.87   0.061    -.1429836    .0033039
 birthmonthdum9 |  -.0627556   .0358016    -1.75   0.080     -.132999    .0074878
birthmonthdum10 |  -.0976273   .0360265    -2.71   0.007    -.1683119   -.0269427
birthmonthdum11 |  -.0841713    .037291    -2.26   0.024    -.1573369   -.0110058
birthmonthdum12 |  -.1120704   .0376771    -2.97   0.003    -.1859934   -.0381474
           male |   .0155364   .0147443     1.05   0.292    -.0133922     .044465
   provincedum2 |  -.2498546   .0601894    -4.15   0.000    -.3679473    -.131762
   provincedum3 |  -.1945647   .0737234    -2.64   0.008    -.3392113   -.0499182
   provincedum4 |  -.2380757   .0613645    -3.88   0.000    -.3584738   -.1176777
   provincedum5 |  -.1245393   .0486739    -2.56   0.011    -.2200383   -.0290403
   provincedum6 |  -.1655078   .0507419    -3.26   0.001    -.2650642   -.0659514
   provincedum7 |  -.2184843    .048568    -4.50   0.000    -.3137755   -.1231931
   provincedum8 |  -.1932669   .0472671    -4.09   0.000    -.2860057   -.1005282
   provincedum9 |  -.2262274   .0491474    -4.60   0.000    -.3226553   -.1297994
  provincedum10 |  -.1073571   .0502235    -2.14   0.033    -.2058965   -.0088178
  provincedum11 |  -.1934483   .0498328    -3.88   0.000    -.2912211   -.0956754
  provincedum12 |  -.1830984   .0585393    -3.13   0.002    -.2979535   -.0682433
  provincedum13 |  -.2392246   .0516719    -4.63   0.000    -.3406057   -.1378436
  provincedum14 |  -.1917969   .0510572    -3.76   0.000    -.2919719   -.0916219
  provincedum15 |  -.1734007   .0547306    -3.17   0.002    -.2807831   -.0660184
              t |  -.0013054   .0009656    -1.35   0.177       -.0032    .0005892
              d |   .0047707   .0295393     0.16   0.872    -.0531858    .0627272
             td |   .0029798   .0013683     2.18   0.030     .0002952    .0056644
          _cons |   .2405826   .0569933     4.22   0.000     .1287609    .3524043
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,189
                                                  Wald chi2(29)   =     196.63
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .69006

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   1.298173   1.210299     1.07   0.283    -1.073969    3.670314
         tenure |   .0066675   .0164031     0.41   0.684    -.0254819    .0388169
      tenuresqr |  -.0004398   .0006327    -0.70   0.487    -.0016799    .0008003
 birthmonthdum2 |   .1823141   .1327547     1.37   0.170    -.0778804    .4425085
 birthmonthdum3 |   .1220911   .1545506     0.79   0.430    -.1808226    .4250048
 birthmonthdum4 |   .1204881   .1415564     0.85   0.395    -.1569573    .3979335
 birthmonthdum5 |   .0501223    .136351     0.37   0.713    -.2171207    .3173653
 birthmonthdum6 |    .290932    .149661     1.94   0.052    -.0023981    .5842622
 birthmonthdum7 |   .0711071   .1395084     0.51   0.610    -.2023243    .3445386
 birthmonthdum8 |   .1274584   .1333216     0.96   0.339    -.1338472    .3887639
 birthmonthdum9 |  -.0221274    .128033    -0.17   0.863    -.2730674    .2288127
birthmonthdum10 |   .1542953   .1559898     0.99   0.323    -.1514392    .4600297
birthmonthdum11 |   .0921351   .1473019     0.63   0.532    -.1965713    .3808415
birthmonthdum12 |   .1121551   .1759259     0.64   0.524    -.2326534    .4569636
           male |   .4516745   .0455868     9.91   0.000     .3623259     .541023
   provincedum2 |   -.038906   .3458437    -0.11   0.910    -.7167473    .6389352
   provincedum3 |  -.1056762   .3168905    -0.33   0.739    -.7267702    .5154177
   provincedum4 |  -.1494451   .3395984    -0.44   0.660    -.8150457    .5161555
   provincedum5 |   .0035125   .1995894     0.02   0.986    -.3876756    .3947006
   provincedum6 |   .0908901   .2460787     0.37   0.712    -.3914153    .5731954
   provincedum7 |  -.0287821   .2931354    -0.10   0.922     -.603317    .5457528
   provincedum8 |  -.1044559   .2678491    -0.39   0.697    -.6294306    .4205187
   provincedum9 |   .1572402    .304386     0.52   0.605    -.4393453    .7538257
  provincedum10 |  -.0218625   .1929732    -0.11   0.910    -.4000831     .356358
  provincedum11 |   -.041134   .2708211    -0.15   0.879    -.5719336    .4896657
  provincedum12 |  -.2028988   .2725354    -0.74   0.457    -.7370583    .3312607
  provincedum13 |   .0299926   .3213337     0.09   0.926    -.5998099    .6597951
  provincedum14 |  -.1922426   .2707912    -0.71   0.478    -.7229835    .3384984
  provincedum15 |  -.3293402   .2561094    -1.29   0.198    -.8313053     .172625
          _cons |     7.6766   .3606194    21.29   0.000     6.969799    8.383401
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  1.43541  (p = 0.2309)
  Wu-Hausman F(1,1158)            =  1.39968  (p = 0.2370)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .618099  (p = 0.7341)
  Basmann chi2(2)        =  .601776  (p = 0.7402)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  26.142  Chi-sq(31) P-value = 0.7145

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,189    8.124603    .6771347   5.298317   9.721166
      tenure |      1,189    6.067283    6.017554          0         28
   tenuresqr |      1,189    72.99243    118.1597          0        784
birthmont~m2 |      1,189    .0941968    .2922252          0          1
birthmonth~3 |      1,189    .0639193     .244712          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,189    .0656013    .2476881          0          1
birthmonth~5 |      1,189    .0841043    .2776609          0          1
birthmonth~6 |      1,189    .0908326    .2874919          0          1
birthmonth~7 |      1,189    .0731707    .2605261          0          1
birthmonth~8 |      1,189    .0891505    .2850808          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,189    .1084945    .3111348          0          1
birthmont~10 |      1,189    .1009251    .3013563          0          1
birthmont~11 |      1,189    .0841043    .2776609          0          1
birthmont~12 |      1,189    .0815812    .2738407          0          1
        male |      1,189    .6291001     .483249          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u  = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & 
> male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(16, 731)    =   1.10
                                                        Prob > F      = 0.3543
                                                        R-squared     = 0.0234
                                                        Adj R-squared = 0.0021
                                                        Root MSE      = 0.2631

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0120251   .0048907     2.46   0.014     .0024236    .0216266
      tenuresqr |  -.0004028   .0002437    -1.65   0.099    -.0008812    .0000755
 birthmonthdum2 |  -.0268338   .0485269    -0.55   0.580    -.1221025    .0684349
 birthmonthdum3 |  -.0074812   .0534227    -0.14   0.889    -.1123614    .0973989
 birthmonthdum4 |   .0179546   .0521746     0.34   0.731    -.0844754    .1203846
 birthmonthdum5 |  -.0207926   .0497188    -0.42   0.676    -.1184013    .0768161
 birthmonthdum6 |  -.0341445    .049361    -0.69   0.489    -.1310507    .0627617
 birthmonthdum7 |  -.0655038   .0513896    -1.27   0.203    -.1663927     .035385
 birthmonthdum8 |   .0130503   .0497895     0.26   0.793    -.0846971    .1107978
 birthmonthdum9 |   -.008881   .0470035    -0.19   0.850     -.101159    .0833969
birthmonthdum10 |  -.0579177   .0486554    -1.19   0.234    -.1534387    .0376033
birthmonthdum11 |  -.0211754   .0494013    -0.43   0.668    -.1181608      .07581
birthmonthdum12 |   -.047036   .0505804    -0.93   0.353    -.1463361    .0522641
              t |  -.0011336   .0012783    -0.89   0.375    -.0036432    .0013759
              d |   .0207664   .0403131     0.52   0.607    -.0583768    .0999097
             td |   .0016158   .0018784     0.86   0.390    -.0020719    .0053036
          _cons |   .0268916   .0479778     0.56   0.575    -.0672991    .1210824
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(14)   =      16.75
                                                  Prob > chi2     =     0.2695
                                                  R-squared       =          .
                                                  Root MSE        =     .68766

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   1.031968   2.436116     0.42   0.672    -3.742732    5.806668
         tenure |   -.007147   .0317845    -0.22   0.822    -.0694435    .0551494
      tenuresqr |   .0004671   .0011701     0.40   0.690    -.0018263    .0027605
 birthmonthdum2 |   .1513651   .1445784     1.05   0.295    -.1320033    .4347336
 birthmonthdum3 |   .0535729   .1401536     0.38   0.702    -.2211232     .328269
 birthmonthdum4 |   .0731528   .1437574     0.51   0.611    -.2086066    .3549122
 birthmonthdum5 |  -.0068467   .1393689    -0.05   0.961    -.2800046    .2663113
 birthmonthdum6 |   .2581867   .1585572     1.63   0.103    -.0525797    .5689531
 birthmonthdum7 |   .0224345   .2125588     0.11   0.916    -.3941732    .4390422
 birthmonthdum8 |   .0681264   .1322272     0.52   0.606    -.1910341    .3272868
 birthmonthdum9 |  -.1275189   .1262347    -1.01   0.312    -.3749344    .1198966
birthmonthdum10 |   .1114772   .1862103     0.60   0.549    -.2534882    .4764426
birthmonthdum11 |   .0059879   .1382558     0.04   0.965    -.2649884    .2769642
birthmonthdum12 |   .1486207   .1786773     0.83   0.406    -.2015804    .4988218
          _cons |   8.170879   .1667317    49.01   0.000     7.844091    8.497668
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .216944  (p = 0.6414)
  Wu-Hausman F(1,732)             =  .212365  (p = 0.6451)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =   .93162  (p = 0.6276)
  Basmann chi2(2)        =  .911582  (p = 0.6339)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   8.828  Chi-sq(16) P-value = 0.9203

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.300732    .6406061   5.298317   9.721166
      tenure |        748     6.51738    6.276193          0         28
   tenuresqr |        748    81.81417    126.4402          0        784
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0628342    .2428269          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748     .092246    .2895665          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748     .078877    .2697271          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu  = t d td ) if inrange(t, -`months', `months'-1) & inrange(mon
> thlyearning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =   1.56
                                                        Prob > F      = 0.0292
                                                        R-squared     = 0.0614
                                                        Adj R-squared = 0.0221
                                                        Root MSE      = 0.2604

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0103423   .0049559     2.09   0.037     .0006124    .0200722
      tenuresqr |  -.0003329   .0002453    -1.36   0.175    -.0008145    .0001488
 birthmonthdum2 |  -.0391509   .0488943    -0.80   0.424    -.1351439    .0568421
 birthmonthdum3 |  -.0146501   .0532856    -0.27   0.783    -.1192645    .0899644
 birthmonthdum4 |   .0003229   .0519968     0.01   0.995    -.1017613    .1024071
 birthmonthdum5 |  -.0288717   .0497019    -0.58   0.561    -.1264503    .0687068
 birthmonthdum6 |  -.0556697   .0496287    -1.12   0.262    -.1531047    .0417653
 birthmonthdum7 |  -.0590502   .0511942    -1.15   0.249    -.1595588    .0414583
 birthmonthdum8 |   .0049053   .0496984     0.10   0.921    -.0926665    .1024771
 birthmonthdum9 |  -.0238372   .0468731    -0.51   0.611    -.1158621    .0681876
birthmonthdum10 |  -.0620202   .0485313    -1.28   0.202    -.1573006    .0332602
birthmonthdum11 |  -.0385651   .0495297    -0.78   0.436    -.1358057    .0586755
birthmonthdum12 |  -.0559084    .050376    -1.11   0.267    -.1548104    .0429936
   provincedum2 |  -.2756759   .0822875    -3.35   0.001    -.4372292   -.1141226
   provincedum3 |  -.1909416   .0976738    -1.95   0.051    -.3827025    .0008193
   provincedum4 |  -.2635215   .0805607    -3.27   0.001    -.4216844   -.1053585
   provincedum5 |   -.142799   .0639306    -2.23   0.026    -.2683126   -.0172855
   provincedum6 |  -.1843325   .0662884    -2.78   0.006    -.3144752   -.0541899
   provincedum7 |  -.2263884   .0631291    -3.59   0.000    -.3503285   -.1024483
   provincedum8 |  -.2043268   .0620146    -3.29   0.001    -.3260787   -.0825748
   provincedum9 |  -.2492004   .0639693    -3.90   0.000      -.37479   -.1236108
  provincedum10 |  -.1344925   .0661633    -2.03   0.042    -.2643895   -.0045956
  provincedum11 |  -.1958669   .0653655    -3.00   0.003    -.3241976   -.0675363
  provincedum12 |  -.1766421   .0779645    -2.27   0.024    -.3297081   -.0235761
  provincedum13 |  -.2531467   .0681442    -3.71   0.000    -.3869327   -.1193608
  provincedum14 |  -.2240705     .06736    -3.33   0.001    -.3563169   -.0918241
  provincedum15 |  -.2111724   .0702686    -3.01   0.003    -.3491293   -.0732156
              t |  -.0013665   .0012765    -1.07   0.285    -.0038727    .0011397
              d |   .0258667   .0403377     0.64   0.522    -.0533275    .1050609
             td |    .001681   .0018821     0.89   0.372    -.0020141    .0053761
          _cons |   .2376402    .073671     3.23   0.001     .0930036    .3822768
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(28)   =      52.95
                                                  Prob > chi2     =     0.0030
                                                  R-squared       =          .
                                                  Root MSE        =     .65166

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .7794141   2.161999     0.36   0.718    -3.458026    5.016854
         tenure |  -.0150768   .0253683    -0.59   0.552    -.0647977    .0346441
      tenuresqr |   .0007977   .0009415     0.85   0.397    -.0010477     .002643
 birthmonthdum2 |    .152647   .1513072     1.01   0.313    -.1439097    .4492037
 birthmonthdum3 |    .050632   .1363763     0.37   0.710    -.2166607    .3179248
 birthmonthdum4 |   .0564949   .1300126     0.43   0.664    -.1983252    .3113149
 birthmonthdum5 |  -.0100434   .1397381    -0.07   0.943     -.283925    .2638382
 birthmonthdum6 |   .2511448   .1819772     1.38   0.168     -.105524    .6078135
 birthmonthdum7 |  -.0146925   .1861518    -0.08   0.937    -.3795433    .3501583
 birthmonthdum8 |   .0481842    .123653     0.39   0.697    -.1941713    .2905396
 birthmonthdum9 |  -.1380101   .1319161    -1.05   0.295    -.3965609    .1205408
birthmonthdum10 |   .0625609   .1767333     0.35   0.723    -.2838301    .4089519
birthmonthdum11 |  -.0345876   .1478112    -0.23   0.815    -.3242923    .2551171
birthmonthdum12 |   .1293134   .1780123     0.73   0.468    -.2195843    .4782111
   provincedum2 |  -.0573451   .6281159    -0.09   0.927     -1.28843    1.173739
   provincedum3 |   .0298186   .4888229     0.06   0.951    -.9282567    .9878939
   provincedum4 |  -.1775376   .6065248    -0.29   0.770    -1.366304    1.011229
   provincedum5 |   .0479413   .3426853     0.14   0.889    -.6237094    .7195921
   provincedum6 |    .115321   .4356263     0.26   0.791    -.7384908    .9691328
   provincedum7 |    .016369   .5107287     0.03   0.974    -.9846408    1.017379
   provincedum8 |  -.0969052     .47051    -0.21   0.837    -1.019088    .8252774
   provincedum9 |   .1755559   .5590055     0.31   0.753    -.9200748    1.271187
  provincedum10 |   .0207706   .3370031     0.06   0.951    -.6397433    .6812846
  provincedum11 |  -.0239184   .4536659    -0.05   0.958    -.9130872    .8652504
  provincedum12 |  -.2778259    .422733    -0.66   0.511    -1.106367    .5507156
  provincedum13 |  -.0822976   .5697434    -0.14   0.885    -1.198974    1.034379
  provincedum14 |  -.2039165   .5136145    -0.40   0.691    -1.210582    .8027493
  provincedum15 |  -.3477448   .4850858    -0.72   0.473    -1.298495    .6030059
          _cons |   8.264396   .6030376    13.70   0.000     7.082464    9.446328
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .165613  (p = 0.6840)
  Wu-Hausman F(1,718)             =  .159006  (p = 0.6902)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  1.44709  (p = 0.4850)
  Basmann chi2(2)        =  1.38981  (p = 0.4991)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  21.126  Chi-sq(30) P-value = 0.8839

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.300732    .6406061   5.298317   9.721166
      tenure |        748     6.51738    6.276193          0         28
   tenuresqr |        748    81.81417    126.4402          0        784
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0628342    .2428269          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748     .092246    .2895665          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748     .078877    .2697271          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u  = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & 
> male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    441
                                                        F(16, 424)    =   3.64
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1209
                                                        Adj R-squared = 0.0877
                                                        Root MSE      = 0.2126

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0120971     .00549     2.20   0.028     .0013062     .022888
      tenuresqr |  -.0001918   .0002993    -0.64   0.522    -.0007801    .0003965
 birthmonthdum2 |  -.1133772   .0540877    -2.10   0.037    -.2196905   -.0070639
 birthmonthdum3 |  -.2194377   .0589818    -3.72   0.000    -.3353708   -.1035046
 birthmonthdum4 |  -.2262241   .0599203    -3.78   0.000     -.344002   -.1084463
 birthmonthdum5 |   -.166634   .0559259    -2.98   0.003    -.2765606   -.0567074
 birthmonthdum6 |  -.1408991   .0548778    -2.57   0.011    -.2487654   -.0330328
 birthmonthdum7 |  -.0898742    .057975    -1.55   0.122    -.2038283    .0240799
 birthmonthdum8 |  -.2275421   .0546619    -4.16   0.000    -.3349841      -.1201
 birthmonthdum9 |  -.1486218   .0542764    -2.74   0.006    -.2553062   -.0419374
birthmonthdum10 |  -.1683652   .0521835    -3.23   0.001    -.2709358   -.0657946
birthmonthdum11 |  -.1723717   .0558954    -3.08   0.002    -.2822383    -.062505
birthmonthdum12 |  -.2071853   .0549597    -3.77   0.000    -.3152127    -.099158
              t |   -.000273    .001482    -0.18   0.854     -.003186      .00264
              d |   -.062149   .0428228    -1.45   0.147    -.1463204    .0220224
             td |   .0043403   .0019593     2.22   0.027     .0004891    .0081915
          _cons |   .1494871   .0565447     2.64   0.009     .0383442      .26063
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        441
                                                  Wald chi2(14)   =      33.68
                                                  Prob > chi2     =     0.0023
                                                  R-squared       =     0.0172
                                                  Root MSE        =     .62558

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.5442841   .9729013    -0.56   0.576    -2.451136    1.362567
         tenure |   .0877482   .0202549     4.33   0.000     .0480494     .127447
      tenuresqr |  -.0042045   .0009051    -4.65   0.000    -.0059785   -.0024304
 birthmonthdum2 |   .0918658   .1880212     0.49   0.625    -.2766489    .4603806
 birthmonthdum3 |  -.1201289   .2617275    -0.46   0.646    -.6331053    .3928476
 birthmonthdum4 |  -.0849634   .2672171    -0.32   0.751    -.6086994    .4387726
 birthmonthdum5 |  -.0746256   .2166383    -0.34   0.730     -.499229    .3499777
 birthmonthdum6 |   .1460603   .2047417     0.71   0.476    -.2552261    .5473467
 birthmonthdum7 |   .0246849   .1829266     0.13   0.893    -.3338448    .3832145
 birthmonthdum8 |  -.0487758    .257076    -0.19   0.850    -.5526355    .4550838
 birthmonthdum9 |   .0300667    .206775     0.15   0.884    -.3752049    .4353383
birthmonthdum10 |  -.0018921   .2240009    -0.01   0.993    -.4409258    .4371416
birthmonthdum11 |  -.0515101   .2355198    -0.22   0.827    -.5131205    .4101003
birthmonthdum12 |  -.2645597   .2576049    -1.03   0.304    -.7694559    .2403366
          _cons |   7.657205   .1959017    39.09   0.000     7.273245    8.041165
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =   .63672  (p = 0.4249)
  Wu-Hausman F(1,425)             =  .614507  (p = 0.4335)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  3.70481  (p = 0.1569)
  Basmann chi2(2)        =  3.59217  (p = 0.1659)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  16.699  Chi-sq(16) P-value = 0.4053

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        441    7.825861    .6317342   5.298317   9.472705
      tenure |        441    5.303855    5.474171          0         25
   tenuresqr |        441    58.02948    100.9859          0        625
birthmont~m2 |        441    .0952381    .2938769          0          1
birthmonth~3 |        441    .0657596     .248143          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        441    .0612245    .2400139          0          1
birthmonth~5 |        441    .0839002     .277553          0          1
birthmonth~6 |        441    .0907029    .2875124          0          1
birthmonth~7 |        441    .0702948    .2559335          0          1
birthmonth~8 |        441    .0952381    .2938769          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        441    .0997732    .3000378          0          1
birthmont~10 |        441    .1156463    .3201635          0          1
birthmont~11 |        441    .0793651    .2706147          0          1
birthmont~12 |        441    .0861678    .2809304          0          1
        male |        441           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu = t d td ) if inrange(t, -`months', `months'-1) & inrange(mont
> hlyearning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    441
                                                        F(30, 410)    =   2.85
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1725
                                                        Adj R-squared = 0.1119
                                                        Root MSE      = 0.2098

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0102091   .0055271     1.85   0.065    -.0006558    .0210741
      tenuresqr |  -.0001236   .0003001    -0.41   0.681    -.0007134    .0004663
 birthmonthdum2 |  -.1376349    .054747    -2.51   0.012    -.2452547   -.0300152
 birthmonthdum3 |  -.2388399    .059756    -4.00   0.000    -.3563063   -.1213735
 birthmonthdum4 |  -.2376352   .0604137    -3.93   0.000    -.3563944    -.118876
 birthmonthdum5 |  -.1769959   .0563483    -3.14   0.002    -.2877634   -.0662283
 birthmonthdum6 |  -.1617493   .0559101    -2.89   0.004    -.2716555   -.0518432
 birthmonthdum7 |  -.1065083   .0581272    -1.83   0.068    -.2207727    .0077562
 birthmonthdum8 |  -.2382514   .0564446    -4.22   0.000    -.3492085   -.1272944
 birthmonthdum9 |  -.1653919    .055813    -2.96   0.003    -.2751072   -.0556767
birthmonthdum10 |  -.1882217   .0533169    -3.53   0.000    -.2930302   -.0834131
birthmonthdum11 |  -.1827372   .0560931    -3.26   0.001     -.293003   -.0724713
birthmonthdum12 |  -.2296491    .056083    -4.09   0.000    -.3398953   -.1194029
   provincedum2 |  -.1840297   .0876349    -2.10   0.036    -.3562995   -.0117599
   provincedum3 |  -.2134446   .1117379    -1.91   0.057    -.4330953    .0062061
   provincedum4 |  -.1790654    .093845    -1.91   0.057    -.3635428    .0054119
   provincedum5 |   -.072098   .0750056    -0.96   0.337    -.2195416    .0753456
   provincedum6 |  -.1124591   .0793453    -1.42   0.157    -.2684334    .0435152
   provincedum7 |  -.1787618   .0759662    -2.35   0.019    -.3280936     -.02943
   provincedum8 |  -.1628256   .0734336    -2.22   0.027    -.3071791   -.0184722
   provincedum9 |  -.1330286   .0774985    -1.72   0.087    -.2853727    .0193155
  provincedum10 |  -.0332043   .0773342    -0.43   0.668    -.1852252    .1188166
  provincedum11 |  -.1494991   .0780354    -1.92   0.056    -.3028984    .0039002
  provincedum12 |  -.1600192   .0882597    -1.81   0.071    -.3335173    .0134788
  provincedum13 |  -.1755776   .0793296    -2.21   0.027    -.3315211    -.019634
  provincedum14 |  -.1158439   .0792125    -1.46   0.144    -.2715572    .0398695
  provincedum15 |  -.0619036   .0885697    -0.70   0.485    -.2360109    .1122038
              t |  -.0005415   .0015014    -0.36   0.719    -.0034928    .0024099
              d |  -.0567476   .0436799    -1.30   0.195     -.142612    .0291169
             td |   .0047334   .0019525     2.42   0.016     .0008953    .0085715
          _cons |   .2928445    .085694     3.42   0.001       .12439    .4612989
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        441
                                                  Wald chi2(28)   =      62.09
                                                  Prob > chi2     =     0.0002
                                                  R-squared       =     0.1103
                                                  Root MSE        =      .5952

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.2804166   .8919308    -0.31   0.753    -2.028569    1.467736
         tenure |   .0760612   .0182833     4.16   0.000     .0402266    .1118957
      tenuresqr |  -.0038198   .0008604    -4.44   0.000    -.0055062   -.0021335
 birthmonthdum2 |   .0022141   .1924709     0.01   0.991     -.375022    .3794501
 birthmonthdum3 |  -.1968928   .2608455    -0.75   0.450    -.7081406     .314355
 birthmonthdum4 |  -.1046733   .2597999    -0.40   0.687    -.6138718    .4045251
 birthmonthdum5 |  -.1180338   .2118633    -0.56   0.577    -.5332784    .2972107
 birthmonthdum6 |   .0792146   .2081266     0.38   0.703    -.3287061    .4871353
 birthmonthdum7 |   -.037871   .1814984    -0.21   0.835    -.3936013    .3178593
 birthmonthdum8 |  -.0888762   .2499115    -0.36   0.722    -.5786938    .4009415
 birthmonthdum9 |  -.0436296   .2080315    -0.21   0.834    -.4513638    .3641046
birthmonthdum10 |   -.022108   .2255112    -0.10   0.922    -.4641018    .4198857
birthmonthdum11 |  -.0830999   .2287904    -0.36   0.716    -.5315207     .365321
birthmonthdum12 |  -.3166025   .2586037    -1.22   0.221    -.8234564    .1902515
   provincedum2 |  -.6690672    .293906    -2.28   0.023    -1.245112   -.0930221
   provincedum3 |  -.8795547   .3665555    -2.40   0.016     -1.59799   -.1611191
   provincedum4 |   -.676369   .3089952    -2.19   0.029    -1.281988   -.0707495
   provincedum5 |  -.3495175   .2177749    -1.60   0.109    -.7763486    .0773135
   provincedum6 |  -.3444647    .242541    -1.42   0.156    -.8198363    .1309069
   provincedum7 |  -.6233547   .2625676    -2.37   0.018    -1.137978   -.1087317
   provincedum8 |  -.6015292   .2517291    -2.39   0.017    -1.094909   -.1081493
   provincedum9 |  -.3635166   .2492975    -1.46   0.145    -.8521307    .1250976
  provincedum10 |  -.3312791   .2187673    -1.51   0.130    -.7600551    .0974969
  provincedum11 |  -.5398926    .253698    -2.13   0.033    -1.037132   -.0426537
  provincedum12 |  -.5850716   .2865898    -2.04   0.041    -1.146777    -.023366
  provincedum13 |  -.3828737   .2735779    -1.40   0.162    -.9190766    .1533292
  provincedum14 |  -.6129949   .2449726    -2.50   0.012    -1.093132   -.1328575
  provincedum15 |  -.6766448    .253583    -2.67   0.008    -1.173658   -.1796313
          _cons |   8.223447   .3561623    23.09   0.000     7.525382    8.921512
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .199944  (p = 0.6548)
  Wu-Hausman F(1,411)             =  .186427  (p = 0.6661)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  5.93273  (p = 0.0515)
  Basmann chi2(2)        =   5.5909  (p = 0.0611)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  30.477  Chi-sq(30) P-value = 0.4414

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        441    7.825861    .6317342   5.298317   9.472705
      tenure |        441    5.303855    5.474171          0         25
   tenuresqr |        441    58.02948    100.9859          0        625
birthmont~m2 |        441    .0952381    .2938769          0          1
birthmonth~3 |        441    .0657596     .248143          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        441    .0612245    .2400139          0          1
birthmonth~5 |        441    .0839002     .277553          0          1
birthmonth~6 |        441    .0907029    .2875124          0          1
birthmonth~7 |        441    .0702948    .2559335          0          1
birthmonth~8 |        441    .0952381    .2938769          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        441    .0997732    .3000378          0          1
birthmont~10 |        441    .1156463    .3201635          0          1
birthmont~11 |        441    .0793651    .2706147          0          1
birthmont~12 |        441    .0861678    .2809304          0          1
        male |        441           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/Rural/IV Rural ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Tenure/Rural/IV Rural ATF&Birth Tenure 1979 3years.log
  log type:  text
 closed on:   8 Aug 2024, 12:37:11
---------------------------------------------------------------------------------------------
