---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No co
> ntrol/Urban 1979 Highgen ManualD No Control.log
  log type:  text
 opened on:   6 Aug 2024, 17:29:28

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,431 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(33,372 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(5,190 real changes made)

. 
. *Step Two: Regressions (Three parts Ideally: Firstly rdrobust from birthmonth to earning; S
> econdly rdrobust from birthmonth to higheredu; Thirdly rdrobust*2 or rdrobust+OLS or ivregr
> ess from higheredu to earning. Each part has 6 sheets)
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        931
-------------------+----------------------            BW type       =     Manual
     Number of obs |       491         440            Kernel        =    Uniform
Eff. Number of obs |       491         440            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1686     .08609   1.9584   0.050   -.000132      .337333
    Bias-corrected |  .12468     .08609   1.4482   0.148   -.044055       .29341
            Robust |  .12468     .13614   0.9158   0.360   -.142159      .391513
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2723
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1286        1437            Kernel        =    Uniform
Eff. Number of obs |      1286        1437            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09882     .05336   1.8517   0.064   -.005777      .203408
    Bias-corrected |  .14336     .05336   2.6864   0.007    .038766      .247951
            Robust |  .14336     .07634   1.8779   0.060   -.006268      .292985
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs() 
> kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16190
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8396        7794            Kernel        = Epanechnikov
Eff. Number of obs |      2164        2353            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.859      57.859
       BW bias (b) |    90.142      90.142
         rho (h/b) |     0.642       0.642
        Unique obs |       370         261

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05842     .04499   1.2985   0.194   -.029761       .14661
    Bias-corrected |  .06567     .04499   1.4596   0.144   -.022514      .153856
            Robust |  .06567     .05328   1.2326   0.218   -.038751      .170093
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        625
-------------------+----------------------            BW type       =     Manual
     Number of obs |       319         306            Kernel        =    Uniform
Eff. Number of obs |       319         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08776     .11048   0.7944   0.427   -.128767      .304294
    Bias-corrected |  .10094     .11048   0.9137   0.361   -.115586      .317475
            Robust |  .10094     .16794   0.6011   0.548   -.228214      .430104
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1840
-------------------+----------------------            BW type       =     Manual
     Number of obs |       832        1008            Kernel        =    Uniform
Eff. Number of obs |       832        1008            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13648     .06713   2.0331   0.042    .004907      .268055
    Bias-corrected |  .07932     .06713   1.1816   0.237   -.052251      .210897
            Robust |  .07932     .09729   0.8153   0.415   -.111369      .270015
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10681
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4668        6013            Kernel        = Epanechnikov
Eff. Number of obs |      1452        1785            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.532      60.532
       BW bias (b) |    93.413      93.413
         rho (h/b) |     0.648       0.648
        Unique obs |       320         248

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07891     .05588   1.4121   0.158   -.030612      .188422
    Bias-corrected |  .08682     .05588   1.5538   0.120   -.022698      .196336
            Robust |  .08682     .06638   1.3079   0.191   -.043288      .216927
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        206
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106         100            Kernel        =    Uniform
Eff. Number of obs |       106         100            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05504     .19581   -0.2811  0.779    -.43881      .328733
    Bias-corrected | -.09784     .19581   -0.4997  0.617   -.481612      .285931
            Robust | -.09784     .29606   -0.3305  0.741     -.6781       .48242
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        633
-------------------+----------------------            BW type       =     Manual
     Number of obs |       304         329            Kernel        =    Uniform
Eff. Number of obs |       304         329            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14447     .10962   1.3179   0.188   -.070387      .359318
    Bias-corrected |  .08426     .10962   0.7687   0.442   -.130589      .299117
            Robust |  .08426     .16626   0.5068   0.612   -.241606      .410134
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs() k
> ernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2768
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1164        1604            Kernel        = Epanechnikov
Eff. Number of obs |       556         586            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.606      67.606
       BW bias (b) |   110.967     110.967
         rho (h/b) |     0.609       0.609
        Unique obs |       236         243

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11695      .0842   1.3889   0.165   -.048083      .281979
    Bias-corrected |  .13633      .0842   1.6190   0.105   -.028705      .301356
            Robust |  .13633         .1   1.3633   0.173   -.059663      .332314
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14749     .13264   1.1119   0.266   -.112488      .407463
    Bias-corrected |  .18483     .13264   1.3934   0.163    -.07515      .444801
            Robust |  .18483     .20309   0.9101   0.363   -.213219      .582871
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1207
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         679            Kernel        =    Uniform
Eff. Number of obs |       528         679            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12868     .08285   1.5532   0.120   -.033704      .291055
    Bias-corrected |  .08491     .08285   1.0249   0.305   -.077467      .247292
            Robust |  .08491     .11899   0.7136   0.475   -.148307      .318132
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs() k
> ernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7913
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3504        4409            Kernel        = Epanechnikov
Eff. Number of obs |       984        1321            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.616      62.616
       BW bias (b) |    94.133      94.133
         rho (h/b) |     0.665       0.665
        Unique obs |       315         237

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04352     .06849   0.6355   0.525   -.090714      .177759
    Bias-corrected |  .03947     .06849   0.5763   0.564   -.094766      .173707
            Robust |  .03947     .08157   0.4839   0.628   -.120405      .199347
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        306
-------------------+----------------------            BW type       =     Manual
     Number of obs |       172         134            Kernel        =    Uniform
Eff. Number of obs |       172         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .31437      .1249   2.5170   0.012    .069574      .559162
    Bias-corrected |  .30004      .1249   2.4023   0.016    .055245      .544834
            Robust |  .30004      .2004   1.4972   0.134   -.092737      .692816
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        883
-------------------+----------------------            BW type       =     Manual
     Number of obs |       454         429            Kernel        =    Uniform
Eff. Number of obs |       454         429            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00507     .08353   0.0607   0.952   -.158637      .168775
    Bias-corrected |  .22776     .08353   2.7268   0.006    .064051      .391464
            Robust |  .22776     .11438   1.9912   0.046    .003572      .451943
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==3, covs() k
> ernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5509
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3728        1781            Kernel        = Epanechnikov
Eff. Number of obs |       834         691            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.219      59.219
       BW bias (b) |    91.448      91.448
         rho (h/b) |     0.648       0.648
        Unique obs |       356         245

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00663      .0684   -0.0970  0.923   -.140701      .127436
    Bias-corrected | -.00553      .0684   -0.0808  0.936   -.139594      .128543
            Robust | -.00553     .08163   -0.0677  0.946    -.16552      .154468
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        931
-------------------+----------------------            BW type       =     Manual
     Number of obs |       491         440            Kernel        =    Uniform
Eff. Number of obs |       491         440            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1686     .11339   1.4870   0.137   -.053632      .390834
    Bias-corrected |  .12468     .11339   1.0996   0.272   -.097556       .34691
            Robust |  .12468     .18306   0.6811   0.496   -.234111      .483466
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2723
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1286        1437            Kernel        =    Uniform
Eff. Number of obs |      1286        1437            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09882     .07482   1.3208   0.187    -.04782      .245451
    Bias-corrected |  .14336     .07482   1.9162   0.055   -.003277      .289994
            Robust |  .14336     .10304   1.3913   0.164   -.058592       .34531
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs() 
> kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16190
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8396        7794            Kernel        = Epanechnikov
Eff. Number of obs |      2581        2782            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.632      67.632
       BW bias (b) |    86.015      86.015
         rho (h/b) |     0.786       0.786
        Unique obs |       370         261
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04801     .06848   0.7012   0.483   -.086201      .182227
    Bias-corrected |  .06188     .06848   0.9037   0.366   -.072334      .196094
            Robust |  .06188     .07582   0.8162   0.414    -.08672      .210481
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        625
-------------------+----------------------            BW type       =     Manual
     Number of obs |       319         306            Kernel        =    Uniform
Eff. Number of obs |       319         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08776     .15415   0.5693   0.569   -.214359      .389885
    Bias-corrected |  .10094     .15415   0.6549   0.513   -.201177      .403067
            Robust |  .10094     .23014   0.4386   0.661   -.350112      .552001
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1840
-------------------+----------------------            BW type       =     Manual
     Number of obs |       832        1008            Kernel        =    Uniform
Eff. Number of obs |       832        1008            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13648      .0948   1.4397   0.150   -.049319      .322281
    Bias-corrected |  .07932      .0948   0.8368   0.403   -.106477      .265123
            Robust |  .07932     .12487   0.6352   0.525   -.165422      .324068
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10681
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4668        6013            Kernel        = Epanechnikov
Eff. Number of obs |      1804        2242            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    74.280      74.280
       BW bias (b) |    91.354      91.354
         rho (h/b) |     0.813       0.813
        Unique obs |       320         248
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06224      .0855   0.7279   0.467   -.105344      .229821
    Bias-corrected |  .07749      .0855   0.9062   0.365   -.090096      .245068
            Robust |  .07749     .09432   0.8215   0.411   -.107376      .262348
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        206
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106         100            Kernel        =    Uniform
Eff. Number of obs |       106         100            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05504     .22487   -0.2448  0.807   -.495781      .385704
    Bias-corrected | -.09784     .22487   -0.4351  0.663   -.538582      .342902
            Robust | -.09784     .32434   -0.3017  0.763   -.733542      .537862
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        633
-------------------+----------------------            BW type       =     Manual
     Number of obs |       304         329            Kernel        =    Uniform
Eff. Number of obs |       304         329            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14447     .13825   1.0450   0.296   -.126502      .415433
    Bias-corrected |  .08426     .13825   0.6095   0.542   -.186703      .355231
            Robust |  .08426     .21308   0.3954   0.693   -.333373      .501901
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs() k
> ernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2768
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1164        1604            Kernel        = Epanechnikov
Eff. Number of obs |       565         593            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.497      68.497
       BW bias (b) |   107.644     107.644
         rho (h/b) |     0.636       0.636
        Unique obs |       236         243
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1147     .11266   1.0181   0.309   -.106114      .335514
    Bias-corrected |  .13839     .11266   1.2283   0.219   -.082429      .359199
            Robust |  .13839      .1303   1.0620   0.288   -.117008      .393778
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14749     .14373   1.0261   0.305   -.134225        .4292
    Bias-corrected |  .18483     .14373   1.2859   0.198   -.096887      .466538
            Robust |  .18483     .25374   0.7284   0.466   -.312494      .682145
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1207
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         679            Kernel        =    Uniform
Eff. Number of obs |       528         679            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12868     .09874   1.3031   0.193   -.064861      .322212
    Bias-corrected |  .08491     .09874   0.8599   0.390   -.108624      .278449
            Robust |  .08491      .1233   0.6887   0.491   -.156745      .326569
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs() k
> ernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7913
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3504        4409            Kernel        = Epanechnikov
Eff. Number of obs |      1306        1782            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    81.486      81.486
       BW bias (b) |    91.275      91.275
         rho (h/b) |     0.893       0.893
        Unique obs |       315         237
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04391     .08986   0.4887   0.625   -.132207      .220034
    Bias-corrected |  .04217     .08986   0.4693   0.639   -.133947      .218294
            Robust |  .04217     .09252   0.4558   0.649   -.139162       .22351
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        306
-------------------+----------------------            BW type       =     Manual
     Number of obs |       172         134            Kernel        =    Uniform
Eff. Number of obs |       172         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .31437     .11819   2.6598   0.008    .082716      .546019
    Bias-corrected |  .30004     .11819   2.5386   0.011    .068388      .531691
            Robust |  .30004     .15267   1.9653   0.049    .000821      .599258
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        883
-------------------+----------------------            BW type       =     Manual
     Number of obs |       454         429            Kernel        =    Uniform
Eff. Number of obs |       454         429            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00507     .07103   0.0714   0.943   -.134148      .144286
    Bias-corrected |  .22776     .07103   3.2065   0.001     .08854      .366975
            Robust |  .22776     .11226   2.0289   0.042    .007739      .447776
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==3, covs() k
> ernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5509
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3728        1781            Kernel        = Epanechnikov
Eff. Number of obs |       892         730            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.401      62.401
       BW bias (b) |    89.846      89.846
         rho (h/b) |     0.695       0.695
        Unique obs |       356         245
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00419     .07117   -0.0589  0.953   -.143689      .135308
    Bias-corrected | -.00421     .07117   -0.0592  0.953   -.143712      .135286
            Robust | -.00421     .08109   -0.0520  0.959   -.163152      .154726
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        828
-------------------+----------------------            BW type       =     Manual
     Number of obs |       447         381            Kernel        =    Uniform
Eff. Number of obs |       447         381            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11197     .10102   1.1084   0.268   -.086029      .309966
    Bias-corrected | -.08042     .10102   -0.7961  0.426   -.278418      .117577
            Robust | -.08042      .1872   -0.4296  0.667   -.447327      .286486
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2620
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1242        1378            Kernel        =    Uniform
Eff. Number of obs |      1242        1378            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06886     .05697   1.2088   0.227    -.04279      .180511
    Bias-corrected |  .09239     .05697   1.6219   0.105   -.019259      .204042
            Robust |  .09239     .08627   1.0709   0.284   -.076698      .261481
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16087
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8352        7735            Kernel        = Epanechnikov
Eff. Number of obs |      2263        2429            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.865      60.865
       BW bias (b) |    95.583      95.583
         rho (h/b) |     0.637       0.637
        Unique obs |       369         260

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02781     .04581   0.6072   0.544   -.061963      .117592
    Bias-corrected |  .02752     .04581   0.6009   0.548   -.062255      .117301
            Robust |  .02752     .05518   0.4988   0.618   -.080628      .135674
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01897     .13227   -0.1434  0.886   -.278219      .240271
    Bias-corrected | -.17689     .13227   -1.3374  0.181    -.43614       .08235
            Robust | -.17689     .23703   -0.7463  0.455   -.641462      .287672
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1759
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         963            Kernel        =    Uniform
Eff. Number of obs |       796         963            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11346     .07172   1.5820   0.114   -.027111      .254035
    Bias-corrected | -.00126     .07172   -0.0175  0.986   -.141829      .139317
            Robust | -.00126     .11095   -0.0113  0.991   -.218717      .216204
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10600
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4632        5968            Kernel        = Epanechnikov
Eff. Number of obs |      1463        1837            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.239      62.239
       BW bias (b) |    97.773      97.773
         rho (h/b) |     0.637       0.637
        Unique obs |       319         247

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05044     .05735   0.8795   0.379   -.061962      .162837
    Bias-corrected |  .04891     .05735   0.8529   0.394   -.063488      .161311
            Robust |  .04891     .06925   0.7063   0.480   -.086811      .184634
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05749     .22379   -0.2569  0.797   -.496117      .381127
    Bias-corrected | -.18876     .22379   -0.8435  0.399   -.627382      .249862
            Robust | -.18876     .41513   -0.4547  0.649   -1.00239      .624874
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        605
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         313            Kernel        =    Uniform
Eff. Number of obs |       292         313            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18101     .11294   1.6027   0.109   -.040347      .402376
    Bias-corrected |   .1392     .11294   1.2325   0.218   -.082166      .360557
            Robust |   .1392     .18012   0.7728   0.440    -.21383      .492221
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2740
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1152        1588            Kernel        = Epanechnikov
Eff. Number of obs |       460         497            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.834      57.834
       BW bias (b) |   103.428     103.428
         rho (h/b) |     0.559       0.559
        Unique obs |       235         242

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17178      .0916   1.8753   0.061   -.007757      .351313
    Bias-corrected |  .20126      .0916   2.1972   0.028    .021728      .380798
            Robust |  .20126     .10727   1.8763   0.061   -.008975      .411501
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0163      .1628   -0.1001  0.920   -.335375      .302779
    Bias-corrected | -.20562      .1628   -1.2630  0.207   -.524695      .113459
            Robust | -.20562     .28919   -0.7110  0.477   -.772419      .361183
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         650            Kernel        =    Uniform
Eff. Number of obs |       504         650            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07391      .0899   0.8221   0.411   -.102299      .250121
    Bias-corrected | -.06027      .0899   -0.6704  0.503   -.236482      .115938
            Robust | -.06027     .13916   -0.4331  0.665   -.333029      .212486
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7860
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3480        4380            Kernel        = Epanechnikov
Eff. Number of obs |       930        1214            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.267      60.267
       BW bias (b) |   101.551     101.551
         rho (h/b) |     0.593       0.593
        Unique obs |       314         236

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00432     .07377   -0.0585  0.953   -.148901      .140271
    Bias-corrected | -.02482     .07377   -0.3364  0.737   -.169404      .119768
            Robust | -.02482     .08652   -0.2869  0.774   -.194392      .144755
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        284
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         120            Kernel        =    Uniform
Eff. Number of obs |       164         120            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .28988     .14949   1.9391   0.052   -.003125      .582878
    Bias-corrected |  .19208     .14949   1.2849   0.199   -.100923      .485081
            Robust |  .19208     .29408   0.6531   0.514    -.38431      .768468
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        861
-------------------+----------------------            BW type       =     Manual
     Number of obs |       446         415            Kernel        =    Uniform
Eff. Number of obs |       446         415            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03745     .08997   -0.4163  0.677   -.213784       .13888
    Bias-corrected |  .19034     .08997   2.1157   0.034    .014011      .366676
            Robust |  .19034     .13165   1.4459   0.148   -.067681      .448368
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3720        1767            Kernel        = Epanechnikov
Eff. Number of obs |       847         689            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.487      60.487
       BW bias (b) |    95.764      95.764
         rho (h/b) |     0.632       0.632
        Unique obs |       355         244

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03939     .07142   -0.5515  0.581   -.179371       .10059
    Bias-corrected | -.04316     .07142   -0.6043  0.546   -.183141      .096819
            Robust | -.04316     .08597   -0.5020  0.616   -.211663      .125341
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_co
> de)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        828
-------------------+----------------------            BW type       =     Manual
     Number of obs |       447         381            Kernel        =    Uniform
Eff. Number of obs |       447         381            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11197     .09638   1.1618   0.245   -.076927      .300864
    Bias-corrected | -.08042     .09638   -0.8344  0.404   -.269315      .108475
            Robust | -.08042     .19868   -0.4048  0.686   -.469824      .308983
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_co
> de)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2620
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1242        1378            Kernel        =    Uniform
Eff. Number of obs |      1242        1378            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06886     .07459   0.9231   0.356   -.077342      .215063
    Bias-corrected |  .09239     .07459   1.2386   0.215   -.053811      .238594
            Robust |  .09239      .1023   0.9032   0.366   -.108106       .29289
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16087
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8352        7735            Kernel        = Epanechnikov
Eff. Number of obs |      2626        2805            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.223      69.223
       BW bias (b) |    90.873      90.873
         rho (h/b) |     0.762       0.762
        Unique obs |       369         260
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02253     .06574   0.3427   0.732   -.106312      .151365
    Bias-corrected |  .02223     .06574   0.3381   0.735   -.106611      .151066
            Robust |  .02223     .07237   0.3071   0.759   -.119619      .164073
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster
>  province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01897     .13294   -0.1427  0.887   -.279538      .241591
    Bias-corrected | -.17689     .13294   -1.3306  0.183   -.437459       .08367
            Robust | -.17689      .2588   -0.6835  0.494   -.684127      .330337
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster
>  province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1759
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         963            Kernel        =    Uniform
Eff. Number of obs |       796         963            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11346     .09309   1.2189   0.223   -.068989      .295913
    Bias-corrected | -.00126     .09309   -0.0135  0.989   -.183707      .181195
            Robust | -.00126     .11591   -0.0108  0.991   -.228428      .225916
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_co
> de)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10600
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4632        5968            Kernel        = Epanechnikov
Eff. Number of obs |      1768        2197            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    74.567      74.567
       BW bias (b) |    92.465      92.465
         rho (h/b) |     0.806       0.806
        Unique obs |       319         247
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03997     .08451   0.4729   0.636   -.125679      .205609
    Bias-corrected |  .04315     .08451   0.5106   0.610   -.122491      .208797
            Robust |  .04315     .09349   0.4616   0.644   -.140088      .226395
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05749     .17902   -0.3212  0.748    -.40837      .293381
    Bias-corrected | -.18876     .17902   -1.0544  0.292   -.539635      .162116
            Robust | -.18876     .39962   -0.4724  0.637   -.971995      .594475
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        605
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         313            Kernel        =    Uniform
Eff. Number of obs |       292         313            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18101     .11521   1.5712   0.116   -.044792      .406822
    Bias-corrected |   .1392     .11521   1.2082   0.227   -.086612      .365003
            Robust |   .1392     .18044   0.7714   0.440   -.214462      .492853
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2740
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1152        1588            Kernel        = Epanechnikov
Eff. Number of obs |       438         478            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.260      54.260
       BW bias (b) |   100.507     100.507
         rho (h/b) |     0.540       0.540
        Unique obs |       235         242
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18151     .10442   1.7383   0.082   -.023146      .386157
    Bias-corrected |  .21125     .10442   2.0231   0.043    .006594      .415897
            Robust |  .21125     .11955   1.7670   0.077   -.023063      .445554
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0163     .15064   -0.1082  0.914   -.311539      .278944
    Bias-corrected | -.20562     .15064   -1.3650  0.172   -.500859      .089624
            Robust | -.20562     .30438   -0.6755  0.499   -.802195      .390959
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         650            Kernel        =    Uniform
Eff. Number of obs |       504         650            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07391     .10696   0.6910   0.490   -.135735      .283556
    Bias-corrected | -.06027     .10696   -0.5635  0.573   -.269917      .149374
            Robust | -.06027     .13872   -0.4345  0.664   -.332157      .211613
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7860
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3480        4380            Kernel        = Epanechnikov
Eff. Number of obs |      1168        1582            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    74.615      74.615
       BW bias (b) |    98.794      98.794
         rho (h/b) |     0.755       0.755
        Unique obs |       314         236
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0005      .0963   0.0052   0.996   -.188245      .189245
    Bias-corrected | -.03035      .0963   -0.3152  0.753   -.219095      .158394
            Robust | -.03035     .10512   -0.2887  0.773   -.236383      .175682
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        284
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         120            Kernel        =    Uniform
Eff. Number of obs |       164         120            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .28988     .15203   1.9067   0.057   -.008094      .587847
    Bias-corrected |  .19208     .15203   1.2634   0.206   -.105891      .490049
            Robust |  .19208     .20471   0.9383   0.348   -.209142        .5933
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        861
-------------------+----------------------            BW type       =     Manual
     Number of obs |       446         415            Kernel        =    Uniform
Eff. Number of obs |       446         415            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03745     .07349   -0.5097  0.610   -.181482      .106578
    Bias-corrected |  .19034     .07349   2.5902   0.010    .046314      .334373
            Robust |  .19034     .12247   1.5542   0.120   -.049688      .430375
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3720        1767            Kernel        = Epanechnikov
Eff. Number of obs |       903         724            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.738      63.738
       BW bias (b) |    97.876      97.876
         rho (h/b) |     0.651       0.651
        Unique obs |       355         244
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03592      .0691   -0.5199  0.603   -.171344      .099504
    Bias-corrected | -.03865      .0691   -0.5593  0.576   -.174069      .096779
            Robust | -.03865     .08152   -0.4740  0.635   -.198425      .121135
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        723
-------------------+----------------------            BW type       =     Manual
     Number of obs |       399         324            Kernel        =    Uniform
Eff. Number of obs |       399         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14519      .1361   1.0668   0.286   -.121567       .41194
    Bias-corrected | -.21073      .1361   -1.5484  0.122   -.477488      .056019
            Robust | -.21073     .32425   -0.6499  0.516   -.846249       .42478
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2515
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1194        1321            Kernel        =    Uniform
Eff. Number of obs |      1194        1321            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06899     .06315   1.0925   0.275   -.054781      .192764
    Bias-corrected |  .10327     .06315   1.6354   0.102   -.020498      .227047
            Robust |  .10327     .10623   0.9722   0.331   -.104937      .311485
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15982
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8304        7678            Kernel        = Epanechnikov
Eff. Number of obs |      2215        2372            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.130      60.130
       BW bias (b) |    97.824      97.824
         rho (h/b) |     0.615       0.615
        Unique obs |       368         259

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02257     .04949   0.4560   0.648   -.074423      .119558
    Bias-corrected |  .02003     .04949   0.4048   0.686   -.076958      .117022
            Robust |  .02003     .06019   0.3328   0.739   -.097946       .13801
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   -.044     .18167   -0.2422  0.809   -.400062      .312053
    Bias-corrected | -.53065     .18167   -2.9211  0.003   -.886711     -.174596
            Robust | -.53065     .44459   -1.1936  0.233   -1.40203      .340721
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1688
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         928            Kernel        =    Uniform
Eff. Number of obs |       760         928            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12789     .07941   1.6106   0.107   -.027742      .283527
    Bias-corrected | -.01029     .07941   -0.1295  0.897   -.165922      .145348
            Robust | -.01029     .13787   -0.0746  0.941   -.280514      .259941
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10529
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4596        5933            Kernel        = Epanechnikov
Eff. Number of obs |      1380        1705            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.576      60.576
       BW bias (b) |    98.459      98.459
         rho (h/b) |     0.615       0.615
        Unique obs |       318         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05619     .06244   0.9000   0.368   -.066177      .178564
    Bias-corrected |   .0544     .06244   0.8713   0.384   -.067969      .176772
            Robust |   .0544     .07615   0.7144   0.475   -.094844      .203646
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.15818     .27936   -0.5662  0.571   -.705721      .389354
    Bias-corrected | -.83265     .27936   -2.9806  0.003   -1.38019     -.285112
            Robust | -.83265     .70973   -1.1732  0.241   -2.22369      .558389
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        587
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         306            Kernel        =    Uniform
Eff. Number of obs |       281         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18586     .12081   1.5384   0.124    -.05093      .422648
    Bias-corrected |  .14827     .12081   1.2272   0.220   -.088521      .385056
            Robust |  .14827     .20613   0.7193   0.472   -.255746      .552281
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2722
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1141        1581            Kernel        = Epanechnikov
Eff. Number of obs |       456         501            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.099      58.099
       BW bias (b) |   105.635     105.635
         rho (h/b) |     0.550       0.550
        Unique obs |       234         241

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17359     .09559   1.8160   0.069   -.013758      .360945
    Bias-corrected |  .20338     .09559   2.1277   0.033    .016031      .390734
            Robust |  .20338     .11282   1.8027   0.071   -.017746       .42451
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01553      .2332   0.0666   0.947   -.441528      .472592
    Bias-corrected | -.43793      .2332   -1.8779  0.060   -.894992      .019128
            Robust | -.43793     .55369   -0.7909  0.429   -1.52314      .647279
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1101
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         622            Kernel        =    Uniform
Eff. Number of obs |       479         622            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09675     .10099   0.9579   0.338   -.101196      .294688
    Bias-corrected | -.06582     .10099   -0.6517  0.515   -.263758      .132127
            Robust | -.06582     .17899   -0.3677  0.713   -.416631         .285
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7807
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3455        4352            Kernel        = Epanechnikov
Eff. Number of obs |       856        1144            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.057      58.057
       BW bias (b) |    99.623      99.623
         rho (h/b) |     0.583       0.583
        Unique obs |       313         235

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00054     .08174   0.0066   0.995   -.159659      .160742
    Bias-corrected | -.02017     .08174   -0.2467  0.805   -.180366      .140035
            Robust | -.02017      .0974   -0.2070  0.836   -.211073      .170742
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        250
-------------------+----------------------            BW type       =     Manual
     Number of obs |       152          98            Kernel        =    Uniform
Eff. Number of obs |       152          98            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .32183     .20741   1.5517   0.121   -.084679      .728343
    Bias-corrected |  .21516     .20741   1.0374   0.300   -.191351       .62167
            Robust |  .21516      .5052   0.4259   0.670    -.77501      1.20533
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        827
-------------------+----------------------            BW type       =     Manual
     Number of obs |       434         393            Kernel        =    Uniform
Eff. Number of obs |       434         393            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0902     .10192   -0.8850  0.376   -.289959      .109556
    Bias-corrected |  .16697     .10192   1.6383   0.101   -.032788      .366726
            Robust |  .16697     .16698   0.9999   0.317   -.160305      .494243
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5453
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3708        1745            Kernel        = Epanechnikov
Eff. Number of obs |       851         682            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.050      61.050
       BW bias (b) |   101.681     101.681
         rho (h/b) |     0.600       0.600
        Unique obs |       354         243

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07829     .07734   -1.0124  0.311   -.229873      .073284
    Bias-corrected | -.08832     .07734   -1.1421  0.253   -.239903      .063255
            Robust | -.08832     .09383   -0.9413  0.347   -.272234      .095586
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_co
> de)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        723
-------------------+----------------------            BW type       =     Manual
     Number of obs |       399         324            Kernel        =    Uniform
Eff. Number of obs |       399         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14519      .1187   1.2231   0.221   -.087463      .377836
    Bias-corrected | -.21073      .1187   -1.7753  0.076   -.443384      .021915
            Robust | -.21073     .30343   -0.6945  0.487   -.805456      .383987
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_co
> de)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2515
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1194        1321            Kernel        =    Uniform
Eff. Number of obs |      1194        1321            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06899     .07927   0.8704   0.384   -.086369      .224352
    Bias-corrected |  .10327     .07927   1.3029   0.193   -.052086      .258635
            Robust |  .10327     .11134   0.9276   0.354   -.114946      .321495
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15982
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8304        7678            Kernel        = Epanechnikov
Eff. Number of obs |      2409        2603            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.429      65.429
       BW bias (b) |    92.754      92.754
         rho (h/b) |     0.705       0.705
        Unique obs |       368         259
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01897     .06839   0.2773   0.782   -.115074      .153004
    Bias-corrected |  .01634     .06839   0.2390   0.811   -.117697      .150381
            Robust |  .01634     .07738   0.2112   0.833   -.135324      .168008
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster
>  province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   -.044     .16546   -0.2660  0.790   -.368299       .28029
    Bias-corrected | -.53065     .16546   -3.2071  0.001   -.854948     -.206359
            Robust | -.53065     .43438   -1.2216  0.222   -1.38203      .320725
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster
>  province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1688
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         928            Kernel        =    Uniform
Eff. Number of obs |       760         928            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12789     .09898   1.2921   0.196     -.0661      .321885
    Bias-corrected | -.01029     .09898   -0.1039  0.917    -.20428      .183706
            Robust | -.01029      .1417   -0.0726  0.942   -.288011      .267437
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_co
> de)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10529
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4596        5933            Kernel        = Epanechnikov
Eff. Number of obs |      1570        1956            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.015      68.015
       BW bias (b) |    95.338      95.338
         rho (h/b) |     0.713       0.713
        Unique obs |       318         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04288     .08957   0.4787   0.632   -.132681      .218445
    Bias-corrected |  .04384     .08957   0.4894   0.625   -.131722      .219404
            Robust |  .04384     .10308   0.4253   0.671   -.158196      .245878
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.15818     .22471   -0.7039  0.481   -.598614      .282247
    Bias-corrected | -.83265     .22471   -3.7054  0.000   -1.27308     -.392219
            Robust | -.83265     .71898   -1.1581  0.247   -2.24183      .576532
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        587
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         306            Kernel        =    Uniform
Eff. Number of obs |       281         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18586       .134   1.3870   0.165   -.076777      .448495
    Bias-corrected |  .14827       .134   1.1065   0.269   -.114369      .410904
            Robust |  .14827      .2268   0.6537   0.513   -.296253      .592788
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2722
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1141        1581            Kernel        = Epanechnikov
Eff. Number of obs |       456         501            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.523      58.523
       BW bias (b) |   107.466     107.466
         rho (h/b) |     0.545       0.545
        Unique obs |       234         241
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17178      .1089   1.5774   0.115   -.041664      .385228
    Bias-corrected |  .19897      .1089   1.8271   0.068   -.014471      .412421
            Robust |  .19897     .12444   1.5989   0.110   -.044926      .442875
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01553     .17648   0.0880   0.930   -.330368      .361431
    Bias-corrected | -.43793     .17648   -2.4814  0.013   -.783832     -.092033
            Robust | -.43793     .51411   -0.8518  0.394   -1.44557      .569701
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1101
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         622            Kernel        =    Uniform
Eff. Number of obs |       479         622            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09675      .1119   0.8646   0.387   -.122574      .316066
    Bias-corrected | -.06582      .1119   -0.5882  0.556   -.285135      .153505
            Robust | -.06582      .1656   -0.3974  0.691   -.390394      .258763
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7807
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3455        4352            Kernel        = Epanechnikov
Eff. Number of obs |      1028        1386            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.175      68.175
       BW bias (b) |    98.227      98.227
         rho (h/b) |     0.694       0.694
        Unique obs |       313         235
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00433      .1014   -0.0427  0.966    -.20307      .194402
    Bias-corrected | -.03231      .1014   -0.3186  0.750   -.231043      .166429
            Robust | -.03231     .11461   -0.2819  0.778   -.256943       .19233
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        250
-------------------+----------------------            BW type       =     Manual
     Number of obs |       152          98            Kernel        =    Uniform
Eff. Number of obs |       152          98            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .32183     .23054   1.3960   0.163   -.130022      .773687
    Bias-corrected |  .21516     .23054   0.9333   0.351   -.236695      .667014
            Robust |  .21516     .48174   0.4466   0.655   -.729041      1.15936
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        827
-------------------+----------------------            BW type       =     Manual
     Number of obs |       434         393            Kernel        =    Uniform
Eff. Number of obs |       434         393            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0902      .0829   -1.0881  0.277   -.252682      .072279
    Bias-corrected |  .16697      .0829   2.0141   0.044    .004488       .32945
            Robust |  .16697     .13312   1.2543   0.210   -.093939      .427877
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5453
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3708        1745            Kernel        = Epanechnikov
Eff. Number of obs |       891         702            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.529      63.529
       BW bias (b) |   103.909     103.909
         rho (h/b) |     0.611       0.611
        Unique obs |       354         243
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07338     .07316   -1.0030  0.316   -.216778      .070011
    Bias-corrected | -.08124     .07316   -1.1104  0.267   -.224632      .062157
            Robust | -.08124      .0883   -0.9200  0.358   -.254298      .091822
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Earning
>  Sheet 6 results.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *2_2) RDD Higheredu t
. 
. *2_2_1) rdrobust on higheredu, sheet 1, no province no omitting local variables
. 
. **2_2_1_1 Pooled 
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        931
-------------------+----------------------            BW type       =     Manual
     Number of obs |       491         440            Kernel        =    Uniform
Eff. Number of obs |       491         440            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07655     .04788   1.5988   0.110   -.017293      .170385
    Bias-corrected |  .02616     .04788   0.5463   0.585   -.067681      .119997
            Robust |  .02616     .07427   0.3522   0.725   -.119402      .171718
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", replace ctitle(no province no 
> local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2723
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1286        1437            Kernel        =    Uniform
Eff. Number of obs |      1286        1437            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02552     .02887   0.8839   0.377    -.03107       .08211
    Bias-corrected |  .04993     .02887   1.7293   0.084   -.006661      .106519
            Robust |  .04993     .04194   1.1905   0.234   -.032271       .13213
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat != ., covs() kernel(epa)
>  p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16190
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8396        7794            Kernel        = Epanechnikov
Eff. Number of obs |      1955        2160            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.815      52.815
       BW bias (b) |    90.435      90.435
         rho (h/b) |     0.584       0.584
        Unique obs |       370         261

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01136     .02538   0.4476   0.654    -.03838      .061097
    Bias-corrected |  .00388     .02538   0.1529   0.878   -.045858      .053619
            Robust |  .00388     .02931   0.1324   0.895   -.053575      .061336
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        625
-------------------+----------------------            BW type       =     Manual
     Number of obs |       319         306            Kernel        =    Uniform
Eff. Number of obs |       319         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09445     .06629   1.4249   0.154   -.035471      .224371
    Bias-corrected |  .08857     .06629   1.3361   0.182   -.041351       .21849
            Robust |  .08857     .09644   0.9184   0.358   -.100442      .277582
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1840
-------------------+----------------------            BW type       =     Manual
     Number of obs |       832        1008            Kernel        =    Uniform
Eff. Number of obs |       832        1008            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03156      .0406   0.7774   0.437   -.048012      .111136
    Bias-corrected |  .04357      .0406   1.0730   0.283   -.036009       .12314
            Robust |  .04357      .0586   0.7434   0.457   -.071288      .158419
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat==2), covs()
>  kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10681
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4668        6013            Kernel        = Epanechnikov
Eff. Number of obs |      1215        1508            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    51.452      51.452
       BW bias (b) |    88.177      88.177
         rho (h/b) |     0.584       0.584
        Unique obs |       320         248

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01259     .03627   0.3473   0.728   -.058487      .083676
    Bias-corrected |  .00174     .03627   0.0478   0.962   -.069346      .072817
            Robust |  .00174     .04181   0.0415   0.967   -.080203      .083674
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_3 SecVoc
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        206
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106         100            Kernel        =    Uniform
Eff. Number of obs |       106         100            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01123      .0334   0.3363   0.737   -.054224      .076687
    Bias-corrected | -.01828      .0334   -0.5474  0.584   -.083737      .047173
            Robust | -.01828      .0252   -0.7254  0.468   -.067678      .031113
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        633
-------------------+----------------------            BW type       =     Manual
     Number of obs |       304         329            Kernel        =    Uniform
Eff. Number of obs |       304         329            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01942      .0241   0.8059   0.420   -.027816      .066665
    Bias-corrected |   .0205      .0241   0.8506   0.395   -.026737      .067743
            Robust |   .0205     .03723   0.5507   0.582   -.052473      .093479
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==1, covs() kernel(epa) 
> p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2768
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1164        1604            Kernel        = Epanechnikov
Eff. Number of obs |       479         524            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.812      58.812
       BW bias (b) |    98.672      98.672
         rho (h/b) |     0.596       0.596
        Unique obs |       236         243

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00802     .01878   0.4269   0.669   -.028797      .044835
    Bias-corrected |   .0056     .01878   0.2982   0.766   -.031214      .042418
            Robust |   .0056     .02238   0.2503   0.802   -.038262      .049466
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_4 SecGen
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12716     .08806   1.4441   0.149   -.045426      .299746
    Bias-corrected |  .12463     .08806   1.4154   0.157   -.047952       .29722
            Robust |  .12463     .12953   0.9622   0.336   -.129244      .378511
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1207
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         679            Kernel        =    Uniform
Eff. Number of obs |       528         679            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03237     .05491   0.5895   0.556   -.075251      .139983
    Bias-corrected |  .06952     .05491   1.2662   0.205   -.038094       .17714
            Robust |  .06952     .07853   0.8853   0.376   -.084396      .223441
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==2, covs() kernel(epa) 
> p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7913
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3504        4409            Kernel        = Epanechnikov
Eff. Number of obs |       759         996            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.353      49.353
       BW bias (b) |    84.670      84.670
         rho (h/b) |     0.583       0.583
        Unique obs |       315         237

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01034     .05001   0.2067   0.836   -.087681      .108357
    Bias-corrected | -.00421     .05001   -0.0842  0.933   -.102231      .093806
            Robust | -.00421     .05736   -0.0734  0.941   -.116631      .108206
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_5 SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        306
-------------------+----------------------            BW type       =     Manual
     Number of obs |       172         134            Kernel        =    Uniform
Eff. Number of obs |       172         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        883
-------------------+----------------------            BW type       =     Manual
     Number of obs |       454         429            Kernel        =    Uniform
Eff. Number of obs |       454         429            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==3, covs() kernel(epa) 
> p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5509
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3728        1781            Kernel        = Epanechnikov
Eff. Number of obs |      3727        1781            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       356         245

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 1 results.xls
dir : seeout

. 
. *2_2_2) rdrobust on higheredu, sheet 2, province-clustered no omitting local variables
. 
. **2_2_2_1 Pooled 
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        931
-------------------+----------------------            BW type       =     Manual
     Number of obs |       491         440            Kernel        =    Uniform
Eff. Number of obs |       491         440            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07655     .06064   1.2623   0.207   -.042309      .195401
    Bias-corrected |  .02616     .06064   0.4314   0.666   -.092697      .145013
            Robust |  .02616     .08707   0.3004   0.764   -.144503      .196819
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", replace ctitle(province-cluste
> red no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2723
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1286        1437            Kernel        =    Uniform
Eff. Number of obs |      1286        1437            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02552     .04515   0.5652   0.572   -.062972      .114012
    Bias-corrected |  .04993     .04515   1.1059   0.269   -.038563      .138422
            Robust |  .04993     .05002   0.9981   0.318   -.048112      .147971
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat != ., covs() kernel(epa)
>  p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16190
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8396        7794            Kernel        = Epanechnikov
Eff. Number of obs |      2727        2904            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.785      70.785
       BW bias (b) |    99.283      99.283
         rho (h/b) |     0.713       0.713
        Unique obs |       370         261
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01989     .03312   0.6006   0.548   -.045021      .084802
    Bias-corrected |  .00578     .03312   0.1746   0.861   -.059128      .070695
            Robust |  .00578     .03478   0.1663   0.868   -.062376      .073943
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        625
-------------------+----------------------            BW type       =     Manual
     Number of obs |       319         306            Kernel        =    Uniform
Eff. Number of obs |       319         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09445     .08139   1.1604   0.246   -.065076      .253976
    Bias-corrected |  .08857     .08139   1.0882   0.277   -.070956      .248095
            Robust |  .08857     .11413   0.7760   0.438   -.135128      .312268
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1840
-------------------+----------------------            BW type       =     Manual
     Number of obs |       832        1008            Kernel        =    Uniform
Eff. Number of obs |       832        1008            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03156     .05804   0.5438   0.587   -.082196      .145321
    Bias-corrected |  .04357     .05804   0.7506   0.453   -.070193      .157324
            Robust |  .04357     .06373   0.6836   0.494   -.081349      .168481
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat==2), covs()
>  kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10681
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4668        6013            Kernel        = Epanechnikov
Eff. Number of obs |      1519        1908            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.987      63.987
       BW bias (b) |    94.777      94.777
         rho (h/b) |     0.675       0.675
        Unique obs |       320         248
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02086     .04529   0.4607   0.645   -.067897      .109622
    Bias-corrected |  .00375     .04529   0.0827   0.934   -.085013      .092506
            Robust |  .00375     .04985   0.0752   0.940   -.093956      .101449
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_3 SecVoc
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        206
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106         100            Kernel        =    Uniform
Eff. Number of obs |       106         100            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01123     .03117   0.3604   0.719   -.049854      .072317
    Bias-corrected | -.01828     .03117   -0.5866  0.557   -.079368      .042803
            Robust | -.01828     .02598   -0.7038  0.482   -.069193      .032629
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        633
-------------------+----------------------            BW type       =     Manual
     Number of obs |       304         329            Kernel        =    Uniform
Eff. Number of obs |       304         329            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01942     .02333   0.8327   0.405   -.026298      .065146
    Bias-corrected |   .0205     .02333   0.8789   0.379   -.025219      .066225
            Robust |   .0205     .03463   0.5920   0.554    -.04738      .088386
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==1, covs() kernel(epa) 
> p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2768
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1164        1604            Kernel        = Epanechnikov
Eff. Number of obs |       442         487            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.863      53.863
       BW bias (b) |    92.881      92.881
         rho (h/b) |     0.580       0.580
        Unique obs |       236         243
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01014     .01833   0.5534   0.580   -.025782      .046072
    Bias-corrected |  .00799     .01833   0.4361   0.663   -.027933      .043921
            Robust |  .00799     .02143   0.3730   0.709   -.034013      .050001
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_4 SecGen
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12716     .10223   1.2439   0.214   -.073208      .327528
    Bias-corrected |  .12463     .10223   1.2191   0.223   -.075734      .325001
            Robust |  .12463      .1476   0.8444   0.398    -.16466      .413927
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1207
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         679            Kernel        =    Uniform
Eff. Number of obs |       528         679            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03237     .07173   0.4512   0.652   -.108224      .172957
    Bias-corrected |  .06952     .07173   0.9692   0.332   -.071068      .210113
            Robust |  .06952     .08332   0.8344   0.404    -.09378      .232826
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==2, covs() kernel(epa) 
> p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7913
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3504        4409            Kernel        = Epanechnikov
Eff. Number of obs |       924        1218            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.695      59.695
       BW bias (b) |    87.685      87.685
         rho (h/b) |     0.681       0.681
        Unique obs |       315         237
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01677     .05951   0.2819   0.778   -.099861      .133409
    Bias-corrected | -.00614     .05951   -0.1032  0.918   -.122777      .110493
            Robust | -.00614     .06565   -0.0936  0.925   -.134816      .122533
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_5 SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        306
-------------------+----------------------            BW type       =     Manual
     Number of obs |       172         134            Kernel        =    Uniform
Eff. Number of obs |       172         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        883
-------------------+----------------------            BW type       =     Manual
     Number of obs |       454         429            Kernel        =    Uniform
Eff. Number of obs |       454         429            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==3, covs() kernel(epa) 
> p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5509
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3728        1781            Kernel        = Epanechnikov
Eff. Number of obs |      3727        1781            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       356         245
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 2 results.xls
dir : seeout

. 
. *2_2_3) rdrobust on higheredu, sheet 3, no province no Aug-Sep
. 
. **2_2_3_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        828
-------------------+----------------------            BW type       =     Manual
     Number of obs |       447         381            Kernel        =    Uniform
Eff. Number of obs |       447         381            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08266     .05628   1.4688   0.142   -.027645      .192973
    Bias-corrected |  .02602     .05628   0.4624   0.644   -.084286      .136333
            Robust |  .02602     .10432   0.2494   0.803   -.178448      .230495
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", replace ctitle(no province no 
> Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2620
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1242        1378            Kernel        =    Uniform
Eff. Number of obs |      1242        1378            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0185     .03063   0.6039   0.546   -.041535      .078528
    Bias-corrected |   .0482     .03063   1.5737   0.116    -.01183      .108233
            Robust |   .0482     .04729   1.0194   0.308   -.044478      .140881
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16087
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8352        7735            Kernel        = Epanechnikov
Eff. Number of obs |      1744        1921            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    48.240      48.240
       BW bias (b) |    85.869      85.869
         rho (h/b) |     0.562       0.562
        Unique obs |       369         260

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00427     .02777   0.1539   0.878   -.050163      .058713
    Bias-corrected | -.00399     .02777   -0.1437  0.886   -.058428      .050448
            Robust | -.00399     .03227   -0.1237  0.902   -.067236      .059255
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09508     .08359   1.1374   0.255   -.068765      .258919
    Bias-corrected |  .11681     .08359   1.3974   0.162   -.047028      .280657
            Robust |  .11681     .15022   0.7776   0.437   -.177603      .411232
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1759
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         963            Kernel        =    Uniform
Eff. Number of obs |       796         963            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02047     .04407   0.4646   0.642   -.065904      .106852
    Bias-corrected |  .02622     .04407   0.5950   0.552   -.060157      .112599
            Robust |  .02622     .06964   0.3765   0.707   -.110261      .162703
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10600
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4632        5968            Kernel        = Epanechnikov
Eff. Number of obs |      1068        1332            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.278      47.278
       BW bias (b) |    84.518      84.518
         rho (h/b) |     0.559       0.559
        Unique obs |       319         247

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00027      .0405   0.0067   0.995    -.07911      .079657
    Bias-corrected | -.01202      .0405   -0.2967  0.767   -.091399      .067368
            Robust | -.01202     .04708   -0.2552  0.799   -.104299      .080268
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03045      .0581   0.5241   0.600   -.083417      .144312
    Bias-corrected | -.05045      .0581   -0.8684  0.385   -.164316      .063413
            Robust | -.05045     .07997   -0.6309  0.528    -.20718      .106278
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        605
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         313            Kernel        =    Uniform
Eff. Number of obs |       292         313            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02362     .02908   0.8120   0.417   -.033385      .080616
    Bias-corrected |  .03538     .02908   1.2164   0.224   -.021623      .092378
            Robust |  .03538     .05495   0.6439   0.520   -.072315      .143069
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2740
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1152        1588            Kernel        = Epanechnikov
Eff. Number of obs |       494         537            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.821      61.821
       BW bias (b) |   107.570     107.570
         rho (h/b) |     0.575       0.575
        Unique obs |       235         242

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0089     .02104   0.4229   0.672   -.032344       .05014
    Bias-corrected |  .00535     .02104   0.2543   0.799    -.03589      .046594
            Robust |  .00535     .02536   0.2111   0.833   -.044348      .055052
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11015     .10953   1.0056   0.315   -.104527      .324819
    Bias-corrected |  .12007     .10953   1.0963   0.273   -.094601      .334745
            Robust |  .12007     .19572   0.6135   0.540   -.263536      .503681
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         650            Kernel        =    Uniform
Eff. Number of obs |       504         650            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01024     .05958   0.1719   0.863   -.106525      .127013
    Bias-corrected |  .03736     .05958   0.6270   0.531   -.079412      .154126
            Robust |  .03736     .09278   0.4027   0.687   -.144481      .219195
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7860
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3480        4380            Kernel        = Epanechnikov
Eff. Number of obs |       608         845            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    43.863      43.863
       BW bias (b) |    80.054      80.054
         rho (h/b) |     0.548       0.548
        Unique obs |       314         236

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0071     .05691   -0.1247  0.901   -.118639      .104446
    Bias-corrected | -.02541     .05691   -0.4466  0.655   -.136956      .086129
            Robust | -.02541     .06545   -0.3883  0.698   -.153688       .10286
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        284
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         120            Kernel        =    Uniform
Eff. Number of obs |       164         120            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        861
-------------------+----------------------            BW type       =     Manual
     Number of obs |       446         415            Kernel        =    Uniform
Eff. Number of obs |       446         415            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3720        1767            Kernel        = Epanechnikov
Eff. Number of obs |      3719        1767            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       355         244

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 3 results.xls
dir : seeout

. 
. *2_2_4) rdrobust on higheredu, sheet 4, province-clustered no Aug-Sep
. 
. **2_2_4_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        828
-------------------+----------------------            BW type       =     Manual
     Number of obs |       447         381            Kernel        =    Uniform
Eff. Number of obs |       447         381            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08266     .06391   1.2935   0.196   -.042592       .20792
    Bias-corrected |  .02602     .06391   0.4072   0.684   -.099233       .15128
            Robust |  .02602     .09013   0.2887   0.773   -.150633       .20268
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", replace ctitle(province-cluste
> red no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2620
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1242        1378            Kernel        =    Uniform
Eff. Number of obs |      1242        1378            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0185      .0467   0.3960   0.692   -.073042      .110035
    Bias-corrected |   .0482      .0467   1.0321   0.302   -.043338       .13974
            Robust |   .0482     .05285   0.9120   0.362   -.055386      .151789
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16087
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8352        7735            Kernel        = Epanechnikov
Eff. Number of obs |      2304        2505            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.645      61.645
       BW bias (b) |    90.299      90.299
         rho (h/b) |     0.683       0.683
        Unique obs |       369         260
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00903     .03555   0.2539   0.800   -.060646      .078699
    Bias-corrected |  -.0053     .03555   -0.1490  0.882   -.074971      .064374
            Robust |  -.0053     .03866   -0.1370  0.891   -.081078      .070481
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster province_c
> ode)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09508     .08469   1.1226   0.262   -.070915      .261069
    Bias-corrected |  .11681     .08469   1.3793   0.168   -.049178      .282806
            Robust |  .11681     .12508   0.9339   0.350   -.128334      .361962
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster province_c
> ode)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1759
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         963            Kernel        =    Uniform
Eff. Number of obs |       796         963            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02047      .0607   0.3373   0.736   -.098491      .139439
    Bias-corrected |  .02622      .0607   0.4320   0.666   -.092744      .145186
            Robust |  .02622     .06865   0.3819   0.703   -.108334      .160776
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10600
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4632        5968            Kernel        = Epanechnikov
Eff. Number of obs |      1257        1545            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.665      54.665
       BW bias (b) |    87.854      87.854
         rho (h/b) |     0.622       0.622
        Unique obs |       319         247
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00114     .04967   0.0229   0.982   -.096215      .098493
    Bias-corrected | -.01655     .04967   -0.3331  0.739     -.1139      .080808
            Robust | -.01655     .05621   -0.2944  0.768   -.126717      .093625
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03045     .05239   0.5812   0.561   -.072235       .13313
    Bias-corrected | -.05045     .05239   -0.9630  0.336   -.153134      .052231
            Robust | -.05045     .08118   -0.6215  0.534   -.209562       .10866
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        605
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         313            Kernel        =    Uniform
Eff. Number of obs |       292         313            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02362     .02778   0.8502   0.395   -.030824      .078055
    Bias-corrected |  .03538     .02778   1.2737   0.203   -.019062      .089817
            Robust |  .03538     .05078   0.6966   0.486   -.064154      .134909
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2740
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1152        1588            Kernel        = Epanechnikov
Eff. Number of obs |       456         497            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.777      56.777
       BW bias (b) |    99.041      99.041
         rho (h/b) |     0.573       0.573
        Unique obs |       235         242
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01069     .02093   0.5105   0.610   -.030341      .051715
    Bias-corrected |   .0081     .02093   0.3872   0.699   -.032923      .049133
            Robust |   .0081     .02478   0.3270   0.744   -.040468      .056677
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11015     .10384   1.0607   0.289   -.093373      .313664
    Bias-corrected |  .12007     .10384   1.1563   0.248   -.083446      .323591
            Robust |  .12007     .17048   0.7043   0.481   -.214068      .454213
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         650            Kernel        =    Uniform
Eff. Number of obs |       504         650            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01024     .07646   0.1340   0.893   -.139623      .160111
    Bias-corrected |  .03736     .07646   0.4886   0.625    -.11251      .187224
            Robust |  .03736      .0952   0.3924   0.695   -.149233      .223947
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7860
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3480        4380            Kernel        = Epanechnikov
Eff. Number of obs |       754         992            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.356      50.356
       BW bias (b) |    81.730      81.730
         rho (h/b) |     0.616       0.616
        Unique obs |       314         236
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0139     .06764   -0.2055  0.837   -.146476      .118681
    Bias-corrected | -.03743     .06764   -0.5534  0.580    -.17001      .095147
            Robust | -.03743     .07691   -0.4867  0.626   -.188174      .113312
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        284
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         120            Kernel        =    Uniform
Eff. Number of obs |       164         120            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        861
-------------------+----------------------            BW type       =     Manual
     Number of obs |       446         415            Kernel        =    Uniform
Eff. Number of obs |       446         415            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3720        1767            Kernel        = Epanechnikov
Eff. Number of obs |      3719        1767            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       355         244
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 4 results.xls
dir : seeout

. 
. *2_2_5) rdrobust on higheredu, sheet 5, no province no July-Oct
. 
. **2_2_5_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        723
-------------------+----------------------            BW type       =     Manual
     Number of obs |       399         324            Kernel        =    Uniform
Eff. Number of obs |       399         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11149     .07105   1.5691   0.117   -.027773      .250743
    Bias-corrected |  .08443     .07105   1.1882   0.235   -.054832      .223684
            Robust |  .08443     .15932   0.5299   0.596   -.227843      .396696
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", replace ctitle(no province no 
> July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2515
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1194        1321            Kernel        =    Uniform
Eff. Number of obs |      1194        1321            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01665     .03318   0.5018   0.616   -.048384      .081684
    Bias-corrected |  .05833     .03318   1.7578   0.079   -.006707      .123361
            Robust |  .05833     .05569   1.0473   0.295    -.05083      .167485
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15982
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8304        7678            Kernel        = Epanechnikov
Eff. Number of obs |      1544        1751            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    45.841      45.841
       BW bias (b) |    84.252      84.252
         rho (h/b) |     0.544       0.544
        Unique obs |       368         259

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00234     .03047   0.0767   0.939   -.057374       .06205
    Bias-corrected | -.00691     .03047   -0.2269  0.821   -.066624        .0528
            Robust | -.00691     .03577   -0.1933  0.847   -.077014       .06319
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08347     .10931   0.7637   0.445   -.130765      .297712
    Bias-corrected |   .1273     .10931   1.1646   0.244    -.08694      .341537
            Robust |   .1273     .25754   0.4943   0.621   -.377478      .632075
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1688
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         928            Kernel        =    Uniform
Eff. Number of obs |       760         928            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00744     .04789   0.1554   0.877   -.086413      .101294
    Bias-corrected | -.00674     .04789   -0.1408  0.888   -.100594      .087113
            Robust | -.00674     .08372   -0.0805  0.936   -.170827      .157346
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10529
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4596        5933            Kernel        = Epanechnikov
Eff. Number of obs |       914        1201            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    43.313      43.313
       BW bias (b) |    81.582      81.582
         rho (h/b) |     0.531       0.531
        Unique obs |       318         246

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01021      .0457   -0.2235  0.823   -.099786      .079356
    Bias-corrected | -.02546      .0457   -0.5571  0.577   -.115031      .064111
            Robust | -.02546      .0534   -0.4768  0.634   -.130121      .079201
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03683     .08962   0.4110   0.681   -.138816      .212478
    Bias-corrected | -.14678     .08962   -1.6378  0.101   -.322425      .028869
            Robust | -.14678     .25863   -0.5675  0.570    -.65368      .360124
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        587
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         306            Kernel        =    Uniform
Eff. Number of obs |       281         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02575     .03277   0.7857   0.432   -.038478      .089973
    Bias-corrected |  .03953     .03277   1.2062   0.228   -.024698      .103752
            Robust |  .03953     .07264   0.5442   0.586   -.102843      .181897
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2722
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1141        1581            Kernel        = Epanechnikov
Eff. Number of obs |       500         547            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.890      63.890
       BW bias (b) |   114.639     114.639
         rho (h/b) |     0.557       0.557
        Unique obs |       234         241

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00763     .02233   0.3420   0.732   -.036123      .051391
    Bias-corrected |  .00351     .02233   0.1572   0.875   -.040247      .047267
            Robust |  .00351       .027   0.1300   0.897   -.049403      .056423
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12178     .14709   0.8280   0.408   -.166507      .410072
    Bias-corrected |  .19768     .14709   1.3439   0.179   -.090609      .485969
            Robust |  .19768     .33659   0.5873   0.557   -.462034      .857394
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1101
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         622            Kernel        =    Uniform
Eff. Number of obs |       479         622            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00252     .06556   -0.0385  0.969    -.13102      .125978
    Bias-corrected |  .01497     .06556   0.2283   0.819   -.113532      .143467
            Robust |  .01497       .114   0.1313   0.896   -.208478      .238413
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7807
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3455        4352            Kernel        = Epanechnikov
Eff. Number of obs |       537         757            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    40.543      40.543
       BW bias (b) |    78.823      78.823
         rho (h/b) |     0.514       0.514
        Unique obs |       313         235

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01363     .06499   -0.2097  0.834   -.141016      .113757
    Bias-corrected | -.03698     .06499   -0.5690  0.569   -.164371      .090402
            Robust | -.03698     .07504   -0.4928  0.622   -.184066      .110097
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs() kernel(uni) p(1) h(12) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        250
-------------------+----------------------            BW type       =     Manual
     Number of obs |       152          98            Kernel        =    Uniform
Eff. Number of obs |       152          98            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs() kernel(uni) p(1) h(36) all

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        827
-------------------+----------------------            BW type       =     Manual
     Number of obs |       434         393            Kernel        =    Uniform
Eff. Number of obs |       434         393            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs() kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5453
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3708        1745            Kernel        = Epanechnikov
Eff. Number of obs |      3707        1745            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       354         243

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 5 results.xls
dir : seeout

. 
. *2_2_6) rdrobust on higheredu, sheet 6, province-clustered no July-Oct
. 
. **2_2_6_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        723
-------------------+----------------------            BW type       =     Manual
     Number of obs |       399         324            Kernel        =    Uniform
Eff. Number of obs |       399         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11149     .08519   1.3086   0.191    -.05549      .278461
    Bias-corrected |  .08443     .08519   0.9910   0.322   -.082549      .251402
            Robust |  .08443     .13447   0.6279   0.530   -.179125      .347977
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", replace ctitle(province-cluste
> red no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2515
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1194        1321            Kernel        =    Uniform
Eff. Number of obs |      1194        1321            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01665     .05124   0.3249   0.745    -.08378       .11708
    Bias-corrected |  .05833     .05124   1.1383   0.255   -.042103      .158757
            Robust |  .05833     .06658   0.8761   0.381   -.072166       .18882
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15982
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8304        7678            Kernel        = Epanechnikov
Eff. Number of obs |      2072        2237            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.019      57.019
       BW bias (b) |    91.226      91.226
         rho (h/b) |     0.625       0.625
        Unique obs |       368         259
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00162     .03877   0.0419   0.967   -.074362      .077612
    Bias-corrected | -.01324     .03877   -0.3414  0.733   -.089225       .06275
            Robust | -.01324     .04331   -0.3056  0.760   -.098131      .071655
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(12) all vce(nncluster province_c
> ode)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08347     .12241   0.6819   0.495   -.156452      .323399
    Bias-corrected |   .1273     .12241   1.0399   0.298   -.112627      .367224
            Robust |   .1273     .23381   0.5445   0.586   -.330953      .585549
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs() kernel(uni) p(1) h(36) all vce(nncluster province_c
> ode)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1688
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         928            Kernel        =    Uniform
Eff. Number of obs |       760         928            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00744     .06819   0.1091   0.913   -.126205      .141087
    Bias-corrected | -.00674     .06819   -0.0989  0.921   -.140387      .126905
            Robust | -.00674     .09492   -0.0710  0.943   -.192777      .179296
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10529
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4596        5933            Kernel        = Epanechnikov
Eff. Number of obs |      1097        1370            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.638      49.638
       BW bias (b) |    87.744      87.744
         rho (h/b) |     0.566       0.566
        Unique obs |       318         246
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01559     .05727   -0.2722  0.785   -.127847      .096662
    Bias-corrected | -.03574     .05727   -0.6240  0.533   -.147992      .076517
            Robust | -.03574     .06593   -0.5421  0.588   -.164957      .093482
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03683     .08292   0.4442   0.657   -.125693      .199354
    Bias-corrected | -.14678     .08292   -1.7701  0.077   -.309302      .015745
            Robust | -.14678      .2658   -0.5522  0.581   -.667746       .37419
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        587
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         306            Kernel        =    Uniform
Eff. Number of obs |       281         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02575     .03169   0.8124   0.417   -.036373      .087868
    Bias-corrected |  .03953     .03169   1.2471   0.212   -.022594      .101648
            Robust |  .03953     .06738   0.5867   0.557   -.092526       .17158
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2722
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1141        1581            Kernel        = Epanechnikov
Eff. Number of obs |       456         501            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.773      58.773
       BW bias (b) |   105.394     105.394
         rho (h/b) |     0.558       0.558
        Unique obs |       234         241
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00988     .02295   0.4307   0.667   -.035096      .054864
    Bias-corrected |   .0066     .02295   0.2877   0.774   -.038378      .051582
            Robust |   .0066     .02732   0.2416   0.809   -.046952      .060157
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12178     .16502   0.7380   0.461   -.201641      .445206
    Bias-corrected |  .19768     .16502   1.1980   0.231   -.125744      .521103
            Robust |  .19768     .31928   0.6191   0.536   -.428105      .823465
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1101
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         622            Kernel        =    Uniform
Eff. Number of obs |       479         622            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00252     .09199   -0.0274  0.978   -.182819      .177777
    Bias-corrected |  .01497     .09199   0.1627   0.871   -.165331      .195265
            Robust |  .01497     .14465   0.1035   0.918   -.268539      .298474
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7807
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3455        4352            Kernel        = Epanechnikov
Eff. Number of obs |       645         868            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.769      46.769
       BW bias (b) |    85.303      85.303
         rho (h/b) |     0.548       0.548
        Unique obs |       313         235
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02842      .0844   -0.3367  0.736   -.193838      .137003
    Bias-corrected | -.05596      .0844   -0.6630  0.507   -.221379      .109461
            Robust | -.05596     .09679   -0.5781  0.563   -.245665      .133747
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs() kernel(uni) p(1) h(12) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        250
-------------------+----------------------            BW type       =     Manual
     Number of obs |       152          98            Kernel        =    Uniform
Eff. Number of obs |       152          98            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs() kernel(uni) p(1) h(36) all vce(nncluster province_code)

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        827
-------------------+----------------------            BW type       =     Manual
     Number of obs |       434         393            Kernel        =    Uniform
Eff. Number of obs |       434         393            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs() kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5453
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3708        1745            Kernel        = Epanechnikov
Eff. Number of obs |      3707        1745            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       354         243
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No control/Highgen
> edu Sheet 6 results.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision No co
> ntrol/Urban 1979 Highgen ManualD No Control.log
  log type:  text
 closed on:   6 Aug 2024, 17:30:33
---------------------------------------------------------------------------------------------
