-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Ti
> me Frame/Tenure/Rural/IV Rural ATF Tenure 1982 3years.log
  log type:  text
 opened on:  14 Aug 2024, 05:35:43

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<1000000000000
> 00
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=10000000000
> 0000 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=100000000
> 00000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1982)
(7 missing values generated)

. gen d = 1 if t >= 0 & t != .
(19,560 missing values generated)

. replace d = 0 if t < 1
(19,599 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. local months = 36

. 
. 
. *1)
. ivregress 2sls log_monthlyearning tenure tenuresqr male (higheredu secgenhighedu secgened
> u = t d td) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & 
> educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,291
                                                        F(6, 1284)    =   3.71
                                                        Prob > F      = 0.0011
                                                        R-squared     = 0.0171
                                                        Adj R-squared = 0.0125
                                                        Root MSE      = 0.2706

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0154133    .004299     3.59   0.000     .0069794    .0238472
   tenuresqr |  -.0006722   .0002483    -2.71   0.007    -.0011593    -.000185
        male |   .0058908   .0155477     0.38   0.705    -.0246108    .0363924
           t |   .0013642   .0009652     1.41   0.158    -.0005293    .0032578
           d |   .0013247   .0303069     0.04   0.965    -.0581318    .0607812
          td |  -.0011652   .0014387    -0.81   0.418    -.0039876    .0016573
       _cons |   .0419099   .0238611     1.76   0.079    -.0049011    .0887209
------------------------------------------------------------------------------

                                                        Number of obs =  1,291
                                                        F(6, 1284)    =   3.61
                                                        Prob > F      = 0.0015
                                                        R-squared     = 0.0166
                                                        Adj R-squared = 0.0120
                                                        Root MSE      = 0.2466

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0131152   .0039184     3.35   0.001     .0054279    .0208024
   tenuresqr |  -.0006443   .0002263    -2.85   0.004    -.0010884   -.0002003
        male |    .002934   .0141713     0.21   0.836    -.0248675    .0307355
           t |   .0012776   .0008798     1.45   0.147    -.0004483    .0030035
           d |   .0061321    .027624     0.22   0.824     -.048061    .0603252
          td |  -.0007864   .0013113    -0.60   0.549     -.003359    .0017862
       _cons |   .0341091   .0217488     1.57   0.117    -.0085579    .0767762
------------------------------------------------------------------------------

                                                        Number of obs =  1,291
                                                        F(6, 1284)    =   5.26
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0240
                                                        Adj R-squared = 0.0194
                                                        Root MSE      = 0.3525

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0213517   .0056007     3.81   0.000     .0103643    .0323392
   tenuresqr |  -.0010973   .0003235    -3.39   0.001    -.0017319   -.0004626
        male |   .0017971   .0202552     0.09   0.929    -.0379398     .041534
           t |   .0014666   .0012574     1.17   0.244    -.0010002    .0039335
           d |   .0302557   .0394832     0.77   0.444     -.047203    .1077144
          td |  -.0004055   .0018743    -0.22   0.829    -.0040825    .0032716
       _cons |   .0839891   .0310857     2.70   0.007     .0230047    .1449735
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,291
                                                  Wald chi2(6)    =       3.68
                                                  Prob > chi2     =     0.7204
                                                  R-squared       =          .
                                                  Root MSE        =     4.3482

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -24.86767   115.7715    -0.21   0.830    -251.7757    202.0403
secgenhighedu |   40.17944   175.8704     0.23   0.819    -304.5201     384.879
    secgenedu |  -10.14501   45.54274    -0.22   0.824    -99.40713    79.11712
       tenure |   .1103116     .43733     0.25   0.801    -.7468394    .9674626
    tenuresqr |  -.0038132   .0141773    -0.27   0.788    -.0316001    .0239738
         male |   .4923055   .3598762     1.37   0.171    -.2130389     1.19765
        _cons |   8.312649   2.656209     3.13   0.002     3.106576    13.51872
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =   3.8473  (p = 0.2784)
  Wu-Hausman F(3,1281)            =   1.2763  (p = 0.2810)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.051  Chi-sq(6) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,291    8.127393    .6675777   5.298317   9.721166
      tenure |      1,291     5.42835    5.320293          0         26
   tenuresqr |      1,291    57.75058    92.14012          0        676
        male |      1,291    .6150271    .4867775          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled
> ) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p'
> , "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr male provincedum2-provincedum15 (highe
> redu secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(mo
> nthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,291
                                                        F(20, 1270)   =   4.52
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0664
                                                        Adj R-squared = 0.0517
                                                        Root MSE      = 0.2651

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0137777   .0043068     3.20   0.001     .0053285    .0222269
    tenuresqr |  -.0006214   .0002471    -2.51   0.012    -.0011063   -.0001366
         male |   .0067139   .0153574     0.44   0.662    -.0234147    .0368425
 provincedum2 |  -.2276194   .0626946    -3.63   0.000    -.3506158    -.104623
 provincedum3 |  -.2226974   .0787001    -2.83   0.005    -.3770939    -.068301
 provincedum4 |  -.2813765   .0651023    -4.32   0.000    -.4090963   -.1536567
 provincedum5 |  -.1211265   .0451574    -2.68   0.007    -.2097178   -.0325352
 provincedum6 |  -.2670523   .0476455    -5.60   0.000    -.3605249   -.1735797
 provincedum7 |   -.235158   .0458636    -5.13   0.000    -.3251347   -.1451812
 provincedum8 |  -.2275838   .0438146    -5.19   0.000    -.3135407   -.1416268
 provincedum9 |  -.2583638   .0453213    -5.70   0.000    -.3472766    -.169451
provincedum10 |  -.2544439   .0470207    -5.41   0.000    -.3466907   -.1621971
provincedum11 |   -.171573   .0443479    -3.87   0.000    -.2585762   -.0845699
provincedum12 |  -.2383922   .0564303    -4.22   0.000    -.3490992   -.1276853
provincedum13 |  -.2672078   .0492163    -5.43   0.000     -.363762   -.1706537
provincedum14 |  -.2348039   .0481318    -4.88   0.000    -.3292304   -.1403774
provincedum15 |  -.2136406   .0507064    -4.21   0.000    -.3131181    -.114163
            t |   .0011037   .0009506     1.16   0.246    -.0007612    .0029686
            d |  -.0026053   .0298071    -0.09   0.930    -.0610818    .0558712
           td |  -.0006407   .0014184    -0.45   0.652    -.0034233    .0021419
        _cons |   .2582155     .04512     5.72   0.000     .1696975    .3467334
-------------------------------------------------------------------------------

                                                        Number of obs =  1,291
                                                        F(20, 1270)   =   3.93
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0582
                                                        Adj R-squared = 0.0434
                                                        Root MSE      = 0.2427

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0116587   .0039417     2.96   0.003     .0039257    .0193917
    tenuresqr |  -.0005986   .0002262    -2.65   0.008    -.0010423   -.0001548
         male |   .0036168   .0140556     0.26   0.797    -.0239579    .0311915
 provincedum2 |  -.2174593   .0573802    -3.79   0.000    -.3300297   -.1048888
 provincedum3 |  -.1812822    .072029    -2.52   0.012     -.322591   -.0399733
 provincedum4 |  -.2414866   .0595838    -4.05   0.000    -.3583801   -.1245931
 provincedum5 |  -.1207734   .0413296    -2.92   0.004    -.2018551   -.0396917
 provincedum6 |  -.2240002   .0436068    -5.14   0.000    -.3095495   -.1384509
 provincedum7 |   -.192633   .0419759    -4.59   0.000    -.2749828   -.1102832
 provincedum8 |  -.2038414   .0401006    -5.08   0.000    -.2825121   -.1251706
 provincedum9 |  -.2142022   .0414796    -5.16   0.000    -.2955782   -.1328262
provincedum10 |   -.223344   .0430349    -5.19   0.000    -.3077714   -.1389166
provincedum11 |  -.1409733   .0405887    -3.47   0.001    -.2206015   -.0613451
provincedum12 |  -.2222832    .051647    -4.30   0.000    -.3236059   -.1209604
provincedum13 |  -.2360312   .0450444    -5.24   0.000    -.3244008   -.1476616
provincedum14 |  -.1971686   .0440518    -4.48   0.000     -.283591   -.1107463
provincedum15 |  -.2030503   .0464082    -4.38   0.000    -.2940956   -.1120051
            t |   .0010941     .00087     1.26   0.209    -.0006127     .002801
            d |   .0029173   .0272804     0.11   0.915    -.0506024     .056437
           td |   -.000448   .0012981    -0.35   0.730    -.0029947    .0020987
        _cons |   .2234643   .0412954     5.41   0.000     .1424497    .3044789
-------------------------------------------------------------------------------

                                                        Number of obs =  1,291
                                                        F(20, 1270)   =   3.43
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0512
                                                        Adj R-squared = 0.0362
                                                        Root MSE      = 0.3494

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0197334   .0056763     3.48   0.001     .0085974    .0308695
    tenuresqr |  -.0010387   .0003257    -3.19   0.001    -.0016777   -.0003997
         male |   .0028436   .0202409     0.14   0.888    -.0368658    .0425529
 provincedum2 |  -.1261912   .0826312    -1.53   0.127    -.2882999    .0359175
 provincedum3 |  -.1276019   .1037263    -1.23   0.219    -.3310957    .0758919
 provincedum4 |  -.3182042   .0858045    -3.71   0.000    -.4865383     -.14987
 provincedum5 |  -.1290982   .0595172    -2.17   0.030    -.2458611   -.0123354
 provincedum6 |   -.223867   .0627966    -3.56   0.000    -.3470635   -.1006706
 provincedum7 |   -.205919    .060448    -3.41   0.001     -.324508     -.08733
 provincedum8 |  -.2210495   .0577475    -3.83   0.000    -.3343404   -.1077587
 provincedum9 |  -.2112063   .0597332    -3.54   0.000     -.328393   -.0940196
provincedum10 |  -.1176052   .0619731    -1.90   0.058    -.2391861    .0039756
provincedum11 |  -.1565801   .0584503    -2.68   0.007    -.2712499   -.0419104
provincedum12 |  -.2291711   .0743749    -3.08   0.002    -.3750824   -.0832598
provincedum13 |  -.2759073   .0648668    -4.25   0.000    -.4031652   -.1486494
provincedum14 |  -.1953421   .0634374    -3.08   0.002    -.3197958   -.0708883
provincedum15 |  -.2067345   .0668308    -3.09   0.002    -.3378455   -.0756235
            t |   .0012815   .0012529     1.02   0.307    -.0011764    .0037395
            d |    .024355   .0392856     0.62   0.535    -.0527168    .1014268
           td |  -.0000479   .0018694    -0.03   0.980    -.0037154    .0036195
        _cons |   .2736599    .059468     4.60   0.000     .1569936    .3903261
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,291
                                                  Wald chi2(20)   =       0.98
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =     9.7129

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -63.46096   908.0807    -0.07   0.944    -1843.267    1716.345
secgenhighedu |   91.83114   1240.615     0.07   0.941    -2339.729    2523.392
    secgenedu |  -21.58093   280.2929    -0.08   0.939    -570.9449     527.783
       tenure |   .2612104   3.558197     0.07   0.941    -6.712727    7.235148
    tenuresqr |  -.0085036   .1120784    -0.08   0.940    -.2281733     .211166
         male |   .6033215   2.483267     0.24   0.808    -4.263792    5.470435
 provincedum2 |   2.414197   30.02559     0.08   0.936    -56.43489    61.26328
 provincedum3 |  -.7936934    16.2133    -0.05   0.961    -32.57118    30.98379
 provincedum4 |   -2.78857   45.37839    -0.06   0.951    -91.72858    86.15144
 provincedum5 |    .490451   5.877942     0.08   0.934     -11.0301    12.01101
 provincedum6 |  -1.224173   28.71723    -0.04   0.966    -57.50892    55.06057
 provincedum7 |  -1.784727   32.97949    -0.05   0.957    -66.42334    62.85389
 provincedum8 |  -.7708879   17.25268    -0.04   0.964    -34.58552    33.04374
 provincedum9 |  -1.268668   29.28961    -0.04   0.965    -58.67525    56.13791
provincedum10 |   1.783574   18.06268     0.10   0.921    -33.61863    37.18578
provincedum11 |   -1.47535   25.29483    -0.06   0.953     -51.0523     48.1016
provincedum12 |   .0408074   9.769414     0.00   0.997    -19.10689    19.18851
provincedum13 |  -1.567377   28.05707    -0.06   0.955    -56.55822    53.42346
provincedum14 |  -1.190929   24.59982    -0.05   0.961    -49.40569    47.02383
provincedum15 |   .1914127    7.79806     0.02   0.980     -15.0925    15.47533
        _cons |   9.749392   34.33569     0.28   0.776    -57.54732    77.04611
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  3.31618  (p = 0.3454)
  Wu-Hausman F(3,1267)            =  1.08764  (p = 0.3532)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.019  Chi-sq(20) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,291    8.127393    .6675777   5.298317   9.721166
      tenure |      1,291     5.42835    5.320293          0         26
   tenuresqr |      1,291    57.75058    92.14012          0        676
        male |      1,291    .6150271    .4867775          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled 
> Province) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value"
> , `wu_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "
> Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu secgenedu = t
>  d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male
>  == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    794
                                                        F(5, 788)     =   2.68
                                                        Prob > F      = 0.0205
                                                        R-squared     = 0.0167
                                                        Adj R-squared = 0.0105
                                                        Root MSE      = 0.2767

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0175239   .0056441     3.10   0.002     .0064446    .0286033
   tenuresqr |  -.0007781   .0003212    -2.42   0.016    -.0014087   -.0001475
           t |   .0003459   .0012964     0.27   0.790    -.0021989    .0028908
           d |   -.000816   .0397819    -0.02   0.984    -.0789071    .0772751
          td |   .0004609   .0018816     0.24   0.807    -.0032326    .0041544
       _cons |   .0285927   .0300303     0.95   0.341    -.0303562    .0875416
------------------------------------------------------------------------------

                                                        Number of obs =    794
                                                        F(5, 788)     =   2.91
                                                        Prob > F      = 0.0130
                                                        R-squared     = 0.0181
                                                        Adj R-squared = 0.0119
                                                        Root MSE      = 0.2504

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0161059   .0051085     3.15   0.002     .0060779    .0261338
   tenuresqr |  -.0008017   .0002907    -2.76   0.006    -.0013725    -.000231
           t |   .0002991   .0011734     0.25   0.799    -.0020042    .0026025
           d |    .000018   .0360067     0.00   1.000    -.0706625    .0706985
          td |   .0010862    .001703     0.64   0.524    -.0022568    .0044292
       _cons |   .0156776   .0271805     0.58   0.564    -.0376772    .0690324
------------------------------------------------------------------------------

                                                        Number of obs =    794
                                                        F(5, 788)     =   3.46
                                                        Prob > F      = 0.0043
                                                        R-squared     = 0.0215
                                                        Adj R-squared = 0.0153
                                                        Root MSE      = 0.3557

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0204462   .0072555     2.82   0.005     .0062038    .0346886
   tenuresqr |  -.0010787   .0004129    -2.61   0.009    -.0018893   -.0002681
           t |   .0005559   .0016665     0.33   0.739    -.0027154    .0038273
           d |   .0273501   .0511394     0.53   0.593    -.0730354    .1277357
          td |   .0012955   .0024188     0.54   0.592    -.0034525    .0060435
       _cons |    .075725   .0386038     1.96   0.050    -.0000534    .1515034
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        794
                                                  Wald chi2(5)    =       0.10
                                                  Prob > chi2     =     0.9998
                                                  R-squared       =          .
                                                  Root MSE        =     5.4417

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   28.36581   160.4048     0.18   0.860    -286.0219    342.7535
secgenhighedu |  -8.402855   94.84786    -0.09   0.929    -194.3012    177.4955
    secgenedu |  -4.255544   26.30635    -0.16   0.871    -55.81504    47.30395
       tenure |  -.2505429    1.33093    -0.19   0.851    -2.859117    2.358031
    tenuresqr |   .0095688   .0510806     0.19   0.851    -.0905474     .109685
        _cons |   7.960735   2.406595     3.31   0.001     3.243895    12.67757
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  3.89489  (p = 0.2730)
  Wu-Hausman F(3,785)             =  1.28991  (p = 0.2767)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.109  Chi-sq(5) P-value = 0.9998

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        794    8.300732    .6277352   5.298317   9.721166
      tenure |        794    5.778338    5.501689          0         26
   tenuresqr |        794    63.61965    96.67399          0        676
        male |        794           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "
> Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskeda
> sticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu 
> secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthly
> earning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    794
                                                        F(19, 774)    =   2.76
                                                        Prob > F      = 0.0001
                                                        R-squared     = 0.0635
                                                        Adj R-squared = 0.0405
                                                        Root MSE      = 0.2724

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0159587   .0056441     2.83   0.005     .0048791    .0270383
    tenuresqr |  -.0007331   .0003199    -2.29   0.022     -.001361   -.0001051
 provincedum2 |  -.1553625    .081358    -1.91   0.057    -.3150711    .0043461
 provincedum3 |  -.1737564   .0984893    -1.76   0.078    -.3670942    .0195815
 provincedum4 |  -.2664318   .0802061    -3.32   0.001    -.4238791   -.1089844
 provincedum5 |  -.0967299   .0568737    -1.70   0.089    -.2083748     .014915
 provincedum6 |  -.2283067   .0591755    -3.86   0.000    -.3444702   -.1121432
 provincedum7 |  -.1974685   .0562401    -3.51   0.000    -.3078697   -.0870673
 provincedum8 |  -.2159313   .0550769    -3.92   0.000     -.324049   -.1078136
 provincedum9 |  -.2350188   .0565176    -4.16   0.000    -.3459649   -.1240728
provincedum10 |  -.2422055   .0589817    -4.11   0.000    -.3579886   -.1264224
provincedum11 |  -.1316551    .055557    -2.37   0.018    -.2407154   -.0225949
provincedum12 |  -.1968848   .0694685    -2.83   0.005    -.3332537   -.0605159
provincedum13 |  -.2272797   .0622014    -3.65   0.000    -.3493831   -.1051762
provincedum14 |  -.1936895   .0626655    -3.09   0.002     -.316704   -.0706749
provincedum15 |  -.2216621   .0615187    -3.60   0.000    -.3424254   -.1008987
            t |    .000325   .0012919     0.25   0.801    -.0022111    .0028611
            d |   -.000597   .0394774    -0.02   0.988    -.0780925    .0768986
           td |   .0005505   .0018684     0.29   0.768    -.0031173    .0042182
        _cons |   .2209457   .0557775     3.96   0.000     .1114525    .3304388
-------------------------------------------------------------------------------

                                                        Number of obs =    794
                                                        F(19, 774)    =   2.38
                                                        Prob > F      = 0.0008
                                                        R-squared     = 0.0552
                                                        Adj R-squared = 0.0320
                                                        Root MSE      = 0.2479

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0144772   .0051347     2.82   0.005     .0043976    .0245568
    tenuresqr |  -.0007399    .000291    -2.54   0.011    -.0013112   -.0001686
 provincedum2 |  -.1528468   .0740151    -2.07   0.039     -.298141   -.0075526
 provincedum3 |  -.1126137   .0896002    -1.26   0.209    -.2885019    .0632746
 provincedum4 |  -.2105286   .0729672    -2.89   0.004    -.3537656   -.0672915
 provincedum5 |  -.0863282   .0517406    -1.67   0.096    -.1878967    .0152402
 provincedum6 |  -.1679841   .0538346    -3.12   0.002    -.2736633   -.0623049
 provincedum7 |  -.1392568   .0511642    -2.72   0.007    -.2396937   -.0388198
 provincedum8 |  -.1786814   .0501059    -3.57   0.000     -.277041   -.0803218
 provincedum9 |  -.1734123   .0514167    -3.37   0.001     -.274345   -.0724797
provincedum10 |  -.1844598   .0536584    -3.44   0.001    -.2897929   -.0791266
provincedum11 |   -.083123   .0505427    -1.64   0.100    -.1823401    .0160941
provincedum12 |  -.1737231   .0631986    -2.75   0.006    -.2977841   -.0496621
provincedum13 |  -.1871481   .0565875    -3.31   0.001    -.2982312    -.076065
provincedum14 |  -.1407435   .0570097    -2.47   0.014    -.2526555   -.0288316
provincedum15 |  -.1850437   .0559664    -3.31   0.001    -.2949077   -.0751798
            t |   .0003811   .0011753     0.32   0.746    -.0019261    .0026883
            d |   .0003173   .0359144     0.01   0.993    -.0701839    .0708186
           td |    .000971   .0016998     0.57   0.568    -.0023657    .0043077
        _cons |   .1663506   .0507433     3.28   0.001     .0667397    .2659615
-------------------------------------------------------------------------------

                                                        Number of obs =    794
                                                        F(19, 774)    =   1.84
                                                        Prob > F      = 0.0155
                                                        R-squared     = 0.0433
                                                        Adj R-squared = 0.0198
                                                        Root MSE      = 0.3548

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0189465   .0073511     2.58   0.010      .004516     .033377
    tenuresqr |    -.00102   .0004166    -2.45   0.015    -.0018378   -.0002021
 provincedum2 |  -.0374325   .1059637    -0.35   0.724    -.2454428    .1705777
 provincedum3 |  -.1734699   .1282761    -1.35   0.177    -.4252801    .0783403
 provincedum4 |  -.2744798   .1044634    -2.63   0.009    -.4795449   -.0694146
 provincedum5 |  -.0663107   .0740743    -0.90   0.371    -.2117211    .0790997
 provincedum6 |  -.1462547   .0770723    -1.90   0.058    -.2975503    .0050408
 provincedum7 |  -.1266986   .0732491    -1.73   0.084    -.2704891    .0170919
 provincedum8 |  -.1554154   .0717341    -2.17   0.031    -.2962319    -.014599
 provincedum9 |  -.1549701   .0736106    -2.11   0.036    -.2994702     -.01047
provincedum10 |  -.0521311   .0768199    -0.68   0.498    -.2029312     .098669
provincedum11 |  -.1006812   .0723595    -1.39   0.165    -.2427253    .0413628
provincedum12 |  -.1313817   .0904782    -1.45   0.147    -.3089935    .0462302
provincedum13 |  -.1781387   .0810134    -2.20   0.028    -.3371707   -.0191067
provincedum14 |  -.0942913   .0816179    -1.16   0.248      -.25451    .0659273
provincedum15 |  -.1836681   .0801242    -2.29   0.022    -.3409547   -.0263815
            t |   .0003085   .0016827     0.18   0.855    -.0029946    .0036116
            d |   .0304443   .0514168     0.59   0.554    -.0704887    .1313773
           td |   .0015053   .0024335     0.62   0.536    -.0032718    .0062823
        _cons |   .1987315   .0726467     2.74   0.006     .0561237    .3413393
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        794
                                                  Wald chi2(19)   =       0.29
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =     8.6476

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   54.89486   554.2234     0.10   0.921    -1031.363    1141.153
secgenhighedu |  -29.35035   390.6381    -0.08   0.940    -794.9869    736.2862
    secgenedu |  -3.086329   41.86959    -0.07   0.941    -85.14923    78.97657
       tenure |  -.3773251    3.47789    -0.11   0.914    -7.193865    6.439215
    tenuresqr |   .0146832   .1329754     0.11   0.912    -.2459438    .2753101
 provincedum2 |    3.61491   30.09955     0.12   0.904    -55.37913    62.60895
 provincedum3 |   5.522289   54.69017     0.10   0.920    -101.6685     112.713
 provincedum4 |   7.534075   69.65056     0.11   0.914    -128.9785    144.0467
 provincedum5 |   2.457393   21.55492     0.11   0.909    -39.78947    44.70426
 provincedum6 |   7.234079   63.92309     0.11   0.910    -118.0529     132.521
 provincedum7 |   6.415788   57.47903     0.11   0.911     -106.241    119.0726
 provincedum8 |   5.894624   53.15913     0.11   0.912    -98.29536    110.0846
 provincedum9 |   7.373718   65.56385     0.11   0.910    -121.1291    135.8765
provincedum10 |   7.770468   65.38089     0.12   0.905    -120.3737    135.9147
provincedum11 |   4.354477   42.11987     0.10   0.918    -78.19895    86.90791
provincedum12 |    4.95632   44.53068     0.11   0.911    -82.32221    92.23485
provincedum13 |   6.043629   56.29601     0.11   0.915    -104.2945    116.3818
provincedum14 |   6.052273   54.73635     0.11   0.912     -101.229    113.3335
provincedum15 |   5.802372   53.95771     0.11   0.914    -99.95279    111.5575
        _cons |    1.82712   59.94764     0.03   0.976    -115.6681    119.3223
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  4.81728  (p = 0.1857)
  Wu-Hausman F(3,771)             =  1.56876  (p = 0.1955)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.043  Chi-sq(19) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        794    8.300732    .6277352   5.298317   9.721166
      tenure |        794    5.778338    5.501689          0         26
   tenuresqr |        794    63.61965    96.67399          0        676
        male |        794           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", 
> `wu_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "He
> teroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu secgenedu = t
>  d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male
>  == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    497
                                                        F(5, 491)     =   2.38
                                                        Prob > F      = 0.0380
                                                        R-squared     = 0.0236
                                                        Adj R-squared = 0.0137
                                                        Root MSE      = 0.2610

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0122499    .006641     1.84   0.066    -.0007984    .0252983
   tenuresqr |  -.0005262   .0003946    -1.33   0.183    -.0013015    .0002491
           t |   .0028914   .0014408     2.01   0.045     .0000605    .0057222
           d |   .0089131   .0470489     0.19   0.850    -.0835289    .1013551
          td |  -.0037094   .0022375    -1.66   0.098    -.0081058    .0006869
       _cons |   .0695438   .0335453     2.07   0.039     .0036338    .1354538
------------------------------------------------------------------------------

                                                        Number of obs =    497
                                                        F(5, 491)     =   2.32
                                                        Prob > F      = 0.0421
                                                        R-squared     = 0.0231
                                                        Adj R-squared = 0.0132
                                                        Root MSE      = 0.2405

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |    .008647   .0061199     1.41   0.158    -.0033774    .0206715
   tenuresqr |  -.0004131   .0003636    -1.14   0.257    -.0011276    .0003014
           t |    .002746   .0013277     2.07   0.039     .0001373    .0053547
           d |   .0203604   .0433572     0.47   0.639     -.064828    .1055489
          td |  -.0037546    .002062    -1.82   0.069     -.007806    .0002967
       _cons |    .064631   .0309131     2.09   0.037     .0038927    .1253693
------------------------------------------------------------------------------

                                                        Number of obs =    497
                                                        F(5, 491)     =   3.15
                                                        Prob > F      = 0.0082
                                                        R-squared     = 0.0311
                                                        Adj R-squared = 0.0212
                                                        Root MSE      = 0.3486

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |    .022662   .0088706     2.55   0.011     .0052331     .040091
   tenuresqr |  -.0011125   .0005271    -2.11   0.035    -.0021481   -.0000769
           t |   .0027052   .0019245     1.41   0.160     -.001076    .0064864
           d |   .0441354   .0628443     0.70   0.483    -.0793416    .1676124
          td |  -.0031127   .0029887    -1.04   0.298     -.008985    .0027596
       _cons |   .0960993   .0448072     2.14   0.032     .0080617    .1841369
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        497
                                                  Wald chi2(5)    =       2.74
                                                  Prob > chi2     =     0.7399
                                                  R-squared       =          .
                                                  Root MSE        =      1.548

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   8.424708   31.58093     0.27   0.790    -53.47278    70.32219
secgenhighedu |  -13.07356   36.69555    -0.36   0.722    -84.99551     58.8484
    secgenedu |   3.884924   6.622897     0.59   0.557    -9.095715    16.86556
       tenure |  -.0197527   .1883967    -0.10   0.916    -.3890034     .349498
    tenuresqr |   .0004172    .007606     0.05   0.956    -.0144902    .0153247
        _cons |   7.551922   .3005491    25.13   0.000     6.962857    8.140988
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  2.19182  (p = 0.5336)
  Wu-Hausman F(3,488)             =  .720555  (p = 0.5400)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.381  Chi-sq(5) P-value = 0.9958

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        497    7.850469    .6357122   5.521461   9.364491
      tenure |        497    4.869215     4.97139          0         25
   tenuresqr |        497    48.37425    83.63627          0        625
        male |        497           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female)
>  pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p',
>  "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroske
> dasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu 
> secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthly
> earning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    497
                                                        F(19, 477)    =   2.64
                                                        Prob > F      = 0.0002
                                                        R-squared     = 0.0953
                                                        Adj R-squared = 0.0593
                                                        Root MSE      = 0.2549

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0100684   .0068098     1.48   0.140    -.0033126    .0234494
    tenuresqr |  -.0004315   .0004022    -1.07   0.284    -.0012218    .0003588
 provincedum2 |  -.3473952   .1013071    -3.43   0.001    -.5464585   -.1483319
 provincedum3 |  -.3331405   .1335638    -2.49   0.013    -.5955865   -.0706944
 provincedum4 |  -.3160038   .1146361    -2.76   0.006     -.541258   -.0907497
 provincedum5 |  -.1734393   .0768556    -2.26   0.024    -.3244567    -.022422
 provincedum6 |  -.3466187   .0822647    -4.21   0.000    -.5082648   -.1849727
 provincedum7 |  -.3179181   .0813567    -3.91   0.000    -.4777798   -.1580563
 provincedum8 |  -.2641151   .0748194    -3.53   0.000    -.4111316   -.1170987
 provincedum9 |  -.3082098   .0779979    -3.95   0.000    -.4614718   -.1549477
provincedum10 |  -.2853747   .0803206    -3.55   0.000    -.4432007   -.1275487
provincedum11 |  -.2470233   .0759988    -3.25   0.001    -.3963572   -.0976895
provincedum12 |  -.3218475   .0996085    -3.23   0.001    -.5175732   -.1261218
provincedum13 |  -.3413001   .0829387    -4.12   0.000    -.5042706   -.1783296
provincedum14 |  -.3066552   .0795867    -3.85   0.000     -.463039   -.1502713
provincedum15 |  -.1616348   .0928154    -1.74   0.082    -.3440124    .0207428
            t |   .0024788   .0014218     1.74   0.082    -.0003149    .0052725
            d |  -.0131638   .0466624    -0.28   0.778    -.1048531    .0785256
           td |  -.0024577   .0022193    -1.11   0.269    -.0068185    .0019032
        _cons |   .3441027   .0751123     4.58   0.000     .1965108    .4916946
-------------------------------------------------------------------------------

                                                        Number of obs =    497
                                                        F(19, 477)    =   2.49
                                                        Prob > F      = 0.0005
                                                        R-squared     = 0.0902
                                                        Adj R-squared = 0.0540
                                                        Root MSE      = 0.2355

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0068178   .0062913     1.08   0.279    -.0055442    .0191798
    tenuresqr |  -.0003396   .0003716    -0.91   0.361    -.0010698    .0003905
 provincedum2 |  -.3409024   .0935925    -3.64   0.000    -.5248069   -.1569979
 provincedum3 |  -.3356367   .1233928    -2.72   0.007    -.5780973   -.0931761
 provincedum4 |   -.316015   .1059065    -2.98   0.003    -.5241159   -.1079141
 provincedum5 |  -.2025789    .071003    -2.85   0.005    -.3420962   -.0630617
 provincedum6 |  -.3427893   .0760002    -4.51   0.000    -.4921259   -.1934527
 provincedum7 |  -.3127864   .0751613    -4.16   0.000    -.4604746   -.1650982
 provincedum8 |  -.2747327   .0691219    -3.97   0.000    -.4105537   -.1389116
 provincedum9 |  -.3032835   .0720583    -4.21   0.000    -.4448745   -.1616925
provincedum10 |  -.3092732   .0742041    -4.17   0.000    -.4550807   -.1634658
provincedum11 |  -.2556662   .0702115    -3.64   0.000    -.3936281   -.1177042
provincedum12 |  -.3237449   .0920232    -3.52   0.000     -.504566   -.1429239
provincedum13 |  -.3375848   .0766229    -4.41   0.000     -.488145   -.1870246
provincedum14 |  -.3073249   .0735261    -4.18   0.000    -.4518001   -.1628498
provincedum15 |   -.218048   .0857475    -2.54   0.011    -.3865375   -.0495586
            t |   .0022857   .0013135     1.74   0.082    -.0002953    .0048667
            d |  -.0006344    .043109    -0.01   0.988    -.0853415    .0840727
           td |  -.0024955   .0020503    -1.22   0.224    -.0065243    .0015332
        _cons |   .3464391   .0693925     4.99   0.000     .2100864    .4827917
-------------------------------------------------------------------------------

                                                        Number of obs =    497
                                                        F(19, 477)    =   2.59
                                                        Prob > F      = 0.0003
                                                        R-squared     = 0.0935
                                                        Adj R-squared = 0.0574
                                                        Root MSE      = 0.3421

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0210007   .0091399     2.30   0.022     .0030412    .0389602
    tenuresqr |  -.0010336   .0005398    -1.91   0.056    -.0020944    .0000271
 provincedum2 |  -.3128845   .1359709    -2.30   0.022    -.5800605   -.0457086
 provincedum3 |  -.0536226   .1792647    -0.30   0.765    -.4058687    .2986235
 provincedum4 |  -.4285567   .1538606    -2.79   0.006     -.730885   -.1262283
 provincedum5 |  -.2758875   .1031529    -2.67   0.008    -.4785777   -.0731973
 provincedum6 |  -.3954888   .1104129    -3.58   0.000    -.6124445    -.178533
 provincedum7 |  -.3920361   .1091941    -3.59   0.000    -.6065971   -.1774751
 provincedum8 |  -.3732331   .1004201    -3.72   0.000    -.5705535   -.1759127
 provincedum9 |  -.3455077   .1046861    -3.30   0.001    -.5512107   -.1398047
provincedum10 |  -.2657239   .1078036    -2.46   0.014    -.4775525   -.0538953
provincedum11 |  -.2972107    .102003    -2.91   0.004    -.4976415     -.09678
provincedum12 |  -.4437344   .1336911    -3.32   0.001    -.7064307   -.1810381
provincedum13 |  -.4746388   .1113175    -4.26   0.000    -.6933721   -.2559054
provincedum14 |  -.3821169   .1068185    -3.58   0.000      -.59201   -.1722239
provincedum15 |  -.2328363   .1245737    -1.87   0.062    -.4776173    .0119447
            t |   .0021258   .0019083     1.11   0.266    -.0016239    .0058754
            d |   .0269451   .0626287     0.43   0.667    -.0961171    .1500073
           td |  -.0020868   .0029787    -0.70   0.484    -.0079398    .0037662
        _cons |   .4327514   .1008132     4.29   0.000     .2346586    .6308441
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        497
                                                  Wald chi2(19)   =       4.62
                                                  Prob > chi2     =     0.9997
                                                  R-squared       =          .
                                                  Root MSE        =      2.161

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   16.28875   48.05158     0.34   0.735    -77.89061    110.4681
secgenhighedu |  -21.52642   61.74007    -0.35   0.727    -142.5347     99.4819
    secgenedu |   4.065552   12.97667     0.31   0.754    -21.36825    29.49935
       tenure |  -.0482058   .3062555    -0.16   0.875    -.6484556     .552044
    tenuresqr |   .0010179   .0121979     0.08   0.933    -.0228895    .0249254
 provincedum2 |  -.9841392   2.194966    -0.45   0.654    -5.286193    3.317915
 provincedum3 |  -2.883594   5.345525    -0.54   0.590    -13.36063    7.593444
 provincedum4 |  -.5340086   1.706999    -0.31   0.754    -3.879665    2.811648
 provincedum5 |  -.6354536   1.627158    -0.39   0.696    -3.824624    2.553717
 provincedum6 |  -.3614008   1.682162    -0.21   0.830    -3.658378    2.935576
 provincedum7 |  -.4606269    1.49612    -0.31   0.758    -3.392968    2.471714
 provincedum8 |  -.5067201   1.335621    -0.38   0.704    -3.124489    2.111049
 provincedum9 |  -.1914869   1.516351    -0.13   0.900    -3.163481    2.780507
provincedum10 |  -1.174904   3.078091    -0.38   0.703    -7.207851    4.858042
provincedum11 |  -.5398654   1.473981    -0.37   0.714    -3.428815    2.349084
provincedum12 |  -.1440359   1.638288    -0.09   0.930    -3.355021    3.066949
provincedum13 |  -.1000362   1.728026    -0.06   0.954    -3.486905    3.286833
provincedum14 |  -.3433876   1.473425    -0.23   0.816    -3.231247    2.544472
provincedum15 |  -1.771691   3.433643    -0.52   0.606    -8.501508    4.958126
        _cons |   8.127103    1.48885     5.46   0.000     5.209011     11.0452
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =   1.6958  (p = 0.6379)
  Wu-Hausman F(3,474)             =  .540954  (p = 0.6545)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.211  Chi-sq(19) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        497    7.850469    .6357122   5.521461   9.364491
      tenure |        497    4.869215     4.97139          0         25
   tenuresqr |        497    48.37425    83.63627          0        625
        male |        497           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female 
> Province) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value"
> , `wu_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "
> Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning tenure tenuresqr male (higheredu secgenhighedu = t d td
>  ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & educat !=
>  ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,291
                                                        F(6, 1284)    =   3.71
                                                        Prob > F      = 0.0011
                                                        R-squared     = 0.0171
                                                        Adj R-squared = 0.0125
                                                        Root MSE      = 0.2706

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0154133    .004299     3.59   0.000     .0069794    .0238472
   tenuresqr |  -.0006722   .0002483    -2.71   0.007    -.0011593    -.000185
        male |   .0058908   .0155477     0.38   0.705    -.0246108    .0363924
           t |   .0013642   .0009652     1.41   0.158    -.0005293    .0032578
           d |   .0013247   .0303069     0.04   0.965    -.0581318    .0607812
          td |  -.0011652   .0014387    -0.81   0.418    -.0039876    .0016573
       _cons |   .0419099   .0238611     1.76   0.079    -.0049011    .0887209
------------------------------------------------------------------------------

                                                        Number of obs =  1,291
                                                        F(6, 1284)    =   3.61
                                                        Prob > F      = 0.0015
                                                        R-squared     = 0.0166
                                                        Adj R-squared = 0.0120
                                                        Root MSE      = 0.2466

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0131152   .0039184     3.35   0.001     .0054279    .0208024
   tenuresqr |  -.0006443   .0002263    -2.85   0.004    -.0010884   -.0002003
        male |    .002934   .0141713     0.21   0.836    -.0248675    .0307355
           t |   .0012776   .0008798     1.45   0.147    -.0004483    .0030035
           d |   .0061321    .027624     0.22   0.824     -.048061    .0603252
          td |  -.0007864   .0013113    -0.60   0.549     -.003359    .0017862
       _cons |   .0341091   .0217488     1.57   0.117    -.0085579    .0767762
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,291
                                                  Wald chi2(5)    =     154.57
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0039
                                                  Root MSE        =     .66602

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -.6528957   6.100773    -0.11   0.915    -12.61019     11.3044
secgenhighedu |   1.706239   5.081507     0.34   0.737    -8.253331    11.66581
       tenure |   .0249826   .0323207     0.77   0.440    -.0383648    .0883301
    tenuresqr |  -.0011957    .001215    -0.98   0.325    -.0035771    .0011858
         male |     .44265   .0432751    10.23   0.000     .3578324    .5274677
        _cons |   7.728844   .0662059   116.74   0.000     7.599083    7.858605
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.50338  (p = 0.4716)
  Wu-Hausman F(2,1283)            =  .747903  (p = 0.4736)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  2.11499  (p = 0.1459)
  Basmann chi2(1)        =  2.10697  (p = 0.1466)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   2.564  Chi-sq(6) P-value = 0.8612

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,291    8.127393    .6675777   5.298317   9.721166
      tenure |      1,291     5.42835    5.320293          0         26
   tenuresqr |      1,291    57.75058    92.14012          0        676
        male |      1,291    .6150271    .4867775          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue adds
> tat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneit
> y df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basm
> an_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_
> p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr male provincedum2-provincedum15 (highe
> redu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearni
> ng, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,291
                                                        F(20, 1270)   =   4.52
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0664
                                                        Adj R-squared = 0.0517
                                                        Root MSE      = 0.2651

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0137777   .0043068     3.20   0.001     .0053285    .0222269
    tenuresqr |  -.0006214   .0002471    -2.51   0.012    -.0011063   -.0001366
         male |   .0067139   .0153574     0.44   0.662    -.0234147    .0368425
 provincedum2 |  -.2276194   .0626946    -3.63   0.000    -.3506158    -.104623
 provincedum3 |  -.2226974   .0787001    -2.83   0.005    -.3770939    -.068301
 provincedum4 |  -.2813765   .0651023    -4.32   0.000    -.4090963   -.1536567
 provincedum5 |  -.1211265   .0451574    -2.68   0.007    -.2097178   -.0325352
 provincedum6 |  -.2670523   .0476455    -5.60   0.000    -.3605249   -.1735797
 provincedum7 |   -.235158   .0458636    -5.13   0.000    -.3251347   -.1451812
 provincedum8 |  -.2275838   .0438146    -5.19   0.000    -.3135407   -.1416268
 provincedum9 |  -.2583638   .0453213    -5.70   0.000    -.3472766    -.169451
provincedum10 |  -.2544439   .0470207    -5.41   0.000    -.3466907   -.1621971
provincedum11 |   -.171573   .0443479    -3.87   0.000    -.2585762   -.0845699
provincedum12 |  -.2383922   .0564303    -4.22   0.000    -.3490992   -.1276853
provincedum13 |  -.2672078   .0492163    -5.43   0.000     -.363762   -.1706537
provincedum14 |  -.2348039   .0481318    -4.88   0.000    -.3292304   -.1403774
provincedum15 |  -.2136406   .0507064    -4.21   0.000    -.3131181    -.114163
            t |   .0011037   .0009506     1.16   0.246    -.0007612    .0029686
            d |  -.0026053   .0298071    -0.09   0.930    -.0610818    .0558712
           td |  -.0006407   .0014184    -0.45   0.652    -.0034233    .0021419
        _cons |   .2582155     .04512     5.72   0.000     .1696975    .3467334
-------------------------------------------------------------------------------

                                                        Number of obs =  1,291
                                                        F(20, 1270)   =   3.93
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0582
                                                        Adj R-squared = 0.0434
                                                        Root MSE      = 0.2427

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0116587   .0039417     2.96   0.003     .0039257    .0193917
    tenuresqr |  -.0005986   .0002262    -2.65   0.008    -.0010423   -.0001548
         male |   .0036168   .0140556     0.26   0.797    -.0239579    .0311915
 provincedum2 |  -.2174593   .0573802    -3.79   0.000    -.3300297   -.1048888
 provincedum3 |  -.1812822    .072029    -2.52   0.012     -.322591   -.0399733
 provincedum4 |  -.2414866   .0595838    -4.05   0.000    -.3583801   -.1245931
 provincedum5 |  -.1207734   .0413296    -2.92   0.004    -.2018551   -.0396917
 provincedum6 |  -.2240002   .0436068    -5.14   0.000    -.3095495   -.1384509
 provincedum7 |   -.192633   .0419759    -4.59   0.000    -.2749828   -.1102832
 provincedum8 |  -.2038414   .0401006    -5.08   0.000    -.2825121   -.1251706
 provincedum9 |  -.2142022   .0414796    -5.16   0.000    -.2955782   -.1328262
provincedum10 |   -.223344   .0430349    -5.19   0.000    -.3077714   -.1389166
provincedum11 |  -.1409733   .0405887    -3.47   0.001    -.2206015   -.0613451
provincedum12 |  -.2222832    .051647    -4.30   0.000    -.3236059   -.1209604
provincedum13 |  -.2360312   .0450444    -5.24   0.000    -.3244008   -.1476616
provincedum14 |  -.1971686   .0440518    -4.48   0.000     -.283591   -.1107463
provincedum15 |  -.2030503   .0464082    -4.38   0.000    -.2940956   -.1120051
            t |   .0010941     .00087     1.26   0.209    -.0006127     .002801
            d |   .0029173   .0272804     0.11   0.915    -.0506024     .056437
           td |   -.000448   .0012981    -0.35   0.730    -.0029947    .0020987
        _cons |   .2234643   .0412954     5.41   0.000     .1424497    .3044789
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,291
                                                  Wald chi2(19)   =      86.92
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      1.029

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   5.719187   13.92983     0.41   0.681    -21.58278    33.02115
secgenhighedu |  -3.346561   11.11938    -0.30   0.763    -25.14014    18.44702
       tenure |  -.0082797   .0678215    -0.12   0.903    -.1412075     .124648
    tenuresqr |   -.000061   .0024573    -0.02   0.980    -.0048773    .0047552
         male |   .4209058   .0788144     5.34   0.000     .2664323    .5753792
 provincedum2 |   .1911036   .8727013     0.22   0.827     -1.51936    1.901567
 provincedum3 |   .1138811   1.179368     0.10   0.923    -2.197638      2.4254
 provincedum4 |    .565743   1.345182     0.42   0.674    -2.070766    3.202252
 provincedum5 |   .1665869   .4349704     0.38   0.702    -.6859394    1.019113
 provincedum6 |   .7706858   1.312117     0.59   0.557    -1.801016    3.342388
 provincedum7 |   .6006685   1.197638     0.50   0.616    -1.746659    2.947996
 provincedum8 |   .3471521   .9869901     0.35   0.725    -1.587313    2.281617
 provincedum9 |   .7818083   1.291637     0.61   0.545    -1.749754     3.31337
provincedum10 |   .6720451   1.150088     0.58   0.559    -1.582085    2.926176
provincedum11 |   .3634407   .8830104     0.41   0.681    -1.367228    2.094109
provincedum12 |   .3259441   .9577518     0.34   0.734    -1.551215    2.203103
provincedum13 |   .4124913   1.189028     0.35   0.729    -1.917961    2.742944
provincedum14 |   .5080911    1.15183     0.44   0.659    -1.749454    2.765637
provincedum15 |   .1123708   .8189574     0.14   0.891    -1.492756    1.717498
        _cons |   7.236256   1.128833     6.41   0.000     5.023785    9.448727
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.83308  (p = 0.3999)
  Wu-Hausman F(2,1269)            =    .9022  (p = 0.4059)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =   .52817  (p = 0.4674)
  Basmann chi2(1)        =  .519791  (p = 0.4709)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.856  Chi-sq(20) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,291    8.127393    .6675777   5.298317   9.721166
      tenure |      1,291     5.42835    5.320293          0         26
   tenuresqr |      1,291    57.75058    92.14012          0        676
        male |      1,291    .6150271    .4867775          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pv
> alue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-valu
> e", `basman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pa
> gan_hall_p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu = t d td ) if
>  inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male == 1 & ed
> ucat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    794
                                                        F(5, 788)     =   2.68
                                                        Prob > F      = 0.0205
                                                        R-squared     = 0.0167
                                                        Adj R-squared = 0.0105
                                                        Root MSE      = 0.2767

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0175239   .0056441     3.10   0.002     .0064446    .0286033
   tenuresqr |  -.0007781   .0003212    -2.42   0.016    -.0014087   -.0001475
           t |   .0003459   .0012964     0.27   0.790    -.0021989    .0028908
           d |   -.000816   .0397819    -0.02   0.984    -.0789071    .0772751
          td |   .0004609   .0018816     0.24   0.807    -.0032326    .0041544
       _cons |   .0285927   .0300303     0.95   0.341    -.0303562    .0875416
------------------------------------------------------------------------------

                                                        Number of obs =    794
                                                        F(5, 788)     =   2.91
                                                        Prob > F      = 0.0130
                                                        R-squared     = 0.0181
                                                        Adj R-squared = 0.0119
                                                        Root MSE      = 0.2504

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0161059   .0051085     3.15   0.002     .0060779    .0261338
   tenuresqr |  -.0008017   .0002907    -2.76   0.006    -.0013725    -.000231
           t |   .0002991   .0011734     0.25   0.799    -.0020042    .0026025
           d |    .000018   .0360067     0.00   1.000    -.0706625    .0706985
          td |   .0010862    .001703     0.64   0.524    -.0022568    .0044292
       _cons |   .0156776   .0271805     0.58   0.564    -.0376772    .0690324
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        794
                                                  Wald chi2(4)    =       0.26
                                                  Prob > chi2     =     0.9924
                                                  R-squared       =          .
                                                  Root MSE        =     2.8985

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |    17.7126   77.90625     0.23   0.820    -134.9808     170.406
secgenhighedu |  -10.16945   50.18423    -0.20   0.839    -108.5287    88.18984
       tenure |  -.1231361   .5714663    -0.22   0.829    -1.243189    .9969172
    tenuresqr |   .0044824   .0214424     0.21   0.834    -.0375439    .0465086
        _cons |   7.924073   1.276164     6.21   0.000     5.422838    10.42531
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.90326  (p = 0.3861)
  Wu-Hausman F(2,787)             =  .945509  (p = 0.3889)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .092239  (p = 0.7613)
  Basmann chi2(1)        =  .091552  (p = 0.7622)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.086  Chi-sq(5) P-value = 0.9999

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        794    8.300732    .6277352   5.298317   9.721166
      tenure |        794    5.778338    5.501689          0         26
   tenuresqr |        794    63.61965    96.67399          0        676
        male |        794           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity 
> df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman
> _p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p'
> , "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu 
> secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 2
> 00, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    794
                                                        F(19, 774)    =   2.76
                                                        Prob > F      = 0.0001
                                                        R-squared     = 0.0635
                                                        Adj R-squared = 0.0405
                                                        Root MSE      = 0.2724

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0159587   .0056441     2.83   0.005     .0048791    .0270383
    tenuresqr |  -.0007331   .0003199    -2.29   0.022     -.001361   -.0001051
 provincedum2 |  -.1553625    .081358    -1.91   0.057    -.3150711    .0043461
 provincedum3 |  -.1737564   .0984893    -1.76   0.078    -.3670942    .0195815
 provincedum4 |  -.2664318   .0802061    -3.32   0.001    -.4238791   -.1089844
 provincedum5 |  -.0967299   .0568737    -1.70   0.089    -.2083748     .014915
 provincedum6 |  -.2283067   .0591755    -3.86   0.000    -.3444702   -.1121432
 provincedum7 |  -.1974685   .0562401    -3.51   0.000    -.3078697   -.0870673
 provincedum8 |  -.2159313   .0550769    -3.92   0.000     -.324049   -.1078136
 provincedum9 |  -.2350188   .0565176    -4.16   0.000    -.3459649   -.1240728
provincedum10 |  -.2422055   .0589817    -4.11   0.000    -.3579886   -.1264224
provincedum11 |  -.1316551    .055557    -2.37   0.018    -.2407154   -.0225949
provincedum12 |  -.1968848   .0694685    -2.83   0.005    -.3332537   -.0605159
provincedum13 |  -.2272797   .0622014    -3.65   0.000    -.3493831   -.1051762
provincedum14 |  -.1936895   .0626655    -3.09   0.002     -.316704   -.0706749
provincedum15 |  -.2216621   .0615187    -3.60   0.000    -.3424254   -.1008987
            t |    .000325   .0012919     0.25   0.801    -.0022111    .0028611
            d |   -.000597   .0394774    -0.02   0.988    -.0780925    .0768986
           td |   .0005505   .0018684     0.29   0.768    -.0031173    .0042182
        _cons |   .2209457   .0557775     3.96   0.000     .1114525    .3304388
-------------------------------------------------------------------------------

                                                        Number of obs =    794
                                                        F(19, 774)    =   2.38
                                                        Prob > F      = 0.0008
                                                        R-squared     = 0.0552
                                                        Adj R-squared = 0.0320
                                                        Root MSE      = 0.2479

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0144772   .0051347     2.82   0.005     .0043976    .0245568
    tenuresqr |  -.0007399    .000291    -2.54   0.011    -.0013112   -.0001686
 provincedum2 |  -.1528468   .0740151    -2.07   0.039     -.298141   -.0075526
 provincedum3 |  -.1126137   .0896002    -1.26   0.209    -.2885019    .0632746
 provincedum4 |  -.2105286   .0729672    -2.89   0.004    -.3537656   -.0672915
 provincedum5 |  -.0863282   .0517406    -1.67   0.096    -.1878967    .0152402
 provincedum6 |  -.1679841   .0538346    -3.12   0.002    -.2736633   -.0623049
 provincedum7 |  -.1392568   .0511642    -2.72   0.007    -.2396937   -.0388198
 provincedum8 |  -.1786814   .0501059    -3.57   0.000     -.277041   -.0803218
 provincedum9 |  -.1734123   .0514167    -3.37   0.001     -.274345   -.0724797
provincedum10 |  -.1844598   .0536584    -3.44   0.001    -.2897929   -.0791266
provincedum11 |   -.083123   .0505427    -1.64   0.100    -.1823401    .0160941
provincedum12 |  -.1737231   .0631986    -2.75   0.006    -.2977841   -.0496621
provincedum13 |  -.1871481   .0565875    -3.31   0.001    -.2982312    -.076065
provincedum14 |  -.1407435   .0570097    -2.47   0.014    -.2526555   -.0288316
provincedum15 |  -.1850437   .0559664    -3.31   0.001    -.2949077   -.0751798
            t |   .0003811   .0011753     0.32   0.746    -.0019261    .0026883
            d |   .0003173   .0359144     0.01   0.993    -.0701839    .0708186
           td |    .000971   .0016998     0.57   0.568    -.0023657    .0043077
        _cons |   .1663506   .0507433     3.28   0.001     .0667397    .2659615
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        794
                                                  Wald chi2(18)   =       0.26
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =     9.1589

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   61.87092   578.3739     0.11   0.915    -1071.721    1195.463
secgenhighedu |  -39.89849    384.978    -0.10   0.917    -794.4415    714.6445
       tenure |  -.3949592   3.674817    -0.11   0.914    -7.597468     6.80755
    tenuresqr |   .0151654   .1406678     0.11   0.914    -.2605385    .2908692
 provincedum2 |   3.199468   31.31554     0.10   0.919    -58.17785    64.57679
 provincedum3 |    6.07599   57.37509     0.11   0.916    -106.3771    118.5291
 provincedum4 |   8.016709    73.4424     0.11   0.913    -135.9277    151.9612
 provincedum5 |   2.432032   22.82657     0.11   0.915    -42.30723    47.17129
 provincedum6 |   7.510404   67.58641     0.11   0.912    -124.9565    139.9773
 provincedum7 |   6.720625   60.72005     0.11   0.912    -112.2885    125.7297
 provincedum8 |   5.999687   56.28224     0.11   0.915    -104.3115    116.3109
 provincedum9 |   7.666541   69.31312     0.11   0.912    -128.1847    143.5178
provincedum10 |   7.677262   69.23397     0.11   0.912    -128.0188    143.3734
provincedum11 |   4.710548   44.31612     0.11   0.915    -82.14744    91.56854
provincedum12 |   4.901171   47.15716     0.10   0.917    -87.52517    97.32751
provincedum13 |    6.20933   59.57729     0.10   0.917      -110.56    122.9787
provincedum14 |   6.215509    57.9255     0.11   0.915    -107.3164    119.7474
provincedum15 |   5.965846   57.09999     0.10   0.917    -105.9481    117.8798
        _cons |   1.399132    63.1939     0.02   0.982    -122.4586    125.2569
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  3.69079  (p = 0.1580)
  Wu-Hausman F(2,773)             =  1.80498  (p = 0.1652)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .004844  (p = 0.9445)
  Basmann chi2(1)        =  .004722  (p = 0.9452)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.020  Chi-sq(19) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        794    8.300732    .6277352   5.298317   9.721166
      tenure |        794    5.778338    5.501689          0         26
   tenuresqr |        794    63.61965    96.67399          0        676
        male |        794           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "End
> ogeneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value"
> , `basman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `paga
> n_hall_p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu = t d td ) if
>  inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male == 0 & ed
> ucat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    497
                                                        F(5, 491)     =   2.38
                                                        Prob > F      = 0.0380
                                                        R-squared     = 0.0236
                                                        Adj R-squared = 0.0137
                                                        Root MSE      = 0.2610

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0122499    .006641     1.84   0.066    -.0007984    .0252983
   tenuresqr |  -.0005262   .0003946    -1.33   0.183    -.0013015    .0002491
           t |   .0028914   .0014408     2.01   0.045     .0000605    .0057222
           d |   .0089131   .0470489     0.19   0.850    -.0835289    .1013551
          td |  -.0037094   .0022375    -1.66   0.098    -.0081058    .0006869
       _cons |   .0695438   .0335453     2.07   0.039     .0036338    .1354538
------------------------------------------------------------------------------

                                                        Number of obs =    497
                                                        F(5, 491)     =   2.32
                                                        Prob > F      = 0.0421
                                                        R-squared     = 0.0231
                                                        Adj R-squared = 0.0132
                                                        Root MSE      = 0.2405

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |    .008647   .0061199     1.41   0.158    -.0033774    .0206715
   tenuresqr |  -.0004131   .0003636    -1.14   0.257    -.0011276    .0003014
           t |    .002746   .0013277     2.07   0.039     .0001373    .0053547
           d |   .0203604   .0433572     0.47   0.639     -.064828    .1055489
          td |  -.0037546    .002062    -1.82   0.069     -.007806    .0002967
       _cons |    .064631   .0309131     2.09   0.037     .0038927    .1253693
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        497
                                                  Wald chi2(4)    =      10.89
                                                  Prob > chi2     =     0.0278
                                                  R-squared       =          .
                                                  Root MSE        =     .72616

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -3.581226   11.28178    -0.32   0.751    -25.69311    18.53065
secgenhighedu |   3.626731   10.86015     0.33   0.738    -17.65877    24.91223
       tenure |   .0715105    .049836     1.43   0.151    -.0261664    .1691873
    tenuresqr |  -.0033514   .0019097    -1.75   0.079    -.0070944    .0003916
        _cons |   7.704787   .0702341   109.70   0.000      7.56713    7.842443
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .134734  (p = 0.9349)
  Wu-Hausman F(2,490)             =  .066436  (p = 0.9357)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  1.56378  (p = 0.2111)
  Basmann chi2(1)        =  1.54977  (p = 0.2132)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.663  Chi-sq(5) P-value = 0.9850

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        497    7.850469    .6357122   5.521461   9.364491
      tenure |        497    4.869215     4.97139          0         25
   tenuresqr |        497    48.37425    83.63627          0        625
        male |        497           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue adds
> tat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneit
> y df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basm
> an_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_
> p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu 
> secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 2
> 00, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    497
                                                        F(19, 477)    =   2.64
                                                        Prob > F      = 0.0002
                                                        R-squared     = 0.0953
                                                        Adj R-squared = 0.0593
                                                        Root MSE      = 0.2549

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0100684   .0068098     1.48   0.140    -.0033126    .0234494
    tenuresqr |  -.0004315   .0004022    -1.07   0.284    -.0012218    .0003588
 provincedum2 |  -.3473952   .1013071    -3.43   0.001    -.5464585   -.1483319
 provincedum3 |  -.3331405   .1335638    -2.49   0.013    -.5955865   -.0706944
 provincedum4 |  -.3160038   .1146361    -2.76   0.006     -.541258   -.0907497
 provincedum5 |  -.1734393   .0768556    -2.26   0.024    -.3244567    -.022422
 provincedum6 |  -.3466187   .0822647    -4.21   0.000    -.5082648   -.1849727
 provincedum7 |  -.3179181   .0813567    -3.91   0.000    -.4777798   -.1580563
 provincedum8 |  -.2641151   .0748194    -3.53   0.000    -.4111316   -.1170987
 provincedum9 |  -.3082098   .0779979    -3.95   0.000    -.4614718   -.1549477
provincedum10 |  -.2853747   .0803206    -3.55   0.000    -.4432007   -.1275487
provincedum11 |  -.2470233   .0759988    -3.25   0.001    -.3963572   -.0976895
provincedum12 |  -.3218475   .0996085    -3.23   0.001    -.5175732   -.1261218
provincedum13 |  -.3413001   .0829387    -4.12   0.000    -.5042706   -.1783296
provincedum14 |  -.3066552   .0795867    -3.85   0.000     -.463039   -.1502713
provincedum15 |  -.1616348   .0928154    -1.74   0.082    -.3440124    .0207428
            t |   .0024788   .0014218     1.74   0.082    -.0003149    .0052725
            d |  -.0131638   .0466624    -0.28   0.778    -.1048531    .0785256
           td |  -.0024577   .0022193    -1.11   0.269    -.0068185    .0019032
        _cons |   .3441027   .0751123     4.58   0.000     .1965108    .4916946
-------------------------------------------------------------------------------

                                                        Number of obs =    497
                                                        F(19, 477)    =   2.49
                                                        Prob > F      = 0.0005
                                                        R-squared     = 0.0902
                                                        Adj R-squared = 0.0540
                                                        Root MSE      = 0.2355

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0068178   .0062913     1.08   0.279    -.0055442    .0191798
    tenuresqr |  -.0003396   .0003716    -0.91   0.361    -.0010698    .0003905
 provincedum2 |  -.3409024   .0935925    -3.64   0.000    -.5248069   -.1569979
 provincedum3 |  -.3356367   .1233928    -2.72   0.007    -.5780973   -.0931761
 provincedum4 |   -.316015   .1059065    -2.98   0.003    -.5241159   -.1079141
 provincedum5 |  -.2025789    .071003    -2.85   0.005    -.3420962   -.0630617
 provincedum6 |  -.3427893   .0760002    -4.51   0.000    -.4921259   -.1934527
 provincedum7 |  -.3127864   .0751613    -4.16   0.000    -.4604746   -.1650982
 provincedum8 |  -.2747327   .0691219    -3.97   0.000    -.4105537   -.1389116
 provincedum9 |  -.3032835   .0720583    -4.21   0.000    -.4448745   -.1616925
provincedum10 |  -.3092732   .0742041    -4.17   0.000    -.4550807   -.1634658
provincedum11 |  -.2556662   .0702115    -3.64   0.000    -.3936281   -.1177042
provincedum12 |  -.3237449   .0920232    -3.52   0.000     -.504566   -.1429239
provincedum13 |  -.3375848   .0766229    -4.41   0.000     -.488145   -.1870246
provincedum14 |  -.3073249   .0735261    -4.18   0.000    -.4518001   -.1628498
provincedum15 |   -.218048   .0857475    -2.54   0.011    -.3865375   -.0495586
            t |   .0022857   .0013135     1.74   0.082    -.0002953    .0048667
            d |  -.0006344    .043109    -0.01   0.988    -.0853415    .0840727
           td |  -.0024955   .0020503    -1.22   0.224    -.0065243    .0015332
        _cons |   .3464391   .0693925     4.99   0.000     .2100864    .4827917
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        497
                                                  Wald chi2(18)   =      33.79
                                                  Prob > chi2     =     0.0134
                                                  R-squared       =          .
                                                  Root MSE        =     .79076

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   4.628107   11.12106     0.42   0.677    -17.16877    26.42499
secgenhighedu |  -4.628638   10.99469    -0.42   0.674    -26.17783    16.92055
       tenure |    .039735   .0448199     0.89   0.375    -.0481104    .1275805
    tenuresqr |  -.0024981   .0017489    -1.43   0.153    -.0059258    .0009297
 provincedum2 |  -.5456562   .6187205    -0.88   0.378    -1.758326    .6670137
 provincedum3 |  -1.304816   .6526021    -2.00   0.046    -2.583893   -.0257397
 provincedum4 |  -.6159692   .6172411    -1.00   0.318     -1.82574    .5938011
 provincedum5 |  -.3505595   .4937494    -0.71   0.478    -1.318291    .6171716
 provincedum6 |  -.1998798   .5859101    -0.34   0.733    -1.348243    .9484829
 provincedum7 |  -.4718262   .5472994    -0.86   0.389    -1.544513    .6008609
 provincedum8 |  -.4586824   .4854953    -0.94   0.345    -1.410236    .4928708
 provincedum9 |  -.0495542   .5295169    -0.09   0.925    -1.087388    .9882797
provincedum10 |  -.3472229   .5780232    -0.60   0.548    -1.480128    .7856817
provincedum11 |  -.2953418   .4575372    -0.65   0.519    -1.192098    .6014146
provincedum12 |   -.217567   .5932939    -0.37   0.714    -1.380402    .9452676
provincedum13 |  -.3033131   .5860492    -0.52   0.605    -1.451948    .8453221
provincedum14 |  -.2695217    .532204    -0.51   0.613    -1.312622     .773579
provincedum15 |  -.9069455   .7473585    -1.21   0.225    -2.371741    .5578502
        _cons |    8.06479   .5399124    14.94   0.000     7.006581    9.122999
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .409937  (p = 0.8147)
  Wu-Hausman F(2,476)             =   .19647  (p = 0.8217)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .733074  (p = 0.3919)
  Basmann chi2(1)        =  .704613  (p = 0.4012)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.329  Chi-sq(19) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        497    7.850469    .6357122   5.521461   9.364491
      tenure |        497    4.869215     4.97139          0         25
   tenuresqr |        497    48.37425    83.63627          0        625
        male |        497           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pv
> alue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-valu
> e", `basman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pa
> gan_hall_p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning tenure tenuresqr male (higheredu = t d td ) if inrange(
> t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,291
                                                        F(6, 1284)    =   3.71
                                                        Prob > F      = 0.0011
                                                        R-squared     = 0.0171
                                                        Adj R-squared = 0.0125
                                                        Root MSE      = 0.2706

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0154133    .004299     3.59   0.000     .0069794    .0238472
   tenuresqr |  -.0006722   .0002483    -2.71   0.007    -.0011593    -.000185
        male |   .0058908   .0155477     0.38   0.705    -.0246108    .0363924
           t |   .0013642   .0009652     1.41   0.158    -.0005293    .0032578
           d |   .0013247   .0303069     0.04   0.965    -.0581318    .0607812
          td |  -.0011652   .0014387    -0.81   0.418    -.0039876    .0016573
       _cons |   .0419099   .0238611     1.76   0.079    -.0049011    .0887209
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,291
                                                  Wald chi2(4)    =     138.65
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .70296

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |   1.365879   1.092656     1.25   0.211    -.7756875    3.507445
      tenure |   .0162459   .0202367     0.80   0.422    -.0234173    .0559092
   tenuresqr |  -.0009378   .0009938    -0.94   0.345    -.0028857    .0010101
        male |   .4362189   .0409582    10.65   0.000     .3559423    .5164956
       _cons |   7.715046   .0547884   140.82   0.000     7.607663     7.82243
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  1.50744  (p = 0.2195)
  Wu-Hausman F(1,1285)            =  1.50219  (p = 0.2206)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  1.99975  (p = 0.3679)
  Basmann chi2(2)        =  1.99199  (p = 0.3694)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.957  Chi-sq(6) P-value = 0.9236

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,291    8.127393    .6675777   5.298317   9.721166
      tenure |      1,291     5.42835    5.320293          0         26
   tenuresqr |      1,291    57.75058    92.14012          0        676
        male |      1,291    .6150271    .4867775          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Du
> rbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_
> df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overid
> entification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroske
> dasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr male provincedum2-provincedum15 (highe
> redu  = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 1666
> 7) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,291
                                                        F(20, 1270)   =   4.52
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0664
                                                        Adj R-squared = 0.0517
                                                        Root MSE      = 0.2651

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0137777   .0043068     3.20   0.001     .0053285    .0222269
    tenuresqr |  -.0006214   .0002471    -2.51   0.012    -.0011063   -.0001366
         male |   .0067139   .0153574     0.44   0.662    -.0234147    .0368425
 provincedum2 |  -.2276194   .0626946    -3.63   0.000    -.3506158    -.104623
 provincedum3 |  -.2226974   .0787001    -2.83   0.005    -.3770939    -.068301
 provincedum4 |  -.2813765   .0651023    -4.32   0.000    -.4090963   -.1536567
 provincedum5 |  -.1211265   .0451574    -2.68   0.007    -.2097178   -.0325352
 provincedum6 |  -.2670523   .0476455    -5.60   0.000    -.3605249   -.1735797
 provincedum7 |   -.235158   .0458636    -5.13   0.000    -.3251347   -.1451812
 provincedum8 |  -.2275838   .0438146    -5.19   0.000    -.3135407   -.1416268
 provincedum9 |  -.2583638   .0453213    -5.70   0.000    -.3472766    -.169451
provincedum10 |  -.2544439   .0470207    -5.41   0.000    -.3466907   -.1621971
provincedum11 |   -.171573   .0443479    -3.87   0.000    -.2585762   -.0845699
provincedum12 |  -.2383922   .0564303    -4.22   0.000    -.3490992   -.1276853
provincedum13 |  -.2672078   .0492163    -5.43   0.000     -.363762   -.1706537
provincedum14 |  -.2348039   .0481318    -4.88   0.000    -.3292304   -.1403774
provincedum15 |  -.2136406   .0507064    -4.21   0.000    -.3131181    -.114163
            t |   .0011037   .0009506     1.16   0.246    -.0007612    .0029686
            d |  -.0026053   .0298071    -0.09   0.930    -.0610818    .0558712
           td |  -.0006407   .0014184    -0.45   0.652    -.0034233    .0021419
        _cons |   .2582155     .04512     5.72   0.000     .1696975    .3467334
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,291
                                                  Wald chi2(18)   =     181.34
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .71205

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |    1.56362   1.275146     1.23   0.220      -.93562    4.062861
       tenure |   .0099488    .021119     0.47   0.638    -.0314438    .0513413
    tenuresqr |  -.0006415   .0010536    -0.61   0.543    -.0027066    .0014236
         male |   .4359231   .0422162    10.33   0.000     .3531808    .5186654
 provincedum2 |  -.0259947   .3399014    -0.08   0.939    -.6921892    .6401997
 provincedum3 |  -.2047427   .3596481    -0.57   0.569    -.9096401    .5001546
 provincedum4 |   .2022043   .4096619     0.49   0.622    -.6007183    1.005127
 provincedum5 |   .0689722   .2005593     0.34   0.731    -.3241169    .4620612
 provincedum6 |   .4096699   .3679856     1.11   0.266    -.3115685    1.130908
 provincedum7 |   .2698575   .3290932     0.82   0.412    -.3751533    .9148684
 provincedum8 |   .0841254   .3173897     0.27   0.791     -.537947    .7061979
 provincedum9 |   .4249478   .3544696     1.20   0.231    -.2697998    1.119695
provincedum10 |   .3615882   .3519174     1.03   0.304    -.3281573    1.051334
provincedum11 |    .121359   .2521044     0.48   0.630    -.3727565    .6154745
provincedum12 |   .0797003   .3445153     0.23   0.817    -.5955373     .754938
provincedum13 |   .0932553   .3718039     0.25   0.802    -.6354668    .8219775
provincedum14 |    .192056   .3275556     0.59   0.558    -.4499412    .8340532
provincedum15 |  -.0949694   .3064205    -0.31   0.757    -.6955426    .5056039
        _cons |    7.54132   .3438007    21.94   0.000     6.867483    8.215157
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  1.62611  (p = 0.2022)
  Wu-Hausman F(1,1271)            =  1.60294  (p = 0.2057)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  1.29221  (p = 0.5241)
  Basmann chi2(2)        =  1.27246  (p = 0.5293)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  25.442  Chi-sq(20) P-value = 0.1851

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,291    8.127393    .6675777   5.298317   9.721166
      tenure |      1,291     5.42835    5.320293          0         26
   tenuresqr |      1,291    57.75058    92.14012          0        676
        male |      1,291    .6150271    .4867775          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("
> Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df"
> , `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p'
> , "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "
> Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu  = t d td ) if inrange(t, -
> `months', `months'-1) & inrange(monthlyearning, 200, 16667) & male == 1 & educat != ., fi
> rst

First-stage regressions
-----------------------

                                                        Number of obs =    794
                                                        F(5, 788)     =   2.68
                                                        Prob > F      = 0.0205
                                                        R-squared     = 0.0167
                                                        Adj R-squared = 0.0105
                                                        Root MSE      = 0.2767

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0175239   .0056441     3.10   0.002     .0064446    .0286033
   tenuresqr |  -.0007781   .0003212    -2.42   0.016    -.0014087   -.0001475
           t |   .0003459   .0012964     0.27   0.790    -.0021989    .0028908
           d |   -.000816   .0397819    -0.02   0.984    -.0789071    .0772751
          td |   .0004609   .0018816     0.24   0.807    -.0032326    .0041544
       _cons |   .0285927   .0300303     0.95   0.341    -.0303562    .0875416
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        794
                                                  Wald chi2(3)    =       2.79
                                                  Prob > chi2     =     0.4245
                                                  R-squared       =          .
                                                  Root MSE        =     .80736

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |   2.021187   2.385651     0.85   0.397    -2.654604    6.696977
      tenure |  -.0120198   .0448277    -0.27   0.789    -.0998805     .075841
   tenuresqr |   .0004154   .0021026     0.20   0.843    -.0037056    .0045363
       _cons |   8.173207   .0953162    85.75   0.000     7.986391    8.360024
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  1.01363  (p = 0.3140)
  Wu-Hausman F(1,789)             =  1.00854  (p = 0.3156)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  1.71811  (p = 0.4236)
  Basmann chi2(2)        =  1.70883  (p = 0.4255)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   2.732  Chi-sq(5) P-value = 0.7412

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        794    8.300732    .6277352   5.298317   9.721166
      tenure |        794    5.778338    5.501689          0         26
   tenuresqr |        794    63.61965    96.67399          0        676
        male |        794           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df
> ', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overiden
> tification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskeda
> sticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu 
>  = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & 
> male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    794
                                                        F(19, 774)    =   2.76
                                                        Prob > F      = 0.0001
                                                        R-squared     = 0.0635
                                                        Adj R-squared = 0.0405
                                                        Root MSE      = 0.2724

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0159587   .0056441     2.83   0.005     .0048791    .0270383
    tenuresqr |  -.0007331   .0003199    -2.29   0.022     -.001361   -.0001051
 provincedum2 |  -.1553625    .081358    -1.91   0.057    -.3150711    .0043461
 provincedum3 |  -.1737564   .0984893    -1.76   0.078    -.3670942    .0195815
 provincedum4 |  -.2664318   .0802061    -3.32   0.001    -.4238791   -.1089844
 provincedum5 |  -.0967299   .0568737    -1.70   0.089    -.2083748     .014915
 provincedum6 |  -.2283067   .0591755    -3.86   0.000    -.3444702   -.1121432
 provincedum7 |  -.1974685   .0562401    -3.51   0.000    -.3078697   -.0870673
 provincedum8 |  -.2159313   .0550769    -3.92   0.000     -.324049   -.1078136
 provincedum9 |  -.2350188   .0565176    -4.16   0.000    -.3459649   -.1240728
provincedum10 |  -.2422055   .0589817    -4.11   0.000    -.3579886   -.1264224
provincedum11 |  -.1316551    .055557    -2.37   0.018    -.2407154   -.0225949
provincedum12 |  -.1968848   .0694685    -2.83   0.005    -.3332537   -.0605159
provincedum13 |  -.2272797   .0622014    -3.65   0.000    -.3493831   -.1051762
provincedum14 |  -.1936895   .0626655    -3.09   0.002     -.316704   -.0706749
provincedum15 |  -.2216621   .0615187    -3.60   0.000    -.3424254   -.1008987
            t |    .000325   .0012919     0.25   0.801    -.0022111    .0028611
            d |   -.000597   .0394774    -0.02   0.988    -.0780925    .0768986
           td |   .0005505   .0018684     0.29   0.768    -.0031173    .0042182
        _cons |   .2209457   .0557775     3.96   0.000     .1114525    .3304388
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        794
                                                  Wald chi2(17)   =      33.88
                                                  Prob > chi2     =     0.0087
                                                  R-squared       =          .
                                                  Root MSE        =     .77783

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   1.988471   2.183885     0.91   0.363    -2.291864    6.268806
       tenure |  -.0170064   .0384349    -0.44   0.658    -.0923374    .0583245
    tenuresqr |   .0007663   .0018689     0.41   0.682    -.0028966    .0044292
 provincedum2 |  -.0071889   .4101775    -0.02   0.986    -.8111221    .7967443
 provincedum3 |   .1585168   .4788778     0.33   0.741    -.7800664      1.0971
 provincedum4 |   .4439265   .6278859     0.71   0.480    -.7867072     1.67456
 provincedum5 |   .0894499   .2703959     0.33   0.741    -.4405163    .6194162
 provincedum6 |   .5355464   .5278868     1.01   0.310    -.4990927    1.570185
 provincedum7 |   .4530785   .4626649     0.98   0.327     -.453728    1.359885
 provincedum8 |   .1984026    .497757     0.40   0.690    -.7771833    1.173989
 provincedum9 |   .5134878   .5413706     0.95   0.343    -.5475791    1.574555
provincedum10 |   .5337358   .5526728     0.97   0.334     -.549483    1.616955
provincedum11 |   .1352123   .3283551     0.41   0.680    -.5083518    .7787765
provincedum12 |   .0483547   .4748433     0.10   0.919     -.882321    .9790304
provincedum13 |   .0688815   .5305851     0.13   0.897    -.9710462    1.108809
provincedum14 |   .2379558   .4551505     0.52   0.601    -.6541227    1.130034
provincedum15 |    .081349   .5133408     0.16   0.874    -.9247805    1.087478
        _cons |   7.918072   .5162503    15.34   0.000      6.90624    8.929904
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  1.14347  (p = 0.2849)
  Wu-Hausman F(1,775)             =  1.11772  (p = 0.2907)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  2.16083  (p = 0.3395)
  Basmann chi2(2)        =  2.11215  (p = 0.3478)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  23.183  Chi-sq(19) P-value = 0.2294

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        794    8.300732    .6277352   5.298317   9.721166
      tenure |        794    5.778338    5.501689          0         26
   tenuresqr |        794    63.61965    96.67399          0        676
        male |        794           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", 
> `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', 
> "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "He
> teroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu  = t d td ) if inrange(t, -
> `months', `months'-1) & inrange(monthlyearning, 200, 16667) & male == 0 & educat != ., fi
> rst

First-stage regressions
-----------------------

                                                        Number of obs =    497
                                                        F(5, 491)     =   2.38
                                                        Prob > F      = 0.0380
                                                        R-squared     = 0.0236
                                                        Adj R-squared = 0.0137
                                                        Root MSE      = 0.2610

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0122499    .006641     1.84   0.066    -.0007984    .0252983
   tenuresqr |  -.0005262   .0003946    -1.33   0.183    -.0013015    .0002491
           t |   .0028914   .0014408     2.01   0.045     .0000605    .0057222
           d |   .0089131   .0470489     0.19   0.850    -.0835289    .1013551
          td |  -.0037094   .0022375    -1.66   0.098    -.0081058    .0006869
       _cons |   .0695438   .0335453     2.07   0.039     .0036338    .1354538
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        497
                                                  Wald chi2(3)    =      14.60
                                                  Prob > chi2     =     0.0022
                                                  R-squared       =     0.0349
                                                  Root MSE        =      .6239

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |   .1708419   .8773869     0.19   0.846    -1.548805    1.890489
      tenure |   .0566386   .0192197     2.95   0.003     .0189687    .0943086
   tenuresqr |  -.0028641   .0010586    -2.71   0.007    -.0049391   -.0007892
       _cons |   7.700516    .059335   129.78   0.000     7.584222    7.816811
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .001084  (p = 0.9737)
  Wu-Hausman F(1,492)             =  .001073  (p = 0.9739)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  2.26947  (p = 0.3215)
  Basmann chi2(2)        =  2.25236  (p = 0.3243)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.395  Chi-sq(5) P-value = 0.9249

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        497    7.850469    .6357122   5.521461   9.364491
      tenure |        497    4.869215     4.97139          0         25
   tenuresqr |        497    48.37425    83.63627          0        625
        male |        497           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Du
> rbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_
> df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overid
> entification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroske
> dasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu 
> = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & m
> ale == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    497
                                                        F(19, 477)    =   2.64
                                                        Prob > F      = 0.0002
                                                        R-squared     = 0.0953
                                                        Adj R-squared = 0.0593
                                                        Root MSE      = 0.2549

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0100684   .0068098     1.48   0.140    -.0033126    .0234494
    tenuresqr |  -.0004315   .0004022    -1.07   0.284    -.0012218    .0003588
 provincedum2 |  -.3473952   .1013071    -3.43   0.001    -.5464585   -.1483319
 provincedum3 |  -.3331405   .1335638    -2.49   0.013    -.5955865   -.0706944
 provincedum4 |  -.3160038   .1146361    -2.76   0.006     -.541258   -.0907497
 provincedum5 |  -.1734393   .0768556    -2.26   0.024    -.3244567    -.022422
 provincedum6 |  -.3466187   .0822647    -4.21   0.000    -.5082648   -.1849727
 provincedum7 |  -.3179181   .0813567    -3.91   0.000    -.4777798   -.1580563
 provincedum8 |  -.2641151   .0748194    -3.53   0.000    -.4111316   -.1170987
 provincedum9 |  -.3082098   .0779979    -3.95   0.000    -.4614718   -.1549477
provincedum10 |  -.2853747   .0803206    -3.55   0.000    -.4432007   -.1275487
provincedum11 |  -.2470233   .0759988    -3.25   0.001    -.3963572   -.0976895
provincedum12 |  -.3218475   .0996085    -3.23   0.001    -.5175732   -.1261218
provincedum13 |  -.3413001   .0829387    -4.12   0.000    -.5042706   -.1783296
provincedum14 |  -.3066552   .0795867    -3.85   0.000     -.463039   -.1502713
provincedum15 |  -.1616348   .0928154    -1.74   0.082    -.3440124    .0207428
            t |   .0024788   .0014218     1.74   0.082    -.0003149    .0052725
            d |  -.0131638   .0466624    -0.28   0.778    -.1048531    .0785256
           td |  -.0024577   .0022193    -1.11   0.269    -.0068185    .0019032
        _cons |   .3441027   .0751123     4.58   0.000     .1965108    .4916946
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        497
                                                  Wald chi2(17)   =      58.18
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1041
                                                  Root MSE        =      .6011

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -.0133696   1.107677    -0.01   0.990    -2.184376    2.157637
       tenure |   .0551844   .0195598     2.82   0.005      .016848    .0935209
    tenuresqr |  -.0029351   .0010699    -2.74   0.006     -.005032   -.0008382
 provincedum2 |  -.5661272    .468872    -1.21   0.227    -1.485099     .352845
 provincedum3 |  -1.283692   .4946135    -2.60   0.009    -2.253116   -.3142668
 provincedum4 |  -.6057993   .4688427    -1.29   0.196    -1.524714    .3131155
 provincedum5 |  -.2101289   .2767206    -0.76   0.448    -.7524912    .3322334
 provincedum6 |  -.2132073    .444735    -0.48   0.632    -1.084872    .6584573
 provincedum7 |  -.4858839   .4152602    -1.17   0.242    -1.299779    .3280111
 provincedum8 |  -.4060315    .356599    -1.14   0.255    -1.104953    .2928896
 provincedum9 |  -.0711406    .400626    -0.18   0.859    -.8563532     .714072
provincedum10 |  -.2332809   .3882459    -0.60   0.548    -.9942288     .527667
provincedum11 |  -.2506463   .3383086    -0.74   0.459    -.9137189    .4124264
provincedum12 |  -.2013533   .4500472    -0.45   0.655     -1.08343     .680723
provincedum13 |  -.3160751   .4448949    -0.71   0.477    -1.188053    .5559029
provincedum14 |  -.2657252   .4045023    -0.66   0.511    -1.058535    .5270847
provincedum15 |  -.6380217   .2948898    -2.16   0.030    -1.215995   -.0600484
        _cons |   8.023697   .4036569    19.88   0.000     7.232544     8.81485
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .029335  (p = 0.8640)
  Wu-Hausman F(1,478)             =  .028215  (p = 0.8667)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  1.57535  (p = 0.4549)
  Basmann chi2(2)        =  1.51676  (p = 0.4684)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  14.680  Chi-sq(19) P-value = 0.7427

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        497    7.850469    .6357122   5.521461   9.364491
      tenure |        497    4.869215     4.97139          0         25
   tenuresqr |        497    48.37425    83.63627          0        625
        male |        497           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("
> Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df"
> , `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p'
> , "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "
> Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Time Frame/Tenu
> re/Rural/IV Rural ATF Tenure 1982 3years.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Ivregress/Ivregress/1982/Adjusted Ti
> me Frame/Tenure/Rural/IV Rural ATF Tenure 1982 3years.log
  log type:  text
 closed on:  14 Aug 2024, 05:35:57
-------------------------------------------------------------------------------------------
