---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Tenure/IV Urban ATF&Birth Tenure 1979 3years.log
  log type:  text
 opened on:   6 Aug 2024, 17:34:48

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,362 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. **
. tab birthmonth, gen(birthmonthdum)

 birthmonth |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,940        8.11        8.11
          2 |      2,993        8.26       16.37
          3 |      2,883        7.95       24.32
          4 |      2,595        7.16       31.48
          5 |      2,755        7.60       39.08
          6 |      2,889        7.97       47.05
          7 |      2,830        7.81       54.86
          8 |      3,239        8.94       63.80
          9 |      3,187        8.79       72.59
         10 |      3,723       10.27       82.86
         11 |      3,121        8.61       91.47
         12 |      3,091        8.53      100.00
------------+-----------------------------------
      Total |     36,246      100.00

. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. local months = 36

. 
. 
. *1)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu secgenhighedu secgenedu = t d td) if inrange(t, -`months', `months'-1) & inrange(mon
> thlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(17, 2693)   =  13.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0787
                                                        Adj R-squared = 0.0729
                                                        Root MSE      = 0.4740

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0254631   .0046999     5.42   0.000     .0162473    .0346788
      tenuresqr |  -.0003487    .000219    -1.59   0.112    -.0007782    .0000808
 birthmonthdum2 |  -.0606869    .045281    -1.34   0.180    -.1494759    .0281022
 birthmonthdum3 |   .0334053   .0457824     0.73   0.466     -.056367    .1231776
 birthmonthdum4 |    -.09588   .0496329    -1.93   0.053    -.1932023    .0014424
 birthmonthdum5 |  -.1123345   .0468348    -2.40   0.017    -.2041702   -.0204988
 birthmonthdum6 |  -.1078458   .0466855    -2.31   0.021    -.1993888   -.0163028
 birthmonthdum7 |  -.0517959    .046252    -1.12   0.263     -.142489    .0388971
 birthmonthdum8 |  -.0720239   .0467263    -1.54   0.123    -.1636469    .0195991
 birthmonthdum9 |  -.0134891    .045064    -0.30   0.765    -.1018527    .0748744
birthmonthdum10 |    -.05403    .042972    -1.26   0.209    -.1382914    .0302314
birthmonthdum11 |  -.0731019   .0451096    -1.62   0.105    -.1615549    .0153511
birthmonthdum12 |  -.0010485   .0462534    -0.02   0.982    -.0917443    .0896473
           male |   .0091183   .0183483     0.50   0.619    -.0268599    .0450964
              t |   .0003667    .001209     0.30   0.762     -.002004    .0027373
              d |   .0406176   .0377771     1.08   0.282    -.0334574    .1146926
             td |    .002503   .0017244     1.45   0.147    -.0008783    .0058844
          _cons |   .2260436   .0459368     4.92   0.000     .1359685    .3161186
---------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(17, 2693)   =   8.27
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0496
                                                        Adj R-squared = 0.0436
                                                        Root MSE      = 0.4615

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0306955    .004576     6.71   0.000     .0217227    .0396684
      tenuresqr |   -.000895   .0002133    -4.20   0.000    -.0013132   -.0004768
 birthmonthdum2 |  -.0313146   .0440876    -0.71   0.478    -.1177635    .0551343
 birthmonthdum3 |   -.006869   .0445758    -0.15   0.878    -.0942753    .0805372
 birthmonthdum4 |  -.1040546   .0483247    -2.15   0.031    -.1988119   -.0092973
 birthmonthdum5 |  -.0582717   .0456004    -1.28   0.201     -.147687    .0311436
 birthmonthdum6 |  -.0782382    .045455    -1.72   0.085    -.1673685     .010892
 birthmonthdum7 |   -.058197    .045033    -1.29   0.196    -.1464998    .0301057
 birthmonthdum8 |  -.0271924   .0454947    -0.60   0.550    -.1164005    .0620158
 birthmonthdum9 |    .009776   .0438763     0.22   0.824    -.0762586    .0958106
birthmonthdum10 |  -.0422788   .0418394    -1.01   0.312    -.1243194    .0397618
birthmonthdum11 |  -.0435344   .0439207    -0.99   0.322    -.1296561    .0425874
birthmonthdum12 |   .0078356   .0450343     0.17   0.862    -.0804698     .096141
           male |   .0212788   .0178647     1.19   0.234    -.0137511    .0563087
              t |   .0014288   .0011771     1.21   0.225    -.0008794    .0037371
              d |   .0195748   .0367814     0.53   0.595    -.0525478    .0916975
             td |   .0003925    .001679     0.23   0.815    -.0028997    .0036848
          _cons |   .1796325   .0447261     4.02   0.000     .0919315    .2673335
---------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(17, 2693)   =   5.86
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0357
                                                        Adj R-squared = 0.0296
                                                        Root MSE      = 0.4894

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0333428   .0048528     6.87   0.000     .0238272    .0428584
      tenuresqr |  -.0011599   .0002262    -5.13   0.000    -.0016034   -.0007164
 birthmonthdum2 |  -.0239049   .0467544    -0.51   0.609     -.115583    .0677732
 birthmonthdum3 |  -.0252942   .0472721    -0.54   0.593    -.1179875    .0673992
 birthmonthdum4 |  -.0777517   .0512478    -1.52   0.129    -.1782408    .0227374
 birthmonthdum5 |  -.0319233   .0483587    -0.66   0.509    -.1267473    .0629006
 birthmonthdum6 |  -.0543982   .0482045    -1.13   0.259    -.1489199    .0401234
 birthmonthdum7 |  -.0496262    .047757    -1.04   0.299    -.1432703    .0440179
 birthmonthdum8 |  -.0233752   .0482467    -0.48   0.628    -.1179794    .0712291
 birthmonthdum9 |  -.0093306   .0465303    -0.20   0.841    -.1005694    .0819081
birthmonthdum10 |   -.042641   .0443702    -0.96   0.337    -.1296442    .0443621
birthmonthdum11 |   .0022293   .0465774     0.05   0.962    -.0891019    .0935604
birthmonthdum12 |   .0062836   .0477584     0.13   0.895    -.0873633    .0999305
           male |   .0360624   .0189453     1.90   0.057    -.0010864    .0732112
              t |   .0017033   .0012484     1.36   0.173    -.0007445    .0041512
              d |   -.006401   .0390063    -0.16   0.870    -.0828863    .0700843
             td |   .0003291   .0017806     0.18   0.853    -.0031623    .0038205
          _cons |   .2959875   .0474315     6.24   0.000     .2029816    .3889935
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(17)   =     102.74
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     1.1149

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.410993   2.012568    -0.70   0.483    -5.355554    2.533568
  secgenhighedu |   4.385565   5.222447     0.84   0.401    -5.850243    14.62137
      secgenedu |  -2.518952   4.285829    -0.59   0.557    -10.91902    5.881118
         tenure |   .0352591   .0383839     0.92   0.358     -.039972    .1104902
      tenuresqr |  -.0010381   .0019531    -0.53   0.595     -.004866    .0027898
 birthmonthdum2 |  -.0101748   .1148565    -0.09   0.929    -.2352895    .2149398
 birthmonthdum3 |  -.0622807   .1361574    -0.46   0.647    -.3291442    .2045828
 birthmonthdum4 |   .0423765   .1605043     0.26   0.792    -.2722061    .3569591
 birthmonthdum5 |  -.0224372   .1429899    -0.16   0.875    -.3026923    .2578179
 birthmonthdum6 |   .0375303   .1294215     0.29   0.772    -.2161312    .2911918
 birthmonthdum7 |   .0472474   .1186608     0.40   0.691    -.1853236    .2798183
 birthmonthdum8 |  -.0311392   .1346149    -0.23   0.817    -.2949795    .2327011
 birthmonthdum9 |   .0106998   .1468072     0.07   0.942     -.277037    .2984366
birthmonthdum10 |   .0026565   .1113223     0.02   0.981    -.2155312    .2208443
birthmonthdum11 |   .0569643   .1865049     0.31   0.760    -.3085786    .4225072
birthmonthdum12 |  -.0796427   .1106927    -0.72   0.472    -.2965964     .137311
           male |   .3031378    .082985     3.65   0.000     .1404903    .4657854
          _cons |   8.249946   .6174369    13.36   0.000     7.039792      9.4601
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  2.40486  (p = 0.4927)
  Wu-Hausman F(3,2690)            =  .796116  (p = 0.4959)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   3.678  Chi-sq(17) P-value = 0.9997

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
birthmont~m2 |      2,711    .0874216     .282504          0          1
birthmonth~3 |      2,711    .0837329     .277038          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,711     .061232    .2397996          0          1
birthmonth~5 |      2,711    .0763556    .2656152          0          1
birthmonth~6 |      2,711    .0789377    .2696912          0          1
birthmonth~7 |      2,711    .0822575    .2748073          0          1
birthmonth~8 |      2,711    .0800443    .2714118          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,711    .0925858    .2899045          0          1
birthmont~10 |      2,711    .1125046    .3160446          0          1
birthmont~11 |      2,711     .089266    .2851798          0          1
birthmont~12 |      2,711    .0800443    .2714118          0          1
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months
> ', `months'-1) & inrange(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(31, 2679)   =  10.10
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1047
                                                        Adj R-squared = 0.0943
                                                        Root MSE      = 0.4685

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0244069   .0046679     5.23   0.000     .0152539      .03356
      tenuresqr |  -.0003218   .0002173    -1.48   0.139    -.0007479    .0001043
 birthmonthdum2 |  -.0583975   .0448145    -1.30   0.193    -.1462721     .029477
 birthmonthdum3 |   .0315409   .0454064     0.69   0.487    -.0574941     .120576
 birthmonthdum4 |   -.103654   .0491339    -2.11   0.035    -.1999981   -.0073098
 birthmonthdum5 |  -.1110299   .0463526    -2.40   0.017    -.2019204   -.0201393
 birthmonthdum6 |  -.1132066   .0462351    -2.45   0.014    -.2038667   -.0225465
 birthmonthdum7 |  -.0573851   .0458655    -1.25   0.211    -.1473205    .0325502
 birthmonthdum8 |  -.0696769   .0462838    -1.51   0.132    -.1604325    .0210787
 birthmonthdum9 |  -.0084348   .0446369    -0.19   0.850    -.0959612    .0790915
birthmonthdum10 |  -.0459635   .0425903    -1.08   0.281    -.1294767    .0375497
birthmonthdum11 |  -.0688202   .0446494    -1.54   0.123     -.156371    .0187307
birthmonthdum12 |    -.00392   .0458268    -0.09   0.932    -.0937794    .0859394
           male |   .0094607   .0181779     0.52   0.603    -.0261834    .0451049
   provincedum2 |   -.257807    .049097    -5.25   0.000    -.3540789   -.1615351
   provincedum3 |  -.1852794   .0537987    -3.44   0.001    -.2907706   -.0797883
   provincedum4 |  -.2545595   .0482882    -5.27   0.000    -.3492455   -.1598735
   provincedum5 |  -.2792986    .045078    -6.20   0.000    -.3676897   -.1909074
   provincedum6 |  -.2914675   .0519861    -5.61   0.000    -.3934044   -.1895306
   provincedum7 |  -.2363941   .0467451    -5.06   0.000    -.3280543   -.1447339
   provincedum8 |   -.231637   .0472754    -4.90   0.000     -.324337   -.1389369
   provincedum9 |  -.2858431   .0479509    -5.96   0.000    -.3798676   -.1918186
  provincedum10 |  -.2745881   .0474035    -5.79   0.000    -.3675392    -.181637
  provincedum11 |  -.3431736   .0421039    -8.15   0.000    -.4257331   -.2606142
  provincedum12 |  -.2521577   .0534511    -4.72   0.000    -.3569672   -.1473482
  provincedum13 |  -.3056481   .0491294    -6.22   0.000    -.4019834   -.2093128
  provincedum14 |  -.2619057   .0583645    -4.49   0.000    -.3763498   -.1474617
  provincedum15 |  -.2601421   .0584663    -4.45   0.000    -.3747857   -.1454984
              t |   .0004298   .0011978     0.36   0.720    -.0019189    .0027784
              d |    .033242   .0374805     0.89   0.375    -.0402517    .1067356
             td |   .0023859   .0017076     1.40   0.162    -.0009625    .0057342
          _cons |   .4890465   .0565808     8.64   0.000        .3781    .5999931
---------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(31, 2679)   =   6.65
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0715
                                                        Adj R-squared = 0.0607
                                                        Root MSE      = 0.4574

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0295625   .0045571     6.49   0.000     .0206267    .0384982
      tenuresqr |  -.0008525   .0002121    -4.02   0.000    -.0012685   -.0004366
 birthmonthdum2 |  -.0323393   .0437504    -0.74   0.460    -.1181272    .0534486
 birthmonthdum3 |  -.0116505   .0443282    -0.26   0.793    -.0985714    .0752704
 birthmonthdum4 |   -.107687   .0479672    -2.25   0.025    -.2017434   -.0136305
 birthmonthdum5 |  -.0593553    .045252    -1.31   0.190    -.1480876     .029377
 birthmonthdum6 |  -.0852359   .0451372    -1.89   0.059    -.1737433    .0032714
 birthmonthdum7 |  -.0666395   .0447764    -1.49   0.137    -.1544393    .0211603
 birthmonthdum8 |  -.0274304   .0451848    -0.61   0.544     -.116031    .0611702
 birthmonthdum9 |   .0120666    .043577     0.28   0.782    -.0733814    .0975146
birthmonthdum10 |  -.0387532    .041579    -0.93   0.351    -.1202833     .042777
birthmonthdum11 |   -.041617   .0435892    -0.95   0.340    -.1270889    .0438549
birthmonthdum12 |   .0018253   .0447386     0.04   0.967    -.0859004    .0895509
           male |   .0205141   .0177463     1.16   0.248    -.0142836    .0553119
   provincedum2 |  -.2804521   .0479312    -5.85   0.000     -.374438   -.1864662
   provincedum3 |  -.1809199   .0525212    -3.44   0.001    -.2839062   -.0779337
   provincedum4 |  -.1895611   .0471416    -4.02   0.000    -.2819987   -.0971235
   provincedum5 |  -.2119154   .0440076    -4.82   0.000    -.2982076   -.1256231
   provincedum6 |  -.2490865   .0507516    -4.91   0.000    -.3486029   -.1495702
   provincedum7 |  -.1760228   .0456351    -3.86   0.000    -.2655065   -.0865392
   provincedum8 |  -.1865382   .0461529    -4.04   0.000    -.2770371   -.0960394
   provincedum9 |  -.1972406   .0468123    -4.21   0.000    -.2890325   -.1054488
  provincedum10 |  -.2642432   .0462779    -5.71   0.000    -.3549872   -.1734992
  provincedum11 |  -.2731165   .0411041    -6.64   0.000    -.3537155   -.1925175
  provincedum12 |  -.2104025   .0521818    -4.03   0.000    -.3127232   -.1080817
  provincedum13 |   -.269245   .0479628    -5.61   0.000    -.3632928   -.1751972
  provincedum14 |  -.2742047   .0569786    -4.81   0.000    -.3859312   -.1624782
  provincedum15 |   -.238543    .057078    -4.18   0.000    -.3504644   -.1266216
              t |    .001519   .0011693     1.30   0.194    -.0007739    .0038118
              d |   .0095971   .0365905     0.26   0.793    -.0621514    .0813456
             td |   .0003499   .0016671     0.21   0.834    -.0029189    .0036188
          _cons |   .4046463   .0552373     7.33   0.000     .2963343    .5129584
---------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(31, 2679)   =   4.61
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0507
                                                        Adj R-squared = 0.0397
                                                        Root MSE      = 0.4869

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0320306   .0048509     6.60   0.000     .0225186    .0415426
      tenuresqr |  -.0011021   .0002258    -4.88   0.000    -.0015449   -.0006593
 birthmonthdum2 |   -.025075   .0465717    -0.54   0.590    -.1163951    .0662451
 birthmonthdum3 |  -.0277615   .0471867    -0.59   0.556    -.1202876    .0647647
 birthmonthdum4 |  -.0769007   .0510604    -1.51   0.132    -.1770225    .0232211
 birthmonthdum5 |  -.0330942   .0481701    -0.69   0.492    -.1275486    .0613601
 birthmonthdum6 |  -.0605535    .048048    -1.26   0.208    -.1547684    .0336614
 birthmonthdum7 |  -.0578961   .0476639    -1.21   0.225    -.1513578    .0355657
 birthmonthdum8 |  -.0204634   .0480986    -0.43   0.671    -.1147775    .0738508
 birthmonthdum9 |  -.0084614   .0463872    -0.18   0.855    -.0994197    .0824969
birthmonthdum10 |  -.0376741   .0442603    -0.85   0.395    -.1244619    .0491137
birthmonthdum11 |   .0035253   .0464001     0.08   0.939    -.0874584     .094509
birthmonthdum12 |   .0041061   .0476236     0.09   0.931    -.0892767    .0974889
           male |   .0349499   .0188907     1.85   0.064    -.0020919    .0719916
   provincedum2 |  -.2574583   .0510221    -5.05   0.000     -.357505   -.1574115
   provincedum3 |   -.158772   .0559081    -2.84   0.005    -.2683995   -.0491446
   provincedum4 |  -.1831408   .0501816    -3.65   0.000    -.2815394   -.0847422
   provincedum5 |  -.1693363   .0468455    -3.61   0.000    -.2611932   -.0774793
   provincedum6 |  -.2207883   .0540244    -4.09   0.000    -.3267222   -.1148545
   provincedum7 |  -.1547128    .048578    -3.18   0.001     -.249967   -.0594586
   provincedum8 |  -.1497372   .0491291    -3.05   0.002     -.246072   -.0534024
   provincedum9 |   -.179441    .049831    -3.60   0.000    -.2771522   -.0817297
  provincedum10 |  -.2507953   .0492622    -5.09   0.000     -.347391   -.1541995
  provincedum11 |  -.1954764   .0437548    -4.47   0.000     -.281273   -.1096798
  provincedum12 |  -.1789217   .0555469    -3.22   0.001    -.2878408   -.0700026
  provincedum13 |  -.1983658   .0510557    -3.89   0.000    -.2984784   -.0982532
  provincedum14 |  -.2795652    .060653    -4.61   0.000    -.3984966   -.1606338
  provincedum15 |  -.2033106   .0607588    -3.35   0.001    -.3224495   -.0841718
              t |   .0018819   .0012447     1.51   0.131    -.0005589    .0043226
              d |    -.01967   .0389501    -0.51   0.614    -.0960453    .0567053
             td |   .0002596   .0017746     0.15   0.884    -.0032201    .0037392
          _cons |   .4897344   .0587994     8.33   0.000     .3744376    .6050312
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(31)   =     199.48
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .95803

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.194601   1.820731    -0.66   0.512    -4.763168    2.373966
  secgenhighedu |   3.526375   4.424678     0.80   0.425    -5.145834    12.19859
      secgenedu |  -1.936097   3.262532    -0.59   0.553    -8.330541    4.458347
         tenure |   .0323938   .0294274     1.10   0.271    -.0252828    .0900704
      tenuresqr |  -.0008423   .0014506    -0.58   0.561    -.0036854    .0020007
 birthmonthdum2 |  -.0079185    .097437    -0.08   0.935    -.1988914    .1830544
 birthmonthdum3 |  -.0362125   .1146493    -0.32   0.752    -.2609209     .188496
 birthmonthdum4 |   .0438638   .1444501     0.30   0.761    -.2392532    .3269809
 birthmonthdum5 |  -.0335427   .1171516    -0.29   0.775    -.2631556    .1960703
 birthmonthdum6 |   .0282984    .110548     0.26   0.798    -.1883717    .2449686
 birthmonthdum7 |   .0409465   .1068305     0.38   0.702    -.1684374    .2503305
 birthmonthdum8 |  -.0173598   .1129599    -0.15   0.878    -.2387571    .2040375
 birthmonthdum9 |   .0104976    .125356     0.08   0.933    -.2351955    .2561908
birthmonthdum10 |    .019135   .0922532     0.21   0.836     -.161678     .199948
birthmonthdum11 |   .0239654   .1448165     0.17   0.869    -.2598697    .3078005
birthmonthdum12 |  -.0565048   .0940314    -0.60   0.548    -.2408029    .1277933
           male |   .2941201   .0619941     4.74   0.000     .1726139    .4156263
   provincedum2 |  -.3336186   .2255987    -1.48   0.139     -.775784    .1085467
   provincedum3 |  -.2139176   .1583861    -1.35   0.177    -.5243487    .0965136
   provincedum4 |   -.339633   .1698689    -2.00   0.046    -.6725701    -.006696
   provincedum5 |   .0349278   .1427341     0.24   0.807    -.2448259    .3146815
   provincedum6 |  -.0994011   .1701994    -0.58   0.559    -.4329858    .2341836
   provincedum7 |  -.2498912   .1395167    -1.79   0.073    -.5233388    .0235565
   provincedum8 |  -.3398903   .1381304    -2.46   0.014    -.6106208   -.0691597
   provincedum9 |  -.1682624   .1727831    -0.97   0.330     -.506911    .1703862
  provincedum10 |   -.094734   .1895397    -0.50   0.617    -.4662249     .276757
  provincedum11 |   .0887609   .1913488     0.46   0.643    -.2862759    .4637976
  provincedum12 |   -.151901   .1517383    -1.00   0.317    -.4493026    .1455005
  provincedum13 |      .0044   .2114875     0.02   0.983    -.4101079    .4189078
  provincedum14 |  -.1710513   .2350828    -0.73   0.467     -.631805    .2897024
  provincedum15 |  -.2577829    .179955    -1.43   0.152    -.6104883    .0949224
          _cons |   8.324454   .5139154    16.20   0.000     7.317199     9.33171
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =    1.699  (p = 0.6372)
  Wu-Hausman F(3,2676)            =  .559372  (p = 0.6419)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  15.231  Chi-sq(31) P-value = 0.9921

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
birthmont~m2 |      2,711    .0874216     .282504          0          1
birthmonth~3 |      2,711    .0837329     .277038          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,711     .061232    .2397996          0          1
birthmonth~5 |      2,711    .0763556    .2656152          0          1
birthmonth~6 |      2,711    .0789377    .2696912          0          1
birthmonth~7 |      2,711    .0822575    .2748073          0          1
birthmonth~8 |      2,711    .0800443    .2714118          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,711    .0925858    .2899045          0          1
birthmont~10 |      2,711    .1125046    .3160446          0          1
birthmont~11 |      2,711     .089266    .2851798          0          1
birthmont~12 |      2,711    .0800443    .2714118          0          1
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthly
> earning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(16, 1429)   =   5.15
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0546
                                                        Adj R-squared = 0.0440
                                                        Root MSE      = 0.4834

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .026317   .0067649     3.89   0.000     .0130468    .0395871
      tenuresqr |  -.0005715   .0003123    -1.83   0.068    -.0011842    .0000412
 birthmonthdum2 |  -.0710658   .0636836    -1.12   0.265    -.1959892    .0538577
 birthmonthdum3 |     .02028   .0645054     0.31   0.753    -.1062555    .1468154
 birthmonthdum4 |  -.1312034   .0691698    -1.90   0.058    -.2668887    .0044818
 birthmonthdum5 |  -.1106848   .0643275    -1.72   0.086    -.2368712    .0155017
 birthmonthdum6 |  -.0732296   .0652757    -1.12   0.262    -.2012761    .0548169
 birthmonthdum7 |   .0157511   .0637975     0.25   0.805    -.1093958     .140898
 birthmonthdum8 |  -.0712892   .0663516    -1.07   0.283    -.2014462    .0588678
 birthmonthdum9 |   .0060355   .0622725     0.10   0.923    -.1161199    .1281909
birthmonthdum10 |  -.0342882   .0585461    -0.59   0.558    -.1491337    .0805573
birthmonthdum11 |  -.0742862   .0619648    -1.20   0.231    -.1958379    .0472655
birthmonthdum12 |  -.0296086   .0651906    -0.45   0.650    -.1574882    .0982709
              t |  -.0002873   .0016799    -0.17   0.864    -.0035826     .003008
              d |   .0289112   .0524532     0.55   0.582    -.0739824    .1318049
             td |   .0038559   .0023894     1.61   0.107    -.0008311     .008543
          _cons |   .2444901   .0636605     3.84   0.000      .119612    .3693683
---------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(16, 1429)   =   3.81
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0409
                                                        Adj R-squared = 0.0302
                                                        Root MSE      = 0.4701

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0309724    .006579     4.71   0.000     .0180669     .043878
      tenuresqr |  -.0010303   .0003038    -3.39   0.001    -.0016261   -.0004344
 birthmonthdum2 |  -.0316864   .0619341    -0.51   0.609    -.1531778     .089805
 birthmonthdum3 |   .0115447   .0627332     0.18   0.854    -.1115145    .1346038
 birthmonthdum4 |  -.1041851   .0672695    -1.55   0.122    -.2361427    .0277724
 birthmonthdum5 |  -.0464216   .0625602    -0.74   0.458    -.1691413     .076298
 birthmonthdum6 |  -.0751388   .0634824    -1.18   0.237    -.1996675    .0493899
 birthmonthdum7 |   .0201562   .0620448     0.32   0.745    -.1015525    .1418649
 birthmonthdum8 |  -.0171475   .0645287    -0.27   0.790    -.1437287    .1094337
 birthmonthdum9 |   .0670438   .0605617     1.11   0.268    -.0517556    .1858431
birthmonthdum10 |  -.0150134   .0569376    -0.26   0.792    -.1267037     .096677
birthmonthdum11 |  -.0266674   .0602624    -0.44   0.658    -.1448797    .0915449
birthmonthdum12 |   .0221103   .0633996     0.35   0.727     -.102256    .1464766
              t |   .0008579   .0016337     0.53   0.600    -.0023468    .0040626
              d |   .0260493   .0510122     0.51   0.610    -.0740175    .1261162
             td |    .001501   .0023237     0.65   0.518    -.0030574    .0060593
          _cons |   .1820196   .0619116     2.94   0.003     .0605723     .303467
---------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(16, 1429)   =   2.69
                                                        Prob > F      = 0.0003
                                                        R-squared     = 0.0293
                                                        Adj R-squared = 0.0184
                                                        Root MSE      = 0.4944

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0309901   .0069189     4.48   0.000     .0174178    .0445623
      tenuresqr |  -.0011874   .0003194    -3.72   0.000     -.001814   -.0005607
 birthmonthdum2 |   .0140654   .0651335     0.22   0.829    -.1137021    .1418329
 birthmonthdum3 |   .0026755   .0659739     0.04   0.968    -.1267407    .1320916
 birthmonthdum4 |  -.0276933   .0707445    -0.39   0.696    -.1664676     .111081
 birthmonthdum5 |    .010311    .065792     0.16   0.875    -.1187482    .1393702
 birthmonthdum6 |  -.0549371   .0667618    -0.82   0.411    -.1858988    .0760245
 birthmonthdum7 |   .0795832     .06525     1.22   0.223    -.0484128    .2075792
 birthmonthdum8 |  -.0191431   .0678622    -0.28   0.778    -.1522633    .1139771
 birthmonthdum9 |   .0684766   .0636902     1.08   0.282    -.0564597     .193413
birthmonthdum10 |  -.0010908    .059879    -0.02   0.985    -.1185509    .1163693
birthmonthdum11 |   .0476305   .0633755     0.75   0.452    -.0766885    .1719495
birthmonthdum12 |   .0594059   .0666747     0.89   0.373     -.071385    .1901968
              t |   .0015131   .0017181     0.88   0.379    -.0018572    .0048833
              d |   -.001489   .0536474    -0.03   0.978    -.1067252    .1037471
             td |   .0008791   .0024438     0.36   0.719    -.0039147    .0056728
          _cons |   .3069065   .0651098     4.71   0.000     .1791853    .4346276
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(16)   =      19.67
                                                  Prob > chi2     =     0.2353
                                                  R-squared       =          .
                                                  Root MSE        =     .93455

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   -1.55636   2.302765    -0.68   0.499    -6.069696    2.956975
  secgenhighedu |   3.292322   5.313184     0.62   0.535    -7.121327    13.70597
      secgenedu |  -1.648765   4.210609    -0.39   0.695    -9.901407    6.603878
         tenure |   .0306179   .0305698     1.00   0.317    -.0292979    .0905337
      tenuresqr |  -.0010375   .0016791    -0.62   0.537    -.0043285    .0022534
 birthmonthdum2 |   .0412424   .1983626     0.21   0.835    -.3475413     .430026
 birthmonthdum3 |  -.0210592   .1261236    -0.17   0.867    -.2682568    .2261385
 birthmonthdum4 |  -.0096379     .29428    -0.03   0.974     -.586416    .5671402
 birthmonthdum5 |     .01942   .2356087     0.08   0.934    -.4423646    .4812047
 birthmonthdum6 |   .0714005   .1479844     0.48   0.629    -.2186435    .3614446
 birthmonthdum7 |   .1687303   .2988489     0.56   0.572    -.4170028    .7544635
 birthmonthdum8 |  -.0787559   .1757553    -0.45   0.654    -.4232299    .2657182
 birthmonthdum9 |   .0845661   .1874572     0.45   0.652    -.2828433    .4519754
birthmonthdum10 |   .0224848    .122132     0.18   0.854    -.2168894    .2618591
birthmonthdum11 |  -.0066333   .2885208    -0.02   0.982    -.5721236     .558857
birthmonthdum12 |  -.0200879   .1995476    -0.10   0.920    -.4111939    .3710182
          _cons |   8.611928   .6640278    12.97   0.000     7.310458    9.913399
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  1.46471  (p = 0.6904)
  Wu-Hausman F(3,1426)            =  .481973  (p = 0.6949)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   5.070  Chi-sq(16) P-value = 0.9954

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
birthmont~m2 |      1,446    .0829876    .2759588          0          1
birthmonth~3 |      1,446    .0788382    .2695793          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,446    .0608575    .2391515          0          1
birthmonth~5 |      1,446    .0795297    .2706574          0          1
birthmonth~6 |      1,446    .0760719    .2652049          0          1
birthmonth~7 |      1,446    .0850622    .2790708          0          1
birthmonth~8 |      1,446    .0733057    .2607278          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,446    .0947441    .2929625          0          1
birthmont~10 |      1,446    .1224066    .3278683          0          1
birthmont~11 |      1,446     .093361    .2910383          0          1
birthmont~12 |      1,446    .0753804    .2640954          0          1
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `m
> onths'-1) & inrange(monthlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(30, 1415)   =   4.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0901
                                                        Adj R-squared = 0.0708
                                                        Root MSE      = 0.4765

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0257801   .0067032     3.85   0.000     .0126308    .0389294
      tenuresqr |  -.0005671   .0003088    -1.84   0.066    -.0011729    .0000386
 birthmonthdum2 |  -.0601084   .0630701    -0.95   0.341    -.1838293    .0636126
 birthmonthdum3 |   .0336733   .0639728     0.53   0.599    -.0918184    .1591651
 birthmonthdum4 |  -.1386915   .0685311    -2.02   0.043    -.2731251    -.004258
 birthmonthdum5 |    -.09914   .0636861    -1.56   0.120    -.2240693    .0257893
 birthmonthdum6 |  -.0650607   .0645993    -1.01   0.314    -.1917814      .06166
 birthmonthdum7 |   .0149482   .0632619     0.24   0.813     -.109149    .1390455
 birthmonthdum8 |  -.0607551   .0657721    -0.92   0.356    -.1897765    .0682662
 birthmonthdum9 |   .0177724   .0617253     0.29   0.773    -.1033106    .1388554
birthmonthdum10 |  -.0123792   .0580061    -0.21   0.831    -.1261664    .1014081
birthmonthdum11 |   -.072208   .0615175    -1.17   0.241    -.1928833    .0484673
birthmonthdum12 |  -.0204969   .0645692    -0.32   0.751    -.1471585    .1061647
   provincedum2 |  -.3153364   .0670917    -4.70   0.000    -.4469464   -.1837265
   provincedum3 |  -.2506163   .0734282    -3.41   0.001    -.3946562   -.1065765
   provincedum4 |   -.305607   .0661955    -4.62   0.000    -.4354589   -.1757551
   provincedum5 |  -.2967071   .0617862    -4.80   0.000    -.4179095   -.1755047
   provincedum6 |  -.3720288   .0713634    -5.21   0.000    -.5120183   -.2320393
   provincedum7 |  -.2692213   .0660777    -4.07   0.000    -.3988421   -.1396004
   provincedum8 |  -.2282949   .0659087    -3.46   0.001    -.3575843   -.0990056
   provincedum9 |  -.3180519   .0651108    -4.88   0.000    -.4457759    -.190328
  provincedum10 |  -.2508223   .0666763    -3.76   0.000    -.3816172   -.1200273
  provincedum11 |  -.3807392   .0575227    -6.62   0.000    -.4935781   -.2679003
  provincedum12 |  -.1989739    .078292    -2.54   0.011    -.3525548    -.045393
  provincedum13 |  -.3052823   .0682683    -4.47   0.000    -.4392003   -.1713644
  provincedum14 |  -.2484807   .0834957    -2.98   0.003    -.4122693   -.0846921
  provincedum15 |    -.19001   .0844811    -2.25   0.025    -.3557317   -.0242882
              t |  -.0001696   .0016657    -0.10   0.919    -.0034371    .0030978
              d |   .0108542   .0520494     0.21   0.835     -.091248    .1129564
             td |   .0040551   .0023665     1.71   0.087    -.0005871    .0086974
          _cons |   .5202839   .0778906     6.68   0.000     .3674904    .6730774
---------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(30, 1415)   =   3.65
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0718
                                                        Adj R-squared = 0.0522
                                                        Root MSE      = 0.4647

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0304727   .0065369     4.66   0.000     .0176497    .0432958
      tenuresqr |  -.0010197   .0003011    -3.39   0.001    -.0016104    -.000429
 birthmonthdum2 |  -.0243932   .0615054    -0.40   0.692    -.1450448    .0962585
 birthmonthdum3 |   .0195891   .0623858     0.31   0.754    -.1027894    .1419676
 birthmonthdum4 |  -.1090903    .066831    -1.63   0.103    -.2401888    .0220082
 birthmonthdum5 |  -.0374178   .0621061    -0.60   0.547    -.1592479    .0844122
 birthmonthdum6 |  -.0731236   .0629967    -1.16   0.246    -.1967006    .0504534
 birthmonthdum7 |   .0127716   .0616925     0.21   0.836     -.108247    .1337902
 birthmonthdum8 |  -.0144824   .0641404    -0.23   0.821     -.140303    .1113381
 birthmonthdum9 |   .0712303    .060194     1.18   0.237    -.0468488    .1893095
birthmonthdum10 |   .0015322   .0565671     0.03   0.978    -.1094322    .1124966
birthmonthdum11 |  -.0258861   .0599914    -0.43   0.666    -.1435676    .0917955
birthmonthdum12 |   .0281836   .0629673     0.45   0.655    -.0953358    .1517029
   provincedum2 |  -.3492045   .0654273    -5.34   0.000    -.4775494   -.2208595
   provincedum3 |  -.2269694   .0716066    -3.17   0.002    -.3674358   -.0865029
   provincedum4 |  -.2407627   .0645533    -3.73   0.000    -.3673931   -.1141322
   provincedum5 |  -.2063643   .0602534    -3.42   0.001    -.3245599   -.0881687
   provincedum6 |  -.3306272    .069593    -4.75   0.000    -.4671438   -.1941106
   provincedum7 |  -.1928007   .0644385    -2.99   0.003    -.3192059   -.0663956
   provincedum8 |   -.153495   .0642737    -2.39   0.017    -.2795769   -.0274131
   provincedum9 |  -.2336598   .0634955    -3.68   0.000    -.3582152   -.1091045
  provincedum10 |  -.2348469   .0650221    -3.61   0.000    -.3623971   -.1072967
  provincedum11 |  -.2981382   .0560956    -5.31   0.000    -.4081778   -.1880987
  provincedum12 |  -.1595741   .0763497    -2.09   0.037    -.3093449   -.0098032
  provincedum13 |  -.2654245   .0665747    -3.99   0.000    -.3960202   -.1348288
  provincedum14 |  -.3006401   .0814243    -3.69   0.000    -.4603654   -.1409148
  provincedum15 |  -.1866383   .0823853    -2.27   0.024    -.3482488   -.0250279
              t |    .001033   .0016244     0.64   0.525    -.0021534    .0042194
              d |   .0018313   .0507581     0.04   0.971    -.0977379    .1014005
             td |   .0018436   .0023078     0.80   0.425    -.0026835    .0063707
          _cons |   .4162756   .0759583     5.48   0.000     .2672726    .5652785
---------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(30, 1415)   =   2.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0535
                                                        Adj R-squared = 0.0334
                                                        Root MSE      = 0.4906

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0304396   .0069005     4.41   0.000     .0169032     .043976
      tenuresqr |  -.0011692   .0003179    -3.68   0.000    -.0017928   -.0005456
 birthmonthdum2 |   .0203057   .0649268     0.31   0.755    -.1070574    .1476688
 birthmonthdum3 |   .0104841   .0658561     0.16   0.874    -.1187019    .1396702
 birthmonthdum4 |   -.030259   .0705486    -0.43   0.668      -.16865     .108132
 birthmonthdum5 |   .0192523   .0655609     0.29   0.769    -.1093547    .1478593
 birthmonthdum6 |  -.0564333    .066501    -0.85   0.396    -.1868844    .0740178
 birthmonthdum7 |   .0723151   .0651243     1.11   0.267    -.0554353    .2000656
 birthmonthdum8 |  -.0140532   .0677083    -0.21   0.836    -.1468727    .1187663
 birthmonthdum9 |   .0669917   .0635424     1.05   0.292    -.0576558    .1916391
birthmonthdum10 |   .0140993   .0597137     0.24   0.813    -.1030376    .1312363
birthmonthdum11 |   .0456382   .0633285     0.72   0.471    -.0785896     .169866
birthmonthdum12 |   .0696549     .06647     1.05   0.295    -.0607354    .2000451
   provincedum2 |  -.3481578   .0690668    -5.04   0.000    -.4836421   -.2126735
   provincedum3 |  -.2083247   .0755898    -2.76   0.006    -.3566049   -.0600446
   provincedum4 |  -.2450519   .0681442    -3.60   0.000    -.3787264   -.1113774
   provincedum5 |  -.1701152   .0636051    -2.67   0.008    -.2948856   -.0453448
   provincedum6 |  -.3002666   .0734642    -4.09   0.000    -.4443772   -.1561561
   provincedum7 |  -.1818781   .0680229    -2.67   0.008    -.3153148   -.0484415
   provincedum8 |  -.1473922    .067849    -2.17   0.030    -.2804877   -.0142968
   provincedum9 |  -.2045073   .0670275    -3.05   0.002    -.3359912   -.0730233
  provincedum10 |  -.1901391   .0686391    -2.77   0.006    -.3247844   -.0554938
  provincedum11 |  -.2162297    .059216    -3.65   0.000    -.3323904   -.1000691
  provincedum12 |  -.1663286   .0805968    -2.06   0.039    -.3244307   -.0082266
  provincedum13 |  -.1896679    .070278    -2.70   0.007    -.3275282   -.0518076
  provincedum14 |   -.329488   .0859536    -3.83   0.000    -.4980983   -.1608778
  provincedum15 |  -.1757718   .0869681    -2.02   0.043    -.3463721   -.0051715
              t |   .0018228   .0017147     1.06   0.288    -.0015409    .0051864
              d |  -.0279106   .0535816    -0.52   0.603    -.1330186    .0771973
             td |   .0010622   .0024362     0.44   0.663    -.0037167    .0058411
          _cons |   .5167251   .0801836     6.44   0.000     .3594336    .6740166
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(30)   =      61.33
                                                  Prob > chi2     =     0.0006
                                                  R-squared       =          .
                                                  Root MSE        =     .85864

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.440795   2.522498    -0.57   0.568      -6.3848    3.503209
  secgenhighedu |   2.806126   5.344704     0.53   0.600    -7.669303    13.28155
      secgenedu |  -1.305861   3.582742    -0.36   0.715    -8.327906    5.716184
         tenure |   .0284627   .0282532     1.01   0.314    -.0269125    .0838379
      tenuresqr |  -.0009059   .0014944    -0.61   0.544     -.003835    .0020231
 birthmonthdum2 |   .0221286   .1638821     0.14   0.893    -.2990745    .3433316
 birthmonthdum3 |  -.0034027   .1166698    -0.03   0.977    -.2320713     .225266
 birthmonthdum4 |  -.0328729   .2552947    -0.13   0.898    -.5332413    .4674956
 birthmonthdum5 |   .0175415   .1938341     0.09   0.928    -.3623664    .3974494
 birthmonthdum6 |   .0521067   .1399949     0.37   0.710    -.2222783    .3264917
 birthmonthdum7 |   .1548923   .2610872     0.59   0.553    -.3568292    .6666139
 birthmonthdum8 |   -.061763    .160589    -0.38   0.701    -.3765117    .2529856
 birthmonthdum9 |   .0697011   .1827191     0.38   0.703    -.2884217     .427824
birthmonthdum10 |   .0244219   .1093647     0.22   0.823     -.189929    .2387727
birthmonthdum11 |  -.0522556   .2234511    -0.23   0.815    -.4902118    .3857005
birthmonthdum12 |  -.0071806   .1737788    -0.04   0.967    -.3477807    .3334196
   provincedum2 |  -.3394748   .2775872    -1.22   0.221    -.8835356    .2045861
   provincedum3 |  -.1878992   .1872579    -1.00   0.316     -.554918    .1791196
   provincedum4 |   -.406716   .2680258    -1.52   0.129    -.9320369    .1186048
   provincedum5 |  -.0405442   .2202063    -0.18   0.854    -.4721407    .3910523
   provincedum6 |  -.1188953   .2344364    -0.51   0.612    -.5783822    .3405915
   provincedum7 |  -.2701583   .2348232    -1.15   0.250    -.7304033    .1900867
   provincedum8 |  -.4649135   .2303148    -2.02   0.044    -.9163222   -.0135047
   provincedum9 |  -.1512971   .2292017    -0.66   0.509    -.6005242      .29793
  provincedum10 |  -.0312241   .1966371    -0.16   0.874    -.4166258    .3541776
  provincedum11 |  -.0254486     .23143    -0.11   0.912     -.479043    .4281459
  provincedum12 |  -.2398621   .2172068    -1.10   0.269    -.6655796    .1858554
  provincedum13 |  -.0812861   .2373388    -0.34   0.732    -.5464616    .3838893
  provincedum14 |  -.2097106   .3034568    -0.69   0.490    -.8044749    .3850538
  provincedum15 |  -.3363286    .190703    -1.76   0.078    -.7100997    .0374425
          _cons |   8.757163   .6808202    12.86   0.000      7.42278    10.09155
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  1.33737  (p = 0.7203)
  Wu-Hausman F(3,1412)            =   .43571  (p = 0.7275)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  18.456  Chi-sq(30) P-value = 0.9507

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
birthmont~m2 |      1,446    .0829876    .2759588          0          1
birthmonth~3 |      1,446    .0788382    .2695793          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,446    .0608575    .2391515          0          1
birthmonth~5 |      1,446    .0795297    .2706574          0          1
birthmonth~6 |      1,446    .0760719    .2652049          0          1
birthmonth~7 |      1,446    .0850622    .2790708          0          1
birthmonth~8 |      1,446    .0733057    .2607278          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,446    .0947441    .2929625          0          1
birthmont~10 |      1,446    .1224066    .3278683          0          1
birthmont~11 |      1,446     .093361    .2910383          0          1
birthmont~12 |      1,446    .0753804    .2640954          0          1
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthly
> earning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(16, 1248)   =  10.64
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1200
                                                        Adj R-squared = 0.1087
                                                        Root MSE      = 0.4624

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0240415   .0065333     3.68   0.000      .011224    .0368589
      tenuresqr |  -.0000795   .0003077    -0.26   0.796    -.0006832    .0005242
 birthmonthdum2 |  -.0581537   .0643169    -0.90   0.366    -.1843349    .0680275
 birthmonthdum3 |   .0445276   .0648834     0.69   0.493     -.082765    .1718202
 birthmonthdum4 |  -.0575437   .0711652    -0.81   0.419    -.1971602    .0820729
 birthmonthdum5 |  -.1134488   .0683171    -1.66   0.097    -.2474778    .0205801
 birthmonthdum6 |  -.1523082   .0667134    -2.28   0.023     -.283191   -.0214254
 birthmonthdum7 |  -.1315652   .0671306    -1.96   0.050    -.2632665    .0001361
 birthmonthdum8 |  -.0758693   .0657125    -1.15   0.248    -.2047884    .0530498
 birthmonthdum9 |  -.0374062   .0651569    -0.57   0.566    -.1652354     .090423
birthmonthdum10 |   -.082566   .0632978    -1.30   0.192    -.2067478    .0416158
birthmonthdum11 |  -.0702458   .0657335    -1.07   0.285    -.1992061    .0587145
birthmonthdum12 |   .0214753    .065505     0.33   0.743    -.1070368    .1499874
              t |   .0008446    .001744     0.48   0.628    -.0025769    .0042661
              d |    .057932   .0546034     1.06   0.289    -.0491926    .1650567
             td |   .0012432   .0025046     0.50   0.620    -.0036705    .0061568
          _cons |   .2182097   .0642618     3.40   0.001     .0921366    .3442828
---------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(16, 1248)   =   5.61
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0671
                                                        Adj R-squared = 0.0552
                                                        Root MSE      = 0.4522

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0300801    .006389     4.71   0.000     .0175458    .0426144
      tenuresqr |   -.000736   .0003009    -2.45   0.015    -.0013263   -.0001456
 birthmonthdum2 |  -.0389282   .0628961    -0.62   0.536    -.1623219    .0844656
 birthmonthdum3 |  -.0287013   .0634501    -0.45   0.651    -.1531818    .0957793
 birthmonthdum4 |  -.1064006   .0695931    -1.53   0.127    -.2429329    .0301317
 birthmonthdum5 |  -.0695987   .0668079    -1.04   0.298    -.2006669    .0614694
 birthmonthdum6 |   -.089636   .0652396    -1.37   0.170    -.2176275    .0383555
 birthmonthdum7 |  -.1488186   .0656476    -2.27   0.024    -.2776104   -.0200267
 birthmonthdum8 |   -.042074   .0642608    -0.65   0.513    -.1681451    .0839972
 birthmonthdum9 |  -.0575738   .0637176    -0.90   0.366    -.1825791    .0674316
birthmonthdum10 |  -.0785831   .0618995    -1.27   0.204    -.2000216    .0428554
birthmonthdum11 |  -.0635151   .0642813    -0.99   0.323    -.1896266    .0625963
birthmonthdum12 |  -.0136236   .0640579    -0.21   0.832    -.1392967    .1120496
              t |   .0017942   .0017055     1.05   0.293    -.0015517    .0051401
              d |   .0210337   .0533972     0.39   0.694    -.0837245    .1257919
             td |  -.0006625   .0024492    -0.27   0.787    -.0054675    .0041426
          _cons |   .2010578   .0628422     3.20   0.001     .0777698    .3243459
---------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(16, 1248)   =   4.40
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0534
                                                        Adj R-squared = 0.0413
                                                        Root MSE      = 0.4830

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .034657   .0068251     5.08   0.000      .021267     .048047
      tenuresqr |  -.0010829   .0003214    -3.37   0.001    -.0017135   -.0004523
 birthmonthdum2 |  -.0739967     .06719    -1.10   0.271    -.2058145    .0578212
 birthmonthdum3 |  -.0616061   .0677818    -0.91   0.364     -.194585    .0713728
 birthmonthdum4 |  -.1366186   .0743442    -1.84   0.066     -.282472    .0092347
 birthmonthdum5 |   -.078739   .0713689    -1.10   0.270    -.2187552    .0612772
 birthmonthdum6 |  -.0650555   .0696936    -0.93   0.351     -.201785    .0716739
 birthmonthdum7 |  -.2011967   .0701294    -2.87   0.004    -.3387812   -.0636122
 birthmonthdum8 |  -.0377762   .0686479    -0.55   0.582    -.1724542    .0969019
 birthmonthdum9 |  -.1011884   .0680676    -1.49   0.137    -.2347279    .0323511
birthmonthdum10 |  -.0952362   .0661254    -1.44   0.150    -.2249654    .0344929
birthmonthdum11 |  -.0523878   .0686698    -0.76   0.446    -.1871089    .0823333
birthmonthdum12 |  -.0579433   .0684312    -0.85   0.397    -.1921962    .0763096
              t |   .0017608   .0018219     0.97   0.334    -.0018136    .0053351
              d |  -.0002466   .0570426    -0.00   0.997    -.1121566    .1116634
             td |  -.0003482   .0026164    -0.13   0.894    -.0054813    .0047849
          _cons |   .3316408   .0671325     4.94   0.000     .1999359    .4633457
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(16)   =      48.51
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     1.1202

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.6145483   2.420717    -0.25   0.800    -5.359066    4.129969
  secgenhighedu |   4.104073   8.524131     0.48   0.630    -12.60292    20.81106
      secgenedu |  -2.752144   8.073111    -0.34   0.733    -18.57515    13.07086
         tenure |   .0442269   .0840521     0.53   0.599    -.1205123    .2089661
      tenuresqr |  -.0013874   .0039046    -0.36   0.722    -.0090403    .0062654
 birthmonthdum2 |  -.1274777   .3745683    -0.34   0.734    -.8616181    .6066627
 birthmonthdum3 |  -.1702597   .3323349    -0.51   0.608    -.8216242    .4811048
 birthmonthdum4 |  -.0285876   .4193519    -0.07   0.946    -.8505022    .7933271
 birthmonthdum5 |  -.1108483   .2511068    -0.44   0.659    -.6030086    .3813121
 birthmonthdum6 |   .0088425   .2003054     0.04   0.965    -.3837489    .4014338
 birthmonthdum7 |  -.1306049   .6193697    -0.21   0.833    -1.344547    1.083337
 birthmonthdum8 |    .023316   .1692655     0.14   0.890    -.3084383    .3550704
 birthmonthdum9 |  -.0761238   .4314365    -0.18   0.860    -.9217237    .7694761
birthmonthdum10 |  -.0266579   .2993466    -0.09   0.929    -.6133665    .5600508
birthmonthdum11 |    .064706   .1775178     0.36   0.715    -.2832226    .4126346
birthmonthdum12 |  -.2257579   .3906504    -0.58   0.563    -.9914185    .5399028
          _cons |   8.149956   1.285564     6.34   0.000     5.630297    10.66961
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  1.63968  (p = 0.6504)
  Wu-Hausman F(3,1245)            =  .538617  (p = 0.6559)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   2.674  Chi-sq(16) P-value = 0.9999

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
birthmont~m2 |      1,265    .0924901    .2898312          0          1
birthmonth~3 |      1,265    .0893281    .2853295          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,265    .0616601    .2406323          0          1
birthmonth~5 |      1,265    .0727273     .259791          0          1
birthmonth~6 |      1,265    .0822134    .2747983          0          1
birthmonth~7 |      1,265    .0790514    .2699257          0          1
birthmonth~8 |      1,265     .087747    .2830386          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,265    .0901186    .2864648          0          1
birthmont~10 |      1,265    .1011858    .3016938          0          1
birthmont~11 |      1,265     .084585    .2783732          0          1
birthmont~12 |      1,265    .0853755    .2795502          0          1
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `m
> onths'-1) & inrange(monthlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(30, 1234)   =   7.20
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1490
                                                        Adj R-squared = 0.1283
                                                        Root MSE      = 0.4573

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0223143   .0065156     3.42   0.001     .0095314    .0350972
      tenuresqr |  -7.89e-07    .000307    -0.00   0.998     -.000603    .0006014
 birthmonthdum2 |  -.0576029   .0640255    -0.90   0.368    -.1832138     .068008
 birthmonthdum3 |   .0288678   .0645591     0.45   0.655    -.0977899    .1555255
 birthmonthdum4 |   -.058769   .0710126    -0.83   0.408    -.1980877    .0805498
 birthmonthdum5 |  -.1205438   .0681075    -1.77   0.077    -.2541631    .0130756
 birthmonthdum6 |  -.1670358   .0662065    -2.52   0.012    -.2969255   -.0371462
 birthmonthdum7 |  -.1439229    .066775    -2.16   0.031     -.274928   -.0129178
 birthmonthdum8 |  -.0748372   .0650771    -1.15   0.250    -.2025111    .0528368
 birthmonthdum9 |  -.0418192   .0646739    -0.65   0.518     -.168702    .0850637
birthmonthdum10 |  -.0848605   .0631314    -1.34   0.179    -.2087173    .0389964
birthmonthdum11 |  -.0582703    .065293    -0.89   0.372    -.1863679    .0698272
birthmonthdum12 |   .0101475   .0651118     0.16   0.876    -.1175945    .1378895
   provincedum2 |  -.1970264   .0722249    -2.73   0.006    -.3387235   -.0553293
   provincedum3 |  -.0939628   .0791751    -1.19   0.236    -.2492956    .0613699
   provincedum4 |  -.1956266   .0708127    -2.76   0.006    -.3345531   -.0567001
   provincedum5 |  -.2622025   .0659558    -3.98   0.000    -.3916004   -.1328046
   provincedum6 |  -.1937218   .0760273    -2.55   0.011    -.3428788   -.0445647
   provincedum7 |  -.2124667   .0668157    -3.18   0.002    -.3435516   -.0813818
   provincedum8 |  -.2370942   .0679771    -3.49   0.001    -.3704577   -.1037307
   provincedum9 |  -.2548614   .0713984    -3.57   0.000    -.3949371   -.1147856
  provincedum10 |  -.3113526    .067692    -4.60   0.000    -.4441567   -.1785485
  provincedum11 |  -.2984119   .0618479    -4.82   0.000    -.4197507   -.1770732
  provincedum12 |  -.2911813   .0734355    -3.97   0.000    -.4352534   -.1471091
  provincedum13 |  -.3115919   .0708046    -4.40   0.000    -.4505026   -.1726813
  provincedum14 |   -.286672   .0820783    -3.49   0.000    -.4477005   -.1256436
  provincedum15 |  -.3278249   .0811432    -4.04   0.000    -.4870189    -.168631
              t |   .0009183   .0017313     0.53   0.596    -.0024784     .004315
              d |   .0575307   .0543649     1.06   0.290    -.0491272    .1641886
             td |    .001016   .0024887     0.41   0.683    -.0038666    .0058986
          _cons |   .4655385   .0804853     5.78   0.000     .3076353    .6234416
---------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(30, 1234)   =   4.25
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0937
                                                        Adj R-squared = 0.0717
                                                        Root MSE      = 0.4482

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0282883   .0063862     4.43   0.000     .0157593    .0408172
      tenuresqr |  -.0006443   .0003009    -2.14   0.032    -.0012345    -.000054
 birthmonthdum2 |  -.0382232   .0627534    -0.61   0.543    -.1613384    .0848919
 birthmonthdum3 |   -.045833   .0632764    -0.72   0.469    -.1699742    .0783082
 birthmonthdum4 |   -.104093   .0696017    -1.50   0.135    -.2406437    .0324577
 birthmonthdum5 |  -.0756873   .0667543    -1.13   0.257    -.2066519    .0552772
 birthmonthdum6 |  -.1016939    .064891    -1.57   0.117    -.2290029     .025615
 birthmonthdum7 |  -.1590563   .0654483    -2.43   0.015    -.2874585   -.0306541
 birthmonthdum8 |  -.0398078   .0637841    -0.62   0.533     -.164945    .0853295
 birthmonthdum9 |  -.0581937   .0633889    -0.92   0.359    -.1825556    .0661682
birthmonthdum10 |  -.0837268   .0618771    -1.35   0.176    -.2051227    .0376692
birthmonthdum11 |  -.0556254   .0639957    -0.87   0.385    -.1811779     .069927
birthmonthdum12 |  -.0275263   .0638181    -0.43   0.666    -.1527303    .0976776
   provincedum2 |    -.20094   .0707899    -2.84   0.005    -.3398218   -.0620582
   provincedum3 |  -.1176826    .077602    -1.52   0.130    -.2699291    .0345638
   provincedum4 |  -.1265384   .0694057    -1.82   0.069    -.2627046    .0096279
   provincedum5 |  -.2224461   .0646453    -3.44   0.001     -.349273   -.0956191
   provincedum6 |  -.1496609   .0745167    -2.01   0.045    -.2958544   -.0034674
   provincedum7 |  -.1618049   .0654881    -2.47   0.014    -.2902853   -.0333245
   provincedum8 |  -.2249365   .0666265    -3.38   0.001    -.3556502   -.0942227
   provincedum9 |  -.1564358   .0699798    -2.24   0.026    -.2937285   -.0191432
  provincedum10 |  -.3000376    .066347    -4.52   0.000     -.430203   -.1698721
  provincedum11 |  -.2420187   .0606191    -3.99   0.000    -.3609466   -.1230908
  provincedum12 |  -.2475573   .0719764    -3.44   0.001    -.3887669   -.1063476
  provincedum13 |  -.2778013   .0693978    -4.00   0.000    -.4139519   -.1416506
  provincedum14 |   -.256436   .0804475    -3.19   0.001    -.4142651    -.098607
  provincedum15 |  -.2901091    .079531    -3.65   0.000    -.4461401   -.1340781
              t |   .0019501   .0016969     1.15   0.251     -.001379    .0052793
              d |   .0191548   .0532848     0.36   0.719     -.085384    .1236936
             td |  -.0010091   .0024393    -0.41   0.679    -.0057946    .0037765
          _cons |   .4136601   .0788861     5.24   0.000     .2588943    .5684259
---------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(30, 1234)   =   3.21
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0724
                                                        Adj R-squared = 0.0499
                                                        Root MSE      = 0.4809

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0330098   .0068518     4.82   0.000     .0195674    .0464523
      tenuresqr |  -.0009862   .0003228    -3.06   0.002    -.0016195   -.0003529
 birthmonthdum2 |  -.0745176   .0673287    -1.11   0.269    -.2066089    .0575738
 birthmonthdum3 |  -.0759924   .0678898    -1.12   0.263    -.2091845    .0571998
 birthmonthdum4 |  -.1278071   .0746762    -1.71   0.087    -.2743135    .0186994
 birthmonthdum5 |  -.0823583   .0716213    -1.15   0.250    -.2228713    .0581547
 birthmonthdum6 |  -.0747739   .0696222    -1.07   0.283    -.2113648    .0618169
 birthmonthdum7 |  -.2081586     .07022    -2.96   0.003    -.3459224   -.0703947
 birthmonthdum8 |  -.0323833   .0684345    -0.47   0.636    -.1666442    .1018775
 birthmonthdum9 |  -.1018021   .0680105    -1.50   0.135    -.2352311    .0316268
birthmonthdum10 |  -.1002714   .0663885    -1.51   0.131    -.2305182    .0299754
birthmonthdum11 |   -.044016   .0686616    -0.64   0.522    -.1787223    .0906903
birthmonthdum12 |  -.0668035    .068471    -0.98   0.329    -.2011359    .0675289
   provincedum2 |  -.1480855   .0759511    -1.95   0.051    -.2970929     .000922
   provincedum3 |    -.08441   .0832599    -1.01   0.311    -.2477566    .0789366
   provincedum4 |   -.102288    .074466    -1.37   0.170    -.2483819    .0438059
   provincedum5 |  -.1683511   .0693586    -2.43   0.015    -.3044249   -.0322774
   provincedum6 |  -.1105094   .0799497    -1.38   0.167    -.2673617    .0463429
   provincedum7 |   -.111445   .0702628    -1.59   0.113    -.2492928    .0264027
   provincedum8 |  -.1477026   .0714842    -2.07   0.039    -.2879465   -.0074587
   provincedum9 |  -.1495852    .075082    -1.99   0.047    -.2968876   -.0022827
  provincedum10 |  -.3029009   .0711843    -4.26   0.000    -.4425565   -.1632452
  provincedum11 |  -.1653727   .0650388    -2.54   0.011    -.2929715   -.0377739
  provincedum12 |  -.1798019   .0772241    -2.33   0.020     -.331307   -.0282969
  provincedum13 |  -.2029953   .0744575    -2.73   0.006    -.3490725    -.056918
  provincedum14 |  -.2329626   .0863128    -2.70   0.007    -.4022988   -.0636264
  provincedum15 |  -.2269233   .0853295    -2.66   0.008    -.3943303   -.0595163
              t |    .001981   .0018206     1.09   0.277    -.0015909    .0055529
              d |   -.007435   .0571697    -0.13   0.897    -.1195955    .1047256
             td |  -.0005263   .0026171    -0.20   0.841    -.0056608    .0046082
          _cons |   .4967027   .0846376     5.87   0.000     .3306532    .6627523
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(30)   =     126.30
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .86376

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.2444566   1.645416    -0.15   0.882    -3.469413      2.9805
  secgenhighedu |   2.660539   5.041528     0.53   0.598    -7.220674    12.54175
      secgenedu |  -1.816817     4.5599    -0.40   0.690    -10.75406    7.120423
         tenure |    .041015   .0510701     0.80   0.422    -.0590806    .1411106
      tenuresqr |  -.0011097   .0023096    -0.48   0.631    -.0056365     .003417
 birthmonthdum2 |   -.086972   .2298988    -0.38   0.705    -.5375654    .3636213
 birthmonthdum3 |  -.1421846   .2255633    -0.63   0.528    -.5842806    .2999113
 birthmonthdum4 |   .0352619   .2453574     0.14   0.886    -.4456298    .5161535
 birthmonthdum5 |   -.107693   .1641207    -0.66   0.512    -.4293636    .2139777
 birthmonthdum6 |   .0139838   .1552249     0.09   0.928    -.2902515     .318219
 birthmonthdum7 |  -.0884771   .3613072    -0.24   0.807    -.7966262     .619672
 birthmonthdum8 |   .0280582    .129445     0.22   0.828    -.2256492    .2817657
 birthmonthdum9 |  -.0597256   .2586171    -0.23   0.817    -.5666058    .4471546
birthmonthdum10 |   .0017441   .1974006     0.01   0.993     -.385154    .3886423
birthmonthdum11 |   .0539535   .1361744     0.40   0.692    -.2129433    .3208503
birthmonthdum12 |  -.1751425     .23138    -0.76   0.449    -.6286389    .2783539
   provincedum2 |  -.4508084   .2664427    -1.69   0.091    -.9730266    .0714098
   provincedum3 |  -.3498912   .2280787    -1.53   0.125    -.7969172    .0971349
   provincedum4 |  -.2977493   .1621836    -1.84   0.066    -.6156233    .0201248
   provincedum5 |   .0647447   .2308603     0.28   0.779    -.3877332    .5172226
   provincedum6 |  -.1547807   .1909825    -0.81   0.418    -.5290995    .2195381
   provincedum7 |   -.250564   .1997662    -1.25   0.210    -.6420985    .1409705
   provincedum8 |  -.2505632   .3190236    -0.79   0.432     -.875838    .3747117
   provincedum9 |  -.2533189   .2090243    -1.21   0.226    -.6629989    .1563612
  provincedum10 |  -.2254506   .3553213    -0.63   0.526    -.9218676    .4709664
  provincedum11 |   .1120203   .2750982     0.41   0.684    -.4271623    .6512028
  provincedum12 |  -.0893015   .2742572    -0.33   0.745    -.6268357    .4482326
  provincedum13 |   .0013553   .3060324     0.00   0.996    -.5984571    .6011677
  provincedum14 |  -.1772965   .2698583    -0.66   0.511    -.7062091    .3516161
  provincedum15 |  -.1986049   .2962948    -0.67   0.503     -.779332    .3821222
          _cons |   8.185013   .7124978    11.49   0.000     6.788543    9.581483
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  .874817  (p = 0.8315)
  Wu-Hausman F(3,1231)            =  .283964  (p = 0.8370)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  10.967  Chi-sq(30) P-value = 0.9994

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
birthmont~m2 |      1,265    .0924901    .2898312          0          1
birthmonth~3 |      1,265    .0893281    .2853295          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,265    .0616601    .2406323          0          1
birthmonth~5 |      1,265    .0727273     .259791          0          1
birthmonth~6 |      1,265    .0822134    .2747983          0          1
birthmonth~7 |      1,265    .0790514    .2699257          0          1
birthmonth~8 |      1,265     .087747    .2830386          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,265    .0901186    .2864648          0          1
birthmont~10 |      1,265    .1011858    .3016938          0          1
birthmont~11 |      1,265     .084585    .2783732          0          1
birthmont~12 |      1,265    .0853755    .2795502          0          1
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearni
> ng, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(17, 2693)   =  13.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0787
                                                        Adj R-squared = 0.0729
                                                        Root MSE      = 0.4740

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0254631   .0046999     5.42   0.000     .0162473    .0346788
      tenuresqr |  -.0003487    .000219    -1.59   0.112    -.0007782    .0000808
 birthmonthdum2 |  -.0606869    .045281    -1.34   0.180    -.1494759    .0281022
 birthmonthdum3 |   .0334053   .0457824     0.73   0.466     -.056367    .1231776
 birthmonthdum4 |    -.09588   .0496329    -1.93   0.053    -.1932023    .0014424
 birthmonthdum5 |  -.1123345   .0468348    -2.40   0.017    -.2041702   -.0204988
 birthmonthdum6 |  -.1078458   .0466855    -2.31   0.021    -.1993888   -.0163028
 birthmonthdum7 |  -.0517959    .046252    -1.12   0.263     -.142489    .0388971
 birthmonthdum8 |  -.0720239   .0467263    -1.54   0.123    -.1636469    .0195991
 birthmonthdum9 |  -.0134891    .045064    -0.30   0.765    -.1018527    .0748744
birthmonthdum10 |    -.05403    .042972    -1.26   0.209    -.1382914    .0302314
birthmonthdum11 |  -.0731019   .0451096    -1.62   0.105    -.1615549    .0153511
birthmonthdum12 |  -.0010485   .0462534    -0.02   0.982    -.0917443    .0896473
           male |   .0091183   .0183483     0.50   0.619    -.0268599    .0450964
              t |   .0003667    .001209     0.30   0.762     -.002004    .0027373
              d |   .0406176   .0377771     1.08   0.282    -.0334574    .1146926
             td |    .002503   .0017244     1.45   0.147    -.0008783    .0058844
          _cons |   .2260436   .0459368     4.92   0.000     .1359685    .3161186
---------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(17, 2693)   =   8.27
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0496
                                                        Adj R-squared = 0.0436
                                                        Root MSE      = 0.4615

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0306955    .004576     6.71   0.000     .0217227    .0396684
      tenuresqr |   -.000895   .0002133    -4.20   0.000    -.0013132   -.0004768
 birthmonthdum2 |  -.0313146   .0440876    -0.71   0.478    -.1177635    .0551343
 birthmonthdum3 |   -.006869   .0445758    -0.15   0.878    -.0942753    .0805372
 birthmonthdum4 |  -.1040546   .0483247    -2.15   0.031    -.1988119   -.0092973
 birthmonthdum5 |  -.0582717   .0456004    -1.28   0.201     -.147687    .0311436
 birthmonthdum6 |  -.0782382    .045455    -1.72   0.085    -.1673685     .010892
 birthmonthdum7 |   -.058197    .045033    -1.29   0.196    -.1464998    .0301057
 birthmonthdum8 |  -.0271924   .0454947    -0.60   0.550    -.1164005    .0620158
 birthmonthdum9 |    .009776   .0438763     0.22   0.824    -.0762586    .0958106
birthmonthdum10 |  -.0422788   .0418394    -1.01   0.312    -.1243194    .0397618
birthmonthdum11 |  -.0435344   .0439207    -0.99   0.322    -.1296561    .0425874
birthmonthdum12 |   .0078356   .0450343     0.17   0.862    -.0804698     .096141
           male |   .0212788   .0178647     1.19   0.234    -.0137511    .0563087
              t |   .0014288   .0011771     1.21   0.225    -.0008794    .0037371
              d |   .0195748   .0367814     0.53   0.595    -.0525478    .0916975
             td |   .0003925    .001679     0.23   0.815    -.0028997    .0036848
          _cons |   .1796325   .0447261     4.02   0.000     .0919315    .2673335
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(16)   =     213.25
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .77258

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.8954364    1.25518    -0.71   0.476    -3.355544    1.564672
  secgenhighedu |   1.637954   1.613181     1.02   0.310    -1.523822     4.79973
         tenure |   .0225498   .0219758     1.03   0.305     -.020522    .0656217
      tenuresqr |  -.0003957   .0011216    -0.35   0.724     -.002594    .0018026
 birthmonthdum2 |  -.0064513   .0794691    -0.08   0.935     -.162208    .1493053
 birthmonthdum3 |  -.0369408   .0894958    -0.41   0.680    -.2123494    .1384677
 birthmonthdum4 |  -.0028914   .0975799    -0.03   0.976    -.1941445    .1883617
 birthmonthdum5 |  -.0485501    .094181    -0.52   0.606    -.2331415    .1360412
 birthmonthdum6 |   .0087916   .0830361     0.11   0.916    -.1539562    .1715393
 birthmonthdum7 |   .0325488   .0803796     0.40   0.686    -.1249923    .1900899
 birthmonthdum8 |  -.0183889   .0920627    -0.20   0.842    -.1988284    .1620507
 birthmonthdum9 |   .0622426   .0815853     0.76   0.446    -.0976616    .2221469
birthmonthdum10 |   .0254763   .0722973     0.35   0.725    -.1162239    .1671765
birthmonthdum11 |  -.0295215   .0794061    -0.37   0.710    -.1851545    .1261116
birthmonthdum12 |  -.0730359   .0763084    -0.96   0.339    -.2225977    .0765259
           male |   .2662926   .0376786     7.07   0.000      .192444    .3401413
          _cons |   7.897511   .1019704    77.45   0.000     7.697652    8.097369
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.37976  (p = 0.5016)
  Wu-Hausman F(2,2692)            =  .685393  (p = 0.5040)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .719384  (p = 0.3963)
  Basmann chi2(1)        =  .714797  (p = 0.3979)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  12.463  Chi-sq(17) P-value = 0.7713

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
birthmont~m2 |      2,711    .0874216     .282504          0          1
birthmonth~3 |      2,711    .0837329     .277038          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,711     .061232    .2397996          0          1
birthmonth~5 |      2,711    .0763556    .2656152          0          1
birthmonth~6 |      2,711    .0789377    .2696912          0          1
birthmonth~7 |      2,711    .0822575    .2748073          0          1
birthmonth~8 |      2,711    .0800443    .2714118          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,711    .0925858    .2899045          0          1
birthmont~10 |      2,711    .1125046    .3160446          0          1
birthmont~11 |      2,711     .089266    .2851798          0          1
birthmont~12 |      2,711    .0800443    .2714118          0          1
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months
> '-1) & inrange(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(31, 2679)   =  10.10
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1047
                                                        Adj R-squared = 0.0943
                                                        Root MSE      = 0.4685

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0244069   .0046679     5.23   0.000     .0152539      .03356
      tenuresqr |  -.0003218   .0002173    -1.48   0.139    -.0007479    .0001043
 birthmonthdum2 |  -.0583975   .0448145    -1.30   0.193    -.1462721     .029477
 birthmonthdum3 |   .0315409   .0454064     0.69   0.487    -.0574941     .120576
 birthmonthdum4 |   -.103654   .0491339    -2.11   0.035    -.1999981   -.0073098
 birthmonthdum5 |  -.1110299   .0463526    -2.40   0.017    -.2019204   -.0201393
 birthmonthdum6 |  -.1132066   .0462351    -2.45   0.014    -.2038667   -.0225465
 birthmonthdum7 |  -.0573851   .0458655    -1.25   0.211    -.1473205    .0325502
 birthmonthdum8 |  -.0696769   .0462838    -1.51   0.132    -.1604325    .0210787
 birthmonthdum9 |  -.0084348   .0446369    -0.19   0.850    -.0959612    .0790915
birthmonthdum10 |  -.0459635   .0425903    -1.08   0.281    -.1294767    .0375497
birthmonthdum11 |  -.0688202   .0446494    -1.54   0.123     -.156371    .0187307
birthmonthdum12 |    -.00392   .0458268    -0.09   0.932    -.0937794    .0859394
           male |   .0094607   .0181779     0.52   0.603    -.0261834    .0451049
   provincedum2 |   -.257807    .049097    -5.25   0.000    -.3540789   -.1615351
   provincedum3 |  -.1852794   .0537987    -3.44   0.001    -.2907706   -.0797883
   provincedum4 |  -.2545595   .0482882    -5.27   0.000    -.3492455   -.1598735
   provincedum5 |  -.2792986    .045078    -6.20   0.000    -.3676897   -.1909074
   provincedum6 |  -.2914675   .0519861    -5.61   0.000    -.3934044   -.1895306
   provincedum7 |  -.2363941   .0467451    -5.06   0.000    -.3280543   -.1447339
   provincedum8 |   -.231637   .0472754    -4.90   0.000     -.324337   -.1389369
   provincedum9 |  -.2858431   .0479509    -5.96   0.000    -.3798676   -.1918186
  provincedum10 |  -.2745881   .0474035    -5.79   0.000    -.3675392    -.181637
  provincedum11 |  -.3431736   .0421039    -8.15   0.000    -.4257331   -.2606142
  provincedum12 |  -.2521577   .0534511    -4.72   0.000    -.3569672   -.1473482
  provincedum13 |  -.3056481   .0491294    -6.22   0.000    -.4019834   -.2093128
  provincedum14 |  -.2619057   .0583645    -4.49   0.000    -.3763498   -.1474617
  provincedum15 |  -.2601421   .0584663    -4.45   0.000    -.3747857   -.1454984
              t |   .0004298   .0011978     0.36   0.720    -.0019189    .0027784
              d |    .033242   .0374805     0.89   0.375    -.0402517    .1067356
             td |   .0023859   .0017076     1.40   0.162    -.0009625    .0057342
          _cons |   .4890465   .0565808     8.64   0.000        .3781    .5999931
---------------------------------------------------------------------------------

                                                        Number of obs =  2,711
                                                        F(31, 2679)   =   6.65
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0715
                                                        Adj R-squared = 0.0607
                                                        Root MSE      = 0.4574

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0295625   .0045571     6.49   0.000     .0206267    .0384982
      tenuresqr |  -.0008525   .0002121    -4.02   0.000    -.0012685   -.0004366
 birthmonthdum2 |  -.0323393   .0437504    -0.74   0.460    -.1181272    .0534486
 birthmonthdum3 |  -.0116505   .0443282    -0.26   0.793    -.0985714    .0752704
 birthmonthdum4 |   -.107687   .0479672    -2.25   0.025    -.2017434   -.0136305
 birthmonthdum5 |  -.0593553    .045252    -1.31   0.190    -.1480876     .029377
 birthmonthdum6 |  -.0852359   .0451372    -1.89   0.059    -.1737433    .0032714
 birthmonthdum7 |  -.0666395   .0447764    -1.49   0.137    -.1544393    .0211603
 birthmonthdum8 |  -.0274304   .0451848    -0.61   0.544     -.116031    .0611702
 birthmonthdum9 |   .0120666    .043577     0.28   0.782    -.0733814    .0975146
birthmonthdum10 |  -.0387532    .041579    -0.93   0.351    -.1202833     .042777
birthmonthdum11 |   -.041617   .0435892    -0.95   0.340    -.1270889    .0438549
birthmonthdum12 |   .0018253   .0447386     0.04   0.967    -.0859004    .0895509
           male |   .0205141   .0177463     1.16   0.248    -.0142836    .0553119
   provincedum2 |  -.2804521   .0479312    -5.85   0.000     -.374438   -.1864662
   provincedum3 |  -.1809199   .0525212    -3.44   0.001    -.2839062   -.0779337
   provincedum4 |  -.1895611   .0471416    -4.02   0.000    -.2819987   -.0971235
   provincedum5 |  -.2119154   .0440076    -4.82   0.000    -.2982076   -.1256231
   provincedum6 |  -.2490865   .0507516    -4.91   0.000    -.3486029   -.1495702
   provincedum7 |  -.1760228   .0456351    -3.86   0.000    -.2655065   -.0865392
   provincedum8 |  -.1865382   .0461529    -4.04   0.000    -.2770371   -.0960394
   provincedum9 |  -.1972406   .0468123    -4.21   0.000    -.2890325   -.1054488
  provincedum10 |  -.2642432   .0462779    -5.71   0.000    -.3549872   -.1734992
  provincedum11 |  -.2731165   .0411041    -6.64   0.000    -.3537155   -.1925175
  provincedum12 |  -.2104025   .0521818    -4.03   0.000    -.3127232   -.1080817
  provincedum13 |   -.269245   .0479628    -5.61   0.000    -.3632928   -.1751972
  provincedum14 |  -.2742047   .0569786    -4.81   0.000    -.3859312   -.1624782
  provincedum15 |   -.238543    .057078    -4.18   0.000    -.3504644   -.1266216
              t |    .001519   .0011693     1.30   0.194    -.0007739    .0038118
              d |   .0095971   .0365905     0.26   0.793    -.0621514    .0813456
             td |   .0003499   .0016671     0.21   0.834    -.0029189    .0036188
          _cons |   .4046463   .0552373     7.33   0.000     .2963343    .5129584
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(30)   =     365.93
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0163
                                                  Root MSE        =     .70671

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.6089478   1.128694    -0.54   0.590    -2.821148    1.603253
  secgenhighedu |   1.180065   1.465239     0.81   0.421    -1.691751    4.051881
         tenure |   .0255598   .0199766     1.28   0.201    -.0135936    .0647133
      tenuresqr |  -.0005236    .000994    -0.53   0.598    -.0024717    .0014246
 birthmonthdum2 |  -.0025976   .0715719    -0.04   0.971    -.1428759    .1376807
 birthmonthdum3 |  -.0299192   .0842114    -0.36   0.722    -.1949704    .1351321
 birthmonthdum4 |  -.0029024   .0893027    -0.03   0.974    -.1779325    .1721277
 birthmonthdum5 |   -.047383   .0846901    -0.56   0.576    -.2133725    .1186065
 birthmonthdum6 |   .0066799   .0769935     0.09   0.931    -.1442246    .1575843
 birthmonthdum7 |   .0250904   .0763016     0.33   0.742     -.124458    .1746389
 birthmonthdum8 |  -.0081316   .0825344    -0.10   0.922    -.1698961    .1536328
 birthmonthdum9 |   .0553231   .0737988     0.75   0.453    -.0893199    .1999661
birthmonthdum10 |   .0311842   .0663842     0.47   0.639    -.0989266    .1612949
birthmonthdum11 |   -.039433   .0721207    -0.55   0.585     -.180787     .101921
birthmonthdum12 |  -.0577029   .0693486    -0.83   0.405    -.1936238    .0782179
           male |   .2692124   .0336562     8.00   0.000     .2032475    .3351772
   provincedum2 |  -.3434628   .1659681    -2.07   0.039    -.6687544   -.0181713
   provincedum3 |  -.2253799   .1159655    -1.94   0.052    -.4526681    .0019084
   provincedum4 |  -.2827961   .1034913    -2.73   0.006    -.4856353   -.0799569
   provincedum5 |    .028498   .1049877     0.27   0.786     -.177274    .2342701
   provincedum6 |  -.0863056   .1244921    -0.69   0.488    -.3303057    .1576946
   provincedum7 |  -.2248894   .0981133    -2.29   0.022     -.417188   -.0325908
   provincedum8 |  -.3525513   .1006726    -3.50   0.000     -.549866   -.1552367
   provincedum9 |  -.1177168   .1108951    -1.06   0.288    -.3350673    .0996336
  provincedum10 |  -.0705085   .1365374    -0.52   0.606    -.3381169    .1970998
  provincedum11 |   .0266584   .1181729     0.23   0.822    -.2049563     .258273
  provincedum12 |  -.1529038   .1119267    -1.37   0.172    -.3722761    .0664684
  provincedum13 |   -.065092    .129911    -0.50   0.616    -.3197128    .1895288
  provincedum14 |  -.1227527   .1626902    -0.75   0.451    -.4416197    .1961143
  provincedum15 |  -.2725533   .1314725    -2.07   0.038    -.5302348   -.0148719
          _cons |   8.051997   .1703333    47.27   0.000      7.71815    8.385844
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .890499  (p = 0.6407)
  Wu-Hausman F(2,2678)            =  .439974  (p = 0.6441)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .647163  (p = 0.4211)
  Basmann chi2(1)        =  .639677  (p = 0.4238)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  27.730  Chi-sq(31) P-value = 0.6351

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
birthmont~m2 |      2,711    .0874216     .282504          0          1
birthmonth~3 |      2,711    .0837329     .277038          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,711     .061232    .2397996          0          1
birthmonth~5 |      2,711    .0763556    .2656152          0          1
birthmonth~6 |      2,711    .0789377    .2696912          0          1
birthmonth~7 |      2,711    .0822575    .2748073          0          1
birthmonth~8 |      2,711    .0800443    .2714118          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,711    .0925858    .2899045          0          1
birthmont~10 |      2,711    .1125046    .3160446          0          1
birthmont~11 |      2,711     .089266    .2851798          0          1
birthmont~12 |      2,711    .0800443    .2714118          0          1
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 2
> 50, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(16, 1429)   =   5.15
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0546
                                                        Adj R-squared = 0.0440
                                                        Root MSE      = 0.4834

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .026317   .0067649     3.89   0.000     .0130468    .0395871
      tenuresqr |  -.0005715   .0003123    -1.83   0.068    -.0011842    .0000412
 birthmonthdum2 |  -.0710658   .0636836    -1.12   0.265    -.1959892    .0538577
 birthmonthdum3 |     .02028   .0645054     0.31   0.753    -.1062555    .1468154
 birthmonthdum4 |  -.1312034   .0691698    -1.90   0.058    -.2668887    .0044818
 birthmonthdum5 |  -.1106848   .0643275    -1.72   0.086    -.2368712    .0155017
 birthmonthdum6 |  -.0732296   .0652757    -1.12   0.262    -.2012761    .0548169
 birthmonthdum7 |   .0157511   .0637975     0.25   0.805    -.1093958     .140898
 birthmonthdum8 |  -.0712892   .0663516    -1.07   0.283    -.2014462    .0588678
 birthmonthdum9 |   .0060355   .0622725     0.10   0.923    -.1161199    .1281909
birthmonthdum10 |  -.0342882   .0585461    -0.59   0.558    -.1491337    .0805573
birthmonthdum11 |  -.0742862   .0619648    -1.20   0.231    -.1958379    .0472655
birthmonthdum12 |  -.0296086   .0651906    -0.45   0.650    -.1574882    .0982709
              t |  -.0002873   .0016799    -0.17   0.864    -.0035826     .003008
              d |   .0289112   .0524532     0.55   0.582    -.0739824    .1318049
             td |   .0038559   .0023894     1.61   0.107    -.0008311     .008543
          _cons |   .2444901   .0636605     3.84   0.000      .119612    .3693683
---------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(16, 1429)   =   3.81
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0409
                                                        Adj R-squared = 0.0302
                                                        Root MSE      = 0.4701

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0309724    .006579     4.71   0.000     .0180669     .043878
      tenuresqr |  -.0010303   .0003038    -3.39   0.001    -.0016261   -.0004344
 birthmonthdum2 |  -.0316864   .0619341    -0.51   0.609    -.1531778     .089805
 birthmonthdum3 |   .0115447   .0627332     0.18   0.854    -.1115145    .1346038
 birthmonthdum4 |  -.1041851   .0672695    -1.55   0.122    -.2361427    .0277724
 birthmonthdum5 |  -.0464216   .0625602    -0.74   0.458    -.1691413     .076298
 birthmonthdum6 |  -.0751388   .0634824    -1.18   0.237    -.1996675    .0493899
 birthmonthdum7 |   .0201562   .0620448     0.32   0.745    -.1015525    .1418649
 birthmonthdum8 |  -.0171475   .0645287    -0.27   0.790    -.1437287    .1094337
 birthmonthdum9 |   .0670438   .0605617     1.11   0.268    -.0517556    .1858431
birthmonthdum10 |  -.0150134   .0569376    -0.26   0.792    -.1267037     .096677
birthmonthdum11 |  -.0266674   .0602624    -0.44   0.658    -.1448797    .0915449
birthmonthdum12 |   .0221103   .0633996     0.35   0.727     -.102256    .1464766
              t |   .0008579   .0016337     0.53   0.600    -.0023468    .0040626
              d |   .0260493   .0510122     0.51   0.610    -.0740175    .1261162
             td |    .001501   .0023237     0.65   0.518    -.0030574    .0060593
          _cons |   .1820196   .0619116     2.94   0.003     .0605723     .303467
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(15)   =      29.12
                                                  Prob > chi2     =     0.0155
                                                  R-squared       =          .
                                                  Root MSE        =     .76518

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.146969   1.679889    -0.68   0.495    -4.439492    2.145553
  secgenhighedu |    1.42317    1.91041     0.74   0.456    -2.321165    5.167506
         tenure |   .0266505   .0236147     1.13   0.259    -.0196334    .0729343
      tenuresqr |  -.0007685   .0012544    -0.61   0.540    -.0032269      .00169
 birthmonthdum2 |   -.012635   .1169892    -0.11   0.914    -.2419296    .2166596
 birthmonthdum3 |  -.0141593   .1022524    -0.14   0.890    -.2145703    .1862516
 birthmonthdum4 |  -.1094935   .1202496    -0.91   0.363    -.3451785    .1261915
 birthmonthdum5 |   -.041799   .1443182    -0.29   0.772    -.3246575    .2410596
 birthmonthdum6 |   .0468337   .1097362     0.43   0.670    -.1682453    .2619126
 birthmonthdum7 |   .0621709   .1011271     0.61   0.539    -.1360346    .2603764
 birthmonthdum8 |  -.0577583   .1370404    -0.42   0.673    -.3263525    .2108359
 birthmonthdum9 |   .0891043   .1531892     0.58   0.561     -.211141    .3893495
birthmonthdum10 |   .0127445    .097901     0.13   0.896    -.1791379     .204627
birthmonthdum11 |   -.102632   .1245492    -0.82   0.410     -.346744      .14148
birthmonthdum12 |  -.0642365   .1348037    -0.48   0.634    -.3284469     .199974
          _cons |   8.364787    .168958    49.51   0.000     8.033635    8.695938
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.15439  (p = 0.5615)
  Wu-Hausman F(2,1428)            =  .570463  (p = 0.5654)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .228724  (p = 0.6325)
  Basmann chi2(1)        =  .226071  (p = 0.6345)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  10.028  Chi-sq(16) P-value = 0.8652

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
birthmont~m2 |      1,446    .0829876    .2759588          0          1
birthmonth~3 |      1,446    .0788382    .2695793          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,446    .0608575    .2391515          0          1
birthmonth~5 |      1,446    .0795297    .2706574          0          1
birthmonth~6 |      1,446    .0760719    .2652049          0          1
birthmonth~7 |      1,446    .0850622    .2790708          0          1
birthmonth~8 |      1,446    .0733057    .2607278          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,446    .0947441    .2929625          0          1
birthmont~10 |      1,446    .1224066    .3278683          0          1
birthmont~11 |      1,446     .093361    .2910383          0          1
birthmont~12 |      1,446    .0753804    .2640954          0          1
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) 
> & inrange(monthlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(30, 1415)   =   4.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0901
                                                        Adj R-squared = 0.0708
                                                        Root MSE      = 0.4765

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0257801   .0067032     3.85   0.000     .0126308    .0389294
      tenuresqr |  -.0005671   .0003088    -1.84   0.066    -.0011729    .0000386
 birthmonthdum2 |  -.0601084   .0630701    -0.95   0.341    -.1838293    .0636126
 birthmonthdum3 |   .0336733   .0639728     0.53   0.599    -.0918184    .1591651
 birthmonthdum4 |  -.1386915   .0685311    -2.02   0.043    -.2731251    -.004258
 birthmonthdum5 |    -.09914   .0636861    -1.56   0.120    -.2240693    .0257893
 birthmonthdum6 |  -.0650607   .0645993    -1.01   0.314    -.1917814      .06166
 birthmonthdum7 |   .0149482   .0632619     0.24   0.813     -.109149    .1390455
 birthmonthdum8 |  -.0607551   .0657721    -0.92   0.356    -.1897765    .0682662
 birthmonthdum9 |   .0177724   .0617253     0.29   0.773    -.1033106    .1388554
birthmonthdum10 |  -.0123792   .0580061    -0.21   0.831    -.1261664    .1014081
birthmonthdum11 |   -.072208   .0615175    -1.17   0.241    -.1928833    .0484673
birthmonthdum12 |  -.0204969   .0645692    -0.32   0.751    -.1471585    .1061647
   provincedum2 |  -.3153364   .0670917    -4.70   0.000    -.4469464   -.1837265
   provincedum3 |  -.2506163   .0734282    -3.41   0.001    -.3946562   -.1065765
   provincedum4 |   -.305607   .0661955    -4.62   0.000    -.4354589   -.1757551
   provincedum5 |  -.2967071   .0617862    -4.80   0.000    -.4179095   -.1755047
   provincedum6 |  -.3720288   .0713634    -5.21   0.000    -.5120183   -.2320393
   provincedum7 |  -.2692213   .0660777    -4.07   0.000    -.3988421   -.1396004
   provincedum8 |  -.2282949   .0659087    -3.46   0.001    -.3575843   -.0990056
   provincedum9 |  -.3180519   .0651108    -4.88   0.000    -.4457759    -.190328
  provincedum10 |  -.2508223   .0666763    -3.76   0.000    -.3816172   -.1200273
  provincedum11 |  -.3807392   .0575227    -6.62   0.000    -.4935781   -.2679003
  provincedum12 |  -.1989739    .078292    -2.54   0.011    -.3525548    -.045393
  provincedum13 |  -.3052823   .0682683    -4.47   0.000    -.4392003   -.1713644
  provincedum14 |  -.2484807   .0834957    -2.98   0.003    -.4122693   -.0846921
  provincedum15 |    -.19001   .0844811    -2.25   0.025    -.3557317   -.0242882
              t |  -.0001696   .0016657    -0.10   0.919    -.0034371    .0030978
              d |   .0108542   .0520494     0.21   0.835     -.091248    .1129564
             td |   .0040551   .0023665     1.71   0.087    -.0005871    .0086974
          _cons |   .5202839   .0778906     6.68   0.000     .3674904    .6730774
---------------------------------------------------------------------------------

                                                        Number of obs =  1,446
                                                        F(30, 1415)   =   3.65
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0718
                                                        Adj R-squared = 0.0522
                                                        Root MSE      = 0.4647

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0304727   .0065369     4.66   0.000     .0176497    .0432958
      tenuresqr |  -.0010197   .0003011    -3.39   0.001    -.0016104    -.000429
 birthmonthdum2 |  -.0243932   .0615054    -0.40   0.692    -.1450448    .0962585
 birthmonthdum3 |   .0195891   .0623858     0.31   0.754    -.1027894    .1419676
 birthmonthdum4 |  -.1090903    .066831    -1.63   0.103    -.2401888    .0220082
 birthmonthdum5 |  -.0374178   .0621061    -0.60   0.547    -.1592479    .0844122
 birthmonthdum6 |  -.0731236   .0629967    -1.16   0.246    -.1967006    .0504534
 birthmonthdum7 |   .0127716   .0616925     0.21   0.836     -.108247    .1337902
 birthmonthdum8 |  -.0144824   .0641404    -0.23   0.821     -.140303    .1113381
 birthmonthdum9 |   .0712303    .060194     1.18   0.237    -.0468488    .1893095
birthmonthdum10 |   .0015322   .0565671     0.03   0.978    -.1094322    .1124966
birthmonthdum11 |  -.0258861   .0599914    -0.43   0.666    -.1435676    .0917955
birthmonthdum12 |   .0281836   .0629673     0.45   0.655    -.0953358    .1517029
   provincedum2 |  -.3492045   .0654273    -5.34   0.000    -.4775494   -.2208595
   provincedum3 |  -.2269694   .0716066    -3.17   0.002    -.3674358   -.0865029
   provincedum4 |  -.2407627   .0645533    -3.73   0.000    -.3673931   -.1141322
   provincedum5 |  -.2063643   .0602534    -3.42   0.001    -.3245599   -.0881687
   provincedum6 |  -.3306272    .069593    -4.75   0.000    -.4671438   -.1941106
   provincedum7 |  -.1928007   .0644385    -2.99   0.003    -.3192059   -.0663956
   provincedum8 |   -.153495   .0642737    -2.39   0.017    -.2795769   -.0274131
   provincedum9 |  -.2336598   .0634955    -3.68   0.000    -.3582152   -.1091045
  provincedum10 |  -.2348469   .0650221    -3.61   0.000    -.3623971   -.1072967
  provincedum11 |  -.2981382   .0560956    -5.31   0.000    -.4081778   -.1880987
  provincedum12 |  -.1595741   .0763497    -2.09   0.037    -.3093449   -.0098032
  provincedum13 |  -.2654245   .0665747    -3.99   0.000    -.3960202   -.1348288
  provincedum14 |  -.3006401   .0814243    -3.69   0.000    -.4603654   -.1409148
  provincedum15 |  -.1866383   .0823853    -2.27   0.024    -.3482488   -.0250279
              t |    .001033   .0016244     0.64   0.525    -.0021534    .0042194
              d |   .0018313   .0507581     0.04   0.971    -.0977379    .1014005
             td |   .0018436   .0023078     0.80   0.425    -.0026835    .0063707
          _cons |   .4162756   .0759583     5.48   0.000     .2672726    .5652785
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(29)   =      86.36
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .72281

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.8795507   1.681912    -0.52   0.601    -4.176037    2.416935
  secgenhighedu |   1.048442   1.939945     0.54   0.589     -2.75378    4.850665
         tenure |   .0279781   .0237573     1.18   0.239    -.0185853    .0745415
      tenuresqr |  -.0008601   .0012535    -0.69   0.493     -.003317    .0015968
 birthmonthdum2 |  -.0142558   .1094107    -0.13   0.896    -.2286967    .2001852
 birthmonthdum3 |  -.0029852   .0982084    -0.03   0.976    -.1954702    .1894997
 birthmonthdum4 |  -.1109595   .1168797    -0.95   0.342    -.3400396    .1181206
 birthmonthdum5 |  -.0201626   .1379916    -0.15   0.884    -.2906211     .250296
 birthmonthdum6 |   .0300042   .1062188     0.28   0.778    -.1781807    .2381892
 birthmonthdum7 |   .0691142   .0951715     0.73   0.468    -.1174186     .255647
 birthmonthdum8 |  -.0406751   .1261062    -0.32   0.747    -.2878387    .2064885
 birthmonthdum9 |     .09266    .144385     0.64   0.521    -.1903294    .3756493
birthmonthdum10 |   .0177643   .0907706     0.20   0.845    -.1601427    .1956713
birthmonthdum11 |  -.1154552    .118647    -0.97   0.331    -.3479991    .1170887
birthmonthdum12 |   -.037253   .1287485    -0.29   0.772    -.2895956    .2150895
   provincedum2 |  -.3246023   .2311357    -1.40   0.160      -.77762    .1284153
   provincedum3 |  -.1760145   .1552264    -1.13   0.257    -.4802526    .1282236
   provincedum4 |   -.340431   .1657419    -2.05   0.040    -.6652792   -.0155828
   provincedum5 |  -.0165337   .1768817    -0.09   0.926    -.3632155    .3301481
   provincedum6 |   -.101037   .1929914    -0.52   0.601    -.4792931    .2772192
   provincedum7 |  -.2213411   .1623692    -1.36   0.173    -.5395789    .0968966
   provincedum8 |   -.415442   .1566354    -2.65   0.008    -.7224418   -.1084421
   provincedum9 |  -.1184801   .1774328    -0.67   0.504     -.466242    .2292819
  provincedum10 |   -.057654   .1538639    -0.37   0.708    -.3592217    .2439137
  provincedum11 |  -.0547135   .1827185    -0.30   0.765    -.4128351    .3034081
  provincedum12 |  -.1920547   .1457438    -1.32   0.188    -.4777073    .0935979
  provincedum13 |  -.1304561   .1643808    -0.79   0.427    -.4526365    .1917243
  provincedum14 |  -.1728216   .2408251    -0.72   0.473      -.64483    .2991869
  provincedum15 |  -.3293483   .1597231    -2.06   0.039    -.6423998   -.0162968
          _cons |    8.53749   .2665744    32.03   0.000     8.015014    9.059967
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.10975  (p = 0.5741)
  Wu-Hausman F(2,1414)            =  .543014  (p = 0.5811)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .187474  (p = 0.6650)
  Basmann chi2(1)        =  .183479  (p = 0.6684)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  27.056  Chi-sq(30) P-value = 0.6203

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
birthmont~m2 |      1,446    .0829876    .2759588          0          1
birthmonth~3 |      1,446    .0788382    .2695793          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,446    .0608575    .2391515          0          1
birthmonth~5 |      1,446    .0795297    .2706574          0          1
birthmonth~6 |      1,446    .0760719    .2652049          0          1
birthmonth~7 |      1,446    .0850622    .2790708          0          1
birthmonth~8 |      1,446    .0733057    .2607278          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,446    .0947441    .2929625          0          1
birthmont~10 |      1,446    .1224066    .3278683          0          1
birthmont~11 |      1,446     .093361    .2910383          0          1
birthmont~12 |      1,446    .0753804    .2640954          0          1
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 2
> 50, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(16, 1248)   =  10.64
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1200
                                                        Adj R-squared = 0.1087
                                                        Root MSE      = 0.4624

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0240415   .0065333     3.68   0.000      .011224    .0368589
      tenuresqr |  -.0000795   .0003077    -0.26   0.796    -.0006832    .0005242
 birthmonthdum2 |  -.0581537   .0643169    -0.90   0.366    -.1843349    .0680275
 birthmonthdum3 |   .0445276   .0648834     0.69   0.493     -.082765    .1718202
 birthmonthdum4 |  -.0575437   .0711652    -0.81   0.419    -.1971602    .0820729
 birthmonthdum5 |  -.1134488   .0683171    -1.66   0.097    -.2474778    .0205801
 birthmonthdum6 |  -.1523082   .0667134    -2.28   0.023     -.283191   -.0214254
 birthmonthdum7 |  -.1315652   .0671306    -1.96   0.050    -.2632665    .0001361
 birthmonthdum8 |  -.0758693   .0657125    -1.15   0.248    -.2047884    .0530498
 birthmonthdum9 |  -.0374062   .0651569    -0.57   0.566    -.1652354     .090423
birthmonthdum10 |   -.082566   .0632978    -1.30   0.192    -.2067478    .0416158
birthmonthdum11 |  -.0702458   .0657335    -1.07   0.285    -.1992061    .0587145
birthmonthdum12 |   .0214753    .065505     0.33   0.743    -.1070368    .1499874
              t |   .0008446    .001744     0.48   0.628    -.0025769    .0042661
              d |    .057932   .0546034     1.06   0.289    -.0491926    .1650567
             td |   .0012432   .0025046     0.50   0.620    -.0036705    .0061568
          _cons |   .2182097   .0642618     3.40   0.001     .0921366    .3442828
---------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(16, 1248)   =   5.61
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0671
                                                        Adj R-squared = 0.0552
                                                        Root MSE      = 0.4522

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0300801    .006389     4.71   0.000     .0175458    .0426144
      tenuresqr |   -.000736   .0003009    -2.45   0.015    -.0013263   -.0001456
 birthmonthdum2 |  -.0389282   .0628961    -0.62   0.536    -.1623219    .0844656
 birthmonthdum3 |  -.0287013   .0634501    -0.45   0.651    -.1531818    .0957793
 birthmonthdum4 |  -.1064006   .0695931    -1.53   0.127    -.2429329    .0301317
 birthmonthdum5 |  -.0695987   .0668079    -1.04   0.298    -.2006669    .0614694
 birthmonthdum6 |   -.089636   .0652396    -1.37   0.170    -.2176275    .0383555
 birthmonthdum7 |  -.1488186   .0656476    -2.27   0.024    -.2776104   -.0200267
 birthmonthdum8 |   -.042074   .0642608    -0.65   0.513    -.1681451    .0839972
 birthmonthdum9 |  -.0575738   .0637176    -0.90   0.366    -.1825791    .0674316
birthmonthdum10 |  -.0785831   .0618995    -1.27   0.204    -.2000216    .0428554
birthmonthdum11 |  -.0635151   .0642813    -0.99   0.323    -.1896266    .0625963
birthmonthdum12 |  -.0136236   .0640579    -0.21   0.832    -.1392967    .1120496
              t |   .0017942   .0017055     1.05   0.293    -.0015517    .0051401
              d |   .0210337   .0533972     0.39   0.694    -.0837245    .1257919
             td |  -.0006625   .0024492    -0.27   0.787    -.0054675    .0041426
          _cons |   .2010578   .0628422     3.20   0.001     .0777698    .3243459
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(15)   =     105.55
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .75851

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.3085065    1.52221    -0.20   0.839    -3.291982     2.67497
  secgenhighedu |   1.426669   2.243429     0.64   0.525    -2.970371    5.823708
         tenure |   .0218825   .0356282     0.61   0.539    -.0479475    .0917126
      tenuresqr |   -.000343   .0016389    -0.21   0.834    -.0035551    .0028692
 birthmonthdum2 |  -.0119068   .1078512    -0.11   0.912    -.2232913    .1994777
 birthmonthdum3 |  -.0935846   .1656619    -0.56   0.572     -.418276    .2311067
 birthmonthdum4 |   .0779486   .1893397     0.41   0.681    -.2931503    .4490475
 birthmonthdum5 |  -.0504124   .1204149    -0.42   0.675    -.2864212    .1855964
 birthmonthdum6 |  -.0112242   .1296404    -0.09   0.931    -.2653147    .2428664
 birthmonthdum7 |   .0608729   .1767446     0.34   0.731    -.2855402    .4072861
 birthmonthdum8 |   .0316344   .1134144     0.28   0.780    -.1906538    .2539225
 birthmonthdum9 |   .0560323   .1282102     0.44   0.662     -.195255    .3073196
birthmonthdum10 |    .054257   .1235075     0.44   0.660    -.1878132    .2963273
birthmonthdum11 |    .059907   .1198207     0.50   0.617    -.1749373    .2947513
birthmonthdum12 |  -.1082591   .1245048    -0.87   0.385     -.352284    .1357658
          _cons |   7.718651    .154374    50.00   0.000     7.416083    8.021218
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  1.26948  (p = 0.5301)
  Wu-Hausman F(2,1247)            =  .626338  (p = 0.5347)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .253478  (p = 0.6146)
  Basmann chi2(1)        =  .250122  (p = 0.6170)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   7.017  Chi-sq(16) P-value = 0.9729

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
birthmont~m2 |      1,265    .0924901    .2898312          0          1
birthmonth~3 |      1,265    .0893281    .2853295          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,265    .0616601    .2406323          0          1
birthmonth~5 |      1,265    .0727273     .259791          0          1
birthmonth~6 |      1,265    .0822134    .2747983          0          1
birthmonth~7 |      1,265    .0790514    .2699257          0          1
birthmonth~8 |      1,265     .087747    .2830386          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,265    .0901186    .2864648          0          1
birthmont~10 |      1,265    .1011858    .3016938          0          1
birthmont~11 |      1,265     .084585    .2783732          0          1
birthmont~12 |      1,265    .0853755    .2795502          0          1
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) 
> & inrange(monthlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(30, 1234)   =   7.20
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1490
                                                        Adj R-squared = 0.1283
                                                        Root MSE      = 0.4573

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0223143   .0065156     3.42   0.001     .0095314    .0350972
      tenuresqr |  -7.89e-07    .000307    -0.00   0.998     -.000603    .0006014
 birthmonthdum2 |  -.0576029   .0640255    -0.90   0.368    -.1832138     .068008
 birthmonthdum3 |   .0288678   .0645591     0.45   0.655    -.0977899    .1555255
 birthmonthdum4 |   -.058769   .0710126    -0.83   0.408    -.1980877    .0805498
 birthmonthdum5 |  -.1205438   .0681075    -1.77   0.077    -.2541631    .0130756
 birthmonthdum6 |  -.1670358   .0662065    -2.52   0.012    -.2969255   -.0371462
 birthmonthdum7 |  -.1439229    .066775    -2.16   0.031     -.274928   -.0129178
 birthmonthdum8 |  -.0748372   .0650771    -1.15   0.250    -.2025111    .0528368
 birthmonthdum9 |  -.0418192   .0646739    -0.65   0.518     -.168702    .0850637
birthmonthdum10 |  -.0848605   .0631314    -1.34   0.179    -.2087173    .0389964
birthmonthdum11 |  -.0582703    .065293    -0.89   0.372    -.1863679    .0698272
birthmonthdum12 |   .0101475   .0651118     0.16   0.876    -.1175945    .1378895
   provincedum2 |  -.1970264   .0722249    -2.73   0.006    -.3387235   -.0553293
   provincedum3 |  -.0939628   .0791751    -1.19   0.236    -.2492956    .0613699
   provincedum4 |  -.1956266   .0708127    -2.76   0.006    -.3345531   -.0567001
   provincedum5 |  -.2622025   .0659558    -3.98   0.000    -.3916004   -.1328046
   provincedum6 |  -.1937218   .0760273    -2.55   0.011    -.3428788   -.0445647
   provincedum7 |  -.2124667   .0668157    -3.18   0.002    -.3435516   -.0813818
   provincedum8 |  -.2370942   .0679771    -3.49   0.001    -.3704577   -.1037307
   provincedum9 |  -.2548614   .0713984    -3.57   0.000    -.3949371   -.1147856
  provincedum10 |  -.3113526    .067692    -4.60   0.000    -.4441567   -.1785485
  provincedum11 |  -.2984119   .0618479    -4.82   0.000    -.4197507   -.1770732
  provincedum12 |  -.2911813   .0734355    -3.97   0.000    -.4352534   -.1471091
  provincedum13 |  -.3115919   .0708046    -4.40   0.000    -.4505026   -.1726813
  provincedum14 |   -.286672   .0820783    -3.49   0.000    -.4477005   -.1256436
  provincedum15 |  -.3278249   .0811432    -4.04   0.000    -.4870189    -.168631
              t |   .0009183   .0017313     0.53   0.596    -.0024784     .004315
              d |   .0575307   .0543649     1.06   0.290    -.0491272    .1641886
             td |    .001016   .0024887     0.41   0.683    -.0038666    .0058986
          _cons |   .4655385   .0804853     5.78   0.000     .3076353    .6234416
---------------------------------------------------------------------------------

                                                        Number of obs =  1,265
                                                        F(30, 1234)   =   4.25
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0937
                                                        Adj R-squared = 0.0717
                                                        Root MSE      = 0.4482

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0282883   .0063862     4.43   0.000     .0157593    .0408172
      tenuresqr |  -.0006443   .0003009    -2.14   0.032    -.0012345    -.000054
 birthmonthdum2 |  -.0382232   .0627534    -0.61   0.543    -.1613384    .0848919
 birthmonthdum3 |   -.045833   .0632764    -0.72   0.469    -.1699742    .0783082
 birthmonthdum4 |   -.104093   .0696017    -1.50   0.135    -.2406437    .0324577
 birthmonthdum5 |  -.0756873   .0667543    -1.13   0.257    -.2066519    .0552772
 birthmonthdum6 |  -.1016939    .064891    -1.57   0.117    -.2290029     .025615
 birthmonthdum7 |  -.1590563   .0654483    -2.43   0.015    -.2874585   -.0306541
 birthmonthdum8 |  -.0398078   .0637841    -0.62   0.533     -.164945    .0853295
 birthmonthdum9 |  -.0581937   .0633889    -0.92   0.359    -.1825556    .0661682
birthmonthdum10 |  -.0837268   .0618771    -1.35   0.176    -.2051227    .0376692
birthmonthdum11 |  -.0556254   .0639957    -0.87   0.385    -.1811779     .069927
birthmonthdum12 |  -.0275263   .0638181    -0.43   0.666    -.1527303    .0976776
   provincedum2 |    -.20094   .0707899    -2.84   0.005    -.3398218   -.0620582
   provincedum3 |  -.1176826    .077602    -1.52   0.130    -.2699291    .0345638
   provincedum4 |  -.1265384   .0694057    -1.82   0.069    -.2627046    .0096279
   provincedum5 |  -.2224461   .0646453    -3.44   0.001     -.349273   -.0956191
   provincedum6 |  -.1496609   .0745167    -2.01   0.045    -.2958544   -.0034674
   provincedum7 |  -.1618049   .0654881    -2.47   0.014    -.2902853   -.0333245
   provincedum8 |  -.2249365   .0666265    -3.38   0.001    -.3556502   -.0942227
   provincedum9 |  -.1564358   .0699798    -2.24   0.026    -.2937285   -.0191432
  provincedum10 |  -.3000376    .066347    -4.52   0.000     -.430203   -.1698721
  provincedum11 |  -.2420187   .0606191    -3.99   0.000    -.3609466   -.1230908
  provincedum12 |  -.2475573   .0719764    -3.44   0.001    -.3887669   -.1063476
  provincedum13 |  -.2778013   .0693978    -4.00   0.000    -.4139519   -.1416506
  provincedum14 |   -.256436   .0804475    -3.19   0.001    -.4142651    -.098607
  provincedum15 |  -.2901091    .079531    -3.65   0.000    -.4461401   -.1340781
              t |   .0019501   .0016969     1.15   0.251     -.001379    .0052793
              d |   .0191548   .0532848     0.36   0.719     -.085384    .1236936
             td |  -.0010091   .0024393    -0.41   0.679    -.0057946    .0037765
          _cons |   .4136601   .0788861     5.24   0.000     .2588943    .5684259
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(29)   =     213.04
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0695
                                                  Root MSE        =     .66465

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.0411803   1.203728    -0.03   0.973    -2.400444    2.318084
  secgenhighedu |   .8776435   1.787054     0.49   0.623    -2.624918    4.380205
         tenure |   .0268099   .0281371     0.95   0.341    -.0283377    .0819575
      tenuresqr |  -.0004566   .0012521    -0.36   0.715    -.0029107    .0019974
 birthmonthdum2 |  -.0097191   .0950545    -0.10   0.919    -.1960224    .1765842
 birthmonthdum3 |  -.0938354    .146311    -0.64   0.521    -.3805998    .1929289
 birthmonthdum4 |    .091732   .1541145     0.60   0.552    -.2103268    .3937909
 birthmonthdum5 |  -.0728414   .1068574    -0.68   0.495    -.2822781    .1365953
 birthmonthdum6 |   -.002682   .1150255    -0.02   0.981    -.2281279    .2227639
 birthmonthdum7 |   .0315429   .1535194     0.21   0.837    -.2693496    .3324354
 birthmonthdum8 |   .0253987   .0994739     0.26   0.798    -.1695666     .220364
 birthmonthdum9 |   .0266192   .1086023     0.25   0.806    -.1862374    .2394759
birthmonthdum10 |   .0554612   .1109517     0.50   0.617    -.1620002    .2729225
birthmonthdum11 |   .0463522   .1037512     0.45   0.655    -.1569964    .2497009
birthmonthdum12 |  -.1038212    .112814    -0.92   0.357    -.3249325    .1172901
   provincedum2 |  -.4980239   .1836305    -2.71   0.007     -.857933   -.1381148
   provincedum3 |  -.3897936   .1576799    -2.47   0.013    -.6988406   -.0807467
   provincedum4 |  -.2992714   .1247639    -2.40   0.016    -.5438041   -.0547387
   provincedum5 |   .0283299   .1631306     0.17   0.862    -.2914003      .34806
   provincedum6 |  -.1801788   .1385314    -1.30   0.193    -.4516952    .0913377
   provincedum7 |  -.2917193   .1315739    -2.22   0.027    -.5495994   -.0338392
   provincedum8 |  -.3339824   .1852234    -1.80   0.071    -.6970136    .0290489
   provincedum9 |   -.209278   .1365125    -1.53   0.125    -.4768375    .0582815
  provincedum10 |  -.1476919   .2284817    -0.65   0.518    -.5955079    .3001241
  provincedum11 |   .0422825   .1633122     0.26   0.796    -.2778036    .3623686
  provincedum12 |   -.146552   .1797552    -0.82   0.415    -.4988657    .2057618
  provincedum13 |  -.0606832   .2027299    -0.30   0.765    -.4580266    .3366602
  provincedum14 |  -.1534838   .2024963    -0.76   0.448    -.5503694    .2434017
  provincedum15 |   -.237743   .2151014    -1.11   0.269     -.659334    .1838481
          _cons |   7.934735   .2587544    30.67   0.000     7.427586    8.441885
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .542519  (p = 0.7624)
  Wu-Hausman F(2,1233)            =  .264511  (p = 0.7676)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .268106  (p = 0.6046)
  Basmann chi2(1)        =  .261592  (p = 0.6090)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  17.036  Chi-sq(30) P-value = 0.9721

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
birthmont~m2 |      1,265    .0924901    .2898312          0          1
birthmonth~3 |      1,265    .0893281    .2853295          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,265    .0616601    .2406323          0          1
birthmonth~5 |      1,265    .0727273     .259791          0          1
birthmonth~6 |      1,265    .0822134    .2747983          0          1
birthmonth~7 |      1,265    .0790514    .2699257          0          1
birthmonth~8 |      1,265     .087747    .2830386          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,265    .0901186    .2864648          0          1
birthmont~10 |      1,265    .1011858    .3016938          0          1
birthmont~11 |      1,265     .084585    .2783732          0          1
birthmont~12 |      1,265    .0853755    .2795502          0          1
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000
> ) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(17, 2693)   =  13.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0787
                                                        Adj R-squared = 0.0729
                                                        Root MSE      = 0.4740

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0254631   .0046999     5.42   0.000     .0162473    .0346788
      tenuresqr |  -.0003487    .000219    -1.59   0.112    -.0007782    .0000808
 birthmonthdum2 |  -.0606869    .045281    -1.34   0.180    -.1494759    .0281022
 birthmonthdum3 |   .0334053   .0457824     0.73   0.466     -.056367    .1231776
 birthmonthdum4 |    -.09588   .0496329    -1.93   0.053    -.1932023    .0014424
 birthmonthdum5 |  -.1123345   .0468348    -2.40   0.017    -.2041702   -.0204988
 birthmonthdum6 |  -.1078458   .0466855    -2.31   0.021    -.1993888   -.0163028
 birthmonthdum7 |  -.0517959    .046252    -1.12   0.263     -.142489    .0388971
 birthmonthdum8 |  -.0720239   .0467263    -1.54   0.123    -.1636469    .0195991
 birthmonthdum9 |  -.0134891    .045064    -0.30   0.765    -.1018527    .0748744
birthmonthdum10 |    -.05403    .042972    -1.26   0.209    -.1382914    .0302314
birthmonthdum11 |  -.0731019   .0451096    -1.62   0.105    -.1615549    .0153511
birthmonthdum12 |  -.0010485   .0462534    -0.02   0.982    -.0917443    .0896473
           male |   .0091183   .0183483     0.50   0.619    -.0268599    .0450964
              t |   .0003667    .001209     0.30   0.762     -.002004    .0027373
              d |   .0406176   .0377771     1.08   0.282    -.0334574    .1146926
             td |    .002503   .0017244     1.45   0.147    -.0008783    .0058844
          _cons |   .2260436   .0459368     4.92   0.000     .1359685    .3161186
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(15)   =     291.66
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1446
                                                  Root MSE        =     .65902

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |    .346773    .239325     1.45   0.147    -.1222954    .8158414
         tenure |   .0418517   .0094048     4.45   0.000     .0234185    .0602848
      tenuresqr |  -.0014661   .0003266    -4.49   0.000    -.0021062   -.0008261
 birthmonthdum2 |   .0172195   .0648056     0.27   0.790    -.1097971    .1442361
 birthmonthdum3 |  -.0866043   .0639308    -1.35   0.176    -.2119063    .0386978
 birthmonthdum4 |  -.0519017   .0723398    -0.72   0.473    -.1936852    .0898817
 birthmonthdum5 |    -.00334    .070792    -0.05   0.962    -.1420897    .1354098
 birthmonthdum6 |   .0191976   .0702891     0.27   0.785    -.1185665    .1569618
 birthmonthdum7 |   .0072291   .0651816     0.11   0.912    -.1205245    .1349827
 birthmonthdum8 |   .0318568   .0662208     0.48   0.630    -.0979335    .1616472
 birthmonthdum9 |   .0981447   .0627174     1.56   0.118    -.0247792    .2210687
birthmonthdum10 |   .0222096   .0616093     0.36   0.718    -.0985425    .1429616
birthmonthdum11 |  -.0116836   .0660557    -0.18   0.860    -.1411504    .1177831
birthmonthdum12 |  -.0609523   .0642954    -0.95   0.343     -.186969    .0650645
           male |   .2894563   .0255793    11.32   0.000     .2393218    .3395908
          _cons |   7.877713   .0853769    92.27   0.000     7.710377    8.045049
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .000016  (p = 0.9968)
  Wu-Hausman F(1,2694)            =  .000016  (p = 0.9968)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  2.40553  (p = 0.3004)
  Basmann chi2(2)        =  2.39169  (p = 0.3024)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  17.872  Chi-sq(17) P-value = 0.3969

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
birthmont~m2 |      2,711    .0874216     .282504          0          1
birthmonth~3 |      2,711    .0837329     .277038          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,711     .061232    .2397996          0          1
birthmonth~5 |      2,711    .0763556    .2656152          0          1
birthmonth~6 |      2,711    .0789377    .2696912          0          1
birthmonth~7 |      2,711    .0822575    .2748073          0          1
birthmonth~8 |      2,711    .0800443    .2714118          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,711    .0925858    .2899045          0          1
birthmont~10 |      2,711    .1125046    .3160446          0          1
birthmont~11 |      2,711     .089266    .2851798          0          1
birthmont~12 |      2,711    .0800443    .2714118          0          1
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu  = t d td ) if inrange(t, -`months', `months'-1) & inrang
> e(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,711
                                                        F(31, 2679)   =  10.10
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1047
                                                        Adj R-squared = 0.0943
                                                        Root MSE      = 0.4685

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0244069   .0046679     5.23   0.000     .0152539      .03356
      tenuresqr |  -.0003218   .0002173    -1.48   0.139    -.0007479    .0001043
 birthmonthdum2 |  -.0583975   .0448145    -1.30   0.193    -.1462721     .029477
 birthmonthdum3 |   .0315409   .0454064     0.69   0.487    -.0574941     .120576
 birthmonthdum4 |   -.103654   .0491339    -2.11   0.035    -.1999981   -.0073098
 birthmonthdum5 |  -.1110299   .0463526    -2.40   0.017    -.2019204   -.0201393
 birthmonthdum6 |  -.1132066   .0462351    -2.45   0.014    -.2038667   -.0225465
 birthmonthdum7 |  -.0573851   .0458655    -1.25   0.211    -.1473205    .0325502
 birthmonthdum8 |  -.0696769   .0462838    -1.51   0.132    -.1604325    .0210787
 birthmonthdum9 |  -.0084348   .0446369    -0.19   0.850    -.0959612    .0790915
birthmonthdum10 |  -.0459635   .0425903    -1.08   0.281    -.1294767    .0375497
birthmonthdum11 |  -.0688202   .0446494    -1.54   0.123     -.156371    .0187307
birthmonthdum12 |    -.00392   .0458268    -0.09   0.932    -.0937794    .0859394
           male |   .0094607   .0181779     0.52   0.603    -.0261834    .0451049
   provincedum2 |   -.257807    .049097    -5.25   0.000    -.3540789   -.1615351
   provincedum3 |  -.1852794   .0537987    -3.44   0.001    -.2907706   -.0797883
   provincedum4 |  -.2545595   .0482882    -5.27   0.000    -.3492455   -.1598735
   provincedum5 |  -.2792986    .045078    -6.20   0.000    -.3676897   -.1909074
   provincedum6 |  -.2914675   .0519861    -5.61   0.000    -.3934044   -.1895306
   provincedum7 |  -.2363941   .0467451    -5.06   0.000    -.3280543   -.1447339
   provincedum8 |   -.231637   .0472754    -4.90   0.000     -.324337   -.1389369
   provincedum9 |  -.2858431   .0479509    -5.96   0.000    -.3798676   -.1918186
  provincedum10 |  -.2745881   .0474035    -5.79   0.000    -.3675392    -.181637
  provincedum11 |  -.3431736   .0421039    -8.15   0.000    -.4257331   -.2606142
  provincedum12 |  -.2521577   .0534511    -4.72   0.000    -.3569672   -.1473482
  provincedum13 |  -.3056481   .0491294    -6.22   0.000    -.4019834   -.2093128
  provincedum14 |  -.2619057   .0583645    -4.49   0.000    -.3763498   -.1474617
  provincedum15 |  -.2601421   .0584663    -4.45   0.000    -.3747857   -.1454984
              t |   .0004298   .0011978     0.36   0.720    -.0019189    .0027784
              d |    .033242   .0374805     0.89   0.375    -.0402517    .1067356
             td |   .0023859   .0017076     1.40   0.162    -.0009625    .0057342
          _cons |   .4890465   .0565808     8.64   0.000        .3781    .5999931
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,711
                                                  Wald chi2(29)   =     439.47
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1824
                                                  Root MSE        =     .64431

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .2725623   .2512438     1.08   0.278    -.2198665    .7649911
         tenure |   .0393836   .0093175     4.23   0.000     .0211217    .0576456
      tenuresqr |  -.0012726   .0003196    -3.98   0.000    -.0018991   -.0006462
 birthmonthdum2 |   .0105897   .0635212     0.17   0.868    -.1139096     .135089
 birthmonthdum3 |  -.0689987   .0627485    -1.10   0.272    -.1919834    .0539861
 birthmonthdum4 |  -.0364865   .0719957    -0.51   0.612    -.1775954    .1046224
 birthmonthdum5 |  -.0183598   .0698728    -0.26   0.793    -.1553079    .1185882
 birthmonthdum6 |   .0098549   .0701026     0.14   0.888    -.1275437    .1472535
 birthmonthdum7 |   .0017988   .0643734     0.03   0.978    -.1243709    .1279684
 birthmonthdum8 |   .0254101   .0649638     0.39   0.696    -.1019167    .1527368
 birthmonthdum9 |    .079833   .0612949     1.30   0.193    -.0403028    .1999687
birthmonthdum10 |   .0248019   .0600895     0.41   0.680    -.0929713    .1425751
birthmonthdum11 |  -.0292111    .064726    -0.45   0.652    -.1560716    .0976495
birthmonthdum12 |  -.0536211   .0630558    -0.85   0.395    -.1772082    .0699661
           male |   .2848238   .0250839    11.35   0.000     .2356602    .3339875
   provincedum2 |  -.4477215   .0946898    -4.73   0.000    -.6333101   -.2621329
   provincedum3 |  -.2763499   .0885928    -3.12   0.002    -.4499886   -.1027111
   provincedum4 |  -.2814776   .0943408    -2.98   0.003    -.4663822    -.096573
   provincedum5 |   .0257576   .0956666     0.27   0.788    -.1617454    .2132607
   provincedum6 |  -.1231543   .1055558    -1.17   0.243    -.3300398    .0837312
   provincedum7 |  -.2243573   .0894475    -2.51   0.012    -.3996713   -.0490434
   provincedum8 |  -.3691744   .0898331    -4.11   0.000     -.545244   -.1931048
   provincedum9 |  -.0986645   .0987755    -1.00   0.318    -.2922609    .0949318
  provincedum10 |  -.1390715   .0973212    -1.43   0.153    -.3298176    .0516746
  provincedum11 |    .006751   .1053546     0.06   0.949    -.1997401    .2132422
  provincedum12 |  -.1787923   .0977443    -1.83   0.067    -.3703676     .012783
  provincedum13 |  -.1141796   .1045948    -1.09   0.275    -.3191817    .0908226
  provincedum14 |  -.2136271   .1068528    -2.00   0.046    -.4230548   -.0041995
  provincedum15 |  -.3240984   .1047017    -3.10   0.002    -.5293099   -.1188869
          _cons |   8.072696   .1535143    52.59   0.000     7.771813    8.373578
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .094612  (p = 0.7584)
  Wu-Hausman F(1,2680)            =  .093533  (p = 0.7598)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  1.55896  (p = 0.4586)
  Basmann chi2(2)        =  1.54144  (p = 0.4627)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  38.807  Chi-sq(31) P-value = 0.1582

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,711    8.366253    .7126735   5.521461   10.12663
      tenure |      2,711    9.048322    6.837833         -1         30
   tenuresqr |      2,711    128.6108    147.7194          0        900
birthmont~m2 |      2,711    .0874216     .282504          0          1
birthmonth~3 |      2,711    .0837329     .277038          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,711     .061232    .2397996          0          1
birthmonth~5 |      2,711    .0763556    .2656152          0          1
birthmonth~6 |      2,711    .0789377    .2696912          0          1
birthmonth~7 |      2,711    .0822575    .2748073          0          1
birthmonth~8 |      2,711    .0800443    .2714118          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,711    .0925858    .2899045          0          1
birthmont~10 |      2,711    .1125046    .3160446          0          1
birthmont~11 |      2,711     .089266    .2851798          0          1
birthmont~12 |      2,711    .0800443    .2714118          0          1
        male |      2,711    .5333825    .4989764          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u  = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & 
> male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(16, 1429)   =   5.15
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0546
                                                        Adj R-squared = 0.0440
                                                        Root MSE      = 0.4834

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .026317   .0067649     3.89   0.000     .0130468    .0395871
      tenuresqr |  -.0005715   .0003123    -1.83   0.068    -.0011842    .0000412
 birthmonthdum2 |  -.0710658   .0636836    -1.12   0.265    -.1959892    .0538577
 birthmonthdum3 |     .02028   .0645054     0.31   0.753    -.1062555    .1468154
 birthmonthdum4 |  -.1312034   .0691698    -1.90   0.058    -.2668887    .0044818
 birthmonthdum5 |  -.1106848   .0643275    -1.72   0.086    -.2368712    .0155017
 birthmonthdum6 |  -.0732296   .0652757    -1.12   0.262    -.2012761    .0548169
 birthmonthdum7 |   .0157511   .0637975     0.25   0.805    -.1093958     .140898
 birthmonthdum8 |  -.0712892   .0663516    -1.07   0.283    -.2014462    .0588678
 birthmonthdum9 |   .0060355   .0622725     0.10   0.923    -.1161199    .1281909
birthmonthdum10 |  -.0342882   .0585461    -0.59   0.558    -.1491337    .0805573
birthmonthdum11 |  -.0742862   .0619648    -1.20   0.231    -.1958379    .0472655
birthmonthdum12 |  -.0296086   .0651906    -0.45   0.650    -.1574882    .0982709
              t |  -.0002873   .0016799    -0.17   0.864    -.0035826     .003008
              d |   .0289112   .0524532     0.55   0.582    -.0739824    .1318049
             td |   .0038559   .0023894     1.61   0.107    -.0008311     .008543
          _cons |   .2444901   .0636605     3.84   0.000      .119612    .3693683
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(14)   =      35.64
                                                  Prob > chi2     =     0.0012
                                                  R-squared       =     0.0417
                                                  Root MSE        =     .68499

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |    .068831   .3563505     0.19   0.847    -.6296031    .7672651
         tenure |   .0398775   .0139374     2.86   0.004     .0125607    .0671943
      tenuresqr |  -.0016025   .0005063    -3.17   0.002    -.0025948   -.0006102
 birthmonthdum2 |   .0256137    .094104     0.27   0.785    -.1588268    .2100541
 birthmonthdum3 |  -.0198599   .0912798    -0.22   0.828     -.198765    .1590451
 birthmonthdum4 |  -.0993813   .1069596    -0.93   0.353    -.3090182    .1102556
 birthmonthdum5 |   .0256923    .100565     0.26   0.798    -.1714116    .2227961
 birthmonthdum6 |   .0305783   .0962743     0.32   0.751    -.1581158    .2192724
 birthmonthdum7 |   .0734801   .0895032     0.82   0.412     -.101943    .2489033
 birthmonthdum8 |   .0060795    .095735     0.06   0.949    -.1815578    .1937167
 birthmonthdum9 |   .1769841   .0874864     2.02   0.043     .0055139    .3484543
birthmonthdum10 |   .0327859   .0842671     0.39   0.697    -.1323747    .1979465
birthmonthdum11 |   -.051482   .0930237    -0.55   0.580    -.2338052    .1308411
birthmonthdum12 |  -.0006033   .0933574    -0.01   0.995    -.1835804    .1823738
          _cons |   8.302686   .1315602    63.11   0.000     8.044833    8.560539
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .480292  (p = 0.4883)
  Wu-Hausman F(1,1430)            =  .475136  (p = 0.4907)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =   .97791  (p = 0.6133)
  Basmann chi2(2)        =  .967067  (p = 0.6166)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  14.104  Chi-sq(16) P-value = 0.5910

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
birthmont~m2 |      1,446    .0829876    .2759588          0          1
birthmonth~3 |      1,446    .0788382    .2695793          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,446    .0608575    .2391515          0          1
birthmonth~5 |      1,446    .0795297    .2706574          0          1
birthmonth~6 |      1,446    .0760719    .2652049          0          1
birthmonth~7 |      1,446    .0850622    .2790708          0          1
birthmonth~8 |      1,446    .0733057    .2607278          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,446    .0947441    .2929625          0          1
birthmont~10 |      1,446    .1224066    .3278683          0          1
birthmont~11 |      1,446     .093361    .2910383          0          1
birthmont~12 |      1,446    .0753804    .2640954          0          1
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu  = t d td ) if inrange(t, -`months', `months'-1) & inrange(mon
> thlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,446
                                                        F(30, 1415)   =   4.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0901
                                                        Adj R-squared = 0.0708
                                                        Root MSE      = 0.4765

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0257801   .0067032     3.85   0.000     .0126308    .0389294
      tenuresqr |  -.0005671   .0003088    -1.84   0.066    -.0011729    .0000386
 birthmonthdum2 |  -.0601084   .0630701    -0.95   0.341    -.1838293    .0636126
 birthmonthdum3 |   .0336733   .0639728     0.53   0.599    -.0918184    .1591651
 birthmonthdum4 |  -.1386915   .0685311    -2.02   0.043    -.2731251    -.004258
 birthmonthdum5 |    -.09914   .0636861    -1.56   0.120    -.2240693    .0257893
 birthmonthdum6 |  -.0650607   .0645993    -1.01   0.314    -.1917814      .06166
 birthmonthdum7 |   .0149482   .0632619     0.24   0.813     -.109149    .1390455
 birthmonthdum8 |  -.0607551   .0657721    -0.92   0.356    -.1897765    .0682662
 birthmonthdum9 |   .0177724   .0617253     0.29   0.773    -.1033106    .1388554
birthmonthdum10 |  -.0123792   .0580061    -0.21   0.831    -.1261664    .1014081
birthmonthdum11 |   -.072208   .0615175    -1.17   0.241    -.1928833    .0484673
birthmonthdum12 |  -.0204969   .0645692    -0.32   0.751    -.1471585    .1061647
   provincedum2 |  -.3153364   .0670917    -4.70   0.000    -.4469464   -.1837265
   provincedum3 |  -.2506163   .0734282    -3.41   0.001    -.3946562   -.1065765
   provincedum4 |   -.305607   .0661955    -4.62   0.000    -.4354589   -.1757551
   provincedum5 |  -.2967071   .0617862    -4.80   0.000    -.4179095   -.1755047
   provincedum6 |  -.3720288   .0713634    -5.21   0.000    -.5120183   -.2320393
   provincedum7 |  -.2692213   .0660777    -4.07   0.000    -.3988421   -.1396004
   provincedum8 |  -.2282949   .0659087    -3.46   0.001    -.3575843   -.0990056
   provincedum9 |  -.3180519   .0651108    -4.88   0.000    -.4457759    -.190328
  provincedum10 |  -.2508223   .0666763    -3.76   0.000    -.3816172   -.1200273
  provincedum11 |  -.3807392   .0575227    -6.62   0.000    -.4935781   -.2679003
  provincedum12 |  -.1989739    .078292    -2.54   0.011    -.3525548    -.045393
  provincedum13 |  -.3052823   .0682683    -4.47   0.000    -.4392003   -.1713644
  provincedum14 |  -.2484807   .0834957    -2.98   0.003    -.4122693   -.0846921
  provincedum15 |    -.19001   .0844811    -2.25   0.025    -.3557317   -.0242882
              t |  -.0001696   .0016657    -0.10   0.919    -.0034371    .0030978
              d |   .0108542   .0520494     0.21   0.835     -.091248    .1129564
             td |   .0040551   .0023665     1.71   0.087    -.0005871    .0086974
          _cons |   .5202839   .0778906     6.68   0.000     .3674904    .6730774
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,446
                                                  Wald chi2(28)   =      98.15
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0644
                                                  Root MSE        =     .67682

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |    .003174   .3758454     0.01   0.993    -.7334694    .7398174
         tenure |   .0379278   .0140607     2.70   0.007     .0103694    .0654862
      tenuresqr |  -.0014714    .000506    -2.91   0.004    -.0024631   -.0004797
 birthmonthdum2 |   .0110426   .0926006     0.12   0.905    -.1704513    .1925364
 birthmonthdum3 |  -.0100915    .091133    -0.11   0.912    -.1887088    .1685258
 birthmonthdum4 |  -.1027722   .1085213    -0.95   0.344      -.31547    .1099256
 birthmonthdum5 |   .0279304   .0987564     0.28   0.777    -.1656286    .2214895
 birthmonthdum6 |   .0128937   .0949408     0.14   0.892    -.1731869    .1989743
 birthmonthdum7 |   .0718669   .0889895     0.81   0.419    -.1025493    .2462831
 birthmonthdum8 |   .0003579    .094284     0.00   0.997    -.1844352    .1851511
 birthmonthdum9 |   .1525166   .0867393     1.76   0.079    -.0174893    .3225225
birthmonthdum10 |   .0293673   .0825846     0.36   0.722    -.1324955    .1912301
birthmonthdum11 |  -.0803263    .092944    -0.86   0.387    -.2624931    .1018405
birthmonthdum12 |   .0075574   .0922307     0.08   0.935    -.1732116    .1883263
   provincedum2 |  -.4133127   .1523782    -2.71   0.007    -.7119686   -.1146569
   provincedum3 |  -.1947108   .1416961    -1.37   0.169    -.4724301    .0830084
   provincedum4 |  -.3227191   .1521341    -2.12   0.034    -.6208965   -.0245418
   provincedum5 |   .0298185   .1448565     0.21   0.837    -.2540952    .3137321
   provincedum6 |  -.1203738   .1775816    -0.68   0.498    -.4684272    .2276797
   provincedum7 |  -.1867666   .1397415    -1.34   0.181    -.4606549    .0871218
   provincedum8 |  -.3757673   .1295652    -2.90   0.004    -.6297105    -.121824
   provincedum9 |  -.0820396   .1536817    -0.53   0.593    -.3832501    .2191709
  provincedum10 |   -.082665   .1374046    -0.60   0.547     -.351973     .186643
  provincedum11 |  -.0318056   .1664276    -0.19   0.848    -.3579976    .2943865
  provincedum12 |  -.1845633   .1358537    -1.36   0.174    -.4508317    .0817051
  provincedum13 |  -.1419334   .1526338    -0.93   0.352    -.4410902    .1572234
  provincedum14 |  -.2673359   .1550372    -1.72   0.085    -.5712032    .0365315
  provincedum15 |  -.3565313   .1419533    -2.51   0.012    -.6347546   -.0783079
          _cons |   8.495174   .2386062    35.60   0.000     8.027515    8.962834
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .762777  (p = 0.3825)
  Wu-Hausman F(1,1416)            =  .747346  (p = 0.3875)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .546932  (p = 0.7607)
  Basmann chi2(2)        =  .535409  (p = 0.7651)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  36.222  Chi-sq(30) P-value = 0.2009

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,446    8.514166    .6999866   5.521461   10.12663
      tenure |      1,446    9.493776    6.768104         -1         30
   tenuresqr |      1,446    135.9073    148.0074          0        900
birthmont~m2 |      1,446    .0829876    .2759588          0          1
birthmonth~3 |      1,446    .0788382    .2695793          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,446    .0608575    .2391515          0          1
birthmonth~5 |      1,446    .0795297    .2706574          0          1
birthmonth~6 |      1,446    .0760719    .2652049          0          1
birthmonth~7 |      1,446    .0850622    .2790708          0          1
birthmonth~8 |      1,446    .0733057    .2607278          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,446    .0947441    .2929625          0          1
birthmont~10 |      1,446    .1224066    .3278683          0          1
birthmont~11 |      1,446     .093361    .2910383          0          1
birthmont~12 |      1,446    .0753804    .2640954          0          1
        male |      1,446           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u  = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & 
> male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(16, 1248)   =  10.64
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1200
                                                        Adj R-squared = 0.1087
                                                        Root MSE      = 0.4624

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0240415   .0065333     3.68   0.000      .011224    .0368589
      tenuresqr |  -.0000795   .0003077    -0.26   0.796    -.0006832    .0005242
 birthmonthdum2 |  -.0581537   .0643169    -0.90   0.366    -.1843349    .0680275
 birthmonthdum3 |   .0445276   .0648834     0.69   0.493     -.082765    .1718202
 birthmonthdum4 |  -.0575437   .0711652    -0.81   0.419    -.1971602    .0820729
 birthmonthdum5 |  -.1134488   .0683171    -1.66   0.097    -.2474778    .0205801
 birthmonthdum6 |  -.1523082   .0667134    -2.28   0.023     -.283191   -.0214254
 birthmonthdum7 |  -.1315652   .0671306    -1.96   0.050    -.2632665    .0001361
 birthmonthdum8 |  -.0758693   .0657125    -1.15   0.248    -.2047884    .0530498
 birthmonthdum9 |  -.0374062   .0651569    -0.57   0.566    -.1652354     .090423
birthmonthdum10 |   -.082566   .0632978    -1.30   0.192    -.2067478    .0416158
birthmonthdum11 |  -.0702458   .0657335    -1.07   0.285    -.1992061    .0587145
birthmonthdum12 |   .0214753    .065505     0.33   0.743    -.1070368    .1499874
              t |   .0008446    .001744     0.48   0.628    -.0025769    .0042661
              d |    .057932   .0546034     1.06   0.289    -.0491926    .1650567
             td |   .0012432   .0025046     0.50   0.620    -.0036705    .0061568
          _cons |   .2182097   .0642618     3.40   0.001     .0921366    .3442828
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(14)   =     146.43
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1298
                                                  Root MSE        =     .64276

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |    .629216   .3202047     1.97   0.049     .0016262    1.256806
         tenure |   .0424883   .0125533     3.38   0.001     .0178843    .0670923
      tenuresqr |  -.0013336   .0004315    -3.09   0.002    -.0021793   -.0004879
 birthmonthdum2 |  -.0111063   .0913868    -0.12   0.903     -.190221    .1680085
 birthmonthdum3 |  -.1736635   .0912169    -1.90   0.057    -.3524453    .0051183
 birthmonthdum4 |  -.0158884   .1005376    -0.16   0.874    -.2129385    .1811616
 birthmonthdum5 |   -.041304    .101315    -0.41   0.684    -.2398778    .1572697
 birthmonthdum6 |   .0095885   .1062988     0.09   0.928    -.1987533    .2179304
 birthmonthdum7 |   -.021898   .1013265    -0.22   0.829    -.2204944    .1766983
 birthmonthdum8 |   .0488739   .0933213     0.52   0.600    -.1340325    .2317804
 birthmonthdum9 |   .0128058   .0921191     0.14   0.889    -.1677443    .1933559
birthmonthdum10 |    .018098   .0929093     0.19   0.846    -.1640009     .200197
birthmonthdum11 |   .0340007   .0954874     0.36   0.722    -.1531512    .2211527
birthmonthdum12 |  -.1483622   .0909707    -1.63   0.103    -.3266615    .0299372
          _cons |   7.768046    .113051    68.71   0.000      7.54647    7.989622
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .686108  (p = 0.4075)
  Wu-Hausman F(1,1249)            =  .677798  (p = 0.4105)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .916171  (p = 0.6325)
  Basmann chi2(2)        =  .904514  (p = 0.6362)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   8.453  Chi-sq(16) P-value = 0.9342

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
birthmont~m2 |      1,265    .0924901    .2898312          0          1
birthmonth~3 |      1,265    .0893281    .2853295          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,265    .0616601    .2406323          0          1
birthmonth~5 |      1,265    .0727273     .259791          0          1
birthmonth~6 |      1,265    .0822134    .2747983          0          1
birthmonth~7 |      1,265    .0790514    .2699257          0          1
birthmonth~8 |      1,265     .087747    .2830386          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,265    .0901186    .2864648          0          1
birthmont~10 |      1,265    .1011858    .3016938          0          1
birthmont~11 |      1,265     .084585    .2783732          0          1
birthmont~12 |      1,265    .0853755    .2795502          0          1
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu = t d td ) if inrange(t, -`months', `months'-1) & inrange(mont
> hlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,265
                                                        F(30, 1234)   =   7.20
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1490
                                                        Adj R-squared = 0.1283
                                                        Root MSE      = 0.4573

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0223143   .0065156     3.42   0.001     .0095314    .0350972
      tenuresqr |  -7.89e-07    .000307    -0.00   0.998     -.000603    .0006014
 birthmonthdum2 |  -.0576029   .0640255    -0.90   0.368    -.1832138     .068008
 birthmonthdum3 |   .0288678   .0645591     0.45   0.655    -.0977899    .1555255
 birthmonthdum4 |   -.058769   .0710126    -0.83   0.408    -.1980877    .0805498
 birthmonthdum5 |  -.1205438   .0681075    -1.77   0.077    -.2541631    .0130756
 birthmonthdum6 |  -.1670358   .0662065    -2.52   0.012    -.2969255   -.0371462
 birthmonthdum7 |  -.1439229    .066775    -2.16   0.031     -.274928   -.0129178
 birthmonthdum8 |  -.0748372   .0650771    -1.15   0.250    -.2025111    .0528368
 birthmonthdum9 |  -.0418192   .0646739    -0.65   0.518     -.168702    .0850637
birthmonthdum10 |  -.0848605   .0631314    -1.34   0.179    -.2087173    .0389964
birthmonthdum11 |  -.0582703    .065293    -0.89   0.372    -.1863679    .0698272
birthmonthdum12 |   .0101475   .0651118     0.16   0.876    -.1175945    .1378895
   provincedum2 |  -.1970264   .0722249    -2.73   0.006    -.3387235   -.0553293
   provincedum3 |  -.0939628   .0791751    -1.19   0.236    -.2492956    .0613699
   provincedum4 |  -.1956266   .0708127    -2.76   0.006    -.3345531   -.0567001
   provincedum5 |  -.2622025   .0659558    -3.98   0.000    -.3916004   -.1328046
   provincedum6 |  -.1937218   .0760273    -2.55   0.011    -.3428788   -.0445647
   provincedum7 |  -.2124667   .0668157    -3.18   0.002    -.3435516   -.0813818
   provincedum8 |  -.2370942   .0679771    -3.49   0.001    -.3704577   -.1037307
   provincedum9 |  -.2548614   .0713984    -3.57   0.000    -.3949371   -.1147856
  provincedum10 |  -.3113526    .067692    -4.60   0.000    -.4441567   -.1785485
  provincedum11 |  -.2984119   .0618479    -4.82   0.000    -.4197507   -.1770732
  provincedum12 |  -.2911813   .0734355    -3.97   0.000    -.4352534   -.1471091
  provincedum13 |  -.3115919   .0708046    -4.40   0.000    -.4505026   -.1726813
  provincedum14 |   -.286672   .0820783    -3.49   0.000    -.4477005   -.1256436
  provincedum15 |  -.3278249   .0811432    -4.04   0.000    -.4870189    -.168631
              t |   .0009183   .0017313     0.53   0.596    -.0024784     .004315
              d |   .0575307   .0543649     1.06   0.290    -.0491272    .1641886
             td |    .001016   .0024887     0.41   0.683    -.0038666    .0058986
          _cons |   .4655385   .0804853     5.78   0.000     .3076353    .6234416
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,265
                                                  Wald chi2(28)   =     248.62
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2036
                                                  Root MSE        =      .6149

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |    .525884   .3147371     1.67   0.095    -.0909894    1.142757
         tenure |   .0391345   .0117723     3.32   0.001     .0160613    .0622078
      tenuresqr |  -.0010314    .000412    -2.50   0.012    -.0018389   -.0002238
 birthmonthdum2 |  -.0094338   .0879383    -0.11   0.915    -.1817897    .1629222
 birthmonthdum3 |  -.1487812   .0872283    -1.71   0.088    -.3197456    .0221832
 birthmonthdum4 |   .0363009   .0970836     0.37   0.708    -.1539795    .2265812
 birthmonthdum5 |  -.0698819   .0987022    -0.71   0.479    -.2633346    .1235709
 birthmonthdum6 |   .0065968   .1049709     0.06   0.950    -.1991425     .212336
 birthmonthdum7 |    -.02238   .0992664    -0.23   0.822    -.2169385    .1721785
 birthmonthdum8 |   .0368448    .089467     0.41   0.680    -.1385073    .2121969
 birthmonthdum9 |   .0016967   .0888301     0.02   0.985    -.1724071    .1758005
birthmonthdum10 |   .0291137     .08985     0.32   0.746     -.146989    .2052163
birthmonthdum11 |   .0297219   .0907294     0.33   0.743    -.1481044    .2075483
birthmonthdum12 |  -.1340662   .0874469    -1.53   0.125    -.3054589    .0373265
   provincedum2 |  -.5636601   .1165043    -4.84   0.000    -.7920044   -.3353158
   provincedum3 |  -.4396982   .1115462    -3.94   0.000    -.6583248   -.2210716
   provincedum4 |  -.2994972    .115425    -2.59   0.009     -.525726   -.0732685
   provincedum5 |  -.0178246   .1233596    -0.14   0.885     -.259605    .2239558
   provincedum6 |  -.2012658   .1218512    -1.65   0.099    -.4400898    .0375582
   provincedum7 |  -.3131346   .1148466    -2.73   0.006    -.5382299   -.0880394
   provincedum8 |  -.3978971   .1219327    -3.26   0.001    -.6368809   -.1589134
   provincedum9 |  -.2042314   .1259367    -1.62   0.105    -.4510628    .0425999
  provincedum10 |  -.2334513   .1363174    -1.71   0.087    -.5006285    .0337259
  provincedum11 |  -.0008857   .1273377    -0.01   0.994    -.2504631    .2486916
  provincedum12 |   -.198419   .1345714    -1.47   0.140     -.462174     .065336
  provincedum13 |  -.1273237   .1393479    -0.91   0.361    -.4004406    .1457932
  provincedum14 |  -.2154847   .1464746    -1.47   0.141    -.5025698    .0716003
  provincedum15 |  -.3068188   .1505633    -2.04   0.042    -.6019175   -.0117201
          _cons |   8.011752   .1904129    42.08   0.000      7.63855    8.384955
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .253998  (p = 0.6143)
  Wu-Hausman F(1,1235)            =  .248024  (p = 0.6186)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .595037  (p = 0.7427)
  Basmann chi2(2)        =  .580728  (p = 0.7480)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  20.513  Chi-sq(30) P-value = 0.9025

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,265    8.197175    .6893154   5.521461   10.12663
      tenure |      1,265     8.53913    6.884117         -1         29
   tenuresqr |      1,265    120.2704    147.0048          0        841
birthmont~m2 |      1,265    .0924901    .2898312          0          1
birthmonth~3 |      1,265    .0893281    .2853295          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,265    .0616601    .2406323          0          1
birthmonth~5 |      1,265    .0727273     .259791          0          1
birthmonth~6 |      1,265    .0822134    .2747983          0          1
birthmonth~7 |      1,265    .0790514    .2699257          0          1
birthmonth~8 |      1,265     .087747    .2830386          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,265    .0901186    .2864648          0          1
birthmont~10 |      1,265    .1011858    .3016938          0          1
birthmont~11 |      1,265     .084585    .2783732          0          1
birthmont~12 |      1,265    .0853755    .2795502          0          1
        male |      1,265           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 3years.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Tenure/IV Urban ATF&Birth Tenure 1979 3years.log
  log type:  text
 closed on:   6 Aug 2024, 17:35:02
---------------------------------------------------------------------------------------------
