---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Tenure/IV Urban ATF&Birth Tenure 1979 1971-1992.log
  log type:  text
 opened on:   6 Aug 2024, 17:35:07

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,362 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. **
. tab birthmonth, gen(birthmonthdum)

 birthmonth |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,940        8.11        8.11
          2 |      2,993        8.26       16.37
          3 |      2,883        7.95       24.32
          4 |      2,595        7.16       31.48
          5 |      2,755        7.60       39.08
          6 |      2,889        7.97       47.05
          7 |      2,830        7.81       54.86
          8 |      3,239        8.94       63.80
          9 |      3,187        8.79       72.59
         10 |      3,723       10.27       82.86
         11 |      3,121        8.61       91.47
         12 |      3,091        8.53      100.00
------------+-----------------------------------
      Total |     36,246      100.00

. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. *1)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu secgenhighedu secgenedu = t d td) if inrange(birthyear, 1971, 1992) & inrange(monthl
> yearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(17, 10596)  =  68.32
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0988
                                                        Adj R-squared = 0.0973
                                                        Root MSE      = 0.4723

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0216093   .0020323    10.63   0.000     .0176256     .025593
      tenuresqr |  -.0001721   .0000839    -2.05   0.040    -.0003366   -7.55e-06
 birthmonthdum2 |  -.0302216   .0229253    -1.32   0.187    -.0751596    .0147163
 birthmonthdum3 |  -.0339188   .0228021    -1.49   0.137    -.0786152    .0107776
 birthmonthdum4 |  -.0666227   .0237356    -2.81   0.005     -.113149   -.0200964
 birthmonthdum5 |   -.031314   .0232981    -1.34   0.179    -.0769826    .0143546
 birthmonthdum6 |  -.0468303   .0226813    -2.06   0.039      -.09129   -.0023706
 birthmonthdum7 |  -.0495222   .0229814    -2.15   0.031    -.0945701   -.0044744
 birthmonthdum8 |  -.0515034   .0225049    -2.29   0.022    -.0956172   -.0073895
 birthmonthdum9 |  -.0114459   .0222451    -0.51   0.607    -.0550504    .0321586
birthmonthdum10 |  -.0272027    .021162    -1.29   0.199    -.0686842    .0142788
birthmonthdum11 |  -.0297289   .0223059    -1.33   0.183    -.0734527    .0139949
birthmonthdum12 |  -.0274784   .0224599    -1.22   0.221    -.0715041    .0165474
           male |  -.0347854   .0092228    -3.77   0.000    -.0528637    -.016707
              t |   .0018783   .0002506     7.50   0.000     .0013871    .0023696
              d |   .0619987   .0192648     3.22   0.001     .0242361    .0997613
             td |  -.0001695   .0002865    -0.59   0.554    -.0007311    .0003922
          _cons |   .2654303   .0241213    11.00   0.000      .218148    .3127126
---------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(17, 10596)  =  55.60
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0819
                                                        Adj R-squared = 0.0804
                                                        Root MSE      = 0.4668

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0217704   .0020086    10.84   0.000     .0178333    .0257076
      tenuresqr |  -.0003714    .000083    -4.48   0.000    -.0005341   -.0002088
 birthmonthdum2 |  -.0093179   .0226575    -0.41   0.681    -.0537309    .0350951
 birthmonthdum3 |  -.0327935   .0225357    -1.46   0.146    -.0769678    .0113808
 birthmonthdum4 |  -.0592076   .0234584    -2.52   0.012    -.1051904   -.0132248
 birthmonthdum5 |  -.0176861   .0230259    -0.77   0.442    -.0628212     .027449
 birthmonthdum6 |  -.0311989   .0224164    -1.39   0.164    -.0751393    .0127414
 birthmonthdum7 |  -.0407467   .0227129    -1.79   0.073    -.0852683    .0037749
 birthmonthdum8 |  -.0249824    .022242    -1.12   0.261    -.0685809    .0186161
 birthmonthdum9 |  -.0072628   .0219852    -0.33   0.741     -.050358    .0358323
birthmonthdum10 |  -.0147037   .0209148    -0.70   0.482    -.0557007    .0262932
birthmonthdum11 |  -.0137495   .0220454    -0.62   0.533    -.0569625    .0294635
birthmonthdum12 |  -.0158936   .0221976    -0.72   0.474     -.059405    .0276178
           male |  -.0179563    .009115    -1.97   0.049    -.0358234   -.0000891
              t |   .0013349   .0002477     5.39   0.000     .0008494    .0018204
              d |   .0570785   .0190397     3.00   0.003      .019757       .0944
             td |   .0004483   .0002832     1.58   0.113    -.0001068    .0010034
          _cons |   .1942804   .0238395     8.15   0.000     .1475504    .2410103
---------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(17, 10596)  =  33.88
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0516
                                                        Adj R-squared = 0.0500
                                                        Root MSE      = 0.4873

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0212849    .002097    10.15   0.000     .0171744    .0253955
      tenuresqr |  -.0004772   .0000866    -5.51   0.000     -.000647   -.0003075
 birthmonthdum2 |  -.0037028   .0236556    -0.16   0.876    -.0500723    .0426667
 birthmonthdum3 |  -.0243959   .0235285    -1.04   0.300    -.0705162    .0217243
 birthmonthdum4 |  -.0302759   .0244918    -1.24   0.216    -.0782844    .0177325
 birthmonthdum5 |  -.0115944   .0240403    -0.48   0.630    -.0587178     .035529
 birthmonthdum6 |  -.0080838   .0234039    -0.35   0.730    -.0539598    .0377923
 birthmonthdum7 |  -.0224122   .0237135    -0.95   0.345    -.0688951    .0240706
 birthmonthdum8 |   -.008979   .0232218    -0.39   0.699    -.0544981    .0365402
 birthmonthdum9 |    .013782   .0229537     0.60   0.548    -.0312116    .0587755
birthmonthdum10 |  -.0036571   .0218362    -0.17   0.867    -.0464601    .0391458
birthmonthdum11 |   .0103597   .0230165     0.45   0.653     -.034757    .0554764
birthmonthdum12 |   .0008963   .0231754     0.04   0.969    -.0445319    .0463245
           male |  -.0013258   .0095166    -0.14   0.889      -.01998    .0173285
              t |   .0005219   .0002586     2.02   0.044     .0000151    .0010288
              d |   .0537263   .0198785     2.70   0.007     .0147607    .0926919
             td |   .0011044   .0002957     3.74   0.000     .0005248    .0016839
          _cons |   .2965845   .0248897    11.92   0.000     .2477959     .345373
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(17)   =      72.32
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     2.4307

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   8.367578   12.87565     0.65   0.516    -16.86824     33.6034
  secgenhighedu |  -12.71609   23.21972    -0.55   0.584     -58.2259    32.79371
      secgenedu |   5.212631   11.72794     0.44   0.657    -17.77371    28.19897
         tenure |   .0243979   .0240583     1.01   0.311    -.0227555    .0715512
      tenuresqr |   -.001717   .0009777    -1.76   0.079    -.0036333    .0001993
 birthmonthdum2 |   .1056559   .2473433     0.43   0.669     -.379128    .5904399
 birthmonthdum3 |  -.0609305   .1233908    -0.49   0.621    -.3027721     .180911
 birthmonthdum4 |  -.0936583   .2053652    -0.46   0.648    -.4961666      .30885
 birthmonthdum5 |   .0609319   .1784959     0.34   0.733    -.2889137    .4107775
 birthmonthdum6 |   .0143727   .1227913     0.12   0.907    -.2262939    .2550393
 birthmonthdum7 |  -.0156701   .1266346    -0.12   0.902    -.2638693    .2325292
 birthmonthdum8 |    .123929   .2267944     0.55   0.585    -.3205799     .568438
 birthmonthdum9 |  -.0943643    .210325    -0.45   0.654    -.5065938    .3178652
birthmonthdum10 |   .0414828   .1219902     0.34   0.734    -.1976135    .2805791
birthmonthdum11 |  -.0066337    .132001    -0.05   0.960     -.265351    .2520836
birthmonthdum12 |  -.0014736   .1202348    -0.01   0.990    -.2371294    .2341823
           male |    .340101   .0720789     4.72   0.000     .1988288    .4813731
          _cons |   6.720635   2.423287     2.77   0.006     1.971079    11.47019
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  30.2478  (p = 0.0000)
  Wu-Hausman F(3,10593)           =  10.0914  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.916  Chi-sq(17) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
birthmont~m2 |     10,614     .078387    .2687923          0          1
birthmonth~3 |     10,614    .0800829    .2714343          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,614    .0686829     .252926          0          1
birthmonth~5 |     10,614    .0737705    .2614093          0          1
birthmonth~6 |     10,614    .0821556    .2746146          0          1
birthmonth~7 |     10,614     .077916    .2680519          0          1
birthmonth~8 |     10,614    .0846995    .2784471          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,614     .089316    .2852128          0          1
birthmont~10 |     10,614    .1104202    .3134276          0          1
birthmont~11 |     10,614    .0876201     .282755          0          1
birthmont~12 |     10,614    .0851705    .2791484          0          1
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 
> 1971, 1992) & inrange(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(31, 10582)  =  46.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1199
                                                        Adj R-squared = 0.1174
                                                        Root MSE      = 0.4670

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0204578   .0020142    10.16   0.000     .0165096     .024406
      tenuresqr |  -.0001372   .0000832    -1.65   0.099    -.0003002    .0000259
 birthmonthdum2 |  -.0294465   .0226838    -1.30   0.194    -.0739109     .015018
 birthmonthdum3 |  -.0368615   .0225732    -1.63   0.103    -.0811091    .0073862
 birthmonthdum4 |   -.068433   .0234887    -2.91   0.004    -.1144752   -.0223908
 birthmonthdum5 |  -.0318936   .0230484    -1.38   0.166    -.0770728    .0132856
 birthmonthdum6 |  -.0472334   .0224439    -2.10   0.035    -.0912277   -.0032392
 birthmonthdum7 |  -.0512124   .0227438    -2.25   0.024    -.0957946   -.0066303
 birthmonthdum8 |  -.0537702   .0222646    -2.42   0.016     -.097413   -.0101275
 birthmonthdum9 |  -.0144644   .0220229    -0.66   0.511    -.0576333    .0287046
birthmonthdum10 |  -.0237005   .0209503    -1.13   0.258    -.0647671    .0173662
birthmonthdum11 |  -.0289637   .0220717    -1.31   0.189    -.0722283     .014301
birthmonthdum12 |  -.0273521   .0222317    -1.23   0.219    -.0709304    .0162262
           male |  -.0321952    .009128    -3.53   0.000    -.0500879   -.0143025
   provincedum2 |   -.190081   .0246571    -7.71   0.000    -.2384135   -.1417484
   provincedum3 |  -.1204112   .0256768    -4.69   0.000    -.1707425   -.0700799
   provincedum4 |  -.1679636   .0248465    -6.76   0.000    -.2166674   -.1192598
   provincedum5 |  -.2352709   .0227701   -10.33   0.000    -.2799047   -.1906371
   provincedum6 |  -.2557404   .0250447   -10.21   0.000    -.3048327    -.206648
   provincedum7 |  -.2416421   .0237362   -10.18   0.000    -.2881695   -.1951148
   provincedum8 |  -.2322032   .0232843    -9.97   0.000    -.2778448   -.1865617
   provincedum9 |  -.2292805   .0239572    -9.57   0.000    -.2762412   -.1823198
  provincedum10 |  -.2314723   .0245307    -9.44   0.000    -.2795571   -.1833875
  provincedum11 |  -.2836456   .0206328   -13.75   0.000    -.3240898   -.2432014
  provincedum12 |  -.2396842   .0255436    -9.38   0.000    -.2897546   -.1896139
  provincedum13 |  -.2462087   .0235232   -10.47   0.000    -.2923185   -.2000988
  provincedum14 |  -.1800876   .0301998    -5.96   0.000    -.2392849   -.1208903
  provincedum15 |  -.1476976   .0304326    -4.85   0.000    -.2073512    -.088044
              t |   .0019393   .0002483     7.81   0.000     .0014525    .0024261
              d |   .0507458   .0190884     2.66   0.008     .0133289    .0881627
             td |  -.0001783   .0002839    -0.63   0.530    -.0007347    .0003782
          _cons |   .4836836   .0290469    16.65   0.000     .4267463    .5406209
---------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(31, 10582)  =  37.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0988
                                                        Adj R-squared = 0.0961
                                                        Root MSE      = 0.4628

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0208214   .0019959    10.43   0.000     .0169091    .0247336
      tenuresqr |  -.0003416   .0000824    -4.14   0.000    -.0005031     -.00018
 birthmonthdum2 |  -.0083062   .0224772    -0.37   0.712    -.0523658    .0357534
 birthmonthdum3 |  -.0346164   .0223676    -1.55   0.122    -.0784612    .0092284
 birthmonthdum4 |  -.0596136   .0232748    -2.56   0.010    -.1052365   -.0139906
 birthmonthdum5 |  -.0181403   .0228385    -0.79   0.427    -.0629081    .0266275
 birthmonthdum6 |  -.0316031   .0222395    -1.42   0.155    -.0751968    .0119905
 birthmonthdum7 |  -.0422497   .0225367    -1.87   0.061    -.0864259    .0019266
 birthmonthdum8 |  -.0266638   .0220618    -1.21   0.227    -.0699092    .0165815
 birthmonthdum9 |  -.0098898   .0218223    -0.45   0.650    -.0526657     .032886
birthmonthdum10 |  -.0116119   .0207596    -0.56   0.576    -.0523046    .0290808
birthmonthdum11 |  -.0126496   .0218707    -0.58   0.563    -.0555203    .0302211
birthmonthdum12 |  -.0158708   .0220293    -0.72   0.471    -.0590523    .0273107
           male |    -.01599   .0090449    -1.77   0.077    -.0337197    .0017398
   provincedum2 |  -.1971839   .0244326    -8.07   0.000    -.2450764   -.1492914
   provincedum3 |  -.1078039    .025443    -4.24   0.000     -.157677   -.0579309
   provincedum4 |  -.1638875   .0246203    -6.66   0.000    -.2121479   -.1156271
   provincedum5 |  -.2207656   .0225628    -9.78   0.000     -.264993   -.1765383
   provincedum6 |  -.2197921   .0248167    -8.86   0.000    -.2684375   -.1711468
   provincedum7 |  -.2223729     .02352    -9.45   0.000    -.2684766   -.1762692
   provincedum8 |  -.2081936   .0230722    -9.02   0.000    -.2534196   -.1629677
   provincedum9 |  -.1928648   .0237391    -8.12   0.000    -.2393979   -.1463317
  provincedum10 |  -.2103964   .0243074    -8.66   0.000    -.2580434   -.1627494
  provincedum11 |  -.2441031    .020445   -11.94   0.000    -.2841791   -.2040271
  provincedum12 |  -.2259246   .0253111    -8.93   0.000     -.275539   -.1763101
  provincedum13 |  -.2249849    .023309    -9.65   0.000    -.2706749   -.1792949
  provincedum14 |   -.191031   .0299248    -6.38   0.000    -.2496893   -.1323727
  provincedum15 |  -.1418767   .0301555    -4.70   0.000    -.2009872   -.0827663
              t |   .0014008   .0002461     5.69   0.000     .0009184    .0018832
              d |   .0463396   .0189146     2.45   0.014     .0092634    .0834159
             td |   .0004221   .0002813     1.50   0.134    -.0001293    .0009734
          _cons |   .3935933   .0287824    13.67   0.000     .3371744    .4500122
---------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(31, 10582)  =  23.54
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0645
                                                        Adj R-squared = 0.0618
                                                        Root MSE      = 0.4843

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0205258   .0020888     9.83   0.000     .0164314    .0246203
      tenuresqr |  -.0004514   .0000863    -5.23   0.000    -.0006205   -.0002823
 birthmonthdum2 |  -.0024129   .0235241    -0.10   0.918    -.0485245    .0436987
 birthmonthdum3 |  -.0245547   .0234094    -1.05   0.294    -.0704415    .0213321
 birthmonthdum4 |  -.0291223   .0243588    -1.20   0.232    -.0768701    .0186255
 birthmonthdum5 |  -.0119046   .0239022    -0.50   0.618    -.0587574    .0349482
 birthmonthdum6 |  -.0087611   .0232753    -0.38   0.707    -.0543851    .0368629
 birthmonthdum7 |  -.0231898   .0235863    -0.98   0.326    -.0694234    .0230439
 birthmonthdum8 |  -.0098973   .0230893    -0.43   0.668    -.0551568    .0353621
 birthmonthdum9 |   .0118039   .0228387     0.52   0.605    -.0329641     .056572
birthmonthdum10 |   .0000779   .0217264     0.00   0.997      -.04251    .0426658
birthmonthdum11 |   .0115544   .0228893     0.50   0.614    -.0333129    .0564218
birthmonthdum12 |   .0017254   .0230552     0.07   0.940    -.0434673     .046918
           male |  -.0002955   .0094662    -0.03   0.975     -.018851      .01826
   provincedum2 |  -.1803813   .0255705    -7.05   0.000    -.2305042   -.1302583
   provincedum3 |  -.0782059   .0266279    -2.94   0.003    -.1304016   -.0260101
   provincedum4 |  -.1728996   .0257669    -6.71   0.000    -.2234076   -.1223916
   provincedum5 |  -.2038852   .0236136    -8.63   0.000    -.2501724   -.1575981
   provincedum6 |  -.2074657   .0259725    -7.99   0.000    -.2583766   -.1565548
   provincedum7 |  -.2221647   .0246154    -9.03   0.000    -.2704156   -.1739138
   provincedum8 |  -.1632583   .0241468    -6.76   0.000    -.2105905    -.115926
   provincedum9 |  -.1511758   .0248447    -6.08   0.000    -.1998761   -.1024755
  provincedum10 |  -.1840165   .0254394    -7.23   0.000    -.2338826   -.1341505
  provincedum11 |  -.1845538   .0213971    -8.63   0.000    -.2264962   -.1426114
  provincedum12 |  -.1817974   .0264899    -6.86   0.000    -.2337226   -.1298723
  provincedum13 |  -.1977244   .0243946    -8.11   0.000    -.2455423   -.1499065
  provincedum14 |  -.2146735   .0313185    -6.85   0.000    -.2760637   -.1532833
  provincedum15 |  -.1259505   .0315599    -3.99   0.000    -.1878138   -.0640871
              t |   .0005953   .0002575     2.31   0.021     .0000905    .0011001
              d |    .042917   .0197955     2.17   0.030      .004114      .08172
             td |     .00105   .0002944     3.57   0.000     .0004729    .0016271
          _cons |   .4715458   .0301229    15.65   0.000     .4124993    .5305923
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(31)   =     106.91
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      2.516

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   8.745525   16.38495     0.53   0.594    -23.36839    40.85944
  secgenhighedu |  -13.26035   29.61411    -0.45   0.654    -71.30295    44.78224
      secgenedu |   5.357722   15.06492     0.36   0.722    -24.16899    34.88443
         tenure |   .0245655   .0293881     0.84   0.403    -.0330342    .0821651
      tenuresqr |  -.0017312   .0012096    -1.43   0.152    -.0041019    .0006395
 birthmonthdum2 |   .1147666    .300295     0.38   0.702    -.4738008     .703334
 birthmonthdum3 |  -.0488846   .1316315    -0.37   0.710    -.3068776    .2091084
 birthmonthdum4 |  -.0801548   .2436483    -0.33   0.742    -.5576967     .397387
 birthmonthdum5 |   .0692906   .2094833     0.33   0.741    -.3412892    .4798704
 birthmonthdum6 |   .0215512   .1277032     0.17   0.866    -.2287424    .2718448
 birthmonthdum7 |  -.0145405   .1371323    -0.11   0.916    -.2833149    .2542339
 birthmonthdum8 |   .1276219   .2748081     0.46   0.642    -.4109921    .6662359
 birthmonthdum9 |  -.0972901   .2561995    -0.38   0.704    -.5994318    .4048516
birthmonthdum10 |    .035865   .1228189     0.29   0.770    -.2048557    .2765857
birthmonthdum11 |  -.0002741    .143636    -0.00   0.998    -.2817955    .2812473
birthmonthdum12 |  -.0020055   .1305356    -0.02   0.988    -.2578506    .2538396
           male |   .3441294   .0816165     4.22   0.000      .184164    .5040948
   provincedum2 |  -.5741781    .150392    -3.82   0.000     -.868941   -.2794152
   provincedum3 |  -.2377724   .1475035    -1.61   0.107    -.5268739    .0513292
   provincedum4 |  -.2424233   .5172852    -0.47   0.639    -1.256284     .771437
   provincedum5 |   .0904463   .4012873     0.23   0.822    -.6960622    .8769549
   provincedum6 |   .1543505   .8076569     0.19   0.848    -1.428628    1.737329
   provincedum7 |   .0041629   .7213436     0.01   0.995    -1.409645     1.41797
   provincedum8 |  -.3791132    .158998    -2.38   0.017    -.6907435   -.0674828
   provincedum9 |   .0472437   .3402046     0.14   0.890     -.619545    .7140325
  provincedum10 |  -.0453272   .3541911    -0.13   0.898    -.7395289    .6488746
  provincedum11 |   .0658804    .222357     0.30   0.767    -.3699314    .5016922
  provincedum12 |  -.2441457   .1501349    -1.63   0.104    -.5384048    .0501134
  provincedum13 |  -.0216122   .3647282    -0.06   0.953    -.7364663    .6932419
  provincedum14 |  -.1698441   .5542344    -0.31   0.759    -1.256124    .9164353
  provincedum15 |   -.338765   .2001254    -1.69   0.091    -.7310035    .0534736
          _cons |   6.779836   3.408558     1.99   0.047     .0991852    13.46049
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  29.3352  (p = 0.0000)
  Wu-Hausman F(3,10579)           =  9.77316  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   2.367  Chi-sq(31) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
birthmont~m2 |     10,614     .078387    .2687923          0          1
birthmonth~3 |     10,614    .0800829    .2714343          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,614    .0686829     .252926          0          1
birthmonth~5 |     10,614    .0737705    .2614093          0          1
birthmonth~6 |     10,614    .0821556    .2746146          0          1
birthmonth~7 |     10,614     .077916    .2680519          0          1
birthmonth~8 |     10,614    .0846995    .2784471          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,614     .089316    .2852128          0          1
birthmont~10 |     10,614    .1104202    .3134276          0          1
birthmont~11 |     10,614    .0876201     .282755          0          1
birthmont~12 |     10,614    .0851705    .2791484          0          1
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(16, 5649)   =  27.72
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0728
                                                        Adj R-squared = 0.0702
                                                        Root MSE      = 0.4781

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0135243   .0028179     4.80   0.000     .0080002    .0190484
      tenuresqr |   .0000351   .0001143     0.31   0.759    -.0001889    .0002592
 birthmonthdum2 |  -.0522177   .0319016    -1.64   0.102    -.1147572    .0103217
 birthmonthdum3 |  -.0492322   .0317262    -1.55   0.121    -.1114277    .0129633
 birthmonthdum4 |  -.0623486   .0335874    -1.86   0.063    -.1281928    .0034955
 birthmonthdum5 |  -.0317452   .0320983    -0.99   0.323    -.0946702    .0311799
 birthmonthdum6 |  -.0613941   .0315044    -1.95   0.051    -.1231549    .0003667
 birthmonthdum7 |   .0129675   .0319077     0.41   0.684    -.0495838    .0755188
 birthmonthdum8 |  -.0488272   .0308393    -1.58   0.113    -.1092841    .0116298
 birthmonthdum9 |   .0009626   .0308237     0.03   0.975    -.0594638     .061389
birthmonthdum10 |  -.0335252   .0291904    -1.15   0.251    -.0907495    .0236991
birthmonthdum11 |  -.0406388    .030822    -1.32   0.187    -.1010618    .0197842
birthmonthdum12 |    -.05138   .0312387    -1.64   0.100    -.1126199      .00986
              t |   .0020697   .0003463     5.98   0.000     .0013908    .0027486
              d |   .0597105   .0267063     2.24   0.025     .0073558    .1120652
             td |  -.0008197   .0003972    -2.06   0.039    -.0015983   -.0000412
          _cons |   .3013769   .0332199     9.07   0.000     .2362532    .3665006
---------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(16, 5649)   =  22.61
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0602
                                                        Adj R-squared = 0.0575
                                                        Root MSE      = 0.4716

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0152121   .0027795     5.47   0.000     .0097632    .0206611
      tenuresqr |  -.0001749   .0001127    -1.55   0.121     -.000396    .0000461
 birthmonthdum2 |  -.0302846   .0314677    -0.96   0.336    -.0919734    .0314042
 birthmonthdum3 |  -.0365653   .0312946    -1.17   0.243    -.0979148    .0247842
 birthmonthdum4 |  -.0433372   .0331305    -1.31   0.191    -.1082857    .0216113
 birthmonthdum5 |   -.011374   .0316617    -0.36   0.719    -.0734431    .0506951
 birthmonthdum6 |  -.0595842   .0310759    -1.92   0.055    -.1205048    .0013365
 birthmonthdum7 |   .0084337   .0314736     0.27   0.789    -.0532667    .0701342
 birthmonthdum8 |  -.0185213   .0304198    -0.61   0.543    -.0781558    .0411133
 birthmonthdum9 |   .0125142   .0304045     0.41   0.681    -.0470902    .0721187
birthmonthdum10 |  -.0245937   .0287933    -0.85   0.393    -.0810396    .0318523
birthmonthdum11 |  -.0193571   .0304027    -0.64   0.524    -.0789582    .0402439
birthmonthdum12 |  -.0232526   .0308138    -0.75   0.451    -.0836595    .0371543
              t |   .0014349   .0003416     4.20   0.000     .0007652    .0021046
              d |   .0675499   .0263431     2.56   0.010     .0159074    .1191924
             td |  -.0001756   .0003918    -0.45   0.654    -.0009436    .0005924
          _cons |   .2264171    .032768     6.91   0.000     .1621793     .290655
---------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(16, 5649)   =  14.00
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0381
                                                        Adj R-squared = 0.0354
                                                        Root MSE      = 0.4911

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0141732   .0028941     4.90   0.000     .0084997    .0198467
      tenuresqr |  -.0002266   .0001174    -1.93   0.054    -.0004568    3.49e-06
 birthmonthdum2 |   -.000332   .0327643    -0.01   0.992    -.0645627    .0638987
 birthmonthdum3 |  -.0230848   .0325841    -0.71   0.479    -.0869622    .0407927
 birthmonthdum4 |    .012614   .0344957     0.37   0.715    -.0550107    .0802387
 birthmonthdum5 |   .0035522   .0329663     0.11   0.914    -.0610745    .0681789
 birthmonthdum6 |  -.0287393   .0323564    -0.89   0.374    -.0921703    .0346917
 birthmonthdum7 |   .0319975   .0327705     0.98   0.329    -.0322453    .0962404
 birthmonthdum8 |   .0053756   .0316733     0.17   0.865    -.0567162    .0674675
 birthmonthdum9 |   .0362652   .0316573     1.15   0.252    -.0257953    .0983257
birthmonthdum10 |   .0016992   .0299797     0.06   0.955    -.0570726     .060471
birthmonthdum11 |   .0209728   .0316555     0.66   0.508    -.0410841    .0830298
birthmonthdum12 |   .0062948   .0320835     0.20   0.844    -.0566012    .0691908
              t |   .0006994   .0003557     1.97   0.049     2.07e-06    .0013967
              d |   .0643881   .0274285     2.35   0.019     .0106177    .1181586
             td |   .0004938   .0004079     1.21   0.226    -.0003058    .0012934
          _cons |   .3297272   .0341182     9.66   0.000     .2628424     .396612
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(16)   =       1.08
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =     7.2257

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -17.97444   72.78751    -0.25   0.805    -160.6353    124.6865
  secgenhighedu |   36.30677   137.8955     0.26   0.792    -233.9634     306.577
      secgenedu |  -20.20843   71.52886    -0.28   0.778    -160.4024    119.9855
         tenure |   .0076414   .1173099     0.07   0.948    -.2222816    .2375645
      tenuresqr |   .0015102   .0108434     0.14   0.889    -.0197425    .0227629
 birthmonthdum2 |   .1086294   .6375679     0.17   0.865    -1.140981    1.358239
 birthmonthdum3 |  -.0421403   .5136077    -0.08   0.935    -1.048793    .9645122
 birthmonthdum4 |   .6496001    2.42688     0.27   0.789    -4.106998    5.406198
 birthmonthdum5 |  -.0785743   .6866306    -0.11   0.909    -1.424346    1.267197
 birthmonthdum6 |   .4963214   1.794897     0.28   0.782    -3.021612    4.014255
 birthmonthdum7 |   .6222397    2.14775     0.29   0.772    -3.587273    4.831753
 birthmonthdum8 |  -.1055757    .782469    -0.13   0.893    -1.639187    1.428035
 birthmonthdum9 |   .2918216   1.081163     0.27   0.787    -1.827219    2.410863
birthmonthdum10 |   .2969554   1.174662     0.25   0.800     -2.00534    2.599251
birthmonthdum11 |   .3885632    1.33385     0.29   0.771    -2.225734     3.00286
birthmonthdum12 |   .0152318   .5327197     0.03   0.977     -1.02888    1.059343
          _cons |   12.22583   14.06035     0.87   0.385    -15.33195    39.78361
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  20.3762  (p = 0.0001)
  Wu-Hausman F(3,5646)            =  6.79251  (p = 0.0001)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.390  Chi-sq(16) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
birthmont~m2 |      5,666    .0771267     .266816          0          1
birthmonth~3 |      5,666    .0788916    .2695933          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,666    .0637134    .2442632          0          1
birthmonth~5 |      5,666    .0755383    .2642813          0          1
birthmonth~6 |      5,666    .0813625    .2734152          0          1
birthmonth~7 |      5,666    .0776562    .2676534          0          1
birthmonth~8 |      5,666    .0887752     .284444          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,666    .0894811    .2854621          0          1
birthmont~10 |      5,666    .1129545    .3165651          0          1
birthmont~11 |      5,666    .0887752     .284444          0          1
birthmont~12 |      5,666    .0840099    .2774271          0          1
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971,
>  1992) & inrange(monthlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(30, 5635)   =  19.23
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0929
                                                        Adj R-squared = 0.0881
                                                        Root MSE      = 0.4735

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .012191   .0027998     4.35   0.000     .0067023    .0176796
      tenuresqr |   .0000783   .0001135     0.69   0.490    -.0001442    .0003007
 birthmonthdum2 |  -.0490343   .0316577    -1.55   0.121    -.1110956     .013027
 birthmonthdum3 |  -.0477582    .031477    -1.52   0.129    -.1094653    .0139489
 birthmonthdum4 |   -.065075   .0333143    -1.95   0.051    -.1303839    .0002339
 birthmonthdum5 |  -.0310481   .0318078    -0.98   0.329    -.0934037    .0313075
 birthmonthdum6 |   -.054703   .0312462    -1.75   0.080    -.1159575    .0065515
 birthmonthdum7 |   .0112896   .0316505     0.36   0.721    -.0507575    .0733367
 birthmonthdum8 |  -.0498239   .0305719    -1.63   0.103    -.1097565    .0101087
 birthmonthdum9 |  -.0006898   .0305844    -0.02   0.982    -.0606469    .0592673
birthmonthdum10 |  -.0282702   .0289533    -0.98   0.329    -.0850299    .0284895
birthmonthdum11 |  -.0367851   .0305727    -1.20   0.229    -.0967193    .0231491
birthmonthdum12 |  -.0496643   .0309796    -1.60   0.109    -.1103964    .0110677
   provincedum2 |   -.211175   .0340951    -6.19   0.000    -.2780145   -.1443356
   provincedum3 |  -.1242613   .0359228    -3.46   0.001    -.1946838   -.0538388
   provincedum4 |  -.1870205    .034963    -5.35   0.000    -.2555613   -.1184796
   provincedum5 |  -.2221618   .0319602    -6.95   0.000    -.2848161   -.1595075
   provincedum6 |  -.2469161   .0346227    -7.13   0.000      -.31479   -.1790423
   provincedum7 |  -.2457266   .0337359    -7.28   0.000     -.311862   -.1795913
   provincedum8 |  -.2225585   .0325984    -6.83   0.000    -.2864638   -.1586532
   provincedum9 |  -.2036528   .0332686    -6.12   0.000    -.2688719   -.1384336
  provincedum10 |  -.1972116   .0347153    -5.68   0.000    -.2652669   -.1291564
  provincedum11 |  -.2837207   .0290152    -9.78   0.000    -.3406016   -.2268398
  provincedum12 |  -.2192773   .0362456    -6.05   0.000    -.2903326    -.148222
  provincedum13 |  -.2362276   .0333621    -7.08   0.000    -.3016301   -.1708251
  provincedum14 |  -.1644337   .0433529    -3.79   0.000     -.249422   -.0794454
  provincedum15 |  -.1029349   .0430324    -2.39   0.017     -.187295   -.0185749
              t |    .002081    .000344     6.05   0.000     .0014065    .0027554
              d |   .0503075   .0265191     1.90   0.058    -.0016801    .1022951
             td |  -.0007801   .0003945    -1.98   0.048    -.0015536   -6.73e-06
          _cons |   .5116442   .0405533    12.62   0.000     .4321441    .5911443
---------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(30, 5635)   =  15.59
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0766
                                                        Adj R-squared = 0.0717
                                                        Root MSE      = 0.4681

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0141512   .0027676     5.11   0.000     .0087257    .0195767
      tenuresqr |  -.0001402   .0001122    -1.25   0.212    -.0003601    .0000798
 birthmonthdum2 |  -.0283409   .0312933    -0.91   0.365    -.0896878     .033006
 birthmonthdum3 |  -.0350716   .0311147    -1.13   0.260    -.0960684    .0259252
 birthmonthdum4 |  -.0448647   .0329308    -1.36   0.173    -.1094218    .0196924
 birthmonthdum5 |  -.0111687   .0314417    -0.36   0.722    -.0728065    .0504691
 birthmonthdum6 |  -.0537215   .0308865    -1.74   0.082    -.1142709    .0068279
 birthmonthdum7 |   .0064468   .0312861     0.21   0.837     -.054886    .0677797
 birthmonthdum8 |  -.0196219   .0302199    -0.65   0.516    -.0788646    .0396208
 birthmonthdum9 |   .0114993   .0302323     0.38   0.704    -.0477677    .0707663
birthmonthdum10 |  -.0206499   .0286201    -0.72   0.471    -.0767562    .0354564
birthmonthdum11 |  -.0163086   .0302208    -0.54   0.589    -.0755529    .0429357
birthmonthdum12 |  -.0219155    .030623    -0.72   0.474    -.0819485    .0381174
   provincedum2 |  -.2252047   .0337026    -6.68   0.000    -.2912748   -.1591346
   provincedum3 |  -.1277367   .0355093    -3.60   0.000    -.1973486   -.0581249
   provincedum4 |   -.192444   .0345605    -5.57   0.000    -.2601959   -.1246921
   provincedum5 |  -.2141983   .0315923    -6.78   0.000    -.2761314   -.1522652
   provincedum6 |  -.2139067   .0342242    -6.25   0.000    -.2809993   -.1468142
   provincedum7 |  -.2206443   .0333476    -6.62   0.000    -.2860184   -.1552702
   provincedum8 |  -.1984264   .0322231    -6.16   0.000    -.2615961   -.1352567
   provincedum9 |   -.178873   .0328856    -5.44   0.000    -.2433415   -.1144046
  provincedum10 |   -.175977   .0343157    -5.13   0.000    -.2432489   -.1087051
  provincedum11 |  -.2511279   .0286812    -8.76   0.000    -.3073541   -.1949017
  provincedum12 |  -.2074164   .0358284    -5.79   0.000    -.2776538    -.137179
  provincedum13 |  -.2259467   .0329781    -6.85   0.000    -.2905964    -.161297
  provincedum14 |  -.1651709   .0428538    -3.85   0.000    -.2491809   -.0811609
  provincedum15 |   -.108882   .0425371    -2.56   0.011     -.192271    -.025493
              t |   .0014566   .0003401     4.28   0.000     .0007899    .0021233
              d |   .0585983   .0262138     2.24   0.025     .0072091    .1099875
             td |  -.0001566     .00039    -0.40   0.688    -.0009211    .0006079
          _cons |   .4225631   .0400865    10.54   0.000     .3439781    .5011481
---------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(30, 5635)   =   9.65
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0489
                                                        Adj R-squared = 0.0438
                                                        Root MSE      = 0.4889

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0135449   .0028909     4.69   0.000     .0078776    .0192122
      tenuresqr |  -.0002028   .0001172    -1.73   0.083    -.0004325    .0000269
 birthmonthdum2 |  -.0002376    .032688    -0.01   0.994    -.0643186    .0638435
 birthmonthdum3 |  -.0232137   .0325014    -0.71   0.475    -.0869291    .0405016
 birthmonthdum4 |   .0114595   .0343985     0.33   0.739    -.0559748    .0788939
 birthmonthdum5 |   .0029149    .032843     0.09   0.929      -.06147    .0672999
 birthmonthdum6 |  -.0250838   .0322631    -0.78   0.437    -.0883318    .0381643
 birthmonthdum7 |   .0297163   .0326805     0.91   0.363    -.0343501    .0937827
 birthmonthdum8 |   .0045184   .0315668     0.14   0.886    -.0573647    .0664015
 birthmonthdum9 |   .0365153   .0315797     1.16   0.248    -.0253931    .0984238
birthmonthdum10 |   .0041553   .0298956     0.14   0.889    -.0544517    .0627622
birthmonthdum11 |   .0224223   .0315677     0.71   0.478    -.0394625    .0843071
birthmonthdum12 |    .007834   .0319879     0.24   0.807    -.0548746    .0705425
   provincedum2 |  -.2081876   .0352047    -5.91   0.000    -.2772024   -.1391729
   provincedum3 |  -.1001843   .0370919    -2.70   0.007    -.1728987   -.0274699
   provincedum4 |  -.1904957   .0361008    -5.28   0.000    -.2612672   -.1197241
   provincedum5 |   -.175428   .0330003    -5.32   0.000    -.2401214   -.1107347
   provincedum6 |  -.1817875   .0357495    -5.09   0.000    -.2518703   -.1117047
   provincedum7 |  -.2112885   .0348338    -6.07   0.000    -.2795762   -.1430008
   provincedum8 |  -.1483134   .0336593    -4.41   0.000    -.2142985   -.0823282
   provincedum9 |  -.1409285   .0343513    -4.10   0.000    -.2082703   -.0735868
  provincedum10 |  -.1269294   .0358451    -3.54   0.000    -.1971996   -.0566593
  provincedum11 |  -.1719015   .0299595    -5.74   0.000    -.2306336   -.1131694
  provincedum12 |  -.1758921   .0374252    -4.70   0.000    -.2492599   -.1025243
  provincedum13 |   -.168404   .0344479    -4.89   0.000     -.235935   -.1008729
  provincedum14 |  -.1977867   .0447638    -4.42   0.000    -.2855409   -.1100324
  provincedum15 |  -.1130508   .0444329    -2.54   0.011    -.2001564   -.0259452
              t |   .0007386   .0003552     2.08   0.038     .0000422     .001435
              d |   .0562493   .0273822     2.05   0.040     .0025698    .1099289
             td |    .000469   .0004074     1.15   0.250    -.0003296    .0012675
          _cons |   .4914682   .0418731    11.74   0.000     .4093807    .5735556
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(30)   =       3.48
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =     7.1963

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   -17.2549    75.0889    -0.23   0.818    -164.4264    129.9166
  secgenhighedu |   35.64155    144.167     0.25   0.805    -246.9206    318.2037
      secgenedu |  -20.51341   76.53779    -0.27   0.789    -170.5247    129.4979
         tenure |   .0126773    .107092     0.12   0.906    -.1972193    .2225738
      tenuresqr |   .0013771    .010934     0.13   0.900    -.0200532    .0228075
 birthmonthdum2 |   .0927714   .6559088     0.14   0.888    -1.192786    1.378329
 birthmonthdum3 |  -.0714817   .5591809    -0.13   0.898    -1.167456    1.024493
 birthmonthdum4 |    .649695   2.545801     0.26   0.799    -4.339983    5.639373
 birthmonthdum5 |  -.0794953   .6918886    -0.11   0.909    -1.435572    1.276582
 birthmonthdum6 |   .4684226   1.818271     0.26   0.797    -3.095322    4.032168
 birthmonthdum7 |   .6127016   2.268098     0.27   0.787     -3.83269    5.058093
 birthmonthdum8 |  -.0920133   .7482131    -0.12   0.902    -1.558484    1.374457
 birthmonthdum9 |   .3096688   1.215877     0.25   0.799    -2.073406    2.692744
birthmonthdum10 |   .3001316   1.265118     0.24   0.812    -2.179454    2.779717
birthmonthdum11 |   .3899755   1.420472     0.27   0.784    -2.394099     3.17405
birthmonthdum12 |   .0470966   .5372084     0.09   0.930    -1.005812    1.100006
   provincedum2 |  -.3866776   .9953963    -0.39   0.698    -2.337618    1.564263
   provincedum3 |   .1677213    1.56869     0.11   0.915    -2.906854    3.242297
   provincedum4 |  -.6824769   1.032026    -0.66   0.508     -2.70521    1.340257
   provincedum5 |   .1449876   1.007143     0.14   0.886    -1.828977    2.118952
   provincedum6 |  -.5518984   1.620401    -0.34   0.733    -3.727827     2.62403
   provincedum7 |  -.9840368   2.791822    -0.35   0.724    -6.455908    4.487835
   provincedum8 |  -.2850787   .8160912    -0.35   0.727    -1.884588    1.314431
   provincedum9 |  -.1624715   .5775637    -0.28   0.778    -1.294476    .9695325
  provincedum10 |   .0621514   1.080611     0.06   0.954    -2.055807     2.18011
  provincedum11 |   .4200789   1.903282     0.22   0.825    -3.310286    4.150444
  provincedum12 |   -.255901   .5934005    -0.43   0.666    -1.418945    .9071426
  provincedum13 |   .3171706   2.105963     0.15   0.880    -3.810441    4.444782
  provincedum14 |   -1.37539   3.680782    -0.37   0.709    -8.589591     5.83881
  provincedum15 |  -.5941514   .9330048    -0.64   0.524    -2.422807    1.234504
          _cons |    12.4634   14.80552     0.84   0.400    -16.55489     41.4817
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  23.0089  (p = 0.0000)
  Wu-Hausman F(3,5632)            =  7.65468  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.471  Chi-sq(30) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
birthmont~m2 |      5,666    .0771267     .266816          0          1
birthmonth~3 |      5,666    .0788916    .2695933          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,666    .0637134    .2442632          0          1
birthmonth~5 |      5,666    .0755383    .2642813          0          1
birthmonth~6 |      5,666    .0813625    .2734152          0          1
birthmonth~7 |      5,666    .0776562    .2676534          0          1
birthmonth~8 |      5,666    .0887752     .284444          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,666    .0894811    .2854621          0          1
birthmont~10 |      5,666    .1129545    .3165651          0          1
birthmont~11 |      5,666    .0887752     .284444          0          1
birthmont~12 |      5,666    .0840099    .2774271          0          1
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(16, 4931)   =  49.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1385
                                                        Adj R-squared = 0.1357
                                                        Root MSE      = 0.4633

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .029702   .0029307    10.13   0.000     .0239566    .0354474
      tenuresqr |  -.0003737   .0001236    -3.02   0.003    -.0006161   -.0001313
 birthmonthdum2 |  -.0030518   .0327848    -0.09   0.926    -.0673245     .061221
 birthmonthdum3 |  -.0158755   .0326178    -0.49   0.626    -.0798209    .0480698
 birthmonthdum4 |  -.0668267   .0333788    -2.00   0.045    -.1322641   -.0013893
 birthmonthdum5 |  -.0284847   .0337183    -0.84   0.398    -.0945876    .0376182
 birthmonthdum6 |  -.0299933   .0325231    -0.92   0.356    -.0937531    .0337664
 birthmonthdum7 |   -.118265   .0329648    -3.59   0.000    -.1828907   -.0536393
 birthmonthdum8 |  -.0523819   .0327837    -1.60   0.110    -.1166525    .0118887
 birthmonthdum9 |  -.0275337     .03197    -0.86   0.389    -.0902093    .0351418
birthmonthdum10 |  -.0179572   .0305709    -0.59   0.557    -.0778898    .0419753
birthmonthdum11 |  -.0143907   .0321578    -0.45   0.655    -.0774343    .0486529
birthmonthdum12 |  -.0010603   .0321358    -0.03   0.974    -.0640609    .0619402
              t |   .0016287   .0003616     4.50   0.000     .0009197    .0023376
              d |   .0679936   .0277002     2.45   0.014     .0136888    .1222984
             td |   .0005519   .0004121     1.34   0.181    -.0002559    .0013597
          _cons |   .1919299   .0338418     5.67   0.000     .1255849    .2582748
---------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(16, 4931)   =  40.17
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1153
                                                        Adj R-squared = 0.1125
                                                        Root MSE      = 0.4596

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0285824   .0029074     9.83   0.000     .0228825    .0342822
      tenuresqr |  -.0005823   .0001227    -4.75   0.000    -.0008228   -.0003418
 birthmonthdum2 |   .0159078   .0325248     0.49   0.625    -.0478553    .0796709
 birthmonthdum3 |  -.0277329   .0323591    -0.86   0.391    -.0911712    .0357054
 birthmonthdum4 |  -.0733699   .0331142    -2.22   0.027    -.1382884   -.0084514
 birthmonthdum5 |  -.0240845   .0334509    -0.72   0.472    -.0896633    .0414942
 birthmonthdum6 |  -.0003564   .0322652    -0.01   0.991    -.0636106    .0628977
 birthmonthdum7 |  -.0949902   .0327034    -2.90   0.004    -.1591034    -.030877
 birthmonthdum8 |  -.0309409   .0325237    -0.95   0.341    -.0947019    .0328201
 birthmonthdum9 |  -.0321907   .0317165    -1.01   0.310    -.0943692    .0299878
birthmonthdum10 |  -.0021839   .0303285    -0.07   0.943    -.0616412    .0572734
birthmonthdum11 |  -.0055726   .0319028    -0.17   0.861    -.0681163    .0569711
birthmonthdum12 |  -.0078282    .031881    -0.25   0.806    -.0703292    .0546728
              t |   .0011876   .0003587     3.31   0.001     .0004843    .0018909
              d |   .0487938   .0274806     1.78   0.076    -.0050803     .102668
             td |   .0011467   .0004088     2.81   0.005     .0003453    .0019481
          _cons |   .1420187   .0335734     4.23   0.000     .0761998    .2078376
---------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(16, 4931)   =  24.60
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0739
                                                        Adj R-squared = 0.0709
                                                        Root MSE      = 0.4820

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0290267    .003049     9.52   0.000     .0230493    .0350042
      tenuresqr |  -.0007661   .0001286    -5.96   0.000    -.0010183   -.0005139
 birthmonthdum2 |  -.0062589   .0341089    -0.18   0.854    -.0731276    .0606098
 birthmonthdum3 |  -.0246864   .0339352    -0.73   0.467    -.0912144    .0418417
 birthmonthdum4 |  -.0733597    .034727    -2.11   0.035      -.14144   -.0052793
 birthmonthdum5 |  -.0271733   .0350802    -0.77   0.439    -.0959461    .0415995
 birthmonthdum6 |   .0148789   .0338367     0.44   0.660    -.0514561    .0812139
 birthmonthdum7 |  -.0823311   .0342962    -2.40   0.016     -.149567   -.0150953
 birthmonthdum8 |  -.0234913   .0341078    -0.69   0.491    -.0903577    .0433752
 birthmonthdum9 |  -.0136922   .0332613    -0.41   0.681    -.0788992    .0515147
birthmonthdum10 |  -.0089486   .0318056    -0.28   0.778    -.0713018    .0534046
birthmonthdum11 |  -.0000381   .0334566    -0.00   0.999     -.065628    .0655518
birthmonthdum12 |  -.0055742   .0334338    -0.17   0.868    -.0711193    .0599709
              t |   .0002773   .0003762     0.74   0.461    -.0004603    .0010148
              d |   .0448797    .028819     1.56   0.119    -.0116184    .1013778
             td |   .0018001   .0004287     4.20   0.000     .0009596    .0026405
          _cons |   .2611403   .0352086     7.42   0.000     .1921157    .3301649
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(16)   =     310.10
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .81634

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   1.996156   2.254029     0.89   0.376     -2.42166    6.413972
  secgenhighedu |  -.5547716   3.879019    -0.14   0.886    -8.157508    7.047965
      secgenedu |  -.9371076   1.987186    -0.47   0.637     -4.83192    2.957705
         tenure |   .0299902   .0128177     2.34   0.019     .0048679    .0551125
      tenuresqr |  -.0011244   .0002926    -3.84   0.000    -.0016979    -.000551
 birthmonthdum2 |  -.0378799   .0996713    -0.38   0.704    -.2332321    .1574722
 birthmonthdum3 |  -.1071357   .0624086    -1.72   0.086    -.2294543     .015183
 birthmonthdum4 |   -.024996   .0606228    -0.41   0.680    -.1438145    .0938225
 birthmonthdum5 |  -.0727554   .0642846    -1.13   0.258     -.198751    .0532401
 birthmonthdum6 |  -.0027994   .0723159    -0.04   0.969     -.144536    .1389372
 birthmonthdum7 |  -.0105447   .0804133    -0.13   0.896    -.1681519    .1470625
 birthmonthdum8 |  -.0015791   .0733487    -0.02   0.983      -.14534    .1421818
 birthmonthdum9 |  -.0334606   .0655867    -0.51   0.610    -.1620082    .0950871
birthmonthdum10 |   .0241526   .0732591     0.33   0.742    -.1194325    .1677377
birthmonthdum11 |  -.0192275   .0581628    -0.33   0.741    -.1332245    .0947696
birthmonthdum12 |  -.0253126   .0587999    -0.43   0.667    -.1405582     .089933
          _cons |   7.891835   .4210571    18.74   0.000     7.066578    8.717092
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  61.6157  (p = 0.0000)
  Wu-Hausman F(3,4928)            =  20.7135  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  16.161  Chi-sq(16) P-value = 0.4418

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
birthmont~m2 |      4,948    .0798302    .2710576          0          1
birthmonth~3 |      4,948     .081447    .2735481          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,948    .0743735    .2624042          0          1
birthmonth~5 |      4,948    .0717462    .2580932          0          1
birthmonth~6 |      4,948    .0830639    .2760066          0          1
birthmonth~7 |      4,948    .0782134    .2685343          0          1
birthmonth~8 |      4,948    .0800323    .2713707          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,948    .0891269    .2849557          0          1
birthmont~10 |      4,948    .1075182    .3098022          0          1
birthmont~11 |      4,948    .0862975    .2808312          0          1
birthmont~12 |      4,948    .0864996    .2811288          0          1
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971,
>  1992) & inrange(monthlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(30, 4917)   =  31.89
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1629
                                                        Adj R-squared = 0.1578
                                                        Root MSE      = 0.4573

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0286971   .0029005     9.89   0.000     .0230109    .0343833
      tenuresqr |   -.000345   .0001225    -2.82   0.005    -.0005851   -.0001049
 birthmonthdum2 |  -.0070847   .0324009    -0.22   0.827    -.0706049    .0564354
 birthmonthdum3 |  -.0251294   .0322938    -0.78   0.437    -.0884397    .0381808
 birthmonthdum4 |  -.0678211    .033017    -2.05   0.040    -.1325493    -.003093
 birthmonthdum5 |   -.030816   .0333319    -0.92   0.355    -.0961614    .0345294
 birthmonthdum6 |  -.0375565   .0321418    -1.17   0.243    -.1005688    .0254558
 birthmonthdum7 |  -.1203971    .032578    -3.70   0.000    -.1842647   -.0565296
 birthmonthdum8 |  -.0564809   .0323776    -1.74   0.081    -.1199555    .0069936
 birthmonthdum9 |  -.0335198   .0316045    -1.06   0.289    -.0954787     .028439
birthmonthdum10 |  -.0172111   .0302351    -0.57   0.569    -.0764855    .0420633
birthmonthdum11 |  -.0179943    .031793    -0.57   0.571    -.0803227    .0443341
birthmonthdum12 |  -.0024077   .0317739    -0.08   0.940    -.0646988    .0598834
   provincedum2 |  -.1562493   .0356825    -4.38   0.000    -.2262028   -.0862957
   provincedum3 |  -.1090883   .0366081    -2.98   0.003    -.1808565   -.0373202
   provincedum4 |  -.1455314   .0351534    -4.14   0.000    -.2144478   -.0766149
   provincedum5 |  -.2454248   .0323087    -7.60   0.000    -.3087643   -.1820854
   provincedum6 |  -.2609145   .0362271    -7.20   0.000    -.3319358   -.1898932
   provincedum7 |  -.2342037   .0332599    -7.04   0.000    -.2994079   -.1689994
   provincedum8 |  -.2390334   .0331293    -7.22   0.000    -.3039817   -.1740852
   provincedum9 |  -.2623957   .0344851    -7.61   0.000    -.3300019   -.1947896
  provincedum10 |  -.2637123   .0344908    -7.65   0.000    -.3313296    -.196095
  provincedum11 |  -.2783214   .0292463    -9.52   0.000    -.3356573   -.2209855
  provincedum12 |  -.2544147   .0358093    -7.10   0.000     -.324617   -.1842124
  provincedum13 |  -.2558715   .0330008    -7.75   0.000    -.3205679   -.1911751
  provincedum14 |  -.1903181   .0418687    -4.55   0.000    -.2723994   -.1082368
  provincedum15 |  -.1925985   .0428436    -4.50   0.000    -.2765911    -.108606
              t |   .0017654   .0003578     4.93   0.000     .0010639    .0024669
              d |   .0563614    .027415     2.06   0.040     .0026157     .110107
             td |   .0004541   .0004075     1.11   0.265    -.0003448    .0012529
          _cons |   .4190682   .0407558    10.28   0.000     .3391686    .4989678
---------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(30, 4917)   =  25.64
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1353
                                                        Adj R-squared = 0.1300
                                                        Root MSE      = 0.4550

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0277038   .0028861     9.60   0.000     .0220458    .0333618
      tenuresqr |   -.000556   .0001219    -4.56   0.000    -.0007949   -.0003171
 birthmonthdum2 |   .0136004   .0322402     0.42   0.673    -.0496047    .0768056
 birthmonthdum3 |  -.0342967   .0321337    -1.07   0.286     -.097293    .0286996
 birthmonthdum4 |  -.0716831   .0328533    -2.18   0.029    -.1360903    -.007276
 birthmonthdum5 |  -.0252846   .0331666    -0.76   0.446    -.0903059    .0397368
 birthmonthdum6 |  -.0061339   .0319824    -0.19   0.848    -.0688336    .0565659
 birthmonthdum7 |  -.0966335   .0324165    -2.98   0.003    -.1601843   -.0330827
 birthmonthdum8 |  -.0339084    .032217    -1.05   0.293    -.0970681    .0292514
 birthmonthdum9 |   -.037127   .0314477    -1.18   0.238    -.0987785    .0245246
birthmonthdum10 |  -.0003359   .0300852    -0.01   0.991    -.0593164    .0586445
birthmonthdum11 |  -.0077096   .0316353    -0.24   0.807    -.0697289    .0543097
birthmonthdum12 |  -.0086547   .0316164    -0.27   0.784    -.0706368    .0533275
   provincedum2 |  -.1545329   .0355055    -4.35   0.000    -.2241395   -.0849263
   provincedum3 |  -.0786936   .0364265    -2.16   0.031    -.1501058   -.0072814
   provincedum4 |  -.1303995   .0349791    -3.73   0.000    -.1989742   -.0618249
   provincedum5 |  -.2243339   .0321485    -6.98   0.000    -.2873592   -.1613085
   provincedum6 |  -.2219301   .0360474    -6.16   0.000    -.2925992    -.151261
   provincedum7 |  -.2205102    .033095    -6.66   0.000    -.2853911   -.1556293
   provincedum8 |  -.2156579    .032965    -6.54   0.000     -.280284   -.1510317
   provincedum9 |  -.2104257   .0343141    -6.13   0.000    -.2776966   -.1431548
  provincedum10 |  -.2424455   .0343197    -7.06   0.000    -.3097275   -.1751635
  provincedum11 |  -.2312681   .0291013    -7.95   0.000    -.2883197   -.1742166
  provincedum12 |  -.2398586   .0356317    -6.73   0.000    -.3097128   -.1700045
  provincedum13 |  -.2234071   .0328372    -6.80   0.000    -.2877827   -.1590316
  provincedum14 |  -.2113068   .0416611    -5.07   0.000    -.2929811   -.1296325
  provincedum15 |  -.1729101   .0426311    -4.06   0.000    -.2564861    -.089334
              t |   .0013292   .0003561     3.73   0.000     .0006312    .0020272
              d |   .0370271   .0272791     1.36   0.175     -.016452    .0905062
             td |   .0010282   .0004055     2.54   0.011     .0002333    .0018231
          _cons |   .3446893   .0405537     8.50   0.000     .2651859    .4241926
---------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(30, 4917)   =  16.81
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0930
                                                        Adj R-squared = 0.0875
                                                        Root MSE      = 0.4777

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0281555   .0030296     9.29   0.000     .0222162    .0340949
      tenuresqr |  -.0007404   .0001279    -5.79   0.000    -.0009911   -.0004896
 birthmonthdum2 |  -.0072444   .0338434    -0.21   0.831    -.0735926    .0591038
 birthmonthdum3 |  -.0272815   .0337316    -0.81   0.419    -.0934105    .0388475
 birthmonthdum4 |  -.0695708    .034487    -2.02   0.044    -.1371809   -.0019608
 birthmonthdum5 |   -.029365   .0348159    -0.84   0.399    -.0976198    .0388897
 birthmonthdum6 |   .0095762   .0335728     0.29   0.775    -.0562415     .075394
 birthmonthdum7 |  -.0832948   .0340285    -2.45   0.014    -.1500059   -.0165838
 birthmonthdum8 |  -.0253014   .0338191    -0.75   0.454     -.091602    .0409992
 birthmonthdum9 |   -.019175   .0330116    -0.58   0.561    -.0838924    .0455424
birthmonthdum10 |  -.0051079   .0315813    -0.16   0.872    -.0670213    .0568055
birthmonthdum11 |  -.0013889   .0332085    -0.04   0.967    -.0664924    .0637145
birthmonthdum12 |  -.0055767   .0331886    -0.17   0.867    -.0706411    .0594877
   provincedum2 |  -.1338556   .0372711    -3.59   0.000    -.2069236   -.0607875
   provincedum3 |  -.0436819   .0382379    -1.14   0.253    -.1186453    .0312816
   provincedum4 |   -.150454   .0367185    -4.10   0.000    -.2224388   -.0784693
   provincedum5 |  -.2320049   .0337472    -6.87   0.000    -.2981644   -.1658454
   provincedum6 |  -.2312288     .03784    -6.11   0.000    -.3054122   -.1570455
   provincedum7 |  -.2279803   .0347407    -6.56   0.000    -.2960876    -.159873
   provincedum8 |  -.1752204   .0346043    -5.06   0.000    -.2430603   -.1073805
   provincedum9 |  -.1598338   .0360204    -4.44   0.000      -.23045   -.0892177
  provincedum10 |  -.2386542   .0360264    -6.62   0.000     -.309282   -.1680264
  provincedum11 |  -.1940466   .0305485    -6.35   0.000    -.2539352    -.134158
  provincedum12 |  -.1822637   .0374037    -4.87   0.000    -.2555915   -.1089358
  provincedum13 |  -.2257021   .0344701    -6.55   0.000    -.2932789   -.1581253
  provincedum14 |  -.2253088   .0437328    -5.15   0.000    -.3110446    -.139573
  provincedum15 |  -.1326079   .0447511    -2.96   0.003      -.22034   -.0448757
              t |   .0004309   .0003738     1.15   0.249    -.0003018    .0011637
              d |   .0315079   .0286356     1.10   0.271    -.0246307    .0876465
             td |   .0016608   .0004256     3.90   0.000     .0008264    .0024952
          _cons |   .4489873   .0425704    10.55   0.000     .3655303    .5324443
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(30)   =     495.58
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .82556

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   1.522431   2.588575     0.59   0.556    -3.551083    6.595946
  secgenhighedu |   .3107396   4.488309     0.07   0.945    -8.486185    9.107664
      secgenedu |  -1.478009   2.306486    -0.64   0.522    -5.998639    3.042621
         tenure |    .032904   .0140465     2.34   0.019     .0053734    .0604346
      tenuresqr |  -.0010925   .0003006    -3.63   0.000    -.0016817   -.0005033
 birthmonthdum2 |  -.0217241   .1125873    -0.19   0.847    -.2423911    .1989429
 birthmonthdum3 |  -.0635009   .0643093    -0.99   0.323    -.1895448     .062543
 birthmonthdum4 |   .0051446   .0614981     0.08   0.933    -.1153896    .1256787
 birthmonthdum5 |  -.0573422   .0690025    -0.83   0.406    -.1925847    .0779003
 birthmonthdum6 |   .0069145   .0794015     0.09   0.931    -.1487096    .1625386
 birthmonthdum7 |  -.0057805   .0872487    -0.07   0.947    -.1767847    .1652237
 birthmonthdum8 |  -.0025666   .0788318    -0.03   0.974    -.1570741     .151941
 birthmonthdum9 |  -.0161544   .0663635    -0.24   0.808    -.1462244    .1139157
birthmonthdum10 |   .0267059   .0775333     0.34   0.731    -.1252567    .1786685
birthmonthdum11 |  -.0033275   .0599772    -0.06   0.956    -.1208806    .1142256
birthmonthdum12 |  -.0058873   .0603098    -0.10   0.922    -.1240922    .1123177
   provincedum2 |  -.5980655    .067335    -8.88   0.000    -.7300397   -.4660913
   provincedum3 |  -.2555887   .0739186    -3.46   0.001    -.4004665   -.1107109
   provincedum4 |  -.4826767   .1452805    -3.32   0.001    -.7674212   -.1979321
   provincedum5 |  -.1095041   .1613361    -0.68   0.497     -.425717    .2067088
   provincedum6 |  -.2585982    .207536    -1.25   0.213    -.6653612    .1481648
   provincedum7 |   -.341075   .1435724    -2.38   0.018    -.6224717   -.0596782
   provincedum8 |  -.3976276   .0749132    -5.31   0.000    -.5444548   -.2508005
   provincedum9 |  -.0751567   .1102992    -0.68   0.496    -.2913392    .1410258
  provincedum10 |   -.208578   .1460469    -1.43   0.153    -.4948247    .0776686
  provincedum11 |   -.015849   .1265053    -0.13   0.900    -.2637949    .2320969
  provincedum12 |  -.1873517   .0690241    -2.71   0.007    -.3226364    -.052067
  provincedum13 |  -.1790961   .1757172    -1.02   0.308    -.5234955    .1653033
  provincedum14 |  -.3291587   .1026113    -3.21   0.001    -.5302731   -.1280443
  provincedum15 |  -.3162181   .0801532    -3.95   0.000    -.4733155   -.1591207
          _cons |   8.224348   .5837737    14.09   0.000     7.080172    9.368523
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  56.4562  (p = 0.0000)
  Wu-Hausman F(3,4914)            =  18.9051  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  23.215  Chi-sq(30) P-value = 0.8063

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
birthmont~m2 |      4,948    .0798302    .2710576          0          1
birthmonth~3 |      4,948     .081447    .2735481          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,948    .0743735    .2624042          0          1
birthmonth~5 |      4,948    .0717462    .2580932          0          1
birthmonth~6 |      4,948    .0830639    .2760066          0          1
birthmonth~7 |      4,948    .0782134    .2685343          0          1
birthmonth~8 |      4,948    .0800323    .2713707          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,948    .0891269    .2849557          0          1
birthmont~10 |      4,948    .1075182    .3098022          0          1
birthmont~11 |      4,948    .0862975    .2808312          0          1
birthmont~12 |      4,948    .0864996    .2811288          0          1
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning,
>  250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(17, 10596)  =  68.32
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0988
                                                        Adj R-squared = 0.0973
                                                        Root MSE      = 0.4723

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0216093   .0020323    10.63   0.000     .0176256     .025593
      tenuresqr |  -.0001721   .0000839    -2.05   0.040    -.0003366   -7.55e-06
 birthmonthdum2 |  -.0302216   .0229253    -1.32   0.187    -.0751596    .0147163
 birthmonthdum3 |  -.0339188   .0228021    -1.49   0.137    -.0786152    .0107776
 birthmonthdum4 |  -.0666227   .0237356    -2.81   0.005     -.113149   -.0200964
 birthmonthdum5 |   -.031314   .0232981    -1.34   0.179    -.0769826    .0143546
 birthmonthdum6 |  -.0468303   .0226813    -2.06   0.039      -.09129   -.0023706
 birthmonthdum7 |  -.0495222   .0229814    -2.15   0.031    -.0945701   -.0044744
 birthmonthdum8 |  -.0515034   .0225049    -2.29   0.022    -.0956172   -.0073895
 birthmonthdum9 |  -.0114459   .0222451    -0.51   0.607    -.0550504    .0321586
birthmonthdum10 |  -.0272027    .021162    -1.29   0.199    -.0686842    .0142788
birthmonthdum11 |  -.0297289   .0223059    -1.33   0.183    -.0734527    .0139949
birthmonthdum12 |  -.0274784   .0224599    -1.22   0.221    -.0715041    .0165474
           male |  -.0347854   .0092228    -3.77   0.000    -.0528637    -.016707
              t |   .0018783   .0002506     7.50   0.000     .0013871    .0023696
              d |   .0619987   .0192648     3.22   0.001     .0242361    .0997613
             td |  -.0001695   .0002865    -0.59   0.554    -.0007311    .0003922
          _cons |   .2654303   .0241213    11.00   0.000      .218148    .3127126
---------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(17, 10596)  =  55.60
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0819
                                                        Adj R-squared = 0.0804
                                                        Root MSE      = 0.4668

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0217704   .0020086    10.84   0.000     .0178333    .0257076
      tenuresqr |  -.0003714    .000083    -4.48   0.000    -.0005341   -.0002088
 birthmonthdum2 |  -.0093179   .0226575    -0.41   0.681    -.0537309    .0350951
 birthmonthdum3 |  -.0327935   .0225357    -1.46   0.146    -.0769678    .0113808
 birthmonthdum4 |  -.0592076   .0234584    -2.52   0.012    -.1051904   -.0132248
 birthmonthdum5 |  -.0176861   .0230259    -0.77   0.442    -.0628212     .027449
 birthmonthdum6 |  -.0311989   .0224164    -1.39   0.164    -.0751393    .0127414
 birthmonthdum7 |  -.0407467   .0227129    -1.79   0.073    -.0852683    .0037749
 birthmonthdum8 |  -.0249824    .022242    -1.12   0.261    -.0685809    .0186161
 birthmonthdum9 |  -.0072628   .0219852    -0.33   0.741     -.050358    .0358323
birthmonthdum10 |  -.0147037   .0209148    -0.70   0.482    -.0557007    .0262932
birthmonthdum11 |  -.0137495   .0220454    -0.62   0.533    -.0569625    .0294635
birthmonthdum12 |  -.0158936   .0221976    -0.72   0.474     -.059405    .0276178
           male |  -.0179563    .009115    -1.97   0.049    -.0358234   -.0000891
              t |   .0013349   .0002477     5.39   0.000     .0008494    .0018204
              d |   .0570785   .0190397     3.00   0.003      .019757       .0944
             td |   .0004483   .0002832     1.58   0.113    -.0001068    .0010034
          _cons |   .1942804   .0238395     8.15   0.000     .1475504    .2410103
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(16)   =     559.35
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .87285

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   2.724503   .7688142     3.54   0.000     1.217655    4.231351
  secgenhighedu |  -2.447873   .8365774    -2.93   0.003    -4.087534   -.8082113
         tenure |   .0339246   .0039233     8.65   0.000     .0262352    .0416141
      tenuresqr |  -.0013663   .0002073    -6.59   0.000    -.0017726   -.0009599
 birthmonthdum2 |    .010792   .0448848     0.24   0.810    -.0771806    .0987646
 birthmonthdum3 |  -.0442887   .0422189    -1.05   0.294    -.1270363    .0384589
 birthmonthdum4 |  -.0205074    .044107    -0.46   0.642    -.1069554    .0659407
 birthmonthdum5 |   .0032976   .0440465     0.07   0.940    -.0830319     .089627
 birthmonthdum6 |   .0254668   .0431723     0.59   0.555    -.0591493    .1100829
 birthmonthdum7 |   .0039065   .0426338     0.09   0.927    -.0796542    .0874671
 birthmonthdum8 |   .0404517    .045649     0.89   0.376    -.0490187    .1299221
 birthmonthdum9 |  -.0159036   .0410588    -0.39   0.699    -.0963774    .0645701
birthmonthdum10 |   .0191605   .0399206     0.48   0.631    -.0590824    .0974033
birthmonthdum11 |   .0191905   .0425613     0.45   0.652    -.0642281    .1026091
birthmonthdum12 |   .0095742   .0422422     0.23   0.821    -.0732189    .0923674
           male |    .321197   .0208963    15.37   0.000      .280241     .362153
          _cons |    7.79612   .0470491   165.70   0.000     7.703906    7.888335
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =   27.406  (p = 0.0000)
  Wu-Hausman F(2,10595)           =  13.7139  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  1.53204  (p = 0.2158)
  Basmann chi2(1)        =  1.52966  (p = 0.2162)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  15.843  Chi-sq(17) P-value = 0.5350

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
birthmont~m2 |     10,614     .078387    .2687923          0          1
birthmonth~3 |     10,614    .0800829    .2714343          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,614    .0686829     .252926          0          1
birthmonth~5 |     10,614    .0737705    .2614093          0          1
birthmonth~6 |     10,614    .0821556    .2746146          0          1
birthmonth~7 |     10,614     .077916    .2680519          0          1
birthmonth~8 |     10,614    .0846995    .2784471          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,614     .089316    .2852128          0          1
birthmont~10 |     10,614    .1104202    .3134276          0          1
birthmont~11 |     10,614    .0876201     .282755          0          1
birthmont~12 |     10,614    .0851705    .2791484          0          1
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992
> ) & inrange(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(31, 10582)  =  46.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1199
                                                        Adj R-squared = 0.1174
                                                        Root MSE      = 0.4670

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0204578   .0020142    10.16   0.000     .0165096     .024406
      tenuresqr |  -.0001372   .0000832    -1.65   0.099    -.0003002    .0000259
 birthmonthdum2 |  -.0294465   .0226838    -1.30   0.194    -.0739109     .015018
 birthmonthdum3 |  -.0368615   .0225732    -1.63   0.103    -.0811091    .0073862
 birthmonthdum4 |   -.068433   .0234887    -2.91   0.004    -.1144752   -.0223908
 birthmonthdum5 |  -.0318936   .0230484    -1.38   0.166    -.0770728    .0132856
 birthmonthdum6 |  -.0472334   .0224439    -2.10   0.035    -.0912277   -.0032392
 birthmonthdum7 |  -.0512124   .0227438    -2.25   0.024    -.0957946   -.0066303
 birthmonthdum8 |  -.0537702   .0222646    -2.42   0.016     -.097413   -.0101275
 birthmonthdum9 |  -.0144644   .0220229    -0.66   0.511    -.0576333    .0287046
birthmonthdum10 |  -.0237005   .0209503    -1.13   0.258    -.0647671    .0173662
birthmonthdum11 |  -.0289637   .0220717    -1.31   0.189    -.0722283     .014301
birthmonthdum12 |  -.0273521   .0222317    -1.23   0.219    -.0709304    .0162262
           male |  -.0321952    .009128    -3.53   0.000    -.0500879   -.0143025
   provincedum2 |   -.190081   .0246571    -7.71   0.000    -.2384135   -.1417484
   provincedum3 |  -.1204112   .0256768    -4.69   0.000    -.1707425   -.0700799
   provincedum4 |  -.1679636   .0248465    -6.76   0.000    -.2166674   -.1192598
   provincedum5 |  -.2352709   .0227701   -10.33   0.000    -.2799047   -.1906371
   provincedum6 |  -.2557404   .0250447   -10.21   0.000    -.3048327    -.206648
   provincedum7 |  -.2416421   .0237362   -10.18   0.000    -.2881695   -.1951148
   provincedum8 |  -.2322032   .0232843    -9.97   0.000    -.2778448   -.1865617
   provincedum9 |  -.2292805   .0239572    -9.57   0.000    -.2762412   -.1823198
  provincedum10 |  -.2314723   .0245307    -9.44   0.000    -.2795571   -.1833875
  provincedum11 |  -.2836456   .0206328   -13.75   0.000    -.3240898   -.2432014
  provincedum12 |  -.2396842   .0255436    -9.38   0.000    -.2897546   -.1896139
  provincedum13 |  -.2462087   .0235232   -10.47   0.000    -.2923185   -.2000988
  provincedum14 |  -.1800876   .0301998    -5.96   0.000    -.2392849   -.1208903
  provincedum15 |  -.1476976   .0304326    -4.85   0.000    -.2073512    -.088044
              t |   .0019393   .0002483     7.81   0.000     .0014525    .0024261
              d |   .0507458   .0190884     2.66   0.008     .0133289    .0881627
             td |  -.0001783   .0002839    -0.63   0.530    -.0007347    .0003782
          _cons |   .4836836   .0290469    16.65   0.000     .4267463    .5406209
---------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(31, 10582)  =  37.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0988
                                                        Adj R-squared = 0.0961
                                                        Root MSE      = 0.4628

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0208214   .0019959    10.43   0.000     .0169091    .0247336
      tenuresqr |  -.0003416   .0000824    -4.14   0.000    -.0005031     -.00018
 birthmonthdum2 |  -.0083062   .0224772    -0.37   0.712    -.0523658    .0357534
 birthmonthdum3 |  -.0346164   .0223676    -1.55   0.122    -.0784612    .0092284
 birthmonthdum4 |  -.0596136   .0232748    -2.56   0.010    -.1052365   -.0139906
 birthmonthdum5 |  -.0181403   .0228385    -0.79   0.427    -.0629081    .0266275
 birthmonthdum6 |  -.0316031   .0222395    -1.42   0.155    -.0751968    .0119905
 birthmonthdum7 |  -.0422497   .0225367    -1.87   0.061    -.0864259    .0019266
 birthmonthdum8 |  -.0266638   .0220618    -1.21   0.227    -.0699092    .0165815
 birthmonthdum9 |  -.0098898   .0218223    -0.45   0.650    -.0526657     .032886
birthmonthdum10 |  -.0116119   .0207596    -0.56   0.576    -.0523046    .0290808
birthmonthdum11 |  -.0126496   .0218707    -0.58   0.563    -.0555203    .0302211
birthmonthdum12 |  -.0158708   .0220293    -0.72   0.471    -.0590523    .0273107
           male |    -.01599   .0090449    -1.77   0.077    -.0337197    .0017398
   provincedum2 |  -.1971839   .0244326    -8.07   0.000    -.2450764   -.1492914
   provincedum3 |  -.1078039    .025443    -4.24   0.000     -.157677   -.0579309
   provincedum4 |  -.1638875   .0246203    -6.66   0.000    -.2121479   -.1156271
   provincedum5 |  -.2207656   .0225628    -9.78   0.000     -.264993   -.1765383
   provincedum6 |  -.2197921   .0248167    -8.86   0.000    -.2684375   -.1711468
   provincedum7 |  -.2223729     .02352    -9.45   0.000    -.2684766   -.1762692
   provincedum8 |  -.2081936   .0230722    -9.02   0.000    -.2534196   -.1629677
   provincedum9 |  -.1928648   .0237391    -8.12   0.000    -.2393979   -.1463317
  provincedum10 |  -.2103964   .0243074    -8.66   0.000    -.2580434   -.1627494
  provincedum11 |  -.2441031    .020445   -11.94   0.000    -.2841791   -.2040271
  provincedum12 |  -.2259246   .0253111    -8.93   0.000     -.275539   -.1763101
  provincedum13 |  -.2249849    .023309    -9.65   0.000    -.2706749   -.1792949
  provincedum14 |   -.191031   .0299248    -6.38   0.000    -.2496893   -.1323727
  provincedum15 |  -.1418767   .0301555    -4.70   0.000    -.2009872   -.0827663
              t |   .0014008   .0002461     5.69   0.000     .0009184    .0018832
              d |   .0463396   .0189146     2.45   0.014     .0092634    .0834159
             td |   .0004221   .0002813     1.50   0.134    -.0001293    .0009734
          _cons |   .3935933   .0287824    13.67   0.000     .3371744    .4500122
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(30)   =     827.72
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      .9037

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   2.975081   .8192307     3.63   0.000     1.369419    4.580744
  secgenhighedu |   -2.76551   .8930277    -3.10   0.002    -4.515812   -1.015208
         tenure |   .0342017   .0040873     8.37   0.000     .0261908    .0422127
      tenuresqr |  -.0013602   .0002199    -6.19   0.000    -.0017911   -.0009293
 birthmonthdum2 |   .0185179   .0467404     0.40   0.692    -.0730917    .1101275
 birthmonthdum3 |  -.0311142   .0437398    -0.71   0.477    -.1168427    .0546143
 birthmonthdum4 |  -.0062926   .0457586    -0.14   0.891    -.0959778    .0833925
 birthmonthdum5 |   .0101051   .0456986     0.22   0.825    -.0794625    .0996727
 birthmonthdum6 |   .0313566   .0447859     0.70   0.484    -.0564221    .1191353
 birthmonthdum7 |   .0069967   .0441914     0.16   0.874    -.0796169    .0936102
 birthmonthdum8 |    .042042   .0476692     0.88   0.378     -.051388    .1354719
 birthmonthdum9 |  -.0165134   .0425746    -0.39   0.698     -.099958    .0669312
birthmonthdum10 |   .0208173    .041413     0.50   0.615    -.0603506    .1019852
birthmonthdum11 |   .0259369   .0442813     0.59   0.558    -.0608528    .1127266
birthmonthdum12 |     .01454   .0438062     0.33   0.740    -.0713186    .1003986
           male |   .3245245   .0216175    15.01   0.000     .2821549    .3668941
   provincedum2 |  -.5691259   .0537753   -10.58   0.000    -.6745236   -.4637282
   provincedum3 |  -.2214359   .0503449    -4.40   0.000    -.3201102   -.1227617
   provincedum4 |  -.4194427   .0505825    -8.29   0.000    -.5185825   -.3203029
   provincedum5 |  -.0446381   .0464972    -0.96   0.337    -.1357708    .0464947
   provincedum6 |  -.1280622   .0529427    -2.42   0.016     -.231828   -.0242965
   provincedum7 |  -.2477633   .0489172    -5.06   0.000    -.3436392   -.1518873
   provincedum8 |  -.4103902   .0475767    -8.63   0.000    -.5036387   -.3171416
   provincedum9 |  -.0627238    .050959    -1.23   0.218    -.1626015     .037154
  provincedum10 |  -.1612128   .0498641    -3.23   0.001    -.2589446   -.0634811
  provincedum11 |   .0010358   .0457127     0.02   0.982    -.0885594    .0906311
  provincedum12 |   -.231506   .0523918    -4.42   0.000    -.3341921   -.1288198
  provincedum13 |  -.1420454   .0486576    -2.92   0.004    -.2374126   -.0466782
  provincedum14 |  -.3563131   .0645198    -5.52   0.000    -.4827696   -.2298565
  provincedum15 |  -.3782887   .0597779    -6.33   0.000    -.4954513   -.2611261
          _cons |   7.990323   .0655752   121.85   0.000     7.861798    8.118848
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  27.3149  (p = 0.0000)
  Wu-Hausman F(2,10581)           =  13.6501  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .980431  (p = 0.3221)
  Basmann chi2(1)        =  .977566  (p = 0.3228)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  20.445  Chi-sq(31) P-value = 0.9258

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
birthmont~m2 |     10,614     .078387    .2687923          0          1
birthmonth~3 |     10,614    .0800829    .2714343          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,614    .0686829     .252926          0          1
birthmonth~5 |     10,614    .0737705    .2614093          0          1
birthmonth~6 |     10,614    .0821556    .2746146          0          1
birthmonth~7 |     10,614     .077916    .2680519          0          1
birthmonth~8 |     10,614    .0846995    .2784471          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,614     .089316    .2852128          0          1
birthmont~10 |     10,614    .1104202    .3134276          0          1
birthmont~11 |     10,614    .0876201     .282755          0          1
birthmont~12 |     10,614    .0851705    .2791484          0          1
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250,
>  25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(16, 5649)   =  27.72
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0728
                                                        Adj R-squared = 0.0702
                                                        Root MSE      = 0.4781

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0135243   .0028179     4.80   0.000     .0080002    .0190484
      tenuresqr |   .0000351   .0001143     0.31   0.759    -.0001889    .0002592
 birthmonthdum2 |  -.0522177   .0319016    -1.64   0.102    -.1147572    .0103217
 birthmonthdum3 |  -.0492322   .0317262    -1.55   0.121    -.1114277    .0129633
 birthmonthdum4 |  -.0623486   .0335874    -1.86   0.063    -.1281928    .0034955
 birthmonthdum5 |  -.0317452   .0320983    -0.99   0.323    -.0946702    .0311799
 birthmonthdum6 |  -.0613941   .0315044    -1.95   0.051    -.1231549    .0003667
 birthmonthdum7 |   .0129675   .0319077     0.41   0.684    -.0495838    .0755188
 birthmonthdum8 |  -.0488272   .0308393    -1.58   0.113    -.1092841    .0116298
 birthmonthdum9 |   .0009626   .0308237     0.03   0.975    -.0594638     .061389
birthmonthdum10 |  -.0335252   .0291904    -1.15   0.251    -.0907495    .0236991
birthmonthdum11 |  -.0406388    .030822    -1.32   0.187    -.1010618    .0197842
birthmonthdum12 |    -.05138   .0312387    -1.64   0.100    -.1126199      .00986
              t |   .0020697   .0003463     5.98   0.000     .0013908    .0027486
              d |   .0597105   .0267063     2.24   0.025     .0073558    .1120652
             td |  -.0008197   .0003972    -2.06   0.039    -.0015983   -.0000412
          _cons |   .3013769   .0332199     9.07   0.000     .2362532    .3665006
---------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(16, 5649)   =  22.61
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0602
                                                        Adj R-squared = 0.0575
                                                        Root MSE      = 0.4716

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0152121   .0027795     5.47   0.000     .0097632    .0206611
      tenuresqr |  -.0001749   .0001127    -1.55   0.121     -.000396    .0000461
 birthmonthdum2 |  -.0302846   .0314677    -0.96   0.336    -.0919734    .0314042
 birthmonthdum3 |  -.0365653   .0312946    -1.17   0.243    -.0979148    .0247842
 birthmonthdum4 |  -.0433372   .0331305    -1.31   0.191    -.1082857    .0216113
 birthmonthdum5 |   -.011374   .0316617    -0.36   0.719    -.0734431    .0506951
 birthmonthdum6 |  -.0595842   .0310759    -1.92   0.055    -.1205048    .0013365
 birthmonthdum7 |   .0084337   .0314736     0.27   0.789    -.0532667    .0701342
 birthmonthdum8 |  -.0185213   .0304198    -0.61   0.543    -.0781558    .0411133
 birthmonthdum9 |   .0125142   .0304045     0.41   0.681    -.0470902    .0721187
birthmonthdum10 |  -.0245937   .0287933    -0.85   0.393    -.0810396    .0318523
birthmonthdum11 |  -.0193571   .0304027    -0.64   0.524    -.0789582    .0402439
birthmonthdum12 |  -.0232526   .0308138    -0.75   0.451    -.0836595    .0371543
              t |   .0014349   .0003416     4.20   0.000     .0007652    .0021046
              d |   .0675499   .0263431     2.56   0.010     .0159074    .1191924
             td |  -.0001756   .0003918    -0.45   0.654    -.0009436    .0005924
          _cons |   .2264171    .032768     6.91   0.000     .1621793     .290655
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(15)   =      68.69
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .87009

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |    2.41092   1.152858     2.09   0.037     .1513599    4.670481
  secgenhighedu |  -2.536253   1.277131    -1.99   0.047    -5.039383   -.0331228
         tenure |    .037879   .0057833     6.55   0.000      .026544    .0492141
      tenuresqr |  -.0014736   .0002958    -4.98   0.000    -.0020533   -.0008939
 birthmonthdum2 |   .0017789   .0618063     0.03   0.977    -.1193593    .1229171
 birthmonthdum3 |   .0035752   .0586964     0.06   0.951    -.1114676    .1186181
 birthmonthdum4 |  -.0197107   .0634086    -0.31   0.756    -.1439892    .1045679
 birthmonthdum5 |   .0489154   .0623172     0.78   0.432    -.0732241     .171055
 birthmonthdum6 |   .0077498    .057885     0.13   0.893    -.1057028    .1212024
 birthmonthdum7 |   .0310496    .058257     0.53   0.594     -.083132    .1452311
 birthmonthdum8 |   .0549051   .0648005     0.85   0.397    -.0721015    .1819118
 birthmonthdum9 |   .0175639   .0573152     0.31   0.759    -.0947717    .1298996
birthmonthdum10 |  -.0102884   .0534675    -0.19   0.847    -.1150828     .094506
birthmonthdum11 |   .0387596   .0597409     0.65   0.516    -.0783305    .1558497
birthmonthdum12 |   .0266526   .0639624     0.42   0.677    -.0987113    .1520165
          _cons |   8.256196   .0626233   131.84   0.000     8.133457    8.378936
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  10.6866  (p = 0.0048)
  Wu-Hausman F(2,5648)            =  5.33639  (p = 0.0048)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  5.50482  (p = 0.0190)
  Basmann chi2(1)        =  5.49364  (p = 0.0191)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.595  Chi-sq(16) P-value = 0.8869

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
birthmont~m2 |      5,666    .0771267     .266816          0          1
birthmonth~3 |      5,666    .0788916    .2695933          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,666    .0637134    .2442632          0          1
birthmonth~5 |      5,666    .0755383    .2642813          0          1
birthmonth~6 |      5,666    .0813625    .2734152          0          1
birthmonth~7 |      5,666    .0776562    .2676534          0          1
birthmonth~8 |      5,666    .0887752     .284444          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,666    .0894811    .2854621          0          1
birthmont~10 |      5,666    .1129545    .3165651          0          1
birthmont~11 |      5,666    .0887752     .284444          0          1
birthmont~12 |      5,666    .0840099    .2774271          0          1
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & i
> nrange(monthlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(30, 5635)   =  19.23
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0929
                                                        Adj R-squared = 0.0881
                                                        Root MSE      = 0.4735

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .012191   .0027998     4.35   0.000     .0067023    .0176796
      tenuresqr |   .0000783   .0001135     0.69   0.490    -.0001442    .0003007
 birthmonthdum2 |  -.0490343   .0316577    -1.55   0.121    -.1110956     .013027
 birthmonthdum3 |  -.0477582    .031477    -1.52   0.129    -.1094653    .0139489
 birthmonthdum4 |   -.065075   .0333143    -1.95   0.051    -.1303839    .0002339
 birthmonthdum5 |  -.0310481   .0318078    -0.98   0.329    -.0934037    .0313075
 birthmonthdum6 |   -.054703   .0312462    -1.75   0.080    -.1159575    .0065515
 birthmonthdum7 |   .0112896   .0316505     0.36   0.721    -.0507575    .0733367
 birthmonthdum8 |  -.0498239   .0305719    -1.63   0.103    -.1097565    .0101087
 birthmonthdum9 |  -.0006898   .0305844    -0.02   0.982    -.0606469    .0592673
birthmonthdum10 |  -.0282702   .0289533    -0.98   0.329    -.0850299    .0284895
birthmonthdum11 |  -.0367851   .0305727    -1.20   0.229    -.0967193    .0231491
birthmonthdum12 |  -.0496643   .0309796    -1.60   0.109    -.1103964    .0110677
   provincedum2 |   -.211175   .0340951    -6.19   0.000    -.2780145   -.1443356
   provincedum3 |  -.1242613   .0359228    -3.46   0.001    -.1946838   -.0538388
   provincedum4 |  -.1870205    .034963    -5.35   0.000    -.2555613   -.1184796
   provincedum5 |  -.2221618   .0319602    -6.95   0.000    -.2848161   -.1595075
   provincedum6 |  -.2469161   .0346227    -7.13   0.000      -.31479   -.1790423
   provincedum7 |  -.2457266   .0337359    -7.28   0.000     -.311862   -.1795913
   provincedum8 |  -.2225585   .0325984    -6.83   0.000    -.2864638   -.1586532
   provincedum9 |  -.2036528   .0332686    -6.12   0.000    -.2688719   -.1384336
  provincedum10 |  -.1972116   .0347153    -5.68   0.000    -.2652669   -.1291564
  provincedum11 |  -.2837207   .0290152    -9.78   0.000    -.3406016   -.2268398
  provincedum12 |  -.2192773   .0362456    -6.05   0.000    -.2903326    -.148222
  provincedum13 |  -.2362276   .0333621    -7.08   0.000    -.3016301   -.1708251
  provincedum14 |  -.1644337   .0433529    -3.79   0.000     -.249422   -.0794454
  provincedum15 |  -.1029349   .0430324    -2.39   0.017     -.187295   -.0185749
              t |    .002081    .000344     6.05   0.000     .0014065    .0027554
              d |   .0503075   .0265191     1.90   0.058    -.0016801    .1022951
             td |  -.0007801   .0003945    -1.98   0.048    -.0015536   -6.73e-06
          _cons |   .5116442   .0405533    12.62   0.000     .4321441    .5911443
---------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(30, 5635)   =  15.59
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0766
                                                        Adj R-squared = 0.0717
                                                        Root MSE      = 0.4681

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0141512   .0027676     5.11   0.000     .0087257    .0195767
      tenuresqr |  -.0001402   .0001122    -1.25   0.212    -.0003601    .0000798
 birthmonthdum2 |  -.0283409   .0312933    -0.91   0.365    -.0896878     .033006
 birthmonthdum3 |  -.0350716   .0311147    -1.13   0.260    -.0960684    .0259252
 birthmonthdum4 |  -.0448647   .0329308    -1.36   0.173    -.1094218    .0196924
 birthmonthdum5 |  -.0111687   .0314417    -0.36   0.722    -.0728065    .0504691
 birthmonthdum6 |  -.0537215   .0308865    -1.74   0.082    -.1142709    .0068279
 birthmonthdum7 |   .0064468   .0312861     0.21   0.837     -.054886    .0677797
 birthmonthdum8 |  -.0196219   .0302199    -0.65   0.516    -.0788646    .0396208
 birthmonthdum9 |   .0114993   .0302323     0.38   0.704    -.0477677    .0707663
birthmonthdum10 |  -.0206499   .0286201    -0.72   0.471    -.0767562    .0354564
birthmonthdum11 |  -.0163086   .0302208    -0.54   0.589    -.0755529    .0429357
birthmonthdum12 |  -.0219155    .030623    -0.72   0.474    -.0819485    .0381174
   provincedum2 |  -.2252047   .0337026    -6.68   0.000    -.2912748   -.1591346
   provincedum3 |  -.1277367   .0355093    -3.60   0.000    -.1973486   -.0581249
   provincedum4 |   -.192444   .0345605    -5.57   0.000    -.2601959   -.1246921
   provincedum5 |  -.2141983   .0315923    -6.78   0.000    -.2761314   -.1522652
   provincedum6 |  -.2139067   .0342242    -6.25   0.000    -.2809993   -.1468142
   provincedum7 |  -.2206443   .0333476    -6.62   0.000    -.2860184   -.1552702
   provincedum8 |  -.1984264   .0322231    -6.16   0.000    -.2615961   -.1352567
   provincedum9 |   -.178873   .0328856    -5.44   0.000    -.2433415   -.1144046
  provincedum10 |   -.175977   .0343157    -5.13   0.000    -.2432489   -.1087051
  provincedum11 |  -.2511279   .0286812    -8.76   0.000    -.3073541   -.1949017
  provincedum12 |  -.2074164   .0358284    -5.79   0.000    -.2776538    -.137179
  provincedum13 |  -.2259467   .0329781    -6.85   0.000    -.2905964    -.161297
  provincedum14 |  -.1651709   .0428538    -3.85   0.000    -.2491809   -.0811609
  provincedum15 |   -.108882   .0425371    -2.56   0.011     -.192271    -.025493
              t |   .0014566   .0003401     4.28   0.000     .0007899    .0021233
              d |   .0585983   .0262138     2.24   0.025     .0072091    .1099875
             td |  -.0001566     .00039    -0.40   0.688    -.0009211    .0006079
          _cons |   .4225631   .0400865    10.54   0.000     .3439781    .5011481
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(29)   =     215.37
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .90592

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   2.695982   1.241058     2.17   0.030     .2635532    5.128411
  secgenhighedu |  -2.886437   1.375822    -2.10   0.036    -5.582998   -.1898761
         tenure |    .038187   .0061794     6.18   0.000     .0260755    .0502984
      tenuresqr |  -.0014736   .0003189    -4.62   0.000    -.0020987   -.0008485
 birthmonthdum2 |  -.0176289    .064257    -0.27   0.784    -.1435703    .1083126
 birthmonthdum3 |   .0022921   .0612744     0.04   0.970    -.1178036    .1223877
 birthmonthdum4 |  -.0177139    .066628    -0.27   0.790    -.1483025    .1128746
 birthmonthdum5 |   .0439773   .0649845     0.68   0.499    -.0833899    .1713446
 birthmonthdum6 |   -.001672   .0603314    -0.03   0.978    -.1199194    .1165754
 birthmonthdum7 |   .0187746   .0608419     0.31   0.758    -.1004733    .1380225
 birthmonthdum8 |   .0468374   .0679592     0.69   0.491    -.0863602    .1800349
 birthmonthdum9 |   .0099458    .060079     0.17   0.869    -.1078069    .1276984
birthmonthdum10 |  -.0175603   .0556592    -0.32   0.752    -.1266504    .0915298
birthmonthdum11 |   .0331546   .0623466     0.53   0.595    -.0890425    .1553516
birthmonthdum12 |   .0276389   .0670073     0.41   0.680     -.103693    .1589707
   provincedum2 |   -.583198    .084745    -6.88   0.000    -.7492952   -.4171008
   provincedum3 |  -.2228704   .0730738    -3.05   0.002    -.3660924   -.0796484
   provincedum4 |  -.4618496   .0783585    -5.89   0.000    -.6154295   -.3082697
   provincedum5 |  -.0830088   .0678719    -1.22   0.221    -.2160354    .0500177
   provincedum6 |  -.1454274   .0718397    -2.02   0.043    -.2862306   -.0046242
   provincedum7 |  -.2506313   .0696711    -3.60   0.000    -.3871842   -.1140785
   provincedum8 |  -.4523459   .0661972    -6.83   0.000    -.5820901   -.3226017
   provincedum9 |   -.104499   .0674165    -1.55   0.121     -.236633    .0276349
  provincedum10 |  -.1866079    .069667    -2.68   0.007    -.3231528   -.0500629
  provincedum11 |  -.0724854   .0623023    -1.16   0.245    -.1945956    .0496249
  provincedum12 |  -.2693183   .0744352    -3.62   0.000    -.4152087   -.1234279
  provincedum13 |  -.2264487   .0713309    -3.17   0.002    -.3662547   -.0866426
  provincedum14 |  -.4070455   .0885141    -4.60   0.000    -.5805299   -.2335612
  provincedum15 |  -.4234478   .0858288    -4.93   0.000    -.5916691   -.2552265
          _cons |   8.499888   .0898596    94.59   0.000     8.323767     8.67601
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  14.0413  (p = 0.0009)
  Wu-Hausman F(2,5634)            =  6.99834  (p = 0.0009)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  4.53274  (p = 0.0333)
  Basmann chi2(1)        =  4.51155  (p = 0.0337)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  16.425  Chi-sq(30) P-value = 0.9789

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
birthmont~m2 |      5,666    .0771267     .266816          0          1
birthmonth~3 |      5,666    .0788916    .2695933          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,666    .0637134    .2442632          0          1
birthmonth~5 |      5,666    .0755383    .2642813          0          1
birthmonth~6 |      5,666    .0813625    .2734152          0          1
birthmonth~7 |      5,666    .0776562    .2676534          0          1
birthmonth~8 |      5,666    .0887752     .284444          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,666    .0894811    .2854621          0          1
birthmont~10 |      5,666    .1129545    .3165651          0          1
birthmont~11 |      5,666    .0887752     .284444          0          1
birthmont~12 |      5,666    .0840099    .2774271          0          1
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250,
>  25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(16, 4931)   =  49.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1385
                                                        Adj R-squared = 0.1357
                                                        Root MSE      = 0.4633

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .029702   .0029307    10.13   0.000     .0239566    .0354474
      tenuresqr |  -.0003737   .0001236    -3.02   0.003    -.0006161   -.0001313
 birthmonthdum2 |  -.0030518   .0327848    -0.09   0.926    -.0673245     .061221
 birthmonthdum3 |  -.0158755   .0326178    -0.49   0.626    -.0798209    .0480698
 birthmonthdum4 |  -.0668267   .0333788    -2.00   0.045    -.1322641   -.0013893
 birthmonthdum5 |  -.0284847   .0337183    -0.84   0.398    -.0945876    .0376182
 birthmonthdum6 |  -.0299933   .0325231    -0.92   0.356    -.0937531    .0337664
 birthmonthdum7 |   -.118265   .0329648    -3.59   0.000    -.1828907   -.0536393
 birthmonthdum8 |  -.0523819   .0327837    -1.60   0.110    -.1166525    .0118887
 birthmonthdum9 |  -.0275337     .03197    -0.86   0.389    -.0902093    .0351418
birthmonthdum10 |  -.0179572   .0305709    -0.59   0.557    -.0778898    .0419753
birthmonthdum11 |  -.0143907   .0321578    -0.45   0.655    -.0774343    .0486529
birthmonthdum12 |  -.0010603   .0321358    -0.03   0.974    -.0640609    .0619402
              t |   .0016287   .0003616     4.50   0.000     .0009197    .0023376
              d |   .0679936   .0277002     2.45   0.014     .0136888    .1222984
             td |   .0005519   .0004121     1.34   0.181    -.0002559    .0013597
          _cons |   .1919299   .0338418     5.67   0.000     .1255849    .2582748
---------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(16, 4931)   =  40.17
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1153
                                                        Adj R-squared = 0.1125
                                                        Root MSE      = 0.4596

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0285824   .0029074     9.83   0.000     .0228825    .0342822
      tenuresqr |  -.0005823   .0001227    -4.75   0.000    -.0008228   -.0003418
 birthmonthdum2 |   .0159078   .0325248     0.49   0.625    -.0478553    .0796709
 birthmonthdum3 |  -.0277329   .0323591    -0.86   0.391    -.0911712    .0357054
 birthmonthdum4 |  -.0733699   .0331142    -2.22   0.027    -.1382884   -.0084514
 birthmonthdum5 |  -.0240845   .0334509    -0.72   0.472    -.0896633    .0414942
 birthmonthdum6 |  -.0003564   .0322652    -0.01   0.991    -.0636106    .0628977
 birthmonthdum7 |  -.0949902   .0327034    -2.90   0.004    -.1591034    -.030877
 birthmonthdum8 |  -.0309409   .0325237    -0.95   0.341    -.0947019    .0328201
 birthmonthdum9 |  -.0321907   .0317165    -1.01   0.310    -.0943692    .0299878
birthmonthdum10 |  -.0021839   .0303285    -0.07   0.943    -.0616412    .0572734
birthmonthdum11 |  -.0055726   .0319028    -0.17   0.861    -.0681163    .0569711
birthmonthdum12 |  -.0078282    .031881    -0.25   0.806    -.0703292    .0546728
              t |   .0011876   .0003587     3.31   0.001     .0004843    .0018909
              d |   .0487938   .0274806     1.78   0.076    -.0050803     .102668
             td |   .0011467   .0004088     2.81   0.005     .0003453    .0019481
          _cons |   .1420187   .0335734     4.23   0.000     .0761998    .2078376
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(15)   =     259.78
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .89159

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   2.973233   .9693385     3.07   0.002     1.073364    4.873101
  secgenhighedu |  -2.328487   1.035979    -2.25   0.025    -4.358969    -.298005
         tenure |   .0245241   .0059758     4.10   0.000     .0128117    .0362364
      tenuresqr |  -.0010788   .0003016    -3.58   0.000    -.0016699   -.0004877
 birthmonthdum2 |  -.0003719   .0656048    -0.01   0.995     -.128955    .1282111
 birthmonthdum3 |  -.1168153   .0643693    -1.81   0.070    -.2429769    .0093463
 birthmonthdum4 |  -.0205586   .0654087    -0.31   0.753    -.1487572      .10764
 birthmonthdum5 |  -.0611821   .0648926    -0.94   0.346    -.1883693     .066005
 birthmonthdum6 |    .013739   .0690726     0.20   0.842    -.1216409    .1491188
 birthmonthdum7 |   .0146324   .0656752     0.22   0.824    -.1140887    .1433534
 birthmonthdum8 |   .0181132   .0658601     0.28   0.783    -.1109703    .1471966
 birthmonthdum9 |  -.0490983   .0618023    -0.79   0.427    -.1702286    .0720319
birthmonthdum10 |   .0466773   .0606669     0.77   0.442    -.0722277    .1655822
birthmonthdum11 |  -.0140055   .0623624    -0.22   0.822    -.1362336    .1082226
birthmonthdum12 |  -.0321998   .0622076    -0.52   0.605    -.1541246    .0897249
          _cons |   7.694988    .060272   127.67   0.000     7.576857    7.813118
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  61.3493  (p = 0.0000)
  Wu-Hausman F(2,4930)            =  30.9468  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .186429  (p = 0.6659)
  Basmann chi2(1)        =  .185795  (p = 0.6664)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.510  Chi-sq(16) P-value = 0.8909

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
birthmont~m2 |      4,948    .0798302    .2710576          0          1
birthmonth~3 |      4,948     .081447    .2735481          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,948    .0743735    .2624042          0          1
birthmonth~5 |      4,948    .0717462    .2580932          0          1
birthmonth~6 |      4,948    .0830639    .2760066          0          1
birthmonth~7 |      4,948    .0782134    .2685343          0          1
birthmonth~8 |      4,948    .0800323    .2713707          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,948    .0891269    .2849557          0          1
birthmont~10 |      4,948    .1075182    .3098022          0          1
birthmont~11 |      4,948    .0862975    .2808312          0          1
birthmont~12 |      4,948    .0864996    .2811288          0          1
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & i
> nrange(monthlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(30, 4917)   =  31.89
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1629
                                                        Adj R-squared = 0.1578
                                                        Root MSE      = 0.4573

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0286971   .0029005     9.89   0.000     .0230109    .0343833
      tenuresqr |   -.000345   .0001225    -2.82   0.005    -.0005851   -.0001049
 birthmonthdum2 |  -.0070847   .0324009    -0.22   0.827    -.0706049    .0564354
 birthmonthdum3 |  -.0251294   .0322938    -0.78   0.437    -.0884397    .0381808
 birthmonthdum4 |  -.0678211    .033017    -2.05   0.040    -.1325493    -.003093
 birthmonthdum5 |   -.030816   .0333319    -0.92   0.355    -.0961614    .0345294
 birthmonthdum6 |  -.0375565   .0321418    -1.17   0.243    -.1005688    .0254558
 birthmonthdum7 |  -.1203971    .032578    -3.70   0.000    -.1842647   -.0565296
 birthmonthdum8 |  -.0564809   .0323776    -1.74   0.081    -.1199555    .0069936
 birthmonthdum9 |  -.0335198   .0316045    -1.06   0.289    -.0954787     .028439
birthmonthdum10 |  -.0172111   .0302351    -0.57   0.569    -.0764855    .0420633
birthmonthdum11 |  -.0179943    .031793    -0.57   0.571    -.0803227    .0443341
birthmonthdum12 |  -.0024077   .0317739    -0.08   0.940    -.0646988    .0598834
   provincedum2 |  -.1562493   .0356825    -4.38   0.000    -.2262028   -.0862957
   provincedum3 |  -.1090883   .0366081    -2.98   0.003    -.1808565   -.0373202
   provincedum4 |  -.1455314   .0351534    -4.14   0.000    -.2144478   -.0766149
   provincedum5 |  -.2454248   .0323087    -7.60   0.000    -.3087643   -.1820854
   provincedum6 |  -.2609145   .0362271    -7.20   0.000    -.3319358   -.1898932
   provincedum7 |  -.2342037   .0332599    -7.04   0.000    -.2994079   -.1689994
   provincedum8 |  -.2390334   .0331293    -7.22   0.000    -.3039817   -.1740852
   provincedum9 |  -.2623957   .0344851    -7.61   0.000    -.3300019   -.1947896
  provincedum10 |  -.2637123   .0344908    -7.65   0.000    -.3313296    -.196095
  provincedum11 |  -.2783214   .0292463    -9.52   0.000    -.3356573   -.2209855
  provincedum12 |  -.2544147   .0358093    -7.10   0.000     -.324617   -.1842124
  provincedum13 |  -.2558715   .0330008    -7.75   0.000    -.3205679   -.1911751
  provincedum14 |  -.1903181   .0418687    -4.55   0.000    -.2723994   -.1082368
  provincedum15 |  -.1925985   .0428436    -4.50   0.000    -.2765911    -.108606
              t |   .0017654   .0003578     4.93   0.000     .0010639    .0024669
              d |   .0563614    .027415     2.06   0.040     .0026157     .110107
             td |   .0004541   .0004075     1.11   0.265    -.0003448    .0012529
          _cons |   .4190682   .0407558    10.28   0.000     .3391686    .4989678
---------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(30, 4917)   =  25.64
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1353
                                                        Adj R-squared = 0.1300
                                                        Root MSE      = 0.4550

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0277038   .0028861     9.60   0.000     .0220458    .0333618
      tenuresqr |   -.000556   .0001219    -4.56   0.000    -.0007949   -.0003171
 birthmonthdum2 |   .0136004   .0322402     0.42   0.673    -.0496047    .0768056
 birthmonthdum3 |  -.0342967   .0321337    -1.07   0.286     -.097293    .0286996
 birthmonthdum4 |  -.0716831   .0328533    -2.18   0.029    -.1360903    -.007276
 birthmonthdum5 |  -.0252846   .0331666    -0.76   0.446    -.0903059    .0397368
 birthmonthdum6 |  -.0061339   .0319824    -0.19   0.848    -.0688336    .0565659
 birthmonthdum7 |  -.0966335   .0324165    -2.98   0.003    -.1601843   -.0330827
 birthmonthdum8 |  -.0339084    .032217    -1.05   0.293    -.0970681    .0292514
 birthmonthdum9 |   -.037127   .0314477    -1.18   0.238    -.0987785    .0245246
birthmonthdum10 |  -.0003359   .0300852    -0.01   0.991    -.0593164    .0586445
birthmonthdum11 |  -.0077096   .0316353    -0.24   0.807    -.0697289    .0543097
birthmonthdum12 |  -.0086547   .0316164    -0.27   0.784    -.0706368    .0533275
   provincedum2 |  -.1545329   .0355055    -4.35   0.000    -.2241395   -.0849263
   provincedum3 |  -.0786936   .0364265    -2.16   0.031    -.1501058   -.0072814
   provincedum4 |  -.1303995   .0349791    -3.73   0.000    -.1989742   -.0618249
   provincedum5 |  -.2243339   .0321485    -6.98   0.000    -.2873592   -.1613085
   provincedum6 |  -.2219301   .0360474    -6.16   0.000    -.2925992    -.151261
   provincedum7 |  -.2205102    .033095    -6.66   0.000    -.2853911   -.1556293
   provincedum8 |  -.2156579    .032965    -6.54   0.000     -.280284   -.1510317
   provincedum9 |  -.2104257   .0343141    -6.13   0.000    -.2776966   -.1431548
  provincedum10 |  -.2424455   .0343197    -7.06   0.000    -.3097275   -.1751635
  provincedum11 |  -.2312681   .0291013    -7.95   0.000    -.2883197   -.1742166
  provincedum12 |  -.2398586   .0356317    -6.73   0.000    -.3097128   -.1700045
  provincedum13 |  -.2234071   .0328372    -6.80   0.000    -.2877827   -.1590316
  provincedum14 |  -.2113068   .0416611    -5.07   0.000    -.2929811   -.1296325
  provincedum15 |  -.1729101   .0426311    -4.06   0.000    -.2564861    -.089334
              t |   .0013292   .0003561     3.73   0.000     .0006312    .0020272
              d |   .0370271   .0272791     1.36   0.175     -.016452    .0905062
             td |   .0010282   .0004055     2.54   0.011     .0002333    .0018231
          _cons |   .3446893   .0405537     8.50   0.000     .2651859    .4241926
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(29)   =     422.37
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .89388

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   3.073329   .9942518     3.09   0.002     1.124631    5.022027
  secgenhighedu |  -2.495203   1.067083    -2.34   0.019    -4.586647   -.4037581
         tenure |    .024625   .0059683     4.13   0.000     .0129272    .0363227
      tenuresqr |  -.0010303    .000308    -3.34   0.001     -.001634   -.0004265
 birthmonthdum2 |   .0387563   .0664637     0.58   0.560    -.0915103    .1690228
 birthmonthdum3 |  -.0792531   .0643436    -1.23   0.218    -.2053642     .046858
 birthmonthdum4 |   .0127041   .0653508     0.19   0.846    -.1153811    .1407894
 birthmonthdum5 |  -.0357572    .065206    -0.55   0.583    -.1635587    .0920443
 birthmonthdum6 |   .0362556    .070238     0.52   0.606    -.1014083    .1739195
 birthmonthdum7 |   .0342177   .0660058     0.52   0.604    -.0951512    .1635867
 birthmonthdum8 |    .029134   .0664568     0.44   0.661     -.101119    .1593869
 birthmonthdum9 |  -.0376453   .0620047    -0.61   0.544    -.1591724    .0838818
birthmonthdum10 |   .0606177   .0613536     0.99   0.323    -.0596331    .1808684
birthmonthdum11 |   .0063622   .0628429     0.10   0.919    -.1168076     .129532
birthmonthdum12 |  -.0172115   .0624345    -0.28   0.783    -.1395808    .1051579
   provincedum2 |  -.5906693   .0718283    -8.22   0.000    -.7314502   -.4498884
   provincedum3 |  -.2413407   .0763292    -3.16   0.002    -.3909431   -.0917383
   provincedum4 |  -.3994073   .0703436    -5.68   0.000    -.5372782   -.2615363
   provincedum5 |  -.0137181   .0657351    -0.21   0.835    -.1425565    .1151202
   provincedum6 |  -.1337347   .0773476    -1.73   0.084    -.2853332    .0178639
   provincedum7 |  -.2584641   .0684229    -3.78   0.000    -.3925706   -.1243576
   provincedum8 |   -.371471   .0680143    -5.46   0.000    -.5047767   -.2381653
   provincedum9 |   -.022105    .078914    -0.28   0.779    -.1767736    .1325637
  provincedum10 |  -.1248831   .0707614    -1.76   0.078    -.2635729    .0138066
  provincedum11 |   .0546656    .067572     0.81   0.419    -.0777732    .1871043
  provincedum12 |  -.1952129   .0735463    -2.65   0.008    -.3393611   -.0510647
  provincedum13 |  -.0743919   .0699926    -1.06   0.288     -.211575    .0627912
  provincedum14 |  -.2921441   .0918274    -3.18   0.001    -.4721224   -.1121658
  provincedum15 |  -.3060399   .0850653    -3.60   0.000    -.4727648   -.1393151
          _cons |   7.853764   .0862851    91.02   0.000     7.684648     8.02288
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  55.8024  (p = 0.0000)
  Wu-Hausman F(2,4916)            =   28.037  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .350261  (p = 0.5540)
  Basmann chi2(1)        =  .348091  (p = 0.5552)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  13.919  Chi-sq(30) P-value = 0.9946

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
birthmont~m2 |      4,948    .0798302    .2710576          0          1
birthmonth~3 |      4,948     .081447    .2735481          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,948    .0743735    .2624042          0          1
birthmonth~5 |      4,948    .0717462    .2580932          0          1
birthmonth~6 |      4,948    .0830639    .2760066          0          1
birthmonth~7 |      4,948    .0782134    .2685343          0          1
birthmonth~8 |      4,948    .0800323    .2713707          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,948    .0891269    .2849557          0          1
birthmont~10 |      4,948    .1075182    .3098022          0          1
birthmont~11 |      4,948    .0862975    .2808312          0          1
birthmont~12 |      4,948    .0864996    .2811288          0          1
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male (hig
> heredu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) &
>  educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(17, 10596)  =  68.32
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0988
                                                        Adj R-squared = 0.0973
                                                        Root MSE      = 0.4723

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0216093   .0020323    10.63   0.000     .0176256     .025593
      tenuresqr |  -.0001721   .0000839    -2.05   0.040    -.0003366   -7.55e-06
 birthmonthdum2 |  -.0302216   .0229253    -1.32   0.187    -.0751596    .0147163
 birthmonthdum3 |  -.0339188   .0228021    -1.49   0.137    -.0786152    .0107776
 birthmonthdum4 |  -.0666227   .0237356    -2.81   0.005     -.113149   -.0200964
 birthmonthdum5 |   -.031314   .0232981    -1.34   0.179    -.0769826    .0143546
 birthmonthdum6 |  -.0468303   .0226813    -2.06   0.039      -.09129   -.0023706
 birthmonthdum7 |  -.0495222   .0229814    -2.15   0.031    -.0945701   -.0044744
 birthmonthdum8 |  -.0515034   .0225049    -2.29   0.022    -.0956172   -.0073895
 birthmonthdum9 |  -.0114459   .0222451    -0.51   0.607    -.0550504    .0321586
birthmonthdum10 |  -.0272027    .021162    -1.29   0.199    -.0686842    .0142788
birthmonthdum11 |  -.0297289   .0223059    -1.33   0.183    -.0734527    .0139949
birthmonthdum12 |  -.0274784   .0224599    -1.22   0.221    -.0715041    .0165474
           male |  -.0347854   .0092228    -3.77   0.000    -.0528637    -.016707
              t |   .0018783   .0002506     7.50   0.000     .0013871    .0023696
              d |   .0619987   .0192648     3.22   0.001     .0242361    .0997613
             td |  -.0001695   .0002865    -0.59   0.554    -.0007311    .0003922
          _cons |   .2654303   .0241213    11.00   0.000      .218148    .3127126
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(15)   =     975.05
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1162
                                                  Root MSE        =     .65602

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .4818066   .0452136    10.66   0.000     .3931896    .5704237
         tenure |   .0316611   .0028908    10.95   0.000     .0259953    .0373269
      tenuresqr |  -.0009544   .0001144    -8.34   0.000    -.0011786   -.0007302
 birthmonthdum2 |  -.0320785   .0318868    -1.01   0.314    -.0945756    .0304186
 birthmonthdum3 |  -.0389056   .0317009    -1.23   0.220    -.1010383     .023227
 birthmonthdum4 |  -.0250184   .0331298    -0.76   0.450    -.0899516    .0399148
 birthmonthdum5 |  -.0239943   .0323538    -0.74   0.458    -.0874067     .039418
 birthmonthdum6 |  -.0045285   .0315196    -0.14   0.886    -.0663057    .0572487
 birthmonthdum7 |  -.0051011   .0319592    -0.16   0.873      -.06774    .0575377
 birthmonthdum8 |  -.0142565   .0312993    -0.46   0.649    -.0756019    .0470889
 birthmonthdum9 |  -.0214212   .0308265    -0.69   0.487    -.0818401    .0389977
birthmonthdum10 |   -.004518   .0293807    -0.15   0.878    -.0621031    .0530672
birthmonthdum11 |  -.0117641   .0309845    -0.38   0.704    -.0724925    .0489643
birthmonthdum12 |  -.0135646   .0311872    -0.43   0.664    -.0746904    .0475613
           male |   .2863031   .0128967    22.20   0.000      .261026    .3115801
          _cons |     7.8625   .0309793   253.80   0.000     7.801781    7.923218
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  11.8655  (p = 0.0006)
  Wu-Hausman F(1,10597)           =  11.8597  (p = 0.0006)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  17.8691  (p = 0.0001)
  Basmann chi2(2)        =  17.8689  (p = 0.0001)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  29.558  Chi-sq(17) P-value = 0.0297

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
birthmont~m2 |     10,614     .078387    .2687923          0          1
birthmonth~3 |     10,614    .0800829    .2714343          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,614    .0686829     .252926          0          1
birthmonth~5 |     10,614    .0737705    .2614093          0          1
birthmonth~6 |     10,614    .0821556    .2746146          0          1
birthmonth~7 |     10,614     .077916    .2680519          0          1
birthmonth~8 |     10,614    .0846995    .2784471          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,614     .089316    .2852128          0          1
birthmont~10 |     10,614    .1104202    .3134276          0          1
birthmont~11 |     10,614    .0876201     .282755          0          1
birthmont~12 |     10,614    .0851705    .2791484          0          1
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male prov
> incedum2-provincedum15 (higheredu  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(m
> onthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(31, 10582)  =  46.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1199
                                                        Adj R-squared = 0.1174
                                                        Root MSE      = 0.4670

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0204578   .0020142    10.16   0.000     .0165096     .024406
      tenuresqr |  -.0001372   .0000832    -1.65   0.099    -.0003002    .0000259
 birthmonthdum2 |  -.0294465   .0226838    -1.30   0.194    -.0739109     .015018
 birthmonthdum3 |  -.0368615   .0225732    -1.63   0.103    -.0811091    .0073862
 birthmonthdum4 |   -.068433   .0234887    -2.91   0.004    -.1144752   -.0223908
 birthmonthdum5 |  -.0318936   .0230484    -1.38   0.166    -.0770728    .0132856
 birthmonthdum6 |  -.0472334   .0224439    -2.10   0.035    -.0912277   -.0032392
 birthmonthdum7 |  -.0512124   .0227438    -2.25   0.024    -.0957946   -.0066303
 birthmonthdum8 |  -.0537702   .0222646    -2.42   0.016     -.097413   -.0101275
 birthmonthdum9 |  -.0144644   .0220229    -0.66   0.511    -.0576333    .0287046
birthmonthdum10 |  -.0237005   .0209503    -1.13   0.258    -.0647671    .0173662
birthmonthdum11 |  -.0289637   .0220717    -1.31   0.189    -.0722283     .014301
birthmonthdum12 |  -.0273521   .0222317    -1.23   0.219    -.0709304    .0162262
           male |  -.0321952    .009128    -3.53   0.000    -.0500879   -.0143025
   provincedum2 |   -.190081   .0246571    -7.71   0.000    -.2384135   -.1417484
   provincedum3 |  -.1204112   .0256768    -4.69   0.000    -.1707425   -.0700799
   provincedum4 |  -.1679636   .0248465    -6.76   0.000    -.2166674   -.1192598
   provincedum5 |  -.2352709   .0227701   -10.33   0.000    -.2799047   -.1906371
   provincedum6 |  -.2557404   .0250447   -10.21   0.000    -.3048327    -.206648
   provincedum7 |  -.2416421   .0237362   -10.18   0.000    -.2881695   -.1951148
   provincedum8 |  -.2322032   .0232843    -9.97   0.000    -.2778448   -.1865617
   provincedum9 |  -.2292805   .0239572    -9.57   0.000    -.2762412   -.1823198
  provincedum10 |  -.2314723   .0245307    -9.44   0.000    -.2795571   -.1833875
  provincedum11 |  -.2836456   .0206328   -13.75   0.000    -.3240898   -.2432014
  provincedum12 |  -.2396842   .0255436    -9.38   0.000    -.2897546   -.1896139
  provincedum13 |  -.2462087   .0235232   -10.47   0.000    -.2923185   -.2000988
  provincedum14 |  -.1800876   .0301998    -5.96   0.000    -.2392849   -.1208903
  provincedum15 |  -.1476976   .0304326    -4.85   0.000    -.2073512    -.088044
              t |   .0019393   .0002483     7.81   0.000     .0014525    .0024261
              d |   .0507458   .0190884     2.66   0.008     .0133289    .0881627
             td |  -.0001783   .0002839    -0.63   0.530    -.0007347    .0003782
          _cons |   .4836836   .0290469    16.65   0.000     .4267463    .5406209
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(29)   =    1647.37
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1671
                                                  Root MSE        =     .63685

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .4456017   .0443507    10.05   0.000     .3586761    .5325274
         tenure |   .0311731   .0027967    11.15   0.000     .0256916    .0366545
      tenuresqr |   -.000885    .000111    -7.98   0.000    -.0011025   -.0006675
 birthmonthdum2 |  -.0307354   .0309731    -0.99   0.321    -.0914417    .0299708
 birthmonthdum3 |  -.0273899   .0308125    -0.89   0.374    -.0877814    .0330016
 birthmonthdum4 |  -.0146936   .0321901    -0.46   0.648    -.0777851    .0483978
 birthmonthdum5 |   -.020904   .0314219    -0.67   0.506    -.0824899    .0406819
 birthmonthdum6 |  -.0022722   .0306195    -0.07   0.941    -.0622853     .057741
 birthmonthdum7 |  -.0032347   .0310553    -0.10   0.917    -.0641018    .0576325
 birthmonthdum8 |  -.0207283   .0304051    -0.68   0.495    -.0803211    .0388646
 birthmonthdum9 |  -.0233313   .0299629    -0.78   0.436    -.0820574    .0353949
birthmonthdum10 |   -.005709   .0285533    -0.20   0.842    -.0616725    .0502545
birthmonthdum11 |  -.0102579   .0300991    -0.34   0.733    -.0692511    .0487352
birthmonthdum12 |  -.0112906   .0303062    -0.37   0.709    -.0706896    .0481084
           male |   .2863942   .0125216    22.87   0.000     .2618523     .310936
   provincedum2 |  -.5023162    .034713   -14.47   0.000    -.5703523     -.43428
   provincedum3 |  -.2298415   .0354273    -6.49   0.000    -.2992777   -.1604052
   provincedum4 |  -.3890101   .0349671   -11.13   0.000    -.4575444   -.3204758
   provincedum5 |  -.0286384   .0325644    -0.88   0.379    -.0924635    .0351867
   provincedum6 |  -.1698788   .0360757    -4.71   0.000    -.2405858   -.0991719
   provincedum7 |  -.2433857   .0344584    -7.06   0.000    -.3109229   -.1758485
   provincedum8 |  -.4226637   .0334115   -12.65   0.000    -.4881491   -.3571783
   provincedum9 |  -.1079913   .0344025    -3.14   0.002    -.1754189   -.0405637
  provincedum10 |  -.1634362   .0351364    -4.65   0.000    -.2323022   -.0945701
  provincedum11 |  -.0416027   .0307185    -1.35   0.176    -.1018098    .0186045
  provincedum12 |  -.2159713   .0367518    -5.88   0.000    -.2880035   -.1439392
  provincedum13 |  -.1453108   .0342818    -4.24   0.000    -.2125019   -.0781197
  provincedum14 |  -.2808783   .0421032    -6.67   0.000    -.3633989   -.1983576
  provincedum15 |    -.35907   .0418989    -8.57   0.000    -.4411903   -.2769497
          _cons |   8.067633   .0427321   188.80   0.000      7.98388    8.151386
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  7.69261  (p = 0.0055)
  Wu-Hausman F(1,10583)           =  7.67571  (p = 0.0056)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  21.2846  (p = 0.0000)
  Basmann chi2(2)        =  21.2631  (p = 0.0000)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  59.098  Chi-sq(31) P-value = 0.0017

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
birthmont~m2 |     10,614     .078387    .2687923          0          1
birthmonth~3 |     10,614    .0800829    .2714343          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,614    .0686829     .252926          0          1
birthmonth~5 |     10,614    .0737705    .2614093          0          1
birthmonth~6 |     10,614    .0821556    .2746146          0          1
birthmonth~7 |     10,614     .077916    .2680519          0          1
birthmonth~8 |     10,614    .0846995    .2784471          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,614     .089316    .2852128          0          1
birthmont~10 |     10,614    .1104202    .3134276          0          1
birthmont~11 |     10,614    .0876201     .282755          0          1
birthmont~12 |     10,614    .0851705    .2791484          0          1
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & mal
> e == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(16, 5649)   =  27.72
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0728
                                                        Adj R-squared = 0.0702
                                                        Root MSE      = 0.4781

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0135243   .0028179     4.80   0.000     .0080002    .0190484
      tenuresqr |   .0000351   .0001143     0.31   0.759    -.0001889    .0002592
 birthmonthdum2 |  -.0522177   .0319016    -1.64   0.102    -.1147572    .0103217
 birthmonthdum3 |  -.0492322   .0317262    -1.55   0.121    -.1114277    .0129633
 birthmonthdum4 |  -.0623486   .0335874    -1.86   0.063    -.1281928    .0034955
 birthmonthdum5 |  -.0317452   .0320983    -0.99   0.323    -.0946702    .0311799
 birthmonthdum6 |  -.0613941   .0315044    -1.95   0.051    -.1231549    .0003667
 birthmonthdum7 |   .0129675   .0319077     0.41   0.684    -.0495838    .0755188
 birthmonthdum8 |  -.0488272   .0308393    -1.58   0.113    -.1092841    .0116298
 birthmonthdum9 |   .0009626   .0308237     0.03   0.975    -.0594638     .061389
birthmonthdum10 |  -.0335252   .0291904    -1.15   0.251    -.0907495    .0236991
birthmonthdum11 |  -.0406388    .030822    -1.32   0.187    -.1010618    .0197842
birthmonthdum12 |    -.05138   .0312387    -1.64   0.100    -.1126199      .00986
              t |   .0020697   .0003463     5.98   0.000     .0013908    .0027486
              d |   .0597105   .0267063     2.24   0.025     .0073558    .1120652
             td |  -.0008197   .0003972    -2.06   0.039    -.0015983   -.0000412
          _cons |   .3013769   .0332199     9.07   0.000     .2362532    .3665006
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(14)   =     110.17
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0440
                                                  Root MSE        =     .66705

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .1288595   .0710014     1.81   0.070    -.0103007    .2680198
         tenure |   .0324107   .0038989     8.31   0.000      .024769    .0400524
      tenuresqr |  -.0010426   .0001541    -6.77   0.000    -.0013446   -.0007407
 birthmonthdum2 |  -.0389123    .044704    -0.87   0.384    -.1265306     .048706
 birthmonthdum3 |  -.0149475   .0444277    -0.34   0.737    -.1020242    .0721292
 birthmonthdum4 |  -.0509936   .0470881    -1.08   0.279    -.1432845    .0412973
 birthmonthdum5 |    .005945    .044803     0.13   0.894    -.0818672    .0937572
 birthmonthdum6 |   .0182297   .0441926     0.41   0.680    -.0683862    .1048457
 birthmonthdum7 |   .0432169   .0444149     0.97   0.331    -.0438347    .1302685
 birthmonthdum8 |  -.0090399   .0431119    -0.21   0.834    -.0935376    .0754578
 birthmonthdum9 |    -.00723   .0428854    -0.17   0.866    -.0912838    .0768238
birthmonthdum10 |  -.0225574   .0407162    -0.55   0.580    -.1023596    .0572449
birthmonthdum11 |  -.0017621   .0430459    -0.04   0.967    -.0861305    .0826064
birthmonthdum12 |  -.0311239   .0436704    -0.71   0.476    -.1167163    .0544685
          _cons |   8.300429   .0448707   184.99   0.000     8.212484    8.388374
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  3.51448  (p = 0.0608)
  Wu-Hausman F(1,5650)            =  3.50673  (p = 0.0612)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =   16.076  (p = 0.0003)
  Basmann chi2(2)        =  16.0733  (p = 0.0003)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  19.263  Chi-sq(16) P-value = 0.2552

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
birthmont~m2 |      5,666    .0771267     .266816          0          1
birthmonth~3 |      5,666    .0788916    .2695933          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,666    .0637134    .2442632          0          1
birthmonth~5 |      5,666    .0755383    .2642813          0          1
birthmonth~6 |      5,666    .0813625    .2734152          0          1
birthmonth~7 |      5,666    .0776562    .2676534          0          1
birthmonth~8 |      5,666    .0887752     .284444          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,666    .0894811    .2854621          0          1
birthmont~10 |      5,666    .1129545    .3165651          0          1
birthmont~11 |      5,666    .0887752     .284444          0          1
birthmont~12 |      5,666    .0840099    .2774271          0          1
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthl
> yearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(30, 5635)   =  19.23
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0929
                                                        Adj R-squared = 0.0881
                                                        Root MSE      = 0.4735

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .012191   .0027998     4.35   0.000     .0067023    .0176796
      tenuresqr |   .0000783   .0001135     0.69   0.490    -.0001442    .0003007
 birthmonthdum2 |  -.0490343   .0316577    -1.55   0.121    -.1110956     .013027
 birthmonthdum3 |  -.0477582    .031477    -1.52   0.129    -.1094653    .0139489
 birthmonthdum4 |   -.065075   .0333143    -1.95   0.051    -.1303839    .0002339
 birthmonthdum5 |  -.0310481   .0318078    -0.98   0.329    -.0934037    .0313075
 birthmonthdum6 |   -.054703   .0312462    -1.75   0.080    -.1159575    .0065515
 birthmonthdum7 |   .0112896   .0316505     0.36   0.721    -.0507575    .0733367
 birthmonthdum8 |  -.0498239   .0305719    -1.63   0.103    -.1097565    .0101087
 birthmonthdum9 |  -.0006898   .0305844    -0.02   0.982    -.0606469    .0592673
birthmonthdum10 |  -.0282702   .0289533    -0.98   0.329    -.0850299    .0284895
birthmonthdum11 |  -.0367851   .0305727    -1.20   0.229    -.0967193    .0231491
birthmonthdum12 |  -.0496643   .0309796    -1.60   0.109    -.1103964    .0110677
   provincedum2 |   -.211175   .0340951    -6.19   0.000    -.2780145   -.1443356
   provincedum3 |  -.1242613   .0359228    -3.46   0.001    -.1946838   -.0538388
   provincedum4 |  -.1870205    .034963    -5.35   0.000    -.2555613   -.1184796
   provincedum5 |  -.2221618   .0319602    -6.95   0.000    -.2848161   -.1595075
   provincedum6 |  -.2469161   .0346227    -7.13   0.000      -.31479   -.1790423
   provincedum7 |  -.2457266   .0337359    -7.28   0.000     -.311862   -.1795913
   provincedum8 |  -.2225585   .0325984    -6.83   0.000    -.2864638   -.1586532
   provincedum9 |  -.2036528   .0332686    -6.12   0.000    -.2688719   -.1384336
  provincedum10 |  -.1972116   .0347153    -5.68   0.000    -.2652669   -.1291564
  provincedum11 |  -.2837207   .0290152    -9.78   0.000    -.3406016   -.2268398
  provincedum12 |  -.2192773   .0362456    -6.05   0.000    -.2903326    -.148222
  provincedum13 |  -.2362276   .0333621    -7.08   0.000    -.3016301   -.1708251
  provincedum14 |  -.1644337   .0433529    -3.79   0.000     -.249422   -.0794454
  provincedum15 |  -.1029349   .0430324    -2.39   0.017     -.187295   -.0185749
              t |    .002081    .000344     6.05   0.000     .0014065    .0027554
              d |   .0503075   .0265191     1.90   0.058    -.0016801    .1022951
             td |  -.0007801   .0003945    -1.98   0.048    -.0015536   -6.73e-06
          _cons |   .5116442   .0405533    12.62   0.000     .4321441    .5911443
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(28)   =     407.12
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0863
                                                  Root MSE        =     .65213

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .1004188   .0706011     1.42   0.155    -.0379569    .2387944
         tenure |    .031463   .0038032     8.27   0.000     .0240088    .0389172
      tenuresqr |  -.0009686   .0001506    -6.43   0.000    -.0012637   -.0006734
 birthmonthdum2 |  -.0611637   .0437777    -1.40   0.162    -.1469665     .024639
 birthmonthdum3 |  -.0190279   .0434982    -0.44   0.662    -.1042828     .066227
 birthmonthdum4 |  -.0559831   .0461304    -1.21   0.225    -.1463971    .0344308
 birthmonthdum5 |  -.0037234   .0438231    -0.08   0.932    -.0896151    .0821682
 birthmonthdum6 |   .0107942   .0432191     0.25   0.803    -.0739135     .095502
 birthmonthdum7 |   .0339007   .0434891     0.78   0.436    -.0513364    .1191377
 birthmonthdum8 |  -.0253294   .0421915    -0.60   0.548    -.1080232    .0573643
 birthmonthdum9 |  -.0200042   .0420098    -0.48   0.634    -.1023419    .0623336
birthmonthdum10 |  -.0294322   .0398593    -0.74   0.460     -.107555    .0486905
birthmonthdum11 |  -.0118556   .0421399    -0.28   0.778    -.0944483    .0707372
birthmonthdum12 |  -.0374794   .0427489    -0.88   0.381    -.1212657     .046307
   provincedum2 |  -.4786818   .0493507    -9.70   0.000    -.5754074   -.3819561
   provincedum3 |  -.1782412   .0503247    -3.54   0.000    -.2768758   -.0796066
   provincedum4 |  -.3878448   .0503685    -7.70   0.000    -.4865653   -.2891243
   provincedum5 |  -.0398383   .0465588    -0.86   0.392    -.1310919    .0514152
   provincedum6 |  -.1706704   .0509841    -3.35   0.001    -.2705974   -.0707435
   provincedum7 |  -.2507522   .0501535    -5.00   0.000    -.3490512   -.1524533
   provincedum8 |  -.4577203   .0476171    -9.61   0.000    -.5510481   -.3643925
   provincedum9 |  -.1138254   .0484249    -2.35   0.019    -.2087364   -.0189144
  provincedum10 |  -.1887007   .0501454    -3.76   0.000    -.2869839   -.0904175
  provincedum11 |   -.083958   .0446759    -1.88   0.060    -.1715211    .0036051
  provincedum12 |  -.2432075   .0528287    -4.60   0.000    -.3467498   -.1396651
  provincedum13 |  -.1893199   .0497428    -3.81   0.000    -.2868141   -.0918257
  provincedum14 |  -.3538801   .0610506    -5.80   0.000    -.4735371   -.2342231
  provincedum15 |  -.3755794   .0595616    -6.31   0.000    -.4923181   -.2588408
          _cons |   8.531406   .0637759   133.77   0.000     8.406408    8.656405
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  5.12994  (p = 0.0235)
  Wu-Hausman F(1,5636)            =   5.1074  (p = 0.0239)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  17.2409  (p = 0.0002)
  Basmann chi2(2)        =  17.1989  (p = 0.0002)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  43.439  Chi-sq(30) P-value = 0.0536

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
birthmont~m2 |      5,666    .0771267     .266816          0          1
birthmonth~3 |      5,666    .0788916    .2695933          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,666    .0637134    .2442632          0          1
birthmonth~5 |      5,666    .0755383    .2642813          0          1
birthmonth~6 |      5,666    .0813625    .2734152          0          1
birthmonth~7 |      5,666    .0776562    .2676534          0          1
birthmonth~8 |      5,666    .0887752     .284444          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,666    .0894811    .2854621          0          1
birthmont~10 |      5,666    .1129545    .3165651          0          1
birthmont~11 |      5,666    .0887752     .284444          0          1
birthmont~12 |      5,666    .0840099    .2774271          0          1
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 (highered
> u  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & mal
> e == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(16, 4931)   =  49.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1385
                                                        Adj R-squared = 0.1357
                                                        Root MSE      = 0.4633

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |    .029702   .0029307    10.13   0.000     .0239566    .0354474
      tenuresqr |  -.0003737   .0001236    -3.02   0.003    -.0006161   -.0001313
 birthmonthdum2 |  -.0030518   .0327848    -0.09   0.926    -.0673245     .061221
 birthmonthdum3 |  -.0158755   .0326178    -0.49   0.626    -.0798209    .0480698
 birthmonthdum4 |  -.0668267   .0333788    -2.00   0.045    -.1322641   -.0013893
 birthmonthdum5 |  -.0284847   .0337183    -0.84   0.398    -.0945876    .0376182
 birthmonthdum6 |  -.0299933   .0325231    -0.92   0.356    -.0937531    .0337664
 birthmonthdum7 |   -.118265   .0329648    -3.59   0.000    -.1828907   -.0536393
 birthmonthdum8 |  -.0523819   .0327837    -1.60   0.110    -.1166525    .0118887
 birthmonthdum9 |  -.0275337     .03197    -0.86   0.389    -.0902093    .0351418
birthmonthdum10 |  -.0179572   .0305709    -0.59   0.557    -.0778898    .0419753
birthmonthdum11 |  -.0143907   .0321578    -0.45   0.655    -.0774343    .0486529
birthmonthdum12 |  -.0010603   .0321358    -0.03   0.974    -.0640609    .0619402
              t |   .0016287   .0003616     4.50   0.000     .0009197    .0023376
              d |   .0679936   .0277002     2.45   0.014     .0136888    .1222984
             td |   .0005519   .0004121     1.34   0.181    -.0002559    .0013597
          _cons |   .1919299   .0338418     5.67   0.000     .1255849    .2582748
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(14)   =     464.12
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0657
                                                  Root MSE        =     .66053

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .8019287   .0591373    13.56   0.000     .6860217    .9178358
         tenure |   .0252466   .0044207     5.71   0.000     .0165821     .033911
      tenuresqr |  -.0006603   .0001758    -3.76   0.000    -.0010047   -.0003158
 birthmonthdum2 |  -.0409156   .0467293    -0.88   0.381    -.1325033    .0506721
 birthmonthdum3 |  -.0844695   .0464802    -1.82   0.069    -.1755691    .0066301
 birthmonthdum4 |   .0038025   .0477874     0.08   0.937     -.089859    .0974641
 birthmonthdum5 |  -.0672478   .0480334    -1.40   0.162    -.1613916    .0268959
 birthmonthdum6 |  -.0526711   .0462536    -1.14   0.255    -.1433265    .0379843
 birthmonthdum7 |   -.018323   .0474267    -0.39   0.699    -.1112777    .0746317
 birthmonthdum8 |  -.0241219   .0467636    -0.52   0.606    -.1157769    .0675332
 birthmonthdum9 |  -.0332103   .0454851    -0.73   0.465    -.1223594    .0559389
birthmonthdum10 |   .0131416   .0435639     0.30   0.763    -.0722422    .0985254
birthmonthdum11 |  -.0319328   .0458211    -0.70   0.486    -.1217405    .0578749
birthmonthdum12 |  -.0166283   .0457992    -0.36   0.717     -.106393    .0731364
          _cons |   7.744768   .0415278   186.50   0.000     7.663375    7.826161
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  51.6914  (p = 0.0000)
  Wu-Hausman F(1,4932)            =  52.0682  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  9.54412  (p = 0.0085)
  Basmann chi2(2)        =  9.52971  (p = 0.0085)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  17.227  Chi-sq(16) P-value = 0.3711

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
birthmont~m2 |      4,948    .0798302    .2710576          0          1
birthmonth~3 |      4,948     .081447    .2735481          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,948    .0743735    .2624042          0          1
birthmonth~5 |      4,948    .0717462    .2580932          0          1
birthmonth~6 |      4,948    .0830639    .2760066          0          1
birthmonth~7 |      4,948    .0782134    .2685343          0          1
birthmonth~8 |      4,948    .0800323    .2713707          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,948    .0891269    .2849557          0          1
birthmont~10 |      4,948    .1075182    .3098022          0          1
birthmont~11 |      4,948    .0862975    .2808312          0          1
birthmont~12 |      4,948    .0864996    .2811288          0          1
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 provinced
> um2-provincedum15 (higheredu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthly
> earning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(30, 4917)   =  31.89
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1629
                                                        Adj R-squared = 0.1578
                                                        Root MSE      = 0.4573

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
         tenure |   .0286971   .0029005     9.89   0.000     .0230109    .0343833
      tenuresqr |   -.000345   .0001225    -2.82   0.005    -.0005851   -.0001049
 birthmonthdum2 |  -.0070847   .0324009    -0.22   0.827    -.0706049    .0564354
 birthmonthdum3 |  -.0251294   .0322938    -0.78   0.437    -.0884397    .0381808
 birthmonthdum4 |  -.0678211    .033017    -2.05   0.040    -.1325493    -.003093
 birthmonthdum5 |   -.030816   .0333319    -0.92   0.355    -.0961614    .0345294
 birthmonthdum6 |  -.0375565   .0321418    -1.17   0.243    -.1005688    .0254558
 birthmonthdum7 |  -.1203971    .032578    -3.70   0.000    -.1842647   -.0565296
 birthmonthdum8 |  -.0564809   .0323776    -1.74   0.081    -.1199555    .0069936
 birthmonthdum9 |  -.0335198   .0316045    -1.06   0.289    -.0954787     .028439
birthmonthdum10 |  -.0172111   .0302351    -0.57   0.569    -.0764855    .0420633
birthmonthdum11 |  -.0179943    .031793    -0.57   0.571    -.0803227    .0443341
birthmonthdum12 |  -.0024077   .0317739    -0.08   0.940    -.0646988    .0598834
   provincedum2 |  -.1562493   .0356825    -4.38   0.000    -.2262028   -.0862957
   provincedum3 |  -.1090883   .0366081    -2.98   0.003    -.1808565   -.0373202
   provincedum4 |  -.1455314   .0351534    -4.14   0.000    -.2144478   -.0766149
   provincedum5 |  -.2454248   .0323087    -7.60   0.000    -.3087643   -.1820854
   provincedum6 |  -.2609145   .0362271    -7.20   0.000    -.3319358   -.1898932
   provincedum7 |  -.2342037   .0332599    -7.04   0.000    -.2994079   -.1689994
   provincedum8 |  -.2390334   .0331293    -7.22   0.000    -.3039817   -.1740852
   provincedum9 |  -.2623957   .0344851    -7.61   0.000    -.3300019   -.1947896
  provincedum10 |  -.2637123   .0344908    -7.65   0.000    -.3313296    -.196095
  provincedum11 |  -.2783214   .0292463    -9.52   0.000    -.3356573   -.2209855
  provincedum12 |  -.2544147   .0358093    -7.10   0.000     -.324617   -.1842124
  provincedum13 |  -.2558715   .0330008    -7.75   0.000    -.3205679   -.1911751
  provincedum14 |  -.1903181   .0418687    -4.55   0.000    -.2723994   -.1082368
  provincedum15 |  -.1925985   .0428436    -4.50   0.000    -.2765911    -.108606
              t |   .0017654   .0003578     4.93   0.000     .0010639    .0024669
              d |   .0563614    .027415     2.06   0.040     .0026157     .110107
             td |   .0004541   .0004075     1.11   0.265    -.0003448    .0012529
          _cons |   .4190682   .0407558    10.28   0.000     .3391686    .4989678
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(28)   =     827.34
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1378
                                                  Root MSE        =     .63453

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .7560261   .0570044    13.26   0.000     .6442996    .8677526
         tenure |   .0248841    .004236     5.87   0.000     .0165818    .0331865
      tenuresqr |  -.0005731    .000169    -3.39   0.001    -.0009043   -.0002419
 birthmonthdum2 |  -.0084719    .044949    -0.19   0.851    -.0965703    .0796264
 birthmonthdum3 |  -.0497645   .0447893    -1.11   0.267    -.1375499     .038021
 birthmonthdum4 |   .0327575    .045989     0.71   0.476    -.0573793    .1228943
 birthmonthdum5 |  -.0446353   .0462089    -0.97   0.334     -.135203    .0459324
 birthmonthdum6 |  -.0378946   .0444887    -0.85   0.394    -.1250909    .0493017
 birthmonthdum7 |  -.0010516   .0456154    -0.02   0.982    -.0904561    .0883529
 birthmonthdum8 |  -.0179399   .0449587    -0.40   0.690    -.1060574    .0701776
 birthmonthdum9 |  -.0222145   .0437649    -0.51   0.612    -.1079922    .0635632
birthmonthdum10 |   .0217938   .0419276     0.52   0.603    -.0603828    .1039704
birthmonthdum11 |  -.0160248   .0440891    -0.36   0.716     -.102438    .0703883
birthmonthdum12 |  -.0016746   .0440683    -0.04   0.970    -.0880469    .0846976
   provincedum2 |  -.5644766   .0503645   -11.21   0.000    -.6631891    -.465764
   provincedum3 |  -.3004813   .0511224    -5.88   0.000    -.4006793   -.2002833
   provincedum4 |  -.4108644   .0498131    -8.25   0.000    -.5084963   -.3132326
   provincedum5 |  -.0223326   .0465896    -0.48   0.632    -.1136465    .0689813
   provincedum6 |  -.1866963   .0524995    -3.56   0.000    -.2895935   -.0837992
   provincedum7 |  -.2506103   .0485124    -5.17   0.000    -.3456929   -.1555278
   provincedum8 |  -.3880384   .0480182    -8.08   0.000    -.4821524   -.2939244
   provincedum9 |  -.1037919   .0502303    -2.07   0.039    -.2022416   -.0053422
  provincedum10 |  -.1291134   .0502145    -2.57   0.010     -.227532   -.0306948
  provincedum11 |  -.0130861   .0433335    -0.30   0.763    -.0980182     .071846
  provincedum12 |  -.1879928   .0521618    -3.60   0.000    -.2902281   -.0857575
  provincedum13 |  -.1119841   .0483569    -2.32   0.021    -.2067618   -.0172064
  provincedum14 |  -.2030271   .0593057    -3.42   0.001    -.3192641   -.0867901
  provincedum15 |  -.3184728   .0602667    -5.28   0.000    -.4365933   -.2003523
          _cons |   7.929066   .0568249   139.54   0.000     7.817691    8.040441
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =   44.308  (p = 0.0000)
  Wu-Hausman F(1,4918)            =  44.4373  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =   11.546  (p = 0.0031)
  Basmann chi2(2)        =  11.5005  (p = 0.0032)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  33.912  Chi-sq(30) P-value = 0.2844

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
birthmont~m2 |      4,948    .0798302    .2710576          0          1
birthmonth~3 |      4,948     .081447    .2735481          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,948    .0743735    .2624042          0          1
birthmonth~5 |      4,948    .0717462    .2580932          0          1
birthmonth~6 |      4,948    .0830639    .2760066          0          1
birthmonth~7 |      4,948    .0782134    .2685343          0          1
birthmonth~8 |      4,948    .0800323    .2713707          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,948    .0891269    .2849557          0          1
birthmont~10 |      4,948    .1075182    .3098022          0          1
birthmont~11 |      4,948    .0862975    .2808312          0          1
birthmont~12 |      4,948    .0864996    .2811288          0          1
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Tenur
> e/IV Urban ATF&Birth Tenure 1979 1971-1992.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Tenure/IV Urban ATF&Birth Tenure 1979 1971-1992.log
  log type:  text
 closed on:   6 Aug 2024, 17:35:23
---------------------------------------------------------------------------------------------
