---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/
> Selmlog Job-types & Unemployment/Selmlog Urban (1) Unemployment A20=5 (2) Unemployment A20=
> 5|9 (3) High occupation (4) Long-term contract.log
  log type:  text
 opened on:   6 Aug 2024, 17:49:17

. use "`datapath'", clear

. ****Because the selmlog identifying variables take too much time to run, I combine the unem
> ployment, high occupation, and long-term contract dependent variables into this one .do fil
> e. If you wish to run one seperately, simply delete or nullify the other two parts of regre
> ssions. Search *1) Unemployment A20=5, *2) Unemployment A20=5|9, *3) High occupation, or *4
> ) Long-term contract in this file to jump to the regressions!
. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. 
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *6) Instrument
. 
. gen yearat15 = birthyear+15

. local obsnum = _N

. 
. forval i =  1/`obsnum' {
  2.         
.         *extract the observation's year at age 15
.         qui sum yearat15  in `i'
  3.         local yearvalue = round(mod(r(mean),100))
  4.         
.         *get the variables' names for this observation
.         *graduates of mid and sec schools
.         if inrange(`yearvalue', 0, 9) {
  5.                 local czgrad_year = "czgrad0`yearvalue'"
  6.                 local gzgrad_year = "gzgrad0`yearvalue'"
  7.         }
  8.         else {
  9.                 local czgrad_year = "czgrad`yearvalue'"
 10.                 local gzgrad_year = "gzgrad`yearvalue'"
 11.         }
 12.         *entrants of sec and universities
.         if inrange(`yearvalue'+1, 0, 9) {
 13.                 local gzentrant_year = "gzentrant0`=`yearvalue'+1'"
 14.                 local gxentrant_year = "gxentrant0`=`yearvalue'+1'"
 15.                 local vsentrant_year = "vsentrant0`=`yearvalue'+1'"
 16.                 local tsentrant_year = "tsentrant0`=`yearvalue'+1'"
 17.         }
 18.         else{
 19.                 if `yearvalue' == 99 {
 20.                 local gzentrant_year = "gzentrant00"
 21.                 local gxentrant_year = "gxentrant00"
 22.                 local vsentrant_year = "vsentrant00"
 23.                 local tsentrant_year = "tsentrant00"
 24.                 }
 25.         else {
 26.                 local gzentrant_year = "gzentrant`=`yearvalue'+1'"
 27.                 local gxentrant_year = "gxentrant`=`yearvalue'+1'"
 28.                 local vsentrant_year = "vsentrant`=`yearvalue'+1'"
 29.                 local tsentrant_year = "tsentrant`=`yearvalue'+1'"
 30.         }
 31.         }
 32.         
.         
.         *For Ins 1 & 2: check whether the variable names exist (whether we have those years
> ' or not)
.         capture ds `czgrad_year' `gzgrad_year' `gzentrant_year' `gxentrant_year'
 33.         if _rc == 0 {
 34.                 *generate/replace the instrument
.                 capture ds ins1_secgen_entrant_relative ins2_highedu_entrant_relative
 35.                 if _rc!=0 {
 36.                         qui gen ins1_secgen_entrant_relative = `gzentrant_year'/`czgrad_
> year' if _n == `i'
 37.                         qui gen ins2_highedu_entrant_relative = `gxentrant_year'/`gzgrad
> _year' if _n == `i'
 38.                 
.                 }
 39.                 else {
 40.                         qui replace ins1_secgen_entrant_relative = `gzentrant_year'/`czg
> rad_year' if _n == `i'
 41.                         qui replace ins2_highedu_entrant_relative = `gxentrant_year'/`gz
> grad_year' if _n == `i'
 42.                 }
 43.         }
 44.         
.         *For Ins 3
.         capture ds `czgrad_year' `vsentrant_year'
 45.         if _rc == 0 {
 46.                 *generate/replace the instrument
.                 capture ds ins3_vs_entrant_relative
 47.                 if _rc!=0 {
 48.                         qui gen ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_year
> ' if _n == `i'
 49.                 }
 50.                 else {
 51.                         qui replace ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_
> year' if _n == `i'
 52.                 }
 53.         }
 54. }

. 
. 
. sum ins1_secgen_entrant_relative, d

                ins1_secgen_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1551793       .0699308
 5%     .1673149       .0699308
10%      .186534       .0699308       Obs              14,600
25%      .212766       .0699308       Sum of wgt.      14,600

50%     .2705238                      Mean           .3109947
                        Largest       Std. dev.      .1165706
75%     .4141782       .6448125
90%     .4786784       .6448125       Variance       .0135887
95%     .5186297       .6448125       Skewness       .6285488
99%     .5868049       .6448125       Kurtosis       2.318413

. sum ins2_highedu_entrant_relative, d

                ins2_highedu_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .152784       .0821429
 5%     .1734805       .0886667
10%     .2178154       .0925698       Obs              14,600
25%     .2949015       .1380375       Sum of wgt.      14,600

50%      .563901                      Mean           .6110964
                        Largest       Std. dev.      .4193773
75%     .8148931       2.985416
90%     1.023507       2.985416       Variance       .1758773
95%     1.167059       2.985416       Skewness       2.172976
99%     2.425508       2.985416       Kurtosis       10.34083

. sum ins3_vs_entrant_relative, d

                  ins3_vs_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1185751       .0849628
 5%     .1372715       .0849628
10%     .1456793       .0852398       Obs              14,942
25%      .184019       .0852398       Sum of wgt.      14,942

50%     .2320418                      Mean            .249079
                        Largest       Std. dev.      .0890765
75%     .3028006       .6566039
90%     .3705537       .6566039       Variance       .0079346
95%     .4302979       .6566039       Skewness       .9809564
99%     .5072184       .6566039       Kurtosis       4.050356

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. *The specific two; Do that for rural after special care.
. replace province_code = 51 if province_code==.
(2 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.00
         44 |      4,331       11.94       79.95
         50 |      2,115        5.83       85.78
         51 |      2,798        7.72       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,362 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. *9) Tenure
. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. replace tenure = 0 if tenure == -1
(49 real changes made)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *10) Dependent variables: job-types specifications
. 
. gen unemp_A20_5 = 1 if A20 == 5
(35,581 missing values generated)

. replace unemp_A20_5 = 0 if inrange(A20, 1, 4) | inrange(A20, 6, 9)
(34,591 real changes made)

. gen voc_unemp_A20_5 = unemp_A20_5 if educat == 1
(32,694 missing values generated)

. gen gen_unemp_A20_5 = unemp_A20_5 if educat == 2
(24,957 missing values generated)

. 
. gen unemp_A20_59 = unemp_A20_5
(990 missing values generated)

. replace unemp_A20_59 = 1 if A20 == 9
(3,949 real changes made)

. gen voc_unemp_A20_59 = unemp_A20_59 if educat == 1
(32,694 missing values generated)

. gen gen_unemp_A20_59 = unemp_A20_59 if educat == 2
(24,957 missing values generated)

. 
. gen highocc = 1 if C03_4 == 1 | C03_4 == 2
(32,049 missing values generated)

. replace highocc = 0 if inrange(C03_4, 3, 8)
(14,667 real changes made)

. gen voc_highocc = highocc if educat == 1
(33,436 missing values generated)

. gen gen_highocc = highocc if educat == 2
(28,151 missing values generated)

. 
. gen longtermcontract = 1 if C07_1 == 1 | C07_1 == 2
(29,167 missing values generated)

. replace longtermcontract = 0 if inrange(C07_1, 3, 5)
(8,506 real changes made)

. gen voc_longtermcontract= longtermcontract if educat == 1
(33,791 missing values generated)

. gen gen_longtermcontract = longtermcontract if educat == 2
(28,951 missing values generated)

. 
. sum unemp_A20_5, d

                         unemp_A20_5
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              35,269
25%            0              0       Sum of wgt.      35,269

50%            0                      Mean           .0192237
                        Largest       Std. dev.      .1373123
75%            0              1
90%            0              1       Variance       .0188547
95%            0              1       Skewness       7.002769
99%            1              1       Kurtosis       50.03877

. sum unemp_A20_59, d

                        unemp_A20_59
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              35,269
25%            0              0       Sum of wgt.      35,269

50%            0                      Mean           .1311917
                        Largest       Std. dev.      .3376147
75%            0              1
90%            1              1       Variance       .1139837
95%            1              1       Skewness       2.184819
99%            1              1       Kurtosis       5.773435

. sum highocc, d

                           highocc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              18,877
25%            0              0       Sum of wgt.      18,877

50%            0                      Mean           .2230227
                        Largest       Std. dev.      .4162845
75%            0              1
90%            1              1       Variance       .1732928
95%            1              1       Skewness       1.330747
99%            1              1       Kurtosis       2.770887

. sum longtermcontract, d

                      longtermcontract
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              15,598
25%            0              0       Sum of wgt.      15,598

50%            0                      Mean           .4546737
                        Largest       Std. dev.      .4979572
75%            1              1
90%            1              1       Variance       .2479614
95%            1              1       Skewness       .1820549
99%            1              1       Kurtosis       1.033144

. 
. 
. *Step Two: Regressions
. 
. *1) Unemployment A20=5
. 
. selmlog voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear
> , 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant
> _relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(9, 2291)      =      1.40
       Model |  .387764403         9  .043084934   Prob > F        =    0.1805
    Residual |   70.296286     2,291  .030683669   R-squared       =    0.0055
-------------+----------------------------------   Adj R-squared   =    0.0016
       Total |  70.6840504     2,300  .030732196   Root MSE        =    .17517

------------------------------------------------------------------------------
voc_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0082385     .00929    -0.89   0.375    -.0264561    .0099792
         exp |  -.0060916   .0081158    -0.75   0.453    -.0220067    .0098235
      expsqr |   .0001943    .000246     0.79   0.430    -.0002881    .0006767
  highvocedu |   .0114006   .0119226     0.96   0.339    -.0119796    .0347809
  highgenedu |  -.0174606    .022479    -0.78   0.437    -.0615418    .0266207
    adultedu |  -.0186251   .0105974    -1.76   0.079    -.0394065    .0021564
         _m1 |  -.0463316   .0646466    -0.72   0.474    -.1731035    .0804404
         _m2 |   .0908794    .178114     0.51   0.610    -.2584022    .4401609
         _m3 |   .0485234   .1551009     0.31   0.754    -.2556295    .3526763
       _cons |    .193269   .2454588     0.79   0.431    -.2880757    .6746137
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0335872          .        .       .            .           .
        rho1 |  -.2528077          .        .       .            .           .
        rho2 |   .4958822          .        .       .            .           .
        rho3 |   .2647674          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(
> birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(9, 2291)      =      1.40
       Model |  .387764403         9  .043084934   Prob > F        =    0.1805
    Residual |   70.296286     2,291  .030683669   R-squared       =    0.0055
-------------+----------------------------------   Adj R-squared   =    0.0016
       Total |  70.6840504     2,300  .030732196   Root MSE        =    .17517

------------------------------------------------------------------------------
voc_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0082385     .00929    -0.89   0.375    -.0264561    .0099792
         exp |  -.0060916   .0081158    -0.75   0.453    -.0220067    .0098235
      expsqr |   .0001943    .000246     0.79   0.430    -.0002881    .0006767
  highvocedu |   .0114006   .0119226     0.96   0.339    -.0119796    .0347809
  highgenedu |  -.0174606    .022479    -0.78   0.437    -.0615418    .0266207
    adultedu |  -.0186251   .0105974    -1.76   0.079    -.0394065    .0021564
          m1 |  -.0463316   .0646466    -0.72   0.474    -.1731035    .0804404
          m2 |   .0908794    .178114     0.51   0.610    -.2584022    .4401609
          m3 |   .0485234   .1551009     0.31   0.754    -.2556295    .3526763
       _cons |    .193269   .2454588     0.79   0.431    -.2880757    .6746137
------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_re
> lative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(23, 2277)     =      1.35
       Model |  .953465161        23  .041455007   Prob > F        =    0.1212
    Residual |  69.7305853     2,277  .030623885   R-squared       =    0.0135
-------------+----------------------------------   Adj R-squared   =    0.0035
       Total |  70.6840504     2,300  .030732196   Root MSE        =      .175

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.012614   .0099457    -1.27   0.205    -.0321176    .0068895
          exp |  -.0010952   .0090026    -0.12   0.903    -.0187493    .0165589
       expsqr |   .0000495   .0002688     0.18   0.854    -.0004775    .0005766
   highvocedu |   .0110454    .012035     0.92   0.359    -.0125554    .0346462
   highgenedu |  -.0161096   .0226747    -0.71   0.477    -.0605749    .0283556
     adultedu |  -.0204795   .0108467    -1.89   0.059    -.0417499    .0007909
 provincedum2 |  -.0295645   .0215408    -1.37   0.170    -.0718062    .0126773
 provincedum3 |  -.0344292    .022902    -1.50   0.133    -.0793403    .0104818
 provincedum4 |   .0096061   .0209367     0.46   0.646     -.031451    .0506632
 provincedum5 |   .0004225   .0195579     0.02   0.983    -.0379306    .0387757
 provincedum6 |  -.0184842   .0240007    -0.77   0.441    -.0655498    .0285814
 provincedum7 |  -.0129513   .0209932    -0.62   0.537    -.0541191    .0282165
 provincedum8 |  -.0276116   .0218845    -1.26   0.207    -.0705272    .0153041
 provincedum9 |  -.0199438   .0205953    -0.97   0.333    -.0603314    .0204437
provincedum10 |   -.014009    .020782    -0.67   0.500    -.0547627    .0267446
provincedum11 |  -.0181147   .0195839    -0.92   0.355    -.0565187    .0202894
provincedum12 |  -.0211192    .022026    -0.96   0.338    -.0643123    .0220739
provincedum13 |  -.0187988    .021865    -0.86   0.390    -.0616762    .0240786
provincedum14 |   .0394927   .0239194     1.65   0.099    -.0074133    .0863988
provincedum15 |  -.0275661   .0269937    -1.02   0.307     -.080501    .0253687
          _m1 |  -.0053215   .0719373    -0.07   0.941     -.146391     .135748
          _m2 |  -.0348292   .2053445    -0.17   0.865    -.4375111    .3678528
          _m3 |  -.0434434   .1697167    -0.26   0.798     -.376259    .2893722
        _cons |   .0272986   .2749107     0.10   0.921     -.511803    .5664001
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0308929          .        .       .            .           .
        rho1 |  -.0302763          .        .       .            .           .
        rho2 |  -.1981587          .        .       .            .           .
        rho3 |   -.247169          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(23, 2277)     =      1.35
       Model |  .953465161        23  .041455007   Prob > F        =    0.1212
    Residual |  69.7305853     2,277  .030623885   R-squared       =    0.0135
-------------+----------------------------------   Adj R-squared   =    0.0035
       Total |  70.6840504     2,300  .030732196   Root MSE        =      .175

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.012614   .0099457    -1.27   0.205    -.0321176    .0068895
          exp |  -.0010952   .0090026    -0.12   0.903    -.0187493    .0165589
       expsqr |   .0000495   .0002688     0.18   0.854    -.0004775    .0005766
   highvocedu |   .0110454    .012035     0.92   0.359    -.0125554    .0346462
   highgenedu |  -.0161096   .0226747    -0.71   0.477    -.0605749    .0283556
     adultedu |  -.0204795   .0108467    -1.89   0.059    -.0417499    .0007909
 provincedum2 |  -.0295645   .0215408    -1.37   0.170    -.0718062    .0126773
 provincedum3 |  -.0344292    .022902    -1.50   0.133    -.0793403    .0104818
 provincedum4 |   .0096061   .0209367     0.46   0.646     -.031451    .0506632
 provincedum5 |   .0004225   .0195579     0.02   0.983    -.0379306    .0387757
 provincedum6 |  -.0184842   .0240007    -0.77   0.441    -.0655498    .0285814
 provincedum7 |  -.0129513   .0209932    -0.62   0.537    -.0541191    .0282165
 provincedum8 |  -.0276116   .0218845    -1.26   0.207    -.0705272    .0153041
 provincedum9 |  -.0199438   .0205953    -0.97   0.333    -.0603314    .0204437
provincedum10 |   -.014009    .020782    -0.67   0.500    -.0547627    .0267446
provincedum11 |  -.0181147   .0195839    -0.92   0.355    -.0565187    .0202894
provincedum12 |  -.0211192    .022026    -0.96   0.338    -.0643123    .0220739
provincedum13 |  -.0187988    .021865    -0.86   0.390    -.0616762    .0240786
provincedum14 |   .0394927   .0239194     1.65   0.099    -.0074133    .0863988
provincedum15 |  -.0275661   .0269937    -1.02   0.307     -.080501    .0253687
           m1 |  -.0053215   .0719373    -0.07   0.941     -.146391     .135748
           m2 |  -.0348292   .2053445    -0.17   0.865    -.4375111    .3678528
           m3 |  -.0434434   .1697167    -0.26   0.798     -.376259    .2893722
        _cons |   .0272986   .2749107     0.10   0.921     -.511803    .5664001
-------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_5 male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(ed
> ucat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_ent
> rant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(7, 2293)      =      1.16
       Model |  .250283362         7  .035754766   Prob > F        =    0.3202
    Residual |  70.4337671     2,293  .030716863   R-squared       =    0.0035
-------------+----------------------------------   Adj R-squared   =    0.0005
       Total |  70.6840504     2,300  .030732196   Root MSE        =    .17526

------------------------------------------------------------------------------
voc_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   -.008186   .0092938    -0.88   0.379    -.0264111    .0100392
         exp |  -.0070224   .0080915    -0.87   0.386    -.0228899    .0088452
      expsqr |   .0002132   .0002455     0.87   0.385    -.0002682    .0006946
   higheredu |  -.0068432   .0082425    -0.83   0.406    -.0230067    .0093204
         _m1 |  -.0447476   .0646337    -0.69   0.489    -.1714943    .0819991
         _m2 |   .0796283   .1780015     0.45   0.655    -.2694326    .4286892
         _m3 |   .0379518   .1549729     0.24   0.807      -.26595    .3418535
       _cons |   .1917219   .2452865     0.78   0.435    -.2892848    .6727285
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0330757          .        .       .            .           .
        rho1 |  -.2460454          .        .       .            .           .
        rho2 |   .4378375          .        .       .            .           .
        rho3 |   .2086785          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992
> )

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(7, 2293)      =      1.16
       Model |  .250283362         7  .035754766   Prob > F        =    0.3202
    Residual |  70.4337671     2,293  .030716863   R-squared       =    0.0035
-------------+----------------------------------   Adj R-squared   =    0.0005
       Total |  70.6840504     2,300  .030732196   Root MSE        =    .17526

------------------------------------------------------------------------------
voc_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   -.008186   .0092938    -0.88   0.379    -.0264111    .0100392
         exp |  -.0070224   .0080915    -0.87   0.386    -.0228899    .0088452
      expsqr |   .0002132   .0002455     0.87   0.385    -.0002682    .0006946
   higheredu |  -.0068432   .0082425    -0.83   0.406    -.0230067    .0093204
          m1 |  -.0447476   .0646337    -0.69   0.489    -.1714943    .0819991
          m2 |   .0796283   .1780015     0.45   0.655    -.2694326    .4286892
          m3 |   .0379518   .1549729     0.24   0.807      -.26595    .3418535
       _cons |   .1917219   .2452865     0.78   0.435    -.2892848    .6727285
------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bir
> thyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_e
> ntrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(21, 2279)     =      1.25
       Model |  .808013855        21   .03847685   Prob > F        =    0.1948
    Residual |  69.8760366     2,279  .030660832   R-squared       =    0.0114
-------------+----------------------------------   Adj R-squared   =    0.0023
       Total |  70.6840504     2,300  .030732196   Root MSE        =     .1751

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0121635   .0099484    -1.22   0.222    -.0316723    .0073454
          exp |  -.0023694   .0089761    -0.26   0.792    -.0199717    .0152329
       expsqr |   .0000768   .0002683     0.29   0.775    -.0004493    .0006028
    higheredu |  -.0075929   .0084588    -0.90   0.369    -.0241807    .0089949
 provincedum2 |    -.02692   .0215161    -1.25   0.211    -.0691132    .0152732
 provincedum3 |  -.0326031    .022892    -1.42   0.155    -.0774943    .0122882
 provincedum4 |   .0131552   .0208856     0.63   0.529    -.0278015    .0541119
 provincedum5 |   .0036385   .0195135     0.19   0.852    -.0346277    .0419047
 provincedum6 |  -.0167005   .0239991    -0.70   0.487    -.0637629    .0303619
 provincedum7 |  -.0100103   .0209433    -0.48   0.633    -.0510802    .0310595
 provincedum8 |  -.0241362   .0218395    -1.11   0.269    -.0669636    .0186911
 provincedum9 |  -.0183305   .0205873    -0.89   0.373    -.0587022    .0220413
provincedum10 |  -.0114584   .0207578    -0.55   0.581    -.0521646    .0292478
provincedum11 |  -.0152354    .019551    -0.78   0.436     -.053575    .0231042
provincedum12 |   -.018922   .0220141    -0.86   0.390    -.0620917    .0242477
provincedum13 |  -.0160396   .0218414    -0.73   0.463    -.0588707    .0267914
provincedum14 |    .040282    .023918     1.68   0.092    -.0066212    .0871853
provincedum15 |  -.0273524   .0270096    -1.01   0.311    -.0803184    .0256136
          _m1 |  -.0064687   .0719408    -0.09   0.928    -.1475449    .1346076
          _m2 |  -.0318016   .2053041    -0.15   0.877     -.434404    .3708009
          _m3 |  -.0460362   .1696502    -0.27   0.786    -.3787213    .2866488
        _cons |   .0396427   .2747141     0.14   0.885    -.4990732    .5783587
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0309792          .        .       .            .           .
        rho1 |  -.0367519          .        .       .            .           .
        rho2 |  -.1806814          .        .       .            .           .
        rho3 |  -.2615559          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if in
> range(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(21, 2279)     =      1.25
       Model |  .808013855        21   .03847685   Prob > F        =    0.1948
    Residual |  69.8760366     2,279  .030660832   R-squared       =    0.0114
-------------+----------------------------------   Adj R-squared   =    0.0023
       Total |  70.6840504     2,300  .030732196   Root MSE        =     .1751

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0121635   .0099484    -1.22   0.222    -.0316723    .0073454
          exp |  -.0023694   .0089761    -0.26   0.792    -.0199717    .0152329
       expsqr |   .0000768   .0002683     0.29   0.775    -.0004493    .0006028
    higheredu |  -.0075929   .0084588    -0.90   0.369    -.0241807    .0089949
 provincedum2 |    -.02692   .0215161    -1.25   0.211    -.0691132    .0152732
 provincedum3 |  -.0326031    .022892    -1.42   0.155    -.0774943    .0122882
 provincedum4 |   .0131552   .0208856     0.63   0.529    -.0278015    .0541119
 provincedum5 |   .0036385   .0195135     0.19   0.852    -.0346277    .0419047
 provincedum6 |  -.0167005   .0239991    -0.70   0.487    -.0637629    .0303619
 provincedum7 |  -.0100103   .0209433    -0.48   0.633    -.0510802    .0310595
 provincedum8 |  -.0241362   .0218395    -1.11   0.269    -.0669636    .0186911
 provincedum9 |  -.0183305   .0205873    -0.89   0.373    -.0587022    .0220413
provincedum10 |  -.0114584   .0207578    -0.55   0.581    -.0521646    .0292478
provincedum11 |  -.0152354    .019551    -0.78   0.436     -.053575    .0231042
provincedum12 |   -.018922   .0220141    -0.86   0.390    -.0620917    .0242477
provincedum13 |  -.0160396   .0218414    -0.73   0.463    -.0588707    .0267914
provincedum14 |    .040282    .023918     1.68   0.092    -.0066212    .0871853
provincedum15 |  -.0273524   .0270096    -1.01   0.311    -.0803184    .0256136
           m1 |  -.0064687   .0719408    -0.09   0.928    -.1475449    .1346076
           m2 |  -.0318016   .2053041    -0.15   0.877     -.434404    .3708009
           m3 |  -.0460362   .1696502    -0.27   0.786    -.3787213    .2866488
        _cons |   .0396427   .2747141     0.14   0.885    -.4990732    .5783587
-------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear
> , 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant
> _relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(9, 5779)      =      4.71
       Model |  .869560929         9  .096617881   Prob > F        =    0.0000
    Residual |  118.559356     5,779  .020515549   R-squared       =    0.0073
-------------+----------------------------------   Adj R-squared   =    0.0057
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14323

------------------------------------------------------------------------------
gen_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0083054    .004227    -1.96   0.049    -.0165919   -.0000189
         exp |  -.0035792   .0033225    -1.08   0.281    -.0100925     .002934
      expsqr |   .0000755   .0001065     0.71   0.478    -.0001332    .0002842
  highvocedu |  -.0061209   .0057498    -1.06   0.287    -.0173927    .0051509
  highgenedu |  -.0201906   .0055484    -3.64   0.000    -.0310676   -.0093137
    adultedu |  -.0168107   .0069904    -2.40   0.016    -.0305145    -.003107
         _m1 |  -.0271619   .0731342    -0.37   0.710    -.1705323    .1162085
         _m2 |   .0606568   .0210198     2.89   0.004     .0194501    .1018635
         _m3 |   .0817386   .0476382     1.72   0.086    -.0116502    .1751274
       _cons |   .0549686   .0110193     4.99   0.000     .0333667    .0765705
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0229974          .        .       .            .           .
        rho1 |  -.1791104          .        .       .            .           .
        rho2 |   .3999817          .        .       .            .           .
        rho3 |   .5389986          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(
> birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(9, 5779)      =      4.71
       Model |  .869560929         9  .096617881   Prob > F        =    0.0000
    Residual |  118.559356     5,779  .020515549   R-squared       =    0.0073
-------------+----------------------------------   Adj R-squared   =    0.0057
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14323

------------------------------------------------------------------------------
gen_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0083054    .004227    -1.96   0.049    -.0165919   -.0000189
         exp |  -.0035792   .0033225    -1.08   0.281    -.0100925     .002934
      expsqr |   .0000755   .0001065     0.71   0.478    -.0001332    .0002842
  highvocedu |  -.0061209   .0057498    -1.06   0.287    -.0173927    .0051509
  highgenedu |  -.0201906   .0055484    -3.64   0.000    -.0310676   -.0093137
    adultedu |  -.0168107   .0069904    -2.40   0.016    -.0305145    -.003107
          m1 |  -.0271619   .0731342    -0.37   0.710    -.1705323    .1162085
          m2 |   .0606568   .0210198     2.89   0.004     .0194501    .1018635
          m3 |   .0817386   .0476382     1.72   0.086    -.0116502    .1751274
       _cons |   .0549686   .0110193     4.99   0.000     .0333667    .0765705
------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_re
> lative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(23, 5765)     =      2.44
       Model |  1.15062813        23   .05002731   Prob > F        =    0.0001
    Residual |  118.278289     5,765  .020516616   R-squared       =    0.0096
-------------+----------------------------------   Adj R-squared   =    0.0057
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14324

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0085794   .0043063    -1.99   0.046    -.0170214   -.0001373
          exp |  -.0027813   .0035167    -0.79   0.429    -.0096753    .0041127
       expsqr |   .0000421   .0001109     0.38   0.704    -.0001752    .0002595
   highvocedu |  -.0061158   .0057978    -1.05   0.292    -.0174817    .0052501
   highgenedu |  -.0204184   .0057162    -3.57   0.000    -.0316243   -.0092126
     adultedu |  -.0172301   .0070628    -2.44   0.015    -.0310759   -.0033844
 provincedum2 |  -.0014992   .0100808    -0.15   0.882    -.0212614     .018263
 provincedum3 |  -.0150159   .0097452    -1.54   0.123    -.0341203    .0040884
 provincedum4 |  -.0005232   .0101942    -0.05   0.959    -.0205076    .0194613
 provincedum5 |   .0018523   .0091213     0.20   0.839    -.0160288    .0197335
 provincedum6 |   .0107759   .0108647     0.99   0.321     -.010523    .0320748
 provincedum7 |   .0006025   .0102741     0.06   0.953    -.0195385    .0207435
 provincedum8 |  -.0062547   .0098595    -0.63   0.526    -.0255831    .0130737
 provincedum9 |  -.0132324   .0094403    -1.40   0.161    -.0317389    .0052741
provincedum10 |  -.0041772   .0100511    -0.42   0.678    -.0238811    .0155268
provincedum11 |  -.0118022   .0085571    -1.38   0.168    -.0285773    .0049729
provincedum12 |  -.0001494   .0106903    -0.01   0.989    -.0211063    .0208075
provincedum13 |   .0070706   .0098367     0.72   0.472     -.012213    .0263542
provincedum14 |  -.0029278   .0134142    -0.22   0.827    -.0292246     .023369
provincedum15 |   -.008793   .0120461    -0.73   0.465    -.0324079    .0148219
          _m1 |  -.0088795    .078098    -0.11   0.909    -.1619808    .1442219
          _m2 |   .0600751   .0221262     2.72   0.007     .0166995    .1034508
          _m3 |   .0678729   .0487941     1.39   0.164    -.0277819    .1635278
        _cons |   .0575963   .0132524     4.35   0.000     .0316167     .083576
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0224029          .        .       .            .           .
        rho1 |  -.0593245          .        .       .            .           .
        rho2 |   .4013676          .        .       .            .           .
        rho3 |   .4534654          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(23, 5765)     =      2.44
       Model |  1.15062813        23   .05002731   Prob > F        =    0.0001
    Residual |  118.278289     5,765  .020516616   R-squared       =    0.0096
-------------+----------------------------------   Adj R-squared   =    0.0057
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14324

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0085794   .0043063    -1.99   0.046    -.0170214   -.0001373
          exp |  -.0027813   .0035167    -0.79   0.429    -.0096753    .0041127
       expsqr |   .0000421   .0001109     0.38   0.704    -.0001752    .0002595
   highvocedu |  -.0061158   .0057978    -1.05   0.292    -.0174817    .0052501
   highgenedu |  -.0204184   .0057162    -3.57   0.000    -.0316243   -.0092126
     adultedu |  -.0172301   .0070628    -2.44   0.015    -.0310759   -.0033844
 provincedum2 |  -.0014992   .0100808    -0.15   0.882    -.0212614     .018263
 provincedum3 |  -.0150159   .0097452    -1.54   0.123    -.0341203    .0040884
 provincedum4 |  -.0005232   .0101942    -0.05   0.959    -.0205076    .0194613
 provincedum5 |   .0018523   .0091213     0.20   0.839    -.0160288    .0197335
 provincedum6 |   .0107759   .0108647     0.99   0.321     -.010523    .0320748
 provincedum7 |   .0006025   .0102741     0.06   0.953    -.0195385    .0207435
 provincedum8 |  -.0062547   .0098595    -0.63   0.526    -.0255831    .0130737
 provincedum9 |  -.0132324   .0094403    -1.40   0.161    -.0317389    .0052741
provincedum10 |  -.0041772   .0100511    -0.42   0.678    -.0238811    .0155268
provincedum11 |  -.0118022   .0085571    -1.38   0.168    -.0285773    .0049729
provincedum12 |  -.0001494   .0106903    -0.01   0.989    -.0211063    .0208075
provincedum13 |   .0070706   .0098367     0.72   0.472     -.012213    .0263542
provincedum14 |  -.0029278   .0134142    -0.22   0.827    -.0292246     .023369
provincedum15 |   -.008793   .0120461    -0.73   0.465    -.0324079    .0148219
           m1 |  -.0088795    .078098    -0.11   0.909    -.1619808    .1442219
           m2 |   .0600751   .0221262     2.72   0.007     .0166995    .1034508
           m3 |   .0678729   .0487941     1.39   0.164    -.0277819    .1635278
        _cons |   .0575963   .0132524     4.35   0.000     .0316167     .083576
-------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(ed
> ucat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_ent
> rant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(7, 5781)      =      4.80
       Model |  .689795304         7  .098542186   Prob > F        =    0.0000
    Residual |  118.739122     5,781  .020539547   R-squared       =    0.0058
-------------+----------------------------------   Adj R-squared   =    0.0046
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14332

------------------------------------------------------------------------------
gen_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0081965   .0042279    -1.94   0.053    -.0164848    .0000918
         exp |  -.0037318   .0033238    -1.12   0.262    -.0102476     .002784
      expsqr |   .0000792   .0001065     0.74   0.457    -.0001296     .000288
   higheredu |  -.0144547   .0049087    -2.94   0.003    -.0240776   -.0048318
         _m1 |  -.0351537   .0731221    -0.48   0.631    -.1785004     .108193
         _m2 |   .0615098   .0210277     2.93   0.003     .0202875     .102732
         _m3 |   .0808952   .0475689     1.70   0.089    -.0123576     .174148
       _cons |   .0530058   .0108988     4.86   0.000     .0316401    .0743715
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0231638          .        .       .            .           .
        rho1 |  -.2309756          .        .       .            .           .
        rho2 |    .404147          .        .       .            .           .
        rho3 |   .5315181          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992
> )

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(7, 5781)      =      4.80
       Model |  .689795304         7  .098542186   Prob > F        =    0.0000
    Residual |  118.739122     5,781  .020539547   R-squared       =    0.0058
-------------+----------------------------------   Adj R-squared   =    0.0046
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14332

------------------------------------------------------------------------------
gen_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0081965   .0042279    -1.94   0.053    -.0164848    .0000918
         exp |  -.0037318   .0033238    -1.12   0.262    -.0102476     .002784
      expsqr |   .0000792   .0001065     0.74   0.457    -.0001296     .000288
   higheredu |  -.0144547   .0049087    -2.94   0.003    -.0240776   -.0048318
          m1 |  -.0351537   .0731221    -0.48   0.631    -.1785004     .108193
          m2 |   .0615098   .0210277     2.93   0.003     .0202875     .102732
          m3 |   .0808952   .0475689     1.70   0.089    -.0123576     .174148
       _cons |   .0530058   .0108988     4.86   0.000     .0316401    .0743715
------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bir
> thyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_e
> ntrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(21, 5767)     =      2.25
       Model |  .969053703        21  .046145414   Prob > F        =    0.0009
    Residual |  118.459863     5,767  .020540985   R-squared       =    0.0081
-------------+----------------------------------   Adj R-squared   =    0.0045
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14332

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0082103   .0043065    -1.91   0.057    -.0166525     .000232
          exp |  -.0032664    .003515    -0.93   0.353    -.0101571    .0036243
       expsqr |   .0000528   .0001109     0.48   0.634    -.0001646    .0002702
    higheredu |  -.0142382   .0050138    -2.84   0.005    -.0240671   -.0044093
 provincedum2 |    .001715   .0100262     0.17   0.864      -.01794      .02137
 provincedum3 |  -.0136138   .0097396    -1.40   0.162    -.0327071    .0054795
 provincedum4 |     .00066   .0101919     0.06   0.948    -.0193199      .02064
 provincedum5 |   .0033293   .0091114     0.37   0.715    -.0145324    .0211911
 provincedum6 |   .0134924   .0108319     1.25   0.213    -.0077422     .034727
 provincedum7 |   .0033808   .0102376     0.33   0.741    -.0166887    .0234503
 provincedum8 |   -.002839   .0097959    -0.29   0.772    -.0220425    .0163646
 provincedum9 |  -.0110235   .0094161    -1.17   0.242    -.0294826    .0074357
provincedum10 |  -.0010221   .0099996    -0.10   0.919    -.0206251     .018581
provincedum11 |  -.0090747   .0085109    -1.07   0.286    -.0257592    .0076099
provincedum12 |   .0018618   .0106702     0.17   0.861    -.0190558    .0227794
provincedum13 |   .0097171   .0097986     0.99   0.321    -.0094919    .0289261
provincedum14 |  -.0012319   .0134026    -0.09   0.927    -.0275062    .0250423
provincedum15 |    -.00818   .0120502    -0.68   0.497    -.0318029    .0154429
          _m1 |  -.0249217   .0779336    -0.32   0.749    -.1777007    .1278573
          _m2 |    .062982   .0221173     2.85   0.004     .0196238    .1063402
          _m3 |   .0671928   .0487237     1.38   0.168     -.028324    .1627097
        _cons |   .0530411   .0130621     4.06   0.000     .0274345    .0786477
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0226699          .        .       .            .           .
        rho1 |  -.1655209          .        .       .            .           .
        rho2 |   .4183034          .        .       .            .           .
        rho3 |   .4462703          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if in
> range(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(21, 5767)     =      2.25
       Model |  .969053703        21  .046145414   Prob > F        =    0.0009
    Residual |  118.459863     5,767  .020540985   R-squared       =    0.0081
-------------+----------------------------------   Adj R-squared   =    0.0045
       Total |  119.428917     5,788  .020633883   Root MSE        =    .14332

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0082103   .0043065    -1.91   0.057    -.0166525     .000232
          exp |  -.0032664    .003515    -0.93   0.353    -.0101571    .0036243
       expsqr |   .0000528   .0001109     0.48   0.634    -.0001646    .0002702
    higheredu |  -.0142382   .0050138    -2.84   0.005    -.0240671   -.0044093
 provincedum2 |    .001715   .0100262     0.17   0.864      -.01794      .02137
 provincedum3 |  -.0136138   .0097396    -1.40   0.162    -.0327071    .0054795
 provincedum4 |     .00066   .0101919     0.06   0.948    -.0193199      .02064
 provincedum5 |   .0033293   .0091114     0.37   0.715    -.0145324    .0211911
 provincedum6 |   .0134924   .0108319     1.25   0.213    -.0077422     .034727
 provincedum7 |   .0033808   .0102376     0.33   0.741    -.0166887    .0234503
 provincedum8 |   -.002839   .0097959    -0.29   0.772    -.0220425    .0163646
 provincedum9 |  -.0110235   .0094161    -1.17   0.242    -.0294826    .0074357
provincedum10 |  -.0010221   .0099996    -0.10   0.919    -.0206251     .018581
provincedum11 |  -.0090747   .0085109    -1.07   0.286    -.0257592    .0076099
provincedum12 |   .0018618   .0106702     0.17   0.861    -.0190558    .0227794
provincedum13 |   .0097171   .0097986     0.99   0.321    -.0094919    .0289261
provincedum14 |  -.0012319   .0134026    -0.09   0.927    -.0275062    .0250423
provincedum15 |    -.00818   .0120502    -0.68   0.497    -.0318029    .0154429
           m1 |  -.0249217   .0779336    -0.32   0.749    -.1777007    .1278573
           m2 |    .062982   .0221173     2.85   0.004     .0196238    .1063402
           m3 |   .0671928   .0487237     1.38   0.168     -.028324    .1627097
        _cons |   .0530411   .0130621     4.06   0.000     .0274345    .0786477
-------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) Unemployment A20=5|9
. 
. selmlog voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu if inrange(birthyea
> r, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(9, 2291)      =      4.08
       Model |  2.15938996         9  .239932218   Prob > F        =    0.0000
    Residual |  134.576812     2,291  .058741515   R-squared       =    0.0158
-------------+----------------------------------   Adj R-squared   =    0.0119
       Total |  136.736202     2,300  .059450522   Root MSE        =    .24237

------------------------------------------------------------------------------
voc_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   -.044745   .0128539    -3.48   0.001    -.0699514   -.0195385
         exp |  -.0087269   .0112293    -0.78   0.437    -.0307475    .0132937
      expsqr |   .0001614   .0003404     0.47   0.635    -.0005061    .0008289
  highvocedu |   .0107526   .0164964     0.65   0.515    -.0215969    .0431021
  highgenedu |  -.0332369   .0311025    -1.07   0.285    -.0942288    .0277551
    adultedu |  -.0321381   .0146628    -2.19   0.028    -.0608919   -.0033844
         _m1 |  -.0347341   .0894467    -0.39   0.698    -.2101392    .1406709
         _m2 |  -.2876806   .2464433    -1.17   0.243    -.7709559    .1955946
         _m3 |  -.3473907   .2146018    -1.62   0.106    -.7682248    .0734434
       _cons |  -.0456473   .3396233    -0.13   0.893    -.7116486    .6203541
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0965772          .        .       .            .           .
        rho1 |  -.1117685          .        .       .            .           .
        rho2 |  -.9257066          .        .       .            .           .
        rho3 |  -1.117843          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange
> (birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(9, 2291)      =      4.08
       Model |  2.15938996         9  .239932218   Prob > F        =    0.0000
    Residual |  134.576812     2,291  .058741515   R-squared       =    0.0158
-------------+----------------------------------   Adj R-squared   =    0.0119
       Total |  136.736202     2,300  .059450522   Root MSE        =    .24237

------------------------------------------------------------------------------
voc_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   -.044745   .0128539    -3.48   0.001    -.0699514   -.0195385
         exp |  -.0087269   .0112293    -0.78   0.437    -.0307475    .0132937
      expsqr |   .0001614   .0003404     0.47   0.635    -.0005061    .0008289
  highvocedu |   .0107526   .0164964     0.65   0.515    -.0215969    .0431021
  highgenedu |  -.0332369   .0311025    -1.07   0.285    -.0942288    .0277551
    adultedu |  -.0321381   .0146628    -2.19   0.028    -.0608919   -.0033844
          m1 |  -.0347341   .0894467    -0.39   0.698    -.2101392    .1406709
          m2 |  -.2876806   .2464433    -1.17   0.243    -.7709559    .1955946
          m3 |  -.3473907   .2146018    -1.62   0.106    -.7682248    .0734434
       _cons |  -.0456473   .3396233    -0.13   0.893    -.7116486    .6203541
------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_r
> elative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(23, 2277)     =      2.13
       Model |  2.88066673        23  .125246379   Prob > F        =    0.0014
    Residual |  133.855535     2,277  .058785918   R-squared       =    0.0211
-------------+----------------------------------   Adj R-squared   =    0.0112
       Total |  136.736202     2,300  .059450522   Root MSE        =    .24246

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0534129   .0137798    -3.88   0.000    -.0804351   -.0263907
          exp |   .0012279    .012473     0.10   0.922    -.0232318    .0256877
       expsqr |  -.0001236   .0003724    -0.33   0.740    -.0008538    .0006066
   highvocedu |   .0071397   .0166745     0.43   0.669    -.0255592    .0398386
   highgenedu |  -.0348174   .0314158    -1.11   0.268    -.0964239    .0267892
     adultedu |  -.0355804   .0150281    -2.37   0.018    -.0650506   -.0061102
 provincedum2 |   -.020472   .0298448    -0.69   0.493    -.0789979    .0380539
 provincedum3 |   -.002918   .0317308    -0.09   0.927    -.0651423    .0593062
 provincedum4 |   .0169702   .0290079     0.59   0.559    -.0399144    .0738548
 provincedum5 |   .0045299   .0270974     0.17   0.867    -.0486083    .0576682
 provincedum6 |  -.0343622    .033253    -1.03   0.302    -.0995716    .0308472
 provincedum7 |  -.0222813   .0290861    -0.77   0.444    -.0793193    .0347567
 provincedum8 |   -.032961    .030321    -1.09   0.277    -.0924206    .0264986
 provincedum9 |  -.0204548   .0285348    -0.72   0.474    -.0764118    .0355022
provincedum10 |  -.0144068   .0287935    -0.50   0.617    -.0708709    .0420574
provincedum11 |  -.0288444   .0271334    -1.06   0.288    -.0820533    .0243644
provincedum12 |   -.044253    .030517    -1.45   0.147    -.1040971     .015591
provincedum13 |  -.0220418   .0302939    -0.73   0.467    -.0814484    .0373648
provincedum14 |   .0221312   .0331403     0.67   0.504    -.0428572    .0871195
provincedum15 |  -.0529112   .0373998    -1.41   0.157    -.1262524    .0204301
          _m1 |   .0474909   .0996691     0.48   0.634    -.1479609    .2429427
          _m2 |  -.5188013   .2845048    -1.82   0.068    -1.076717    .0391145
          _m3 |  -.5103678   .2351425    -2.17   0.030    -.9714838   -.0492519
        _cons |  -.3697112   .3808887    -0.97   0.332    -1.116636     .377214
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1544299          .        .       .            .           .
        rho1 |   .1208495          .        .       .            .           .
        rho2 |  -1.320187          .        .       .            .           .
        rho3 |  -1.298726          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(23, 2277)     =      2.13
       Model |  2.88066673        23  .125246379   Prob > F        =    0.0014
    Residual |  133.855535     2,277  .058785918   R-squared       =    0.0211
-------------+----------------------------------   Adj R-squared   =    0.0112
       Total |  136.736202     2,300  .059450522   Root MSE        =    .24246

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0534129   .0137798    -3.88   0.000    -.0804351   -.0263907
          exp |   .0012279    .012473     0.10   0.922    -.0232318    .0256877
       expsqr |  -.0001236   .0003724    -0.33   0.740    -.0008538    .0006066
   highvocedu |   .0071397   .0166745     0.43   0.669    -.0255592    .0398386
   highgenedu |  -.0348174   .0314158    -1.11   0.268    -.0964239    .0267892
     adultedu |  -.0355804   .0150281    -2.37   0.018    -.0650506   -.0061102
 provincedum2 |   -.020472   .0298448    -0.69   0.493    -.0789979    .0380539
 provincedum3 |   -.002918   .0317308    -0.09   0.927    -.0651423    .0593062
 provincedum4 |   .0169702   .0290079     0.59   0.559    -.0399144    .0738548
 provincedum5 |   .0045299   .0270974     0.17   0.867    -.0486083    .0576682
 provincedum6 |  -.0343622    .033253    -1.03   0.302    -.0995716    .0308472
 provincedum7 |  -.0222813   .0290861    -0.77   0.444    -.0793193    .0347567
 provincedum8 |   -.032961    .030321    -1.09   0.277    -.0924206    .0264986
 provincedum9 |  -.0204548   .0285348    -0.72   0.474    -.0764118    .0355022
provincedum10 |  -.0144068   .0287935    -0.50   0.617    -.0708709    .0420574
provincedum11 |  -.0288444   .0271334    -1.06   0.288    -.0820533    .0243644
provincedum12 |   -.044253    .030517    -1.45   0.147    -.1040971     .015591
provincedum13 |  -.0220418   .0302939    -0.73   0.467    -.0814484    .0373648
provincedum14 |   .0221312   .0331403     0.67   0.504    -.0428572    .0871195
provincedum15 |  -.0529112   .0373998    -1.41   0.157    -.1262524    .0204301
           m1 |   .0474909   .0996691     0.48   0.634    -.1479609    .2429427
           m2 |  -.5188013   .2845048    -1.82   0.068    -1.076717    .0391145
           m3 |  -.5103678   .2351425    -2.17   0.030    -.9714838   -.0492519
        _cons |  -.3697112   .3808887    -0.97   0.332    -1.116636     .377214
-------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_59 male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(7, 2293)      =      4.55
       Model |  1.87285212         7  .267550303   Prob > F        =    0.0000
    Residual |   134.86335     2,293  .058815242   R-squared       =    0.0137
-------------+----------------------------------   Adj R-squared   =    0.0107
       Total |  136.736202     2,300  .059450522   Root MSE        =    .24252

------------------------------------------------------------------------------
voc_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0446864   .0128603    -3.47   0.001    -.0699054   -.0194674
         exp |  -.0100094   .0111967    -0.89   0.371     -.031966    .0119472
      expsqr |    .000187   .0003397     0.55   0.582    -.0004792    .0008531
   higheredu |  -.0155663   .0114055    -1.36   0.172    -.0379325    .0067999
         _m1 |  -.0321743   .0894367    -0.36   0.719    -.2075596    .1432109
         _m2 |  -.3046982    .246309    -1.24   0.216    -.7877099    .1783136
         _m3 |  -.3633811   .2144432    -1.69   0.090    -.7839041    .0571418
       _cons |  -.0492941   .3394144    -0.15   0.885    -.7148854    .6162971
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1004815          .        .       .            .           .
        rho1 |  -.1015001          .        .       .            .           .
        rho2 |   -.961229          .        .       .            .           .
        rho3 |  -1.146356          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 199
> 2)

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(7, 2293)      =      4.55
       Model |  1.87285212         7  .267550303   Prob > F        =    0.0000
    Residual |   134.86335     2,293  .058815242   R-squared       =    0.0137
-------------+----------------------------------   Adj R-squared   =    0.0107
       Total |  136.736202     2,300  .059450522   Root MSE        =    .24252

------------------------------------------------------------------------------
voc_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0446864   .0128603    -3.47   0.001    -.0699054   -.0194674
         exp |  -.0100094   .0111967    -0.89   0.371     -.031966    .0119472
      expsqr |    .000187   .0003397     0.55   0.582    -.0004792    .0008531
   higheredu |  -.0155663   .0114055    -1.36   0.172    -.0379325    .0067999
          m1 |  -.0321743   .0894367    -0.36   0.719    -.2075596    .1432109
          m2 |  -.3046982    .246309    -1.24   0.216    -.7877099    .1783136
          m3 |  -.3633811   .2144432    -1.69   0.090    -.7839041    .0571418
       _cons |  -.0492941   .3394144    -0.15   0.885    -.7148854    .6162971
------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bi
> rthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_
> entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(21, 2279)     =      2.11
       Model |  2.60423066        21  .124010984   Prob > F        =    0.0023
    Residual |  134.131971     2,279  .058855626   R-squared       =    0.0190
-------------+----------------------------------   Adj R-squared   =    0.0100
       Total |  136.736202     2,300  .059450522   Root MSE        =     .2426

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0528266   .0137833    -3.83   0.000    -.0798558   -.0257974
          exp |  -.0004193   .0124363    -0.03   0.973     -.024807    .0239684
       expsqr |  -.0000893   .0003717    -0.24   0.810    -.0008181    .0006396
    higheredu |  -.0185933   .0117196    -1.59   0.113    -.0415755    .0043889
 provincedum2 |   -.016751   .0298102    -0.56   0.574     -.075209     .041707
 provincedum3 |  -.0005436   .0317165    -0.02   0.986    -.0627398    .0616526
 provincedum4 |   .0218756   .0289367     0.76   0.450    -.0348694    .0786205
 provincedum5 |   .0089768   .0270357     0.33   0.740    -.0440405     .061994
 provincedum6 |  -.0318399   .0332504    -0.96   0.338    -.0970442    .0333643
 provincedum7 |  -.0184331   .0290166    -0.64   0.525    -.0753348    .0384686
 provincedum8 |  -.0281875   .0302583    -0.93   0.352    -.0875241    .0311491
 provincedum9 |  -.0181179   .0285234    -0.64   0.525    -.0740524    .0378166
provincedum10 |   -.010814   .0287597    -0.38   0.707    -.0672119    .0455838
provincedum11 |  -.0248926   .0270876    -0.92   0.358    -.0780116    .0282264
provincedum12 |  -.0411657   .0305002    -1.35   0.177    -.1009767    .0186453
provincedum13 |  -.0182349   .0302609    -0.60   0.547    -.0775768    .0411069
provincedum14 |   .0233892    .033138     0.71   0.480    -.0415947     .088373
provincedum15 |   -.052641   .0374214    -1.41   0.160    -.1260246    .0207426
          _m1 |   .0464239   .0996729     0.47   0.641    -.1490352     .241883
          _m2 |  -.5164052   .2844459    -1.82   0.070    -1.074205    .0413947
          _m3 |  -.5155643    .235048    -2.19   0.028    -.9764946    -.054634
        _cons |  -.3555591   .3806125    -0.93   0.350    -1.101942    .3908241
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1551768          .        .       .            .           .
        rho1 |   .1178497          .        .       .            .           .
        rho2 |  -1.310923          .        .       .            .           .
        rho3 |  -1.308789          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if i
> nrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,301
-------------+----------------------------------   F(21, 2279)     =      2.11
       Model |  2.60423066        21  .124010984   Prob > F        =    0.0023
    Residual |  134.131971     2,279  .058855626   R-squared       =    0.0190
-------------+----------------------------------   Adj R-squared   =    0.0100
       Total |  136.736202     2,300  .059450522   Root MSE        =     .2426

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0528266   .0137833    -3.83   0.000    -.0798558   -.0257974
          exp |  -.0004193   .0124363    -0.03   0.973     -.024807    .0239684
       expsqr |  -.0000893   .0003717    -0.24   0.810    -.0008181    .0006396
    higheredu |  -.0185933   .0117196    -1.59   0.113    -.0415755    .0043889
 provincedum2 |   -.016751   .0298102    -0.56   0.574     -.075209     .041707
 provincedum3 |  -.0005436   .0317165    -0.02   0.986    -.0627398    .0616526
 provincedum4 |   .0218756   .0289367     0.76   0.450    -.0348694    .0786205
 provincedum5 |   .0089768   .0270357     0.33   0.740    -.0440405     .061994
 provincedum6 |  -.0318399   .0332504    -0.96   0.338    -.0970442    .0333643
 provincedum7 |  -.0184331   .0290166    -0.64   0.525    -.0753348    .0384686
 provincedum8 |  -.0281875   .0302583    -0.93   0.352    -.0875241    .0311491
 provincedum9 |  -.0181179   .0285234    -0.64   0.525    -.0740524    .0378166
provincedum10 |   -.010814   .0287597    -0.38   0.707    -.0672119    .0455838
provincedum11 |  -.0248926   .0270876    -0.92   0.358    -.0780116    .0282264
provincedum12 |  -.0411657   .0305002    -1.35   0.177    -.1009767    .0186453
provincedum13 |  -.0182349   .0302609    -0.60   0.547    -.0775768    .0411069
provincedum14 |   .0233892    .033138     0.71   0.480    -.0415947     .088373
provincedum15 |   -.052641   .0374214    -1.41   0.160    -.1260246    .0207426
           m1 |   .0464239   .0996729     0.47   0.641    -.1490352     .241883
           m2 |  -.5164052   .2844459    -1.82   0.070    -1.074205    .0413947
           m3 |  -.5155643    .235048    -2.19   0.028    -.9764946    -.054634
        _cons |  -.3555591   .3806125    -0.93   0.350    -1.101942    .3908241
-------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu if inrange(birthyea
> r, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(9, 5779)      =      7.97
       Model |   3.0795073         9  .342167478   Prob > F        =    0.0000
    Residual |  247.972142     5,779  .042909178   R-squared       =    0.0123
-------------+----------------------------------   Adj R-squared   =    0.0107
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20715

------------------------------------------------------------------------------
gen_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0194324   .0061132    -3.18   0.001    -.0314165   -.0074483
         exp |  -.0090908    .004805    -1.89   0.059    -.0185103    .0003288
      expsqr |   .0002115    .000154     1.37   0.169    -.0000903    .0005134
  highvocedu |  -.0155752   .0083155    -1.87   0.061    -.0318767    .0007263
  highgenedu |   -.040004   .0080242    -4.99   0.000    -.0557345   -.0242736
    adultedu |  -.0393846   .0101096    -3.90   0.000    -.0592032    -.019566
         _m1 |   -.147784   .1057679    -1.40   0.162    -.3551287    .0595607
         _m2 |   .0697162   .0303992     2.29   0.022     .0101224    .1293101
         _m3 |    .082013   .0688952     1.19   0.234    -.0530475    .2170735
       _cons |   .1056953   .0159363     6.63   0.000     .0744543    .1369364
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0510575          .        .       .            .           .
        rho1 |  -.6540302          .        .       .            .           .
        rho2 |   .3085349          .        .       .            .           .
        rho3 |   .3629552          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange
> (birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(9, 5779)      =      7.97
       Model |   3.0795073         9  .342167478   Prob > F        =    0.0000
    Residual |  247.972142     5,779  .042909178   R-squared       =    0.0123
-------------+----------------------------------   Adj R-squared   =    0.0107
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20715

------------------------------------------------------------------------------
gen_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0194324   .0061132    -3.18   0.001    -.0314165   -.0074483
         exp |  -.0090908    .004805    -1.89   0.059    -.0185103    .0003288
      expsqr |   .0002115    .000154     1.37   0.169    -.0000903    .0005134
  highvocedu |  -.0155752   .0083155    -1.87   0.061    -.0318767    .0007263
  highgenedu |   -.040004   .0080242    -4.99   0.000    -.0557345   -.0242736
    adultedu |  -.0393846   .0101096    -3.90   0.000    -.0592032    -.019566
          m1 |   -.147784   .1057679    -1.40   0.162    -.3551287    .0595607
          m2 |   .0697162   .0303992     2.29   0.022     .0101224    .1293101
          m3 |    .082013   .0688952     1.19   0.234    -.0530475    .2170735
       _cons |   .1056953   .0159363     6.63   0.000     .0744543    .1369364
------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_r
> elative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(23, 5765)     =      4.76
       Model |  4.67441239        23  .203235321   Prob > F        =    0.0000
    Residual |  246.377237     5,765  .042736728   R-squared       =    0.0186
-------------+----------------------------------   Adj R-squared   =    0.0147
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20673

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0211832   .0062152    -3.41   0.001    -.0333674   -.0089991
          exp |  -.0059689   .0050755    -1.18   0.240    -.0159188    .0039811
       expsqr |   .0001071     .00016     0.67   0.504    -.0002067    .0004208
   highvocedu |  -.0173528   .0083678    -2.07   0.038    -.0337569   -.0009488
   highgenedu |  -.0434399     .00825    -5.27   0.000     -.059613   -.0272669
     adultedu |  -.0431806   .0101935    -4.24   0.000    -.0631638   -.0231974
 provincedum2 |    .010432   .0145494     0.72   0.473    -.0180902    .0389542
 provincedum3 |  -.0365702    .014065    -2.60   0.009    -.0641429   -.0089975
 provincedum4 |   .0121755    .014713     0.83   0.408    -.0166675    .0410185
 provincedum5 |  -.0149682   .0131645    -1.14   0.256    -.0407756    .0108391
 provincedum6 |  -.0141019   .0156807    -0.90   0.369     -.044842    .0166382
 provincedum7 |  -.0218961   .0148282    -1.48   0.140    -.0509651    .0071728
 provincedum8 |  -.0234079     .01423    -1.64   0.100     -.051304    .0044881
 provincedum9 |  -.0426877   .0136249    -3.13   0.002    -.0693976   -.0159779
provincedum10 |  -.0271256   .0145065    -1.87   0.062    -.0555637    .0013125
provincedum11 |  -.0352304   .0123502    -2.85   0.004    -.0594414   -.0110194
provincedum12 |  -.0343931   .0154289    -2.23   0.026    -.0646396   -.0041466
provincedum13 |  -.0029591    .014197    -0.21   0.835    -.0307906    .0248723
provincedum14 |  -.0128474   .0193603    -0.66   0.507    -.0508008     .025106
provincedum15 |  -.0317369   .0173858    -1.83   0.068    -.0658196    .0023458
          _m1 |  -.0690136   .1127165    -0.61   0.540    -.2899803    .1519531
          _m2 |   .0464021   .0319341     1.45   0.146    -.0162007    .1090048
          _m3 |   .0254331   .0704232     0.36   0.718    -.1126228    .1634889
        _cons |   .1273559   .0191268     6.66   0.000     .0898602    .1648515
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0445622          .        .       .            .           .
        rho1 |  -.3269273          .        .       .            .           .
        rho2 |   .2198133          .        .       .            .           .
        rho3 |   .1204802          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(23, 5765)     =      4.76
       Model |  4.67441239        23  .203235321   Prob > F        =    0.0000
    Residual |  246.377237     5,765  .042736728   R-squared       =    0.0186
-------------+----------------------------------   Adj R-squared   =    0.0147
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20673

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0211832   .0062152    -3.41   0.001    -.0333674   -.0089991
          exp |  -.0059689   .0050755    -1.18   0.240    -.0159188    .0039811
       expsqr |   .0001071     .00016     0.67   0.504    -.0002067    .0004208
   highvocedu |  -.0173528   .0083678    -2.07   0.038    -.0337569   -.0009488
   highgenedu |  -.0434399     .00825    -5.27   0.000     -.059613   -.0272669
     adultedu |  -.0431806   .0101935    -4.24   0.000    -.0631638   -.0231974
 provincedum2 |    .010432   .0145494     0.72   0.473    -.0180902    .0389542
 provincedum3 |  -.0365702    .014065    -2.60   0.009    -.0641429   -.0089975
 provincedum4 |   .0121755    .014713     0.83   0.408    -.0166675    .0410185
 provincedum5 |  -.0149682   .0131645    -1.14   0.256    -.0407756    .0108391
 provincedum6 |  -.0141019   .0156807    -0.90   0.369     -.044842    .0166382
 provincedum7 |  -.0218961   .0148282    -1.48   0.140    -.0509651    .0071728
 provincedum8 |  -.0234079     .01423    -1.64   0.100     -.051304    .0044881
 provincedum9 |  -.0426877   .0136249    -3.13   0.002    -.0693976   -.0159779
provincedum10 |  -.0271256   .0145065    -1.87   0.062    -.0555637    .0013125
provincedum11 |  -.0352304   .0123502    -2.85   0.004    -.0594414   -.0110194
provincedum12 |  -.0343931   .0154289    -2.23   0.026    -.0646396   -.0041466
provincedum13 |  -.0029591    .014197    -0.21   0.835    -.0307906    .0248723
provincedum14 |  -.0128474   .0193603    -0.66   0.507    -.0508008     .025106
provincedum15 |  -.0317369   .0173858    -1.83   0.068    -.0658196    .0023458
           m1 |  -.0690136   .1127165    -0.61   0.540    -.2899803    .1519531
           m2 |   .0464021   .0319341     1.45   0.146    -.0162007    .1090048
           m3 |   .0254331   .0704232     0.36   0.718    -.1126228    .1634889
        _cons |   .1273559   .0191268     6.66   0.000     .0898602    .1648515
-------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(7, 5781)      =      8.30
       Model |  2.49903558         7  .357005083   Prob > F        =    0.0000
    Residual |  248.552614     5,781  .042994744   R-squared       =    0.0100
-------------+----------------------------------   Adj R-squared   =    0.0088
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20735

------------------------------------------------------------------------------
gen_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0191502    .006117    -3.13   0.002    -.0311418   -.0071586
         exp |  -.0093941   .0048088    -1.95   0.051    -.0188212    .0000331
      expsqr |   .0002191   .0001541     1.42   0.155     -.000083    .0005212
   higheredu |  -.0312134    .007102    -4.40   0.000     -.045136   -.0172909
         _m1 |  -.1612861    .105794    -1.52   0.127    -.3686819    .0461097
         _m2 |   .0714881   .0304232     2.35   0.019     .0118473     .131129
         _m3 |    .082971   .0688232     1.21   0.228    -.0519483    .2178903
       _cons |   .1034502   .0157685     6.56   0.000      .072538    .1343623
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .052317          .        .       .            .           .
        rho1 |  -.7051403          .        .       .            .           .
        rho2 |   .3125449          .        .       .            .           .
        rho3 |   .3627477          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 199
> 2)

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(7, 5781)      =      8.30
       Model |  2.49903558         7  .357005083   Prob > F        =    0.0000
    Residual |  248.552614     5,781  .042994744   R-squared       =    0.0100
-------------+----------------------------------   Adj R-squared   =    0.0088
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20735

------------------------------------------------------------------------------
gen_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0191502    .006117    -3.13   0.002    -.0311418   -.0071586
         exp |  -.0093941   .0048088    -1.95   0.051    -.0188212    .0000331
      expsqr |   .0002191   .0001541     1.42   0.155     -.000083    .0005212
   higheredu |  -.0312134    .007102    -4.40   0.000     -.045136   -.0172909
          m1 |  -.1612861    .105794    -1.52   0.127    -.3686819    .0461097
          m2 |   .0714881   .0304232     2.35   0.019     .0118473     .131129
          m3 |    .082971   .0688232     1.21   0.228    -.0519483    .2178903
       _cons |   .1034502   .0157685     6.56   0.000      .072538    .1343623
------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bi
> rthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_
> entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(21, 5767)     =      4.47
       Model |  4.02424945        21  .191630926   Prob > F        =    0.0000
    Residual |    247.0274     5,767  .042834645   R-squared       =    0.0160
-------------+----------------------------------   Adj R-squared   =    0.0124
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20697

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0204297   .0062188    -3.29   0.001    -.0326209   -.0082384
          exp |  -.0068726   .0050759    -1.35   0.176    -.0168232     .003078
       expsqr |   .0001271   .0001601     0.79   0.427    -.0001868    .0004411
    higheredu |  -.0334206   .0072403    -4.62   0.000    -.0476143    -.019227
 provincedum2 |   .0162509   .0144784     1.12   0.262    -.0121322    .0446341
 provincedum3 |  -.0339502   .0140646    -2.41   0.016    -.0615222   -.0063782
 provincedum4 |   .0142933   .0147177     0.97   0.332     -.014559    .0431456
 provincedum5 |   -.012051   .0131574    -0.92   0.360    -.0378445    .0137425
 provincedum6 |  -.0091322    .015642    -0.58   0.559    -.0397964     .021532
 provincedum7 |  -.0167129   .0147837    -1.13   0.258    -.0456946    .0122687
 provincedum8 |  -.0172043   .0141459    -1.22   0.224    -.0449355    .0105269
 provincedum9 |  -.0384758   .0135975    -2.83   0.005     -.065132   -.0118195
provincedum10 |  -.0213613   .0144401    -1.48   0.139    -.0496694    .0069468
provincedum11 |  -.0302853   .0122903    -2.46   0.014    -.0543789   -.0061916
provincedum12 |  -.0309107   .0154085    -2.01   0.045     -.061117   -.0007043
provincedum13 |   .0017649   .0141499     0.12   0.901    -.0259741     .029504
provincedum14 |   -.010055   .0193543    -0.52   0.603    -.0479967    .0278867
provincedum15 |  -.0304394   .0174013    -1.75   0.080    -.0645525    .0036736
          _m1 |  -.0973568   .1125412    -0.87   0.387    -.3179797    .1232662
          _m2 |    .051957   .0319388     1.63   0.104    -.0106551     .114569
          _m3 |   .0268119   .0703603     0.38   0.703    -.1111207    .1647444
        _cons |   .1202818   .0188625     6.38   0.000     .0833042    .1572594
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0460507          .        .       .            .           .
        rho1 |  -.4536783          .        .       .            .           .
        rho2 |   .2421173          .        .       .            .           .
        rho3 |   .1249422          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if i
> nrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,789
-------------+----------------------------------   F(21, 5767)     =      4.47
       Model |  4.02424945        21  .191630926   Prob > F        =    0.0000
    Residual |    247.0274     5,767  .042834645   R-squared       =    0.0160
-------------+----------------------------------   Adj R-squared   =    0.0124
       Total |   251.05165     5,788  .043374508   Root MSE        =    .20697

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0204297   .0062188    -3.29   0.001    -.0326209   -.0082384
          exp |  -.0068726   .0050759    -1.35   0.176    -.0168232     .003078
       expsqr |   .0001271   .0001601     0.79   0.427    -.0001868    .0004411
    higheredu |  -.0334206   .0072403    -4.62   0.000    -.0476143    -.019227
 provincedum2 |   .0162509   .0144784     1.12   0.262    -.0121322    .0446341
 provincedum3 |  -.0339502   .0140646    -2.41   0.016    -.0615222   -.0063782
 provincedum4 |   .0142933   .0147177     0.97   0.332     -.014559    .0431456
 provincedum5 |   -.012051   .0131574    -0.92   0.360    -.0378445    .0137425
 provincedum6 |  -.0091322    .015642    -0.58   0.559    -.0397964     .021532
 provincedum7 |  -.0167129   .0147837    -1.13   0.258    -.0456946    .0122687
 provincedum8 |  -.0172043   .0141459    -1.22   0.224    -.0449355    .0105269
 provincedum9 |  -.0384758   .0135975    -2.83   0.005     -.065132   -.0118195
provincedum10 |  -.0213613   .0144401    -1.48   0.139    -.0496694    .0069468
provincedum11 |  -.0302853   .0122903    -2.46   0.014    -.0543789   -.0061916
provincedum12 |  -.0309107   .0154085    -2.01   0.045     -.061117   -.0007043
provincedum13 |   .0017649   .0141499     0.12   0.901    -.0259741     .029504
provincedum14 |   -.010055   .0193543    -0.52   0.603    -.0479967    .0278867
provincedum15 |  -.0304394   .0174013    -1.75   0.080    -.0645525    .0036736
           m1 |  -.0973568   .1125412    -0.87   0.387    -.3179797    .1232662
           m2 |    .051957   .0319388     1.63   0.104    -.0106551     .114569
           m3 |   .0268119   .0703603     0.38   0.703    -.1111207    .1647444
        _cons |   .1202818   .0188625     6.38   0.000     .0833042    .1572594
-------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) High occupation
. 
. selmlog voc_highocc male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear, 19
> 71, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_rel
> ative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(9, 2093)      =     21.49
       Model |   34.642883         9  3.84920923   Prob > F        =    0.0000
    Residual |  374.830251     2,093  .179087554   R-squared       =    0.0846
-------------+----------------------------------   Adj R-squared   =    0.0807
       Total |  409.473134     2,102  .194801681   Root MSE        =    .42319

------------------------------------------------------------------------------
 voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1178674    .023423     5.03   0.000     .0719327    .1638021
         exp |   .0198132   .0202579     0.98   0.328    -.0199145    .0595409
      expsqr |  -.0005228   .0006125    -0.85   0.393     -.001724    .0006783
  highvocedu |   .0893312   .0302179     2.96   0.003     .0300709    .1485915
  highgenedu |   .3987766   .0560937     7.11   0.000     .2887714    .5087819
    adultedu |   .2766948   .0262024    10.56   0.000     .2253094    .3280803
         _m1 |   .0554638   .1613988     0.34   0.731    -.2610551    .3719827
         _m2 |   .0458082   .4444922     0.10   0.918    -.8258846    .9175009
         _m3 |  -.0028248     .38637    -0.01   0.994    -.7605342    .7548847
       _cons |  -.0657341   .6137223    -0.11   0.915    -1.269304    1.137836
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1803783          .        .       .            .           .
        rho1 |   .1305923          .        .       .            .           .
        rho2 |   .1078576          .        .       .            .           .
        rho3 |   -.006651          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(birt
> hyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(9, 2093)      =     21.49
       Model |   34.642883         9  3.84920923   Prob > F        =    0.0000
    Residual |  374.830251     2,093  .179087554   R-squared       =    0.0846
-------------+----------------------------------   Adj R-squared   =    0.0807
       Total |  409.473134     2,102  .194801681   Root MSE        =    .42319

------------------------------------------------------------------------------
 voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1178674    .023423     5.03   0.000     .0719327    .1638021
         exp |   .0198132   .0202579     0.98   0.328    -.0199145    .0595409
      expsqr |  -.0005228   .0006125    -0.85   0.393     -.001724    .0006783
  highvocedu |   .0893312   .0302179     2.96   0.003     .0300709    .1485915
  highgenedu |   .3987766   .0560937     7.11   0.000     .2887714    .5087819
    adultedu |   .2766948   .0262024    10.56   0.000     .2253094    .3280803
          m1 |   .0554638   .1613988     0.34   0.731    -.2610551    .3719827
          m2 |   .0458082   .4444922     0.10   0.918    -.8258846    .9175009
          m3 |  -.0028248     .38637    -0.01   0.994    -.7605342    .7548847
       _cons |  -.0657341   .6137223    -0.11   0.915    -1.269304    1.137836
------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relati
> ve ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(23, 2079)     =      9.24
       Model |  37.9919857        23  1.65182547   Prob > F        =    0.0000
    Residual |  371.481148     2,079  .178682611   R-squared       =    0.0928
-------------+----------------------------------   Adj R-squared   =    0.0827
       Total |  409.473134     2,102  .194801681   Root MSE        =    .42271

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    .120937   .0249432     4.85   0.000     .0720207    .1698533
          exp |   .0158626   .0223624     0.71   0.478    -.0279924    .0597176
       expsqr |  -.0003419   .0006667    -0.51   0.608    -.0016494    .0009656
   highvocedu |   .0915568   .0305127     3.00   0.003     .0317181    .1513955
   highgenedu |   .3971929   .0565333     7.03   0.000      .286325    .5080607
     adultedu |   .2728597   .0268266    10.17   0.000     .2202499    .3254695
 provincedum2 |  -.0656012    .055188    -1.19   0.235    -.1738307    .0426282
 provincedum3 |  -.0163059   .0576049    -0.28   0.777    -.1292752    .0966634
 provincedum4 |  -.0299777   .0530818    -0.56   0.572    -.1340766    .0741213
 provincedum5 |  -.0149624    .049601    -0.30   0.763    -.1122352    .0823104
 provincedum6 |    .046643      .0604     0.77   0.440    -.0718079    .1650938
 provincedum7 |  -.0098914   .0529275    -0.19   0.852    -.1136877     .093905
 provincedum8 |  -.0060152   .0555016    -0.11   0.914    -.1148596    .1028293
 provincedum9 |   .0644786   .0519881     1.24   0.215    -.0374756    .1664327
provincedum10 |   .0487438   .0522882     0.93   0.351     -.053799    .1512865
provincedum11 |  -.0410668    .049495    -0.83   0.407    -.1381316    .0559981
provincedum12 |  -.0597294   .0556926    -1.07   0.284    -.1689485    .0494897
provincedum13 |  -.0297163   .0549674    -0.54   0.589    -.1375131    .0780806
provincedum14 |  -.0568723   .0597838    -0.95   0.342    -.1741147    .0603701
provincedum15 |   .0918087   .0678208     1.35   0.176     -.041195    .2248125
          _m1 |   .0106381    .179045     0.06   0.953     -.340488    .3617641
          _m2 |   .1344759   .5090789     0.26   0.792    -.8638817    1.132834
          _m3 |   .1647261    .420742     0.39   0.695    -.6603934    .9898455
        _cons |   .1033714   .6834123     0.15   0.880    -1.236872    1.443615
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1849765          .        .       .            .           .
        rho1 |   .0247346          .        .       .            .           .
        rho2 |   .3126701          .        .       .            .           .
        rho3 |   .3830047          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(23, 2079)     =      9.24
       Model |  37.9919857        23  1.65182547   Prob > F        =    0.0000
    Residual |  371.481148     2,079  .178682611   R-squared       =    0.0928
-------------+----------------------------------   Adj R-squared   =    0.0827
       Total |  409.473134     2,102  .194801681   Root MSE        =    .42271

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    .120937   .0249432     4.85   0.000     .0720207    .1698533
          exp |   .0158626   .0223624     0.71   0.478    -.0279924    .0597176
       expsqr |  -.0003419   .0006667    -0.51   0.608    -.0016494    .0009656
   highvocedu |   .0915568   .0305127     3.00   0.003     .0317181    .1513955
   highgenedu |   .3971929   .0565333     7.03   0.000      .286325    .5080607
     adultedu |   .2728597   .0268266    10.17   0.000     .2202499    .3254695
 provincedum2 |  -.0656012    .055188    -1.19   0.235    -.1738307    .0426282
 provincedum3 |  -.0163059   .0576049    -0.28   0.777    -.1292752    .0966634
 provincedum4 |  -.0299777   .0530818    -0.56   0.572    -.1340766    .0741213
 provincedum5 |  -.0149624    .049601    -0.30   0.763    -.1122352    .0823104
 provincedum6 |    .046643      .0604     0.77   0.440    -.0718079    .1650938
 provincedum7 |  -.0098914   .0529275    -0.19   0.852    -.1136877     .093905
 provincedum8 |  -.0060152   .0555016    -0.11   0.914    -.1148596    .1028293
 provincedum9 |   .0644786   .0519881     1.24   0.215    -.0374756    .1664327
provincedum10 |   .0487438   .0522882     0.93   0.351     -.053799    .1512865
provincedum11 |  -.0410668    .049495    -0.83   0.407    -.1381316    .0559981
provincedum12 |  -.0597294   .0556926    -1.07   0.284    -.1689485    .0494897
provincedum13 |  -.0297163   .0549674    -0.54   0.589    -.1375131    .0780806
provincedum14 |  -.0568723   .0597838    -0.95   0.342    -.1741147    .0603701
provincedum15 |   .0918087   .0678208     1.35   0.176     -.041195    .2248125
           m1 |   .0106381    .179045     0.06   0.953     -.340488    .3617641
           m2 |   .1344759   .5090789     0.26   0.792    -.8638817    1.132834
           m3 |   .1647261    .420742     0.39   0.695    -.6603934    .9898455
        _cons |   .1033714   .6834123     0.15   0.880    -1.236872    1.443615
-------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_highocc male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(educat
> =male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant
> _relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(7, 2095)      =     21.75
       Model |  27.7400229         7  3.96286041   Prob > F        =    0.0000
    Residual |  381.733111     2,095  .182211509   R-squared       =    0.0677
-------------+----------------------------------   Adj R-squared   =    0.0646
       Total |  409.473134     2,102  .194801681   Root MSE        =    .42686

------------------------------------------------------------------------------
 voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1175952   .0236234     4.98   0.000     .0712674     .163923
         exp |   .0234224   .0203701     1.15   0.250    -.0165254    .0633702
      expsqr |  -.0005698   .0006165    -0.92   0.355    -.0017788    .0006391
   higheredu |   .2177626   .0208065    10.47   0.000      .176959    .2585662
         _m1 |    .030048   .1627077     0.18   0.854    -.2890375    .3491335
         _m2 |   .1614753   .4478851     0.36   0.718    -.7168708    1.039821
         _m3 |   .1059338   .3892518     0.27   0.786    -.6574268    .8692944
       _cons |     .01371   .6184806     0.02   0.982    -1.199191     1.22661
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1883769          .        .       .            .           .
        rho1 |   .0692312          .        .       .            .           .
        rho2 |   .3720423          .        .       .            .           .
        rho3 |   .2440736          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(7, 2095)      =     21.75
       Model |  27.7400229         7  3.96286041   Prob > F        =    0.0000
    Residual |  381.733111     2,095  .182211509   R-squared       =    0.0677
-------------+----------------------------------   Adj R-squared   =    0.0646
       Total |  409.473134     2,102  .194801681   Root MSE        =    .42686

------------------------------------------------------------------------------
 voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1175952   .0236234     4.98   0.000     .0712674     .163923
         exp |   .0234224   .0203701     1.15   0.250    -.0165254    .0633702
      expsqr |  -.0005698   .0006165    -0.92   0.355    -.0017788    .0006391
   higheredu |   .2177626   .0208065    10.47   0.000      .176959    .2585662
          m1 |    .030048   .1627077     0.18   0.854    -.2890375    .3491335
          m2 |   .1614753   .4478851     0.36   0.718    -.7168708    1.039821
          m3 |   .1059338   .3892518     0.27   0.786    -.6574268    .8692944
       _cons |     .01371   .6184806     0.02   0.982    -1.199191     1.22661
------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_highocc male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entra
> nt_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(21, 2081)     =      8.25
       Model |  31.4651997        21  1.49834284   Prob > F        =    0.0000
    Residual |  378.007934     2,081  .181647253   R-squared       =    0.0768
-------------+----------------------------------   Adj R-squared   =    0.0675
       Total |  409.473134     2,102  .194801681   Root MSE        =     .4262

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1187348   .0251394     4.72   0.000     .0694337    .1680359
          exp |   .0204893   .0224756     0.91   0.362    -.0235877    .0645663
       expsqr |  -.0004127   .0006708    -0.62   0.538    -.0017281    .0009027
    higheredu |   .2152046   .0213434    10.08   0.000     .1733479    .2570612
 provincedum2 |  -.0864809   .0555338    -1.56   0.120    -.1953885    .0224266
 provincedum3 |  -.0310272   .0580032    -0.53   0.593    -.1447776    .0827233
 provincedum4 |  -.0521611   .0533763    -0.98   0.329    -.1568377    .0525154
 provincedum5 |  -.0380916   .0498515    -0.76   0.445    -.1358556    .0596724
 provincedum6 |   .0319765   .0608498     0.53   0.599    -.0873564    .1513094
 provincedum7 |  -.0243761   .0531864    -0.46   0.647    -.1286801    .0799279
 provincedum8 |  -.0259464   .0558398    -0.46   0.642    -.1354541    .0835612
 provincedum9 |   .0506814    .052362     0.97   0.333     -.052006    .1533687
provincedum10 |     .02888   .0526156     0.55   0.583    -.0743048    .1320648
provincedum11 |  -.0609817   .0497765    -1.23   0.221    -.1585987    .0366353
provincedum12 |  -.0770392   .0560774    -1.37   0.170    -.1870128    .0329344
provincedum13 |  -.0481691   .0553236    -0.87   0.384    -.1566644    .0603263
provincedum14 |  -.0669916   .0602324    -1.11   0.266    -.1851137    .0511305
provincedum15 |   .0891501   .0683785     1.30   0.192    -.0449473    .2232474
          _m1 |  -.0012958   .1804488    -0.01   0.994    -.3551747    .3525831
          _m2 |   .1722552   .5129545     0.34   0.737    -.8337022    1.178213
          _m3 |    .230328   .4238742     0.54   0.587    -.6009337     1.06159
        _cons |   .1197273   .6883306     0.17   0.862    -1.230161    1.469616
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1950207          .        .       .            .           .
        rho1 |  -.0029343          .        .       .            .           .
        rho2 |   .3900605          .        .       .            .           .
        rho3 |   .5215624          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inrang
> e(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     2,103
-------------+----------------------------------   F(21, 2081)     =      8.25
       Model |  31.4651997        21  1.49834284   Prob > F        =    0.0000
    Residual |  378.007934     2,081  .181647253   R-squared       =    0.0768
-------------+----------------------------------   Adj R-squared   =    0.0675
       Total |  409.473134     2,102  .194801681   Root MSE        =     .4262

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1187348   .0251394     4.72   0.000     .0694337    .1680359
          exp |   .0204893   .0224756     0.91   0.362    -.0235877    .0645663
       expsqr |  -.0004127   .0006708    -0.62   0.538    -.0017281    .0009027
    higheredu |   .2152046   .0213434    10.08   0.000     .1733479    .2570612
 provincedum2 |  -.0864809   .0555338    -1.56   0.120    -.1953885    .0224266
 provincedum3 |  -.0310272   .0580032    -0.53   0.593    -.1447776    .0827233
 provincedum4 |  -.0521611   .0533763    -0.98   0.329    -.1568377    .0525154
 provincedum5 |  -.0380916   .0498515    -0.76   0.445    -.1358556    .0596724
 provincedum6 |   .0319765   .0608498     0.53   0.599    -.0873564    .1513094
 provincedum7 |  -.0243761   .0531864    -0.46   0.647    -.1286801    .0799279
 provincedum8 |  -.0259464   .0558398    -0.46   0.642    -.1354541    .0835612
 provincedum9 |   .0506814    .052362     0.97   0.333     -.052006    .1533687
provincedum10 |     .02888   .0526156     0.55   0.583    -.0743048    .1320648
provincedum11 |  -.0609817   .0497765    -1.23   0.221    -.1585987    .0366353
provincedum12 |  -.0770392   .0560774    -1.37   0.170    -.1870128    .0329344
provincedum13 |  -.0481691   .0553236    -0.87   0.384    -.1566644    .0603263
provincedum14 |  -.0669916   .0602324    -1.11   0.266    -.1851137    .0511305
provincedum15 |   .0891501   .0683785     1.30   0.192    -.0449473    .2232474
           m1 |  -.0012958   .1804488    -0.01   0.994    -.3551747    .3525831
           m2 |   .1722552   .5129545     0.34   0.737    -.8337022    1.178213
           m3 |    .230328   .4238742     0.54   0.587    -.6009337     1.06159
        _cons |   .1197273   .6883306     0.17   0.862    -1.230161    1.469616
-------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear, 19
> 71, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_rel
> ative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(9, 5406)      =     61.29
       Model |  111.910065         9  12.4344517   Prob > F        =    0.0000
    Residual |  1096.82239     5,406  .202889825   R-squared       =    0.0926
-------------+----------------------------------   Adj R-squared   =    0.0911
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .45043

------------------------------------------------------------------------------
 gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1082302   .0137829     7.85   0.000     .0812101    .1352502
         exp |   .0287629    .010888     2.64   0.008     .0074179    .0501078
      expsqr |  -.0006572    .000349    -1.88   0.060    -.0013414     .000027
  highvocedu |   .1507791   .0189185     7.97   0.000     .1136913     .187867
  highgenedu |   .3490497   .0181156    19.27   0.000     .3135359    .3845635
    adultedu |   .1863894   .0226777     8.22   0.000     .1419319    .2308469
         _m1 |   .4054068   .2372204     1.71   0.088    -.0596408    .8704543
         _m2 |  -.1277919   .0685838    -1.86   0.062    -.2622438      .00666
         _m3 |  -.1958838   .1557172    -1.26   0.208    -.5011522    .1093846
       _cons |   -.053349   .0369069    -1.45   0.148    -.1257013    .0190034
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2558961          .        .       .            .           .
        rho1 |   .8014181          .        .       .            .           .
        rho2 |  -.2526222          .        .       .            .           .
        rho3 |   -.387228          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(birt
> hyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(9, 5406)      =     61.29
       Model |  111.910065         9  12.4344517   Prob > F        =    0.0000
    Residual |  1096.82239     5,406  .202889825   R-squared       =    0.0926
-------------+----------------------------------   Adj R-squared   =    0.0911
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .45043

------------------------------------------------------------------------------
 gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1082302   .0137829     7.85   0.000     .0812101    .1352502
         exp |   .0287629    .010888     2.64   0.008     .0074179    .0501078
      expsqr |  -.0006572    .000349    -1.88   0.060    -.0013414     .000027
  highvocedu |   .1507791   .0189185     7.97   0.000     .1136913     .187867
  highgenedu |   .3490497   .0181156    19.27   0.000     .3135359    .3845635
    adultedu |   .1863894   .0226777     8.22   0.000     .1419319    .2308469
          m1 |   .4054068   .2372204     1.71   0.088    -.0596408    .8704543
          m2 |  -.1277919   .0685838    -1.86   0.062    -.2622438      .00666
          m3 |  -.1958838   .1557172    -1.26   0.208    -.5011522    .1093846
       _cons |   -.053349   .0369069    -1.45   0.148    -.1257013    .0190034
------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relati
> ve ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(23, 5392)     =     25.11
       Model |  116.921397        23  5.08353901   Prob > F        =    0.0000
    Residual |  1091.81106     5,392  .202487215   R-squared       =    0.0967
-------------+----------------------------------   Adj R-squared   =    0.0929
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .44999

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1013355   .0140403     7.22   0.000     .0738108    .1288602
          exp |    .036631   .0115005     3.19   0.001     .0140853    .0591767
       expsqr |  -.0008133   .0003628    -2.24   0.025    -.0015245   -.0001022
   highvocedu |   .1460433   .0190698     7.66   0.000     .1086589    .1834278
   highgenedu |   .3412354   .0186827    18.26   0.000     .3046097    .3778611
     adultedu |   .1810501    .022921     7.90   0.000     .1361157    .2259845
 provincedum2 |  -.0766132   .0332523    -2.30   0.021    -.1418013   -.0114252
 provincedum3 |  -.0131427   .0313334    -0.42   0.675    -.0745688    .0482834
 provincedum4 |  -.0441663   .0332818    -1.33   0.185     -.109412    .0210794
 provincedum5 |  -.0316682   .0295946    -1.07   0.285    -.0896857    .0263492
 provincedum6 |  -.0415718   .0352205    -1.18   0.238    -.1106182    .0274746
 provincedum7 |  -.0211015   .0334624    -0.63   0.528    -.0867013    .0444984
 provincedum8 |  -.0896454   .0324039    -2.77   0.006    -.1531703   -.0261206
 provincedum9 |   .0304915   .0307618     0.99   0.322    -.0298141    .0907971
provincedum10 |   .0057542   .0327008     0.18   0.860    -.0583526     .069861
provincedum11 |  -.0449363   .0278475    -1.61   0.107    -.0995287     .009656
provincedum12 |  -.0466569   .0347858    -1.34   0.180    -.1148511    .0215373
provincedum13 |  -.0042511   .0320765    -0.13   0.895     -.067134    .0586318
provincedum14 |   -.044739    .043197    -1.04   0.300    -.1294226    .0399446
provincedum15 |   -.073979    .038803    -1.91   0.057    -.1500486    .0020907
          _m1 |   .5899931   .2529427     2.33   0.020     .0941232    1.085863
          _m2 |  -.1584954   .0721691    -2.20   0.028     -.299976   -.0170148
          _m3 |  -.1578624   .1592979    -0.99   0.322    -.4701506    .1544259
        _cons |   -.014121   .0439195    -0.32   0.748    -.1002211     .071979
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .301858          .        .       .            .           .
        rho1 |   1.073855          .        .       .            .           .
        rho2 |  -.2884798          .        .       .            .           .
        rho3 |  -.2873276          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(23, 5392)     =     25.11
       Model |  116.921397        23  5.08353901   Prob > F        =    0.0000
    Residual |  1091.81106     5,392  .202487215   R-squared       =    0.0967
-------------+----------------------------------   Adj R-squared   =    0.0929
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .44999

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .1013355   .0140403     7.22   0.000     .0738108    .1288602
          exp |    .036631   .0115005     3.19   0.001     .0140853    .0591767
       expsqr |  -.0008133   .0003628    -2.24   0.025    -.0015245   -.0001022
   highvocedu |   .1460433   .0190698     7.66   0.000     .1086589    .1834278
   highgenedu |   .3412354   .0186827    18.26   0.000     .3046097    .3778611
     adultedu |   .1810501    .022921     7.90   0.000     .1361157    .2259845
 provincedum2 |  -.0766132   .0332523    -2.30   0.021    -.1418013   -.0114252
 provincedum3 |  -.0131427   .0313334    -0.42   0.675    -.0745688    .0482834
 provincedum4 |  -.0441663   .0332818    -1.33   0.185     -.109412    .0210794
 provincedum5 |  -.0316682   .0295946    -1.07   0.285    -.0896857    .0263492
 provincedum6 |  -.0415718   .0352205    -1.18   0.238    -.1106182    .0274746
 provincedum7 |  -.0211015   .0334624    -0.63   0.528    -.0867013    .0444984
 provincedum8 |  -.0896454   .0324039    -2.77   0.006    -.1531703   -.0261206
 provincedum9 |   .0304915   .0307618     0.99   0.322    -.0298141    .0907971
provincedum10 |   .0057542   .0327008     0.18   0.860    -.0583526     .069861
provincedum11 |  -.0449363   .0278475    -1.61   0.107    -.0995287     .009656
provincedum12 |  -.0466569   .0347858    -1.34   0.180    -.1148511    .0215373
provincedum13 |  -.0042511   .0320765    -0.13   0.895     -.067134    .0586318
provincedum14 |   -.044739    .043197    -1.04   0.300    -.1294226    .0399446
provincedum15 |   -.073979    .038803    -1.91   0.057    -.1500486    .0020907
           m1 |   .5899931   .2529427     2.33   0.020     .0941232    1.085863
           m2 |  -.1584954   .0721691    -2.20   0.028     -.299976   -.0170148
           m3 |  -.1578624   .1592979    -0.99   0.322    -.4701506    .1544259
        _cons |   -.014121   .0439195    -0.32   0.748    -.1002211     .071979
-------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(educat
> =male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant
> _relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(7, 5408)      =     51.98
       Model |  76.2000325         7  10.8857189   Prob > F        =    0.0000
    Residual |  1132.53243     5,408  .209417978   R-squared       =    0.0630
-------------+----------------------------------   Adj R-squared   =    0.0618
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .45762

------------------------------------------------------------------------------
 gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1055843   .0139929     7.55   0.000     .0781527    .1330159
         exp |    .030805   .0110574     2.79   0.005     .0091281    .0524818
      expsqr |  -.0007084   .0003545    -2.00   0.046    -.0014034   -.0000135
   higheredu |   .2441401   .0163747    14.91   0.000      .212039    .2762412
         _m1 |   .5320831   .2407956     2.21   0.027     .0600268     1.00414
         _m2 |  -.1313976   .0696659    -1.89   0.059    -.2679709    .0051757
         _m3 |  -.1247525   .1578908    -0.79   0.429     -.434282     .184777
       _cons |  -.0012896   .0370938    -0.03   0.972    -.0740084    .0714293
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2888287          .        .       .            .           .
        rho1 |   .9900551          .        .       .            .           .
        rho2 |  -.2444935          .        .       .            .           .
        rho3 |  -.2321288          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(7, 5408)      =     51.98
       Model |  76.2000325         7  10.8857189   Prob > F        =    0.0000
    Residual |  1132.53243     5,408  .209417978   R-squared       =    0.0630
-------------+----------------------------------   Adj R-squared   =    0.0618
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .45762

------------------------------------------------------------------------------
 gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .1055843   .0139929     7.55   0.000     .0781527    .1330159
         exp |    .030805   .0110574     2.79   0.005     .0091281    .0524818
      expsqr |  -.0007084   .0003545    -2.00   0.046    -.0014034   -.0000135
   higheredu |   .2441401   .0163747    14.91   0.000      .212039    .2762412
          m1 |   .5320831   .2407956     2.21   0.027     .0600268     1.00414
          m2 |  -.1313976   .0696659    -1.89   0.059    -.2679709    .0051757
          m3 |  -.1247525   .1578908    -0.79   0.429     -.434282     .184777
       _cons |  -.0012896   .0370938    -0.03   0.972    -.0740084    .0714293
------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entra
> nt_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(21, 5394)     =     19.00
       Model |  83.2653626        21  3.96501726   Prob > F        =    0.0000
    Residual |   1125.4671     5,394  .208651668   R-squared       =    0.0689
-------------+----------------------------------   Adj R-squared   =    0.0653
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .45678

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0947939    .014234     6.66   0.000     .0668895    .1226983
          exp |   .0438703   .0116563     3.76   0.000     .0210192    .0667215
       expsqr |  -.0009757    .000368    -2.65   0.008     -.001697   -.0002543
    higheredu |   .2316793   .0167268    13.85   0.000      .198888    .2644706
 provincedum2 |  -.1226031   .0335492    -3.65   0.000    -.1883731   -.0568331
 provincedum3 |  -.0331829    .031763    -1.04   0.296    -.0954513    .0290854
 provincedum4 |   -.062145   .0337528    -1.84   0.066    -.1283141    .0040241
 provincedum5 |  -.0487184   .0299882    -1.62   0.104    -.1075074    .0100706
 provincedum6 |  -.0807208   .0356065    -2.27   0.023     -.150524   -.0109177
 provincedum7 |  -.0575185    .033825    -1.70   0.089    -.1238293    .0087922
 provincedum8 |    -.13769   .0326555    -4.22   0.000     -.201708    -.073672
 provincedum9 |   .0026536   .0311214     0.09   0.932    -.0583569     .063664
provincedum10 |  -.0386641   .0329975    -1.17   0.241    -.1033526    .0260243
provincedum11 |   -.084802   .0280836    -3.02   0.003    -.1398572   -.0297468
provincedum12 |  -.0816122   .0352035    -2.32   0.020    -.1506253   -.0125991
provincedum13 |  -.0459106   .0323909    -1.42   0.156    -.1094099    .0175886
provincedum14 |  -.0779649   .0437656    -1.78   0.075    -.1637631    .0078333
provincedum15 |  -.0808175    .039376    -2.05   0.040    -.1580104   -.0036246
          _m1 |   .8398317   .2559848     3.28   0.001     .3379982    1.341665
          _m2 |  -.1930766   .0731863    -2.64   0.008    -.3365513   -.0496019
          _m3 |   -.091523   .1613974    -0.57   0.571    -.4079272    .2248811
        _cons |   .0743711   .0439384     1.69   0.091     -.011766    .1605082
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3993097          .        .       .            .           .
        rho1 |   1.329038          .        .       .            .           .
        rho2 |  -.3055447          .        .       .            .           .
        rho3 |  -.1448357          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inrang
> e(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     5,416
-------------+----------------------------------   F(21, 5394)     =     19.00
       Model |  83.2653626        21  3.96501726   Prob > F        =    0.0000
    Residual |   1125.4671     5,394  .208651668   R-squared       =    0.0689
-------------+----------------------------------   Adj R-squared   =    0.0653
       Total |  1208.73246     5,415  .223219291   Root MSE        =    .45678

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0947939    .014234     6.66   0.000     .0668895    .1226983
          exp |   .0438703   .0116563     3.76   0.000     .0210192    .0667215
       expsqr |  -.0009757    .000368    -2.65   0.008     -.001697   -.0002543
    higheredu |   .2316793   .0167268    13.85   0.000      .198888    .2644706
 provincedum2 |  -.1226031   .0335492    -3.65   0.000    -.1883731   -.0568331
 provincedum3 |  -.0331829    .031763    -1.04   0.296    -.0954513    .0290854
 provincedum4 |   -.062145   .0337528    -1.84   0.066    -.1283141    .0040241
 provincedum5 |  -.0487184   .0299882    -1.62   0.104    -.1075074    .0100706
 provincedum6 |  -.0807208   .0356065    -2.27   0.023     -.150524   -.0109177
 provincedum7 |  -.0575185    .033825    -1.70   0.089    -.1238293    .0087922
 provincedum8 |    -.13769   .0326555    -4.22   0.000     -.201708    -.073672
 provincedum9 |   .0026536   .0311214     0.09   0.932    -.0583569     .063664
provincedum10 |  -.0386641   .0329975    -1.17   0.241    -.1033526    .0260243
provincedum11 |   -.084802   .0280836    -3.02   0.003    -.1398572   -.0297468
provincedum12 |  -.0816122   .0352035    -2.32   0.020    -.1506253   -.0125991
provincedum13 |  -.0459106   .0323909    -1.42   0.156    -.1094099    .0175886
provincedum14 |  -.0779649   .0437656    -1.78   0.075    -.1637631    .0078333
provincedum15 |  -.0808175    .039376    -2.05   0.040    -.1580104   -.0036246
           m1 |   .8398317   .2559848     3.28   0.001     .3379982    1.341665
           m2 |  -.1930766   .0731863    -2.64   0.008    -.3365513   -.0496019
           m3 |   -.091523   .1613974    -0.57   0.571    -.4079272    .2248811
        _cons |   .0743711   .0439384     1.69   0.091     -.011766    .1605082
-------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) Long-term contract
. 
. selmlog voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu if inrange(birt
> hyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_en
> trant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(9, 1815)      =     16.24
       Model |   33.324769         9  3.70275211   Prob > F        =    0.0000
    Residual |  413.877423     1,815  .228031638   R-squared       =    0.0745
-------------+----------------------------------   Adj R-squared   =    0.0699
       Total |  447.202192     1,824   .24517664   Root MSE        =    .47753

------------------------------------------------------------------------------
voc_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0857423    .028073     3.05   0.002     .0306836    .1408011
         exp |  -.0059226   .0241361    -0.25   0.806      -.05326    .0414147
      expsqr |   .0005474   .0007333     0.75   0.455    -.0008908    .0019856
  highvocedu |   .0958377    .035996     2.66   0.008     .0252397    .1664357
  highgenedu |   .2881358   .0645714     4.46   0.000     .1614937    .4147779
    adultedu |   .2982324   .0306256     9.74   0.000     .2381672    .3582975
         _m1 |  -.2727687   .1916425    -1.42   0.155    -.6486317    .1030942
         _m2 |   .8536931   .5216237     1.64   0.102    -.1693529    1.876739
         _m3 |   .7724625    .458782     1.68   0.092    -.1273337    1.672259
       _cons |   1.388401   .7258386     1.91   0.056     -.035166    2.811967
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .5009849          .        .       .            .           .
        rho1 |  -.3853739          .        .       .            .           .
        rho2 |   1.206117          .        .       .            .           .
        rho3 |   1.091353          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inr
> ange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(9, 1815)      =     16.24
       Model |   33.324769         9  3.70275211   Prob > F        =    0.0000
    Residual |  413.877423     1,815  .228031638   R-squared       =    0.0745
-------------+----------------------------------   Adj R-squared   =    0.0699
       Total |  447.202192     1,824   .24517664   Root MSE        =    .47753

------------------------------------------------------------------------------
voc_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0857423    .028073     3.05   0.002     .0306836    .1408011
         exp |  -.0059226   .0241361    -0.25   0.806      -.05326    .0414147
      expsqr |   .0005474   .0007333     0.75   0.455    -.0008908    .0019856
  highvocedu |   .0958377    .035996     2.66   0.008     .0252397    .1664357
  highgenedu |   .2881358   .0645714     4.46   0.000     .1614937    .4147779
    adultedu |   .2982324   .0306256     9.74   0.000     .2381672    .3582975
          m1 |  -.2727687   .1916425    -1.42   0.155    -.6486317    .1030942
          m2 |   .8536931   .5216237     1.64   0.102    -.1693529    1.876739
          m3 |   .7724625    .458782     1.68   0.092    -.1273337    1.672259
       _cons |   1.388401   .7258386     1.91   0.056     -.035166    2.811967
------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entra
> nt_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(23, 1801)     =      8.58
       Model |  44.1826519        23  1.92098487   Prob > F        =    0.0000
    Residual |   403.01954     1,801  .223775425   R-squared       =    0.0988
-------------+----------------------------------   Adj R-squared   =    0.0873
       Total |  447.202192     1,824   .24517664   Root MSE        =    .47305

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0675533   .0295146     2.29   0.022     .0096667    .1254398
          exp |    .024972   .0263278     0.95   0.343    -.0266643    .0766082
       expsqr |  -.0003089   .0007892    -0.39   0.696    -.0018568    .0012389
   highvocedu |   .0770315   .0360682     2.14   0.033     .0062916    .1477714
   highgenedu |   .2441243   .0646099     3.78   0.000      .117406    .3708425
     adultedu |   .2921811   .0310728     9.40   0.000     .2312386    .3531236
 provincedum2 |   -.016822   .0646428    -0.26   0.795    -.1436048    .1099609
 provincedum3 |   .0470442   .0702524     0.67   0.503    -.0907406     .184829
 provincedum4 |  -.0775883   .0619276    -1.25   0.210    -.1990458    .0438692
 provincedum5 |   .0521465   .0579293     0.90   0.368    -.0614692    .1657622
 provincedum6 |  -.0232108   .0717349    -0.32   0.746    -.1639032    .1174816
 provincedum7 |   .1157083   .0624413     1.85   0.064    -.0067568    .2381733
 provincedum8 |  -.1334657   .0660891    -2.02   0.044     -.263085   -.0038463
 provincedum9 |  -.0994466   .0615315    -1.62   0.106    -.2201273    .0212341
provincedum10 |  -.1104832   .0621967    -1.78   0.076    -.2324685    .0115022
provincedum11 |  -.1211079   .0584859    -2.07   0.039    -.2358152   -.0064006
provincedum12 |  -.1323393   .0658702    -2.01   0.045    -.2615293   -.0031492
provincedum13 |  -.0065934   .0657715    -0.10   0.920    -.1355899    .1224032
provincedum14 |  -.1369014   .0704792    -1.94   0.052     -.275131    .0013282
provincedum15 |  -.0365892   .0796276    -0.46   0.646    -.1927615     .119583
          _m1 |  -.0361555   .2106164    -0.17   0.864    -.4492337    .3769227
          _m2 |   .5395306   .5929366     0.91   0.363    -.6233854    1.702447
          _m3 |   .6209651   .4950147     1.25   0.210    -.3498983    1.591829
        _cons |   .7189538   .8007649     0.90   0.369     -.851572     2.28948
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3427666          .        .       .            .           .
        rho1 |  -.0617555          .        .       .            .           .
        rho2 |   .9215457          .        .       .            .           .
        rho3 |    1.06064          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(23, 1801)     =      8.58
       Model |  44.1826519        23  1.92098487   Prob > F        =    0.0000
    Residual |   403.01954     1,801  .223775425   R-squared       =    0.0988
-------------+----------------------------------   Adj R-squared   =    0.0873
       Total |  447.202192     1,824   .24517664   Root MSE        =    .47305

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0675533   .0295146     2.29   0.022     .0096667    .1254398
          exp |    .024972   .0263278     0.95   0.343    -.0266643    .0766082
       expsqr |  -.0003089   .0007892    -0.39   0.696    -.0018568    .0012389
   highvocedu |   .0770315   .0360682     2.14   0.033     .0062916    .1477714
   highgenedu |   .2441243   .0646099     3.78   0.000      .117406    .3708425
     adultedu |   .2921811   .0310728     9.40   0.000     .2312386    .3531236
 provincedum2 |   -.016822   .0646428    -0.26   0.795    -.1436048    .1099609
 provincedum3 |   .0470442   .0702524     0.67   0.503    -.0907406     .184829
 provincedum4 |  -.0775883   .0619276    -1.25   0.210    -.1990458    .0438692
 provincedum5 |   .0521465   .0579293     0.90   0.368    -.0614692    .1657622
 provincedum6 |  -.0232108   .0717349    -0.32   0.746    -.1639032    .1174816
 provincedum7 |   .1157083   .0624413     1.85   0.064    -.0067568    .2381733
 provincedum8 |  -.1334657   .0660891    -2.02   0.044     -.263085   -.0038463
 provincedum9 |  -.0994466   .0615315    -1.62   0.106    -.2201273    .0212341
provincedum10 |  -.1104832   .0621967    -1.78   0.076    -.2324685    .0115022
provincedum11 |  -.1211079   .0584859    -2.07   0.039    -.2358152   -.0064006
provincedum12 |  -.1323393   .0658702    -2.01   0.045    -.2615293   -.0031492
provincedum13 |  -.0065934   .0657715    -0.10   0.920    -.1355899    .1224032
provincedum14 |  -.1369014   .0704792    -1.94   0.052     -.275131    .0013282
provincedum15 |  -.0365892   .0796276    -0.46   0.646    -.1927615     .119583
           m1 |  -.0361555   .2106164    -0.17   0.864    -.4492337    .3769227
           m2 |   .5395306   .5929366     0.91   0.363    -.6233854    1.702447
           m3 |   .6209651   .4950147     1.25   0.210    -.3498983    1.591829
        _cons |   .7189538   .8007649     0.90   0.369     -.851572     2.28948
-------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_longtermcontract male exp expsqr higheredu if inrange(birthyear, 1971, 1992), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(7, 1817)      =     17.33
       Model |   27.994075         7  3.99915357   Prob > F        =    0.0000
    Residual |  419.208117     1,817  .230714429   R-squared       =    0.0626
-------------+----------------------------------   Adj R-squared   =    0.0590
       Total |  447.202192     1,824   .24517664   Root MSE        =    .48033

------------------------------------------------------------------------------
voc_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0849515   .0282324     3.01   0.003       .02958    .1403229
         exp |    .001327   .0241733     0.05   0.956    -.0460835    .0487374
      expsqr |   .0003944   .0007353     0.54   0.592    -.0010477    .0018365
   higheredu |   .2237639   .0245483     9.12   0.000     .1756181    .2719097
         _m1 |  -.2824288   .1925968    -1.47   0.143    -.6601632    .0953055
         _m2 |    .935286    .523992     1.78   0.074     -.092404    1.962976
         _m3 |   .8482042   .4607941     1.84   0.066    -.0555377    1.751946
       _cons |   1.394108   .7290757     1.91   0.056     -.035807    2.824022
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .5538447          .        .       .            .           .
        rho1 |  -.3795028          .        .       .            .           .
        rho2 |   1.256755          .        .       .            .           .
        rho3 |   1.139742          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971,
>  1992)

      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(7, 1817)      =     17.33
       Model |   27.994075         7  3.99915357   Prob > F        =    0.0000
    Residual |  419.208117     1,817  .230714429   R-squared       =    0.0626
-------------+----------------------------------   Adj R-squared   =    0.0590
       Total |  447.202192     1,824   .24517664   Root MSE        =    .48033

------------------------------------------------------------------------------
voc_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0849515   .0282324     3.01   0.003       .02958    .1403229
         exp |    .001327   .0241733     0.05   0.956    -.0460835    .0487374
      expsqr |   .0003944   .0007353     0.54   0.592    -.0010477    .0018365
   higheredu |   .2237639   .0245483     9.12   0.000     .1756181    .2719097
          m1 |  -.2824288   .1925968    -1.47   0.143    -.6601632    .0953055
          m2 |    .935286    .523992     1.78   0.074     -.092404    1.962976
          m3 |   .8482042   .4607941     1.84   0.066    -.0555377    1.751946
       _cons |   1.394108   .7290757     1.91   0.056     -.035807    2.824022
------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 if inrang
> e(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(21, 1803)     =      8.08
       Model |  38.4752656        21   1.8321555   Prob > F        =    0.0000
    Residual |  408.726926     1,803  .226692693   R-squared       =    0.0860
-------------+----------------------------------   Adj R-squared   =    0.0754
       Total |  447.202192     1,824   .24517664   Root MSE        =    .47612

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    .064749   .0296966     2.18   0.029     .0065057    .1229923
          exp |   .0338341   .0264011     1.28   0.200    -.0179458    .0856141
       expsqr |  -.0005008   .0007922    -0.63   0.527    -.0020546     .001053
    higheredu |   .2082549   .0250035     8.33   0.000      .159216    .2572938
 provincedum2 |  -.0338069   .0649549    -0.52   0.603    -.1612017    .0935879
 provincedum3 |   .0329888   .0706475     0.47   0.641    -.1055708    .1715483
 provincedum4 |  -.0992858   .0621759    -1.60   0.110    -.2212301    .0226586
 provincedum5 |   .0290508    .058113     0.50   0.617    -.0849252    .1430268
 provincedum6 |  -.0336602   .0721558    -0.47   0.641     -.175178    .1078575
 provincedum7 |   .0949516   .0626657     1.52   0.130    -.0279535    .2178567
 provincedum8 |  -.1503637   .0664303    -2.26   0.024    -.2806521   -.0200752
 provincedum9 |  -.1065163   .0618756    -1.72   0.085    -.2278717    .0148392
provincedum10 |  -.1230547   .0625254    -1.97   0.049    -.2456846   -.0004249
provincedum11 |  -.1392256   .0587528    -2.37   0.018    -.2544562   -.0239949
provincedum12 |  -.1476322   .0662146    -2.23   0.026    -.2774976   -.0177667
provincedum13 |   -.022951   .0661173    -0.35   0.729    -.1526255    .1067236
provincedum14 |  -.1373676   .0708813    -1.94   0.053    -.2763857    .0016506
provincedum15 |  -.0384683   .0801439    -0.48   0.631    -.1956529    .1187163
          _m1 |  -.0333387   .2118458    -0.16   0.875    -.4488278    .3821504
          _m2 |   .5342128    .596297     0.90   0.370     -.635293    1.703719
          _m3 |   .6446568   .4976857     1.30   0.195    -.3314445    1.620758
        _cons |   .6476085   .8048656     0.80   0.421    -.9309588    2.226176
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3508363          .        .       .            .           .
        rho1 |  -.0562855          .        .       .            .           .
        rho2 |   .9019075          .        .       .            .           .
        rho3 |   1.088369          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 
> if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,825
-------------+----------------------------------   F(21, 1803)     =      8.08
       Model |  38.4752656        21   1.8321555   Prob > F        =    0.0000
    Residual |  408.726926     1,803  .226692693   R-squared       =    0.0860
-------------+----------------------------------   Adj R-squared   =    0.0754
       Total |  447.202192     1,824   .24517664   Root MSE        =    .47612

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    .064749   .0296966     2.18   0.029     .0065057    .1229923
          exp |   .0338341   .0264011     1.28   0.200    -.0179458    .0856141
       expsqr |  -.0005008   .0007922    -0.63   0.527    -.0020546     .001053
    higheredu |   .2082549   .0250035     8.33   0.000      .159216    .2572938
 provincedum2 |  -.0338069   .0649549    -0.52   0.603    -.1612017    .0935879
 provincedum3 |   .0329888   .0706475     0.47   0.641    -.1055708    .1715483
 provincedum4 |  -.0992858   .0621759    -1.60   0.110    -.2212301    .0226586
 provincedum5 |   .0290508    .058113     0.50   0.617    -.0849252    .1430268
 provincedum6 |  -.0336602   .0721558    -0.47   0.641     -.175178    .1078575
 provincedum7 |   .0949516   .0626657     1.52   0.130    -.0279535    .2178567
 provincedum8 |  -.1503637   .0664303    -2.26   0.024    -.2806521   -.0200752
 provincedum9 |  -.1065163   .0618756    -1.72   0.085    -.2278717    .0148392
provincedum10 |  -.1230547   .0625254    -1.97   0.049    -.2456846   -.0004249
provincedum11 |  -.1392256   .0587528    -2.37   0.018    -.2544562   -.0239949
provincedum12 |  -.1476322   .0662146    -2.23   0.026    -.2774976   -.0177667
provincedum13 |   -.022951   .0661173    -0.35   0.729    -.1526255    .1067236
provincedum14 |  -.1373676   .0708813    -1.94   0.053    -.2763857    .0016506
provincedum15 |  -.0384683   .0801439    -0.48   0.631    -.1956529    .1187163
           m1 |  -.0333387   .2118458    -0.16   0.875    -.4488278    .3821504
           m2 |   .5342128    .596297     0.90   0.370     -.635293    1.703719
           m3 |   .6446568   .4976857     1.30   0.195    -.3314445    1.620758
        _cons |   .6476085   .8048656     0.80   0.421    -.9309588    2.226176
-------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu if inrange(birt
> hyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_en
> trant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(9, 4882)      =     76.59
       Model |  137.463452         9  15.2737169   Prob > F        =    0.0000
    Residual |   973.59869     4,882  .199426196   R-squared       =    0.1237
-------------+----------------------------------   Adj R-squared   =    0.1221
       Total |  1111.06214     4,891  .227164617   Root MSE        =    .44657

------------------------------------------------------------------------------
gen_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |    .042879   .0143312     2.99   0.003     .0147835    .0709745
         exp |   .0142914     .01126     1.27   0.204    -.0077834    .0363661
      expsqr |  -.0001529    .000364    -0.42   0.674    -.0008664    .0005606
  highvocedu |    .236184   .0203164    11.63   0.000     .1963547    .2760133
  highgenedu |   .4696075   .0192555    24.39   0.000     .4318581    .5073569
    adultedu |   .3308049   .0236986    13.96   0.000     .2843449    .3772649
         _m1 |  -.1176627   .2450376    -0.48   0.631    -.5980468    .3627213
         _m2 |  -.0336205   .0726611    -0.46   0.644     -.176069    .1088279
         _m3 |  -.1189258   .1657652    -0.72   0.473    -.4439002    .2060486
       _cons |   .1119247    .038245     2.93   0.003     .0369472    .1869021
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2053072          .        .       .            .           .
        rho1 |   -.259679          .        .       .            .           .
        rho2 |  -.0741997          .        .       .            .           .
        rho3 |  -.2624666          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inr
> ange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(9, 4882)      =     76.59
       Model |  137.463452         9  15.2737169   Prob > F        =    0.0000
    Residual |   973.59869     4,882  .199426196   R-squared       =    0.1237
-------------+----------------------------------   Adj R-squared   =    0.1221
       Total |  1111.06214     4,891  .227164617   Root MSE        =    .44657

------------------------------------------------------------------------------
gen_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |    .042879   .0143312     2.99   0.003     .0147835    .0709745
         exp |   .0142914     .01126     1.27   0.204    -.0077834    .0363661
      expsqr |  -.0001529    .000364    -0.42   0.674    -.0008664    .0005606
  highvocedu |    .236184   .0203164    11.63   0.000     .1963547    .2760133
  highgenedu |   .4696075   .0192555    24.39   0.000     .4318581    .5073569
    adultedu |   .3308049   .0236986    13.96   0.000     .2843449    .3772649
          m1 |  -.1176627   .2450376    -0.48   0.631    -.5980468    .3627213
          m2 |  -.0336205   .0726611    -0.46   0.644     -.176069    .1088279
          m3 |  -.1189258   .1657652    -0.72   0.473    -.4439002    .2060486
       _cons |   .1119247    .038245     2.93   0.003     .0369472    .1869021
------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entra
> nt_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(23, 4868)     =     34.81
       Model |   156.93337        23     6.82319   Prob > F        =    0.0000
    Residual |  954.128772     4,868  .196000159   R-squared       =    0.1412
-------------+----------------------------------   Adj R-squared   =    0.1372
       Total |  1111.06214     4,891  .227164617   Root MSE        =    .44272

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0263082   .0144812     1.82   0.069    -.0020814    .0546979
          exp |   .0343519   .0117983     2.91   0.004     .0112219    .0574819
       expsqr |  -.0006321   .0003753    -1.68   0.092    -.0013678    .0001037
   highvocedu |   .2153305   .0203179    10.60   0.000     .1754982    .2551627
   highgenedu |   .4366791   .0197017    22.16   0.000     .3980549    .4753033
     adultedu |   .3111626   .0237681    13.09   0.000     .2645665    .3577588
 provincedum2 |  -.0679317   .0337128    -2.02   0.044    -.1340239   -.0018395
 provincedum3 |  -.0077273   .0321357    -0.24   0.810    -.0707278    .0552732
 provincedum4 |  -.1922341   .0343144    -5.60   0.000    -.2595058   -.1249624
 provincedum5 |   .0177183   .0301288     0.59   0.557    -.0413477    .0767843
 provincedum6 |  -.0597678   .0364623    -1.64   0.101    -.1312503    .0117148
 provincedum7 |  -.0502571   .0343682    -1.46   0.144    -.1176344    .0171201
 provincedum8 |   -.093468   .0333014    -2.81   0.005    -.1587537   -.0281823
 provincedum9 |  -.0653864   .0318858    -2.05   0.040    -.1278969   -.0028758
provincedum10 |  -.1135412   .0336451    -3.37   0.001    -.1795007   -.0475817
provincedum11 |  -.1795692   .0283917    -6.32   0.000    -.2352298   -.1239086
provincedum12 |  -.1553197   .0353732    -4.39   0.000    -.2246671   -.0859723
provincedum13 |  -.1019971   .0330968    -3.08   0.002    -.1668818   -.0371123
provincedum14 |  -.1024319   .0448835    -2.28   0.023    -.1904239   -.0144399
provincedum15 |  -.0092237   .0392752    -0.23   0.814    -.0862208    .0677734
          _m1 |   .3656885   .2596146     1.41   0.159    -.1432732    .8746502
          _m2 |  -.1570291   .0757839    -2.07   0.038    -.3055997   -.0084585
          _m3 |  -.1865872   .1684237    -1.11   0.268    -.5167737    .1435993
        _cons |   .2256938   .0449221     5.02   0.000     .1376261    .3137614
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2425973          .        .       .            .           .
        rho1 |   .7424519          .        .       .            .           .
        rho2 |  -.3188138          .        .       .            .           .
        rho3 |  -.3788252          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(23, 4868)     =     34.81
       Model |   156.93337        23     6.82319   Prob > F        =    0.0000
    Residual |  954.128772     4,868  .196000159   R-squared       =    0.1412
-------------+----------------------------------   Adj R-squared   =    0.1372
       Total |  1111.06214     4,891  .227164617   Root MSE        =    .44272

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0263082   .0144812     1.82   0.069    -.0020814    .0546979
          exp |   .0343519   .0117983     2.91   0.004     .0112219    .0574819
       expsqr |  -.0006321   .0003753    -1.68   0.092    -.0013678    .0001037
   highvocedu |   .2153305   .0203179    10.60   0.000     .1754982    .2551627
   highgenedu |   .4366791   .0197017    22.16   0.000     .3980549    .4753033
     adultedu |   .3111626   .0237681    13.09   0.000     .2645665    .3577588
 provincedum2 |  -.0679317   .0337128    -2.02   0.044    -.1340239   -.0018395
 provincedum3 |  -.0077273   .0321357    -0.24   0.810    -.0707278    .0552732
 provincedum4 |  -.1922341   .0343144    -5.60   0.000    -.2595058   -.1249624
 provincedum5 |   .0177183   .0301288     0.59   0.557    -.0413477    .0767843
 provincedum6 |  -.0597678   .0364623    -1.64   0.101    -.1312503    .0117148
 provincedum7 |  -.0502571   .0343682    -1.46   0.144    -.1176344    .0171201
 provincedum8 |   -.093468   .0333014    -2.81   0.005    -.1587537   -.0281823
 provincedum9 |  -.0653864   .0318858    -2.05   0.040    -.1278969   -.0028758
provincedum10 |  -.1135412   .0336451    -3.37   0.001    -.1795007   -.0475817
provincedum11 |  -.1795692   .0283917    -6.32   0.000    -.2352298   -.1239086
provincedum12 |  -.1553197   .0353732    -4.39   0.000    -.2246671   -.0859723
provincedum13 |  -.1019971   .0330968    -3.08   0.002    -.1668818   -.0371123
provincedum14 |  -.1024319   .0448835    -2.28   0.023    -.1904239   -.0144399
provincedum15 |  -.0092237   .0392752    -0.23   0.814    -.0862208    .0677734
           m1 |   .3656885   .2596146     1.41   0.159    -.1432732    .8746502
           m2 |  -.1570291   .0757839    -2.07   0.038    -.3055997   -.0084585
           m3 |  -.1865872   .1684237    -1.11   0.268    -.5167737    .1435993
        _cons |   .2256938   .0449221     5.02   0.000     .1376261    .3137614
-------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr higheredu if inrange(birthyear, 1971, 1992), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(7, 4884)      =     65.28
       Model |  95.0547271         7  13.5792467   Prob > F        =    0.0000
    Residual |  1016.00742     4,884  .208027726   R-squared       =    0.0856
-------------+----------------------------------   Adj R-squared   =    0.0842
       Total |  1111.06214     4,891  .227164617   Root MSE        =     .4561

------------------------------------------------------------------------------
gen_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0409003   .0146268     2.80   0.005     .0122253    .0695754
         exp |   .0171698   .0114945     1.49   0.135    -.0053646    .0397043
      expsqr |   -.000229   .0003716    -0.62   0.538    -.0009575    .0004995
   higheredu |    .361231   .0177336    20.37   0.000     .3264651    .3959968
         _m1 |   .0210035   .2500645     0.08   0.933    -.4692354    .5112425
         _m2 |  -.0401097   .0741929    -0.54   0.589    -.1855611    .1053417
         _m3 |  -.0603381   .1689416    -0.36   0.721    -.3915397    .2708635
       _cons |   .1582169   .0386657     4.09   0.000     .0824147     .234019
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2089368          .        .       .            .           .
        rho1 |   .0459499          .        .       .            .           .
        rho2 |  -.0877489          .        .       .            .           .
        rho3 |  -.1320031          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971,
>  1992)

      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(7, 4884)      =     65.28
       Model |  95.0547271         7  13.5792467   Prob > F        =    0.0000
    Residual |  1016.00742     4,884  .208027726   R-squared       =    0.0856
-------------+----------------------------------   Adj R-squared   =    0.0842
       Total |  1111.06214     4,891  .227164617   Root MSE        =     .4561

------------------------------------------------------------------------------
gen_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0409003   .0146268     2.80   0.005     .0122253    .0695754
         exp |   .0171698   .0114945     1.49   0.135    -.0053646    .0397043
      expsqr |   -.000229   .0003716    -0.62   0.538    -.0009575    .0004995
   higheredu |    .361231   .0177336    20.37   0.000     .3264651    .3959968
          m1 |   .0210035   .2500645     0.08   0.933    -.4692354    .5112425
          m2 |  -.0401097   .0741929    -0.54   0.589    -.1855611    .1053417
          m3 |  -.0603381   .1689416    -0.36   0.721    -.3915397    .2708635
       _cons |   .1582169   .0386657     4.09   0.000     .0824147     .234019
------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 if inrang
> e(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -12303.164
Iteration 1:  Log likelihood = -10418.255
Iteration 2:  Log likelihood = -10270.622
Iteration 3:  Log likelihood = -10255.582
Iteration 4:  Log likelihood =  -10255.32
Iteration 5:  Log likelihood =  -10255.32

Multinomial logistic regression                   Number of obs   =      11919
                                                  LR chi2(12)     =    4095.69
                                                  Prob > chi2     =     0.0000
Log likelihood =  -10255.32                       Pseudo R2       =     0.1664

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1951205   .0504575    -3.87   0.000    -.2940154   -.0962255
         exp |   .3484008   .0224755    15.50   0.000     .3043496    .3924519
      expsqr |  -.0069218    .000573   -12.08   0.000    -.0080448   -.0057987
ins1_secge~e |   3.261803   .3885384     8.40   0.000     2.500282    4.023324
ins2_highe~e |   .1857712   .0808252     2.30   0.022     .0273568    .3441856
ins3_vs_en~e |   .5880614   .3716973     1.58   0.114    -.1404519    1.316575
       _cons |   -5.61722    .284589   -19.74   0.000    -6.175005   -5.059436
-------------+----------------------------------------------------------------
3            |
        male |   -.203028   .0497527    -4.08   0.000    -.3005415   -.1055145
         exp |   .6324434   .0281732    22.45   0.000      .577225    .6876619
      expsqr |  -.0088767   .0006372   -13.93   0.000    -.0101257   -.0076278
ins1_secge~e |   9.538957    .415342    22.97   0.000     8.724902    10.35301
ins2_highe~e |   .4355875   .0842952     5.17   0.000      .270372     .600803
ins3_vs_en~e |  -.7309262   .4001208    -1.83   0.068    -1.515149    .0532962
       _cons |  -11.66617    .374729   -31.13   0.000    -12.40063   -10.93172
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(21, 4870)     =     28.11
       Model |   120.13294        21  5.72061619   Prob > F        =    0.0000
    Residual |  990.929202     4,870  .203476222   R-squared       =    0.1081
-------------+----------------------------------   Adj R-squared   =    0.1043
       Total |  1111.06214     4,891  .227164617   Root MSE        =    .45108

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0199147   .0147389     1.35   0.177    -.0089802    .0488096
          exp |   .0426722   .0120023     3.56   0.000     .0191422    .0662023
       expsqr |  -.0008164   .0003821    -2.14   0.033    -.0015655   -.0000674
    higheredu |   .3279071   .0179408    18.28   0.000     .2927349    .3630792
 provincedum2 |  -.1218551   .0341141    -3.57   0.000     -.188734   -.0549761
 provincedum3 |  -.0283619   .0327048    -0.87   0.386    -.0924781    .0357544
 provincedum4 |  -.2121394   .0349313    -6.07   0.000    -.2806206   -.1436582
 provincedum5 |  -.0065719   .0306287    -0.21   0.830    -.0666181    .0534742
 provincedum6 |  -.1021854    .037014    -2.76   0.006    -.1747496   -.0296212
 provincedum7 |  -.0945241   .0348529    -2.71   0.007    -.1628514   -.0261967
 provincedum8 |  -.1479359   .0336839    -4.39   0.000    -.2139716   -.0819002
 provincedum9 |   -.098181   .0323867    -3.03   0.002    -.1616736   -.0346884
provincedum10 |   -.161869   .0340898    -4.75   0.000    -.2287004   -.0950375
provincedum11 |  -.2258832   .0287218    -7.86   0.000     -.282191   -.1695754
provincedum12 |  -.1949624   .0359192    -5.43   0.000    -.2653803   -.1245445
provincedum13 |  -.1481496   .0335471    -4.42   0.000    -.2139169   -.0823822
provincedum14 |  -.1378454   .0456449    -3.02   0.003    -.2273299   -.0483609
provincedum15 |   -.016857   .0400045    -0.42   0.673    -.0952839    .0615698
          _m1 |   .6304316   .2637813     2.39   0.017     .1133012    1.147562
          _m2 |  -.1993421   .0771328    -2.58   0.010    -.3505572   -.0481269
          _m3 |  -.1339859   .1712457    -0.78   0.434    -.4697047     .201733
        _cons |   .3113781   .0451288     6.90   0.000     .2229053     .399851
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .318523          .        .       .            .           .
        rho1 |   1.117037          .        .       .            .           .
        rho2 |  -.3532064          .        .       .            .           .
        rho3 |  -.2374043          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 
> if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     4,892
-------------+----------------------------------   F(21, 4870)     =     28.11
       Model |   120.13294        21  5.72061619   Prob > F        =    0.0000
    Residual |  990.929202     4,870  .203476222   R-squared       =    0.1081
-------------+----------------------------------   Adj R-squared   =    0.1043
       Total |  1111.06214     4,891  .227164617   Root MSE        =    .45108

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0199147   .0147389     1.35   0.177    -.0089802    .0488096
          exp |   .0426722   .0120023     3.56   0.000     .0191422    .0662023
       expsqr |  -.0008164   .0003821    -2.14   0.033    -.0015655   -.0000674
    higheredu |   .3279071   .0179408    18.28   0.000     .2927349    .3630792
 provincedum2 |  -.1218551   .0341141    -3.57   0.000     -.188734   -.0549761
 provincedum3 |  -.0283619   .0327048    -0.87   0.386    -.0924781    .0357544
 provincedum4 |  -.2121394   .0349313    -6.07   0.000    -.2806206   -.1436582
 provincedum5 |  -.0065719   .0306287    -0.21   0.830    -.0666181    .0534742
 provincedum6 |  -.1021854    .037014    -2.76   0.006    -.1747496   -.0296212
 provincedum7 |  -.0945241   .0348529    -2.71   0.007    -.1628514   -.0261967
 provincedum8 |  -.1479359   .0336839    -4.39   0.000    -.2139716   -.0819002
 provincedum9 |   -.098181   .0323867    -3.03   0.002    -.1616736   -.0346884
provincedum10 |   -.161869   .0340898    -4.75   0.000    -.2287004   -.0950375
provincedum11 |  -.2258832   .0287218    -7.86   0.000     -.282191   -.1695754
provincedum12 |  -.1949624   .0359192    -5.43   0.000    -.2653803   -.1245445
provincedum13 |  -.1481496   .0335471    -4.42   0.000    -.2139169   -.0823822
provincedum14 |  -.1378454   .0456449    -3.02   0.003    -.2273299   -.0483609
provincedum15 |   -.016857   .0400045    -0.42   0.673    -.0952839    .0615698
           m1 |   .6304316   .2637813     2.39   0.017     .1133012    1.147562
           m2 |  -.1993421   .0771328    -2.58   0.010    -.3505572   -.0481269
           m3 |  -.1339859   .1712457    -0.78   0.434    -.4697047     .201733
        _cons |   .3113781   .0451288     6.90   0.000     .2229053     .399851
-------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Selmlog Urban Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/
> Selmlog Job-types & Unemployment/Selmlog Urban (1) Unemployment A20=5 (2) Unemployment A20=
> 5|9 (3) High occupation (4) Long-term contract.log
  log type:  text
 closed on:   6 Aug 2024, 17:50:55
---------------------------------------------------------------------------------------------
