---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Sel
> mlog Urban Parent BothStages.log
  log type:  text
 opened on:   6 Aug 2024, 18:08:00

. use "`datapath'", clear

. 
. *Step Zero: A New Dataset for Merging
. 
. gen headsecedu = .
(36,259 missing values generated)

. gen headhighedu = .
(36,259 missing values generated)

. gen spousesecedu = .
(36,259 missing values generated)

. gen spousehighedu = .
(36,259 missing values generated)

. gen headparty = .
(36,259 missing values generated)

. gen spouseparty = .
(36,259 missing values generated)

. gen spouseparentsecedu = .
(36,259 missing values generated)

. gen spouseparenthighedu = .
(36,259 missing values generated)

. gen spouseparentparty = .
(36,259 missing values generated)

. gen headparentsecedu = .
(36,259 missing values generated)

. gen headparenthighedu = .
(36,259 missing values generated)

. gen headparentparty = .
(36,259 missing values generated)

. replace headsecedu = 1 if A02 == 1 & inrange(A13_1, 4, 9)
(6,181 real changes made)

. replace headsecedu = 0 if A02 == 1 & inrange(A13_1, 1, 3)
(5,310 real changes made)

. replace headhighedu = 1 if A02 == 1 & inrange(A13_1, 7, 9)
(3,235 real changes made)

. replace headhighedu = 0 if A02 == 1 & inrange(A13_1, 1, 6)
(8,256 real changes made)

. replace spousesecedu = 1 if A02 == 2 & inrange(A13_1, 4, 9)
(4,780 real changes made)

. replace spousesecedu = 0 if A02 == 2 & inrange(A13_1, 1, 3)
(5,112 real changes made)

. replace spousehighedu = 1 if A02 == 2 & inrange(A13_1, 7, 9)
(2,420 real changes made)

. replace spousehighedu = 0 if A02 == 2 & inrange(A13_1, 1, 6)
(7,472 real changes made)

. replace headparty = 1 if A02 == 1 & A07_1 == 1
(2,477 real changes made)

. replace headparty = 0 if A02 == 1 & inrange(A07_1, 2, 4)
(9,027 real changes made)

. replace spouseparty = 1 if A02 == 2 & A07_1 == 1
(1,231 real changes made)

. replace spouseparty = 0 if A02 == 2 & inrange(A07_1, 2, 4)
(8,672 real changes made)

. replace spouseparentsecedu = 0 if A02 == 5 & inrange(A13_1, 1, 3)
(239 real changes made)

. replace spouseparentsecedu = 1 if A02 == 5 & inrange(A13_1, 4, 9)
(63 real changes made)

. replace spouseparenthighedu = 0 if A02 == 5 & inrange(A13_1, 1, 6)
(289 real changes made)

. replace spouseparenthighedu = 1 if A02 == 5 & inrange(A13_1, 7, 9)
(13 real changes made)

. replace spouseparentparty = 0 if A02 == 5 & inrange(A07_1, 2, 4)
(273 real changes made)

. replace spouseparentparty = 1 if A02 == 5 & A07_1 == 1
(33 real changes made)

. replace headparentsecedu = 0 if A02 == 4 & inrange(A13_1, 1, 3)
(1,208 real changes made)

. replace headparentsecedu = 1 if A02 == 4 & inrange(A13_1, 4, 9)
(308 real changes made)

. replace headparenthighedu = 0 if A02 == 4 & inrange(A13_1, 1, 6)
(1,450 real changes made)

. replace headparenthighedu = 1 if A02 == 4 & inrange(A13_1, 7, 9)
(66 real changes made)

. replace headparentparty = 0 if A02 == 4 & inrange(A07_1, 2, 4)
(1,366 real changes made)

. replace headparentparty = 1 if A02 == 4 & A07_1 == 1
(160 real changes made)

. collapse (max) headsecedu headhighedu spousesecedu spousehighedu headparty spouseparty spou
> separentsecedu spouseparenthighedu spouseparentparty headparentsecedu headparenthighedu hea
> dparentparty, by(hhcode)

. 
. save "`folderpath'/`logname'.dta", replace
(file /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog
    Urban Parent BothStages.dta not found)
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog
    Urban Parent BothStages.dta saved

. 
. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. 
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for secjun
. gen jun_log_monthlyearning = log_monthlyearning if secjun == 1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *6) Instrument
. 
. gen yearat15 = birthyear+15

. local obsnum = _N

. 
. forval i =  1/`obsnum' {
  2.         
.         *extract the observation's year at age 15
.         qui sum yearat15  in `i'
  3.         local yearvalue = round(mod(r(mean),100))
  4.         
.         *get the variables' names for this observation
.         *graduates of mid and sec schools
.         if inrange(`yearvalue', 0, 9) {
  5.                 local czgrad_year = "czgrad0`yearvalue'"
  6.                 local gzgrad_year = "gzgrad0`yearvalue'"
  7.         }
  8.         else {
  9.                 local czgrad_year = "czgrad`yearvalue'"
 10.                 local gzgrad_year = "gzgrad`yearvalue'"
 11.         }
 12.         *entrants of sec and universities
.         if inrange(`yearvalue'+1, 0, 9) {
 13.                 local gzentrant_year = "gzentrant0`=`yearvalue'+1'"
 14.                 local gxentrant_year = "gxentrant0`=`yearvalue'+1'"
 15.                 local vsentrant_year = "vsentrant0`=`yearvalue'+1'"
 16.                 local tsentrant_year = "tsentrant0`=`yearvalue'+1'"
 17.         }
 18.         else{
 19.                 if `yearvalue' == 99 {
 20.                 local gzentrant_year = "gzentrant00"
 21.                 local gxentrant_year = "gxentrant00"
 22.                 local vsentrant_year = "vsentrant00"
 23.                 local tsentrant_year = "tsentrant00"
 24.                 }
 25.         else {
 26.                 local gzentrant_year = "gzentrant`=`yearvalue'+1'"
 27.                 local gxentrant_year = "gxentrant`=`yearvalue'+1'"
 28.                 local vsentrant_year = "vsentrant`=`yearvalue'+1'"
 29.                 local tsentrant_year = "tsentrant`=`yearvalue'+1'"
 30.         }
 31.         }
 32.         
.         
.         *For Ins 1 & 2: check whether the variable names exist (whether we have those years
> ' or not)
.         capture ds `czgrad_year' `gzgrad_year' `gzentrant_year' `gxentrant_year'
 33.         if _rc == 0 {
 34.                 *generate/replace the instrument
.                 capture ds ins1_secgen_entrant_relative ins2_highedu_entrant_relative
 35.                 if _rc!=0 {
 36.                         qui gen ins1_secgen_entrant_relative = `gzentrant_year'/`czgrad_
> year' if _n == `i'
 37.                         qui gen ins2_highedu_entrant_relative = `gxentrant_year'/`gzgrad
> _year' if _n == `i'
 38.                 
.                 }
 39.                 else {
 40.                         qui replace ins1_secgen_entrant_relative = `gzentrant_year'/`czg
> rad_year' if _n == `i'
 41.                         qui replace ins2_highedu_entrant_relative = `gxentrant_year'/`gz
> grad_year' if _n == `i'
 42.                 }
 43.         }
 44.         
.         *For Ins 3
.         capture ds `czgrad_year' `vsentrant_year'
 45.         if _rc == 0 {
 46.                 *generate/replace the instrument
.                 capture ds ins3_vs_entrant_relative
 47.                 if _rc!=0 {
 48.                         qui gen ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_year
> ' if _n == `i'
 49.                 }
 50.                 else {
 51.                         qui replace ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_
> year' if _n == `i'
 52.                 }
 53.         }
 54. }

. 
. 
. sum ins1_secgen_entrant_relative, d

                ins1_secgen_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1551793       .0699308
 5%     .1673149       .0699308
10%      .186534       .0699308       Obs              14,600
25%      .212766       .0699308       Sum of wgt.      14,600

50%     .2705238                      Mean           .3109947
                        Largest       Std. dev.      .1165706
75%     .4141782       .6448125
90%     .4786784       .6448125       Variance       .0135887
95%     .5186297       .6448125       Skewness       .6285488
99%     .5868049       .6448125       Kurtosis       2.318413

. sum ins2_highedu_entrant_relative, d

                ins2_highedu_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .152784       .0821429
 5%     .1734805       .0886667
10%     .2178154       .0925698       Obs              14,600
25%     .2949015       .1380375       Sum of wgt.      14,600

50%      .563901                      Mean           .6110964
                        Largest       Std. dev.      .4193773
75%     .8148931       2.985416
90%     1.023507       2.985416       Variance       .1758773
95%     1.167059       2.985416       Skewness       2.172976
99%     2.425508       2.985416       Kurtosis       10.34083

. sum ins3_vs_entrant_relative, d

                  ins3_vs_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1185751       .0849628
 5%     .1372715       .0849628
10%     .1456793       .0852398       Obs              14,942
25%      .184019       .0852398       Sum of wgt.      14,942

50%     .2320418                      Mean            .249079
                        Largest       Std. dev.      .0890765
75%     .3028006       .6566039
90%     .3705537       .6566039       Variance       .0079346
95%     .4302979       .6566039       Skewness       .9809564
99%     .5072184       .6566039       Kurtosis       4.050356

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. *The specific two; Do that for rural after special care.
. replace province_code = 51 if province_code==.
(2 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.00
         44 |      4,331       11.94       79.95
         50 |      2,115        5.83       85.78
         51 |      2,798        7.72       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *8) Parent Indicators
. merge m:1 hhcode using "`folderpath'/`logname'.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            36,259  (_merge==3)
    -----------------------------------------

. *parent_secedu
. gen parent_secedu = 0 if (A02==1 & (inrange(H03_R1, 1, 3) | inrange(H03_R2, 1, 3))) | (A02=
> =2 & (inrange(H03_R3, 1, 3) | inrange(H03_R4, 1, 3)))
(25,313 missing values generated)

. replace parent_secedu = 0 if A02 ==3 & (headsecedu == 0 | spousesecedu == 0)
(6,013 real changes made)

. replace parent_secedu = 0 if (A02 == 2 & spouseparentsecedu == 0) | (A02 == 1 & headparents
> ecedu == 0)
(241 real changes made)

. replace parent_secedu=1 if (A02==1 & (inrange(H03_R1, 4, 9) | inrange(H03_R2, 4, 9)))|(A02=
> =2 & (inrange(H03_R3, 4, 9) | inrange(H03_R4, 4, 9)))
(2,797 real changes made)

. replace parent_secedu = 1 if A02 ==3 & (headsecedu == 1 | spousesecedu == 1)
(5,871 real changes made)

. replace parent_secedu = 1 if (A02 == 2 & spouseparentsecedu == 1) | (A02 == 1 & headparents
> ecedu == 1)
(60 real changes made)

. tab parent_secedu

parent_sece |
         du |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,468       60.68       60.68
          1 |      8,728       39.32      100.00
------------+-----------------------------------
      Total |     22,196      100.00

.  *parent_highedu
. gen parent_highedu = 0 if (A02==1 & (inrange(H03_R1, 1, 6) | inrange(H03_R2, 1, 6))) | (A02
> ==2 & (inrange(H03_R3, 1, 6) | inrange(H03_R4, 1, 6)))
(24,480 missing values generated)

. replace parent_highedu = 0 if A02 == 3 & (headhighedu == 0 | spousehighedu == 0)
(8,028 real changes made)

. replace parent_highedu = 0 if (A02 == 2 & spouseparenthighedu == 0) | (A02 == 1 & headparen
> thighedu == 0)
(256 real changes made)

. replace parent_highedu=1 if (A02==1 & (inrange(H03_R1, 7, 9) | inrange(H03_R2, 7, 9)))|(A02
> ==2 & (inrange(H03_R3, 7, 9) | inrange(H03_R4, 7, 9)))
(546 real changes made)

. replace parent_highedu = 1 if A02 == 3 & (headhighedu == 1 | spousehighedu == 1)
(3,206 real changes made)

. replace parent_highedu = 1 if (A02 == 2 & spouseparenthighedu == 1) | (A02 == 1 & headparen
> thighedu == 1)
(18 real changes made)

. tab parent_highedu

parent_high |
        edu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,426       83.01       83.01
          1 |      3,770       16.99      100.00
------------+-----------------------------------
      Total |     22,196      100.00

. *parent_partymember
. gen parent_partymember = 0 if ((A02==1 & (inrange(H07_R1, 2, 4) | inrange(H07_R2, 2, 4))) |
>  (A02==2 & (inrange(H07_R3, 2, 4) | inrange(H07_R4, 2, 4))))
(24,599 missing values generated)

. replace parent_partymember = 0 if A02 == 3 & (headparty == 0 | spouseparty == 0)
(9,506 real changes made)

. replace parent_partymember = 0 if (A02 == 2 & spouseparentparty == 0) | (A02 == 1 & headpar
> entparty == 0)
(246 real changes made)

. replace parent_partymember=1 if (A02==1 & (H07_R1 == 1 | H07_R2 == 1)) | (A02==2 & (H07_R3 
> == 1 | H07_R4 == 1))
(2,132 real changes made)

. replace parent_partymember = 1 if A02 == 3 & (headparty == 1 | spouseparty == 1)
(2,343 real changes made)

. replace parent_partymember = 1 if (A02 == 2 & spouseparentparty == 1) | (A02 == 1 & headpar
> entparty == 1)
(42 real changes made)

. tab parent_partymember

parent_part |
    ymember |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,694       79.66       79.66
          1 |      4,517       20.34      100.00
------------+-----------------------------------
      Total |     22,211      100.00

. 
. *9) Key School Indicator
. 
. gen Keyschool = 0 if A14 != .

. replace Keyschool = 1 if inrange(A14, 1, 3)
(5,933 real changes made)

. 
. *10) GaoKao Indicator
. gen TakeGaoKao = 1 if A15_1 == 1
(27,995 missing values generated)

. replace TakeGaoKao = 0 if A15_1 == 2
(22,524 real changes made)

. tab TakeGaoKao

 TakeGaoKao |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,524       73.16       73.16
          1 |      8,264       26.84      100.00
------------+-----------------------------------
      Total |     30,788      100.00

. tab TakeGaoKao educat

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |     2,910      3,884      8,219 |    15,013 
         1 |       631      7,499         80 |     8,210 
-----------+---------------------------------+----------
     Total |     3,541     11,383      8,299 |    23,223 

. tab TakeGaoKao educat if male==1

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |     1,459      2,029      4,141 |     7,629 
         1 |       324      3,958         41 |     4,323 
-----------+---------------------------------+----------
     Total |     1,783      5,987      4,182 |    11,952 

. tab TakeGaoKao educat if male==0

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |     1,451      1,855      4,078 |     7,384 
         1 |       307      3,541         39 |     3,887 
-----------+---------------------------------+----------
     Total |     1,758      5,396      4,117 |    11,271 

. 
. *Step Two: Regressions
. 
. *1) All parent indicators & Specified higher education, Sec Voc + inrange(birthyear, 1971, 
> 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entr
> ant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymember ) dm
> f(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -8078.8061
Iteration 2:  Log likelihood =  -7911.762
Iteration 3:  Log likelihood = -7889.2893
Iteration 4:  Log likelihood = -7888.4386
Iteration 5:  Log likelihood = -7888.4358

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(18)     =    3712.44
                                                  Prob > chi2     =     0.0000
Log likelihood = -7888.4358                       Pseudo R2       =     0.1905

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1487723   .0564114    -2.64   0.008    -.2593366    -.038208
         exp |   .3377558   .0258113    13.09   0.000     .2871665     .388345
      expsqr |  -.0066635   .0006555   -10.16   0.000    -.0079483   -.0053787
ins1_secge~e |   3.146607   .4324684     7.28   0.000     2.298984    3.994229
ins2_highe~e |   .1656096    .089736     1.85   0.065    -.0102698     .341489
ins3_vs_en~e |   .6070701   .4164226     1.46   0.145    -.2091033    1.423243
parent_sec~u |  -.1341947   .0659984    -2.03   0.042    -.2635493   -.0048401
parent_hig~u |   -.594374   .1373232    -4.33   0.000    -.8635226   -.3252254
parent_par~r |  -.1816723   .0724654    -2.51   0.012     -.323702   -.0396427
       _cons |   -5.41706   .3248221   -16.68   0.000    -6.053699    -4.78042
-------------+----------------------------------------------------------------
3            |
        male |   .0786611   .0586253     1.34   0.180    -.0362424    .1935645
         exp |   .5579362   .0330371    16.89   0.000     .4931847    .6226877
      expsqr |   -.007165   .0007494    -9.56   0.000    -.0086338   -.0056963
ins1_secge~e |   8.584779   .4797552    17.89   0.000     7.644476    9.525081
ins2_highe~e |   .5007066   .0999275     5.01   0.000     .3048522    .6965609
ins3_vs_en~e |  -.6740965   .4685839    -1.44   0.150    -1.592504     .244311
parent_sec~u |  -.8360797   .0799741   -10.45   0.000    -.9928261   -.6793333
parent_hig~u |  -1.294107     .25006    -5.18   0.000    -1.784216   -.8039985
parent_par~r |  -1.099121   .0857355   -12.82   0.000    -1.267159   -.9310821
       _cons |  -10.60915   .4348344   -24.40   0.000    -11.46141   -9.756888
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(12, 1852)     =     15.77
       Model |  72.2072817        12  6.01727348   Prob > F        =    0.0000
    Residual |  706.759929     1,852  .381619832   R-squared       =    0.0927
-------------+----------------------------------   Adj R-squared   =    0.0868
       Total |  778.967211     1,864  .417900864   Root MSE        =    .61775

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |    .203741   .0386581     5.27   0.000      .127923     .279559
               exp |    .030002   .0252747     1.19   0.235     -.019568     .079572
            expsqr |   -.001078   .0007387    -1.46   0.145    -.0025268    .0003707
        highvocedu |   .2129149    .046691     4.56   0.000     .1213424    .3044873
        highgenedu |   .5629247   .0860242     6.54   0.000     .3942101    .7316392
          adultedu |   .3499776   .0399707     8.76   0.000     .2715851      .42837
     parent_secedu |  -.0010936   .0447022    -0.02   0.980    -.0887656    .0865783
    parent_highedu |   .0424835   .0853595     0.50   0.619    -.1249275    .2098946
parent_partymember |   .0590406   .0512538     1.15   0.250    -.0414807    .1595618
               _m1 |   .2217048   .1850105     1.20   0.231    -.1411462    .5845558
               _m2 |  -1.305841   .6277965    -2.08   0.038    -2.537104    -.074578
               _m3 |  -1.398117   .5533945    -2.53   0.012     -2.48346   -.3127743
             _cons |    6.57024   .7923435     8.29   0.000      5.01626     8.12422
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.024553          .        .       .            .           .
        rho1 |   .2190322          .        .       .            .           .
        rho2 |    -1.2901          .        .       .            .           .
        rho3 |  -1.381263          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrang
> e(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
  highvocedu |      1,865    .1179625    .3226502          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,865    .0294906    .1692226          0          1
    adultedu |      1,865    .1689008    .3747648          0          1
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
-------------+---------------------------------------------------------
          m1 |      1,865    1.112156    .1936098   .6536492   2.083905
          m2 |      1,865    -.537424    .1471293  -.7260021   -.033357
          m3 |      1,865   -.3192815    .1957288  -.7260016  -.0026045

. outreg2 using "`xlspath'", replace ctitle(All Parent Indicators, Sec Voc, Specified Highere
> du,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) All parent indicators & Specified higher education, Sec Voc + inrange(birthyear, 1971, 
> 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_high
> edu parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -8078.8061
Iteration 2:  Log likelihood =  -7911.762
Iteration 3:  Log likelihood = -7889.2893
Iteration 4:  Log likelihood = -7888.4386
Iteration 5:  Log likelihood = -7888.4358

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(18)     =    3712.44
                                                  Prob > chi2     =     0.0000
Log likelihood = -7888.4358                       Pseudo R2       =     0.1905

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1487723   .0564114    -2.64   0.008    -.2593366    -.038208
         exp |   .3377558   .0258113    13.09   0.000     .2871665     .388345
      expsqr |  -.0066635   .0006555   -10.16   0.000    -.0079483   -.0053787
ins1_secge~e |   3.146607   .4324684     7.28   0.000     2.298984    3.994229
ins2_highe~e |   .1656096    .089736     1.85   0.065    -.0102698     .341489
ins3_vs_en~e |   .6070701   .4164226     1.46   0.145    -.2091033    1.423243
parent_sec~u |  -.1341947   .0659984    -2.03   0.042    -.2635493   -.0048401
parent_hig~u |   -.594374   .1373232    -4.33   0.000    -.8635226   -.3252254
parent_par~r |  -.1816723   .0724654    -2.51   0.012     -.323702   -.0396427
       _cons |   -5.41706   .3248221   -16.68   0.000    -6.053699    -4.78042
-------------+----------------------------------------------------------------
3            |
        male |   .0786611   .0586253     1.34   0.180    -.0362424    .1935645
         exp |   .5579362   .0330371    16.89   0.000     .4931847    .6226877
      expsqr |   -.007165   .0007494    -9.56   0.000    -.0086338   -.0056963
ins1_secge~e |   8.584779   .4797552    17.89   0.000     7.644476    9.525081
ins2_highe~e |   .5007066   .0999275     5.01   0.000     .3048522    .6965609
ins3_vs_en~e |  -.6740965   .4685839    -1.44   0.150    -1.592504     .244311
parent_sec~u |  -.8360797   .0799741   -10.45   0.000    -.9928261   -.6793333
parent_hig~u |  -1.294107     .25006    -5.18   0.000    -1.784216   -.8039985
parent_par~r |  -1.099121   .0857355   -12.82   0.000    -1.267159   -.9310821
       _cons |  -10.60915   .4348344   -24.40   0.000    -11.46141   -9.756888
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(26, 1838)     =     11.87
       Model |  111.981572        26  4.30698355   Prob > F        =    0.0000
    Residual |  666.985638     1,838  .362886637   R-squared       =    0.1438
-------------+----------------------------------   Adj R-squared   =    0.1316
       Total |  778.967211     1,864  .417900864   Root MSE        =     .6024

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1897201   .0390676     4.86   0.000     .1130985    .2663417
               exp |   .0521877   .0268476     1.94   0.052    -.0004674    .1048428
            expsqr |  -.0014647   .0007671    -1.91   0.056    -.0029691    .0000397
        highvocedu |   .2225251   .0460217     4.84   0.000     .1322648    .3127854
        highgenedu |   .5760824   .0848199     6.79   0.000     .4097288     .742436
          adultedu |   .3593208   .0398711     9.01   0.000     .2811234    .4375183
     parent_secedu |  -.0207591   .0442352    -0.47   0.639    -.1075157    .0659974
    parent_highedu |  -.0069511    .086765    -0.08   0.936    -.1771195    .1632174
parent_partymember |   .0420158   .0511715     0.82   0.412    -.0583445    .1423761
      provincedum2 |  -.3934871   .0806641    -4.88   0.000    -.5516899   -.2352842
      provincedum3 |   -.337588   .0840921    -4.01   0.000     -.502514   -.1726619
      provincedum4 |  -.3373624   .0786529    -4.29   0.000    -.4916208   -.1831039
      provincedum5 |   .0527932   .0743138     0.71   0.478     -.092955    .1985415
      provincedum6 |  -.1217952    .088655    -1.37   0.170    -.2956704    .0520799
      provincedum7 |  -.1467971   .0769844    -1.91   0.057    -.2977833     .004189
      provincedum8 |  -.2764056   .0824526    -3.35   0.001    -.4381162   -.1146949
      provincedum9 |  -.0310175   .0770499    -0.40   0.687     -.182132     .120097
     provincedum10 |  -.1468707   .0763209    -1.92   0.054    -.2965555    .0028141
     provincedum11 |   .0757576   .0728492     1.04   0.299    -.0671182    .2186335
     provincedum12 |  -.2527065   .0813861    -3.11   0.002    -.4123254   -.0930876
     provincedum13 |  -.0666169   .0800444    -0.83   0.405    -.2236043    .0903706
     provincedum14 |  -.2853952   .0886803    -3.22   0.001    -.4593199   -.1114705
     provincedum15 |  -.1428181   .0972387    -1.47   0.142     -.333528    .0478917
               _m1 |   .3604427   .1982932     1.82   0.069     -.028461    .7493463
               _m2 |  -1.699902    .671815    -2.53   0.011    -3.017503   -.3823013
               _m3 |  -1.395429   .5633001    -2.48   0.013    -2.500204   -.2906531
             _cons |   6.103031   .8363851     7.30   0.000     4.462666    7.743396
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.215186          .        .       .            .           .
        rho1 |   .3269752          .        .       .            .           .
        rho2 |  -1.542065          .        .       .            .           .
        rho3 |  -1.265862          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
  highvocedu |      1,865    .1179625    .3226502          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,865    .0294906    .1692226          0          1
    adultedu |      1,865    .1689008    .3747648          0          1
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
-------------+---------------------------------------------------------
provincedum2 |      1,865    .0654155     .247324          0          1
provincedum3 |      1,865     .044504    .2062674          0          1
provincedum4 |      1,865    .0697051    .2547177          0          1
provincedum5 |      1,865    .0756032    .2644331          0          1
provincedum6 |      1,865    .0493298    .2166137          0          1
-------------+---------------------------------------------------------
provincedum7 |      1,865    .0900804    .2863737          0          1
provincedum8 |      1,865    .0756032    .2644331          0          1
provincedum9 |      1,865    .0654155     .247324          0          1
provinced~10 |      1,865    .0702413    .2556218          0          1
provinced~11 |      1,865    .1115282    .3148695          0          1
-------------+---------------------------------------------------------
provinced~12 |      1,865    .0595174     .236654          0          1
provinced~13 |      1,865    .0670241    .2501308          0          1
provinced~14 |      1,865     .044504    .2062674          0          1
provinced~15 |      1,865    .0300268    .1707068          0          1
          m1 |      1,865    1.112156    .1936098   .6536492   2.083905
-------------+---------------------------------------------------------
          m2 |      1,865    -.537424    .1471293  -.7260021   -.033357
          m3 |      1,865   -.3192815    .1957288  -.7260016  -.0026045

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Specified Highered
> u, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) All parent indicators & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1
> 992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel
> (educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_
> entrant_relative  parent_secedu parent_highedu parent_partymember ) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -8078.8061
Iteration 2:  Log likelihood =  -7911.762
Iteration 3:  Log likelihood = -7889.2893
Iteration 4:  Log likelihood = -7888.4386
Iteration 5:  Log likelihood = -7888.4358

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(18)     =    3712.44
                                                  Prob > chi2     =     0.0000
Log likelihood = -7888.4358                       Pseudo R2       =     0.1905

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1487723   .0564114    -2.64   0.008    -.2593366    -.038208
         exp |   .3377558   .0258113    13.09   0.000     .2871665     .388345
      expsqr |  -.0066635   .0006555   -10.16   0.000    -.0079483   -.0053787
ins1_secge~e |   3.146607   .4324684     7.28   0.000     2.298984    3.994229
ins2_highe~e |   .1656096    .089736     1.85   0.065    -.0102698     .341489
ins3_vs_en~e |   .6070701   .4164226     1.46   0.145    -.2091033    1.423243
parent_sec~u |  -.1341947   .0659984    -2.03   0.042    -.2635493   -.0048401
parent_hig~u |   -.594374   .1373232    -4.33   0.000    -.8635226   -.3252254
parent_par~r |  -.1816723   .0724654    -2.51   0.012     -.323702   -.0396427
       _cons |   -5.41706   .3248221   -16.68   0.000    -6.053699    -4.78042
-------------+----------------------------------------------------------------
3            |
        male |   .0786611   .0586253     1.34   0.180    -.0362424    .1935645
         exp |   .5579362   .0330371    16.89   0.000     .4931847    .6226877
      expsqr |   -.007165   .0007494    -9.56   0.000    -.0086338   -.0056963
ins1_secge~e |   8.584779   .4797552    17.89   0.000     7.644476    9.525081
ins2_highe~e |   .5007066   .0999275     5.01   0.000     .3048522    .6965609
ins3_vs_en~e |  -.6740965   .4685839    -1.44   0.150    -1.592504     .244311
parent_sec~u |  -.8360797   .0799741   -10.45   0.000    -.9928261   -.6793333
parent_hig~u |  -1.294107     .25006    -5.18   0.000    -1.784216   -.8039985
parent_par~r |  -1.099121   .0857355   -12.82   0.000    -1.267159   -.9310821
       _cons |  -10.60915   .4348344   -24.40   0.000    -11.46141   -9.756888
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(10, 1854)     =     17.24
       Model |  66.2691817        10  6.62691817   Prob > F        =    0.0000
    Residual |  712.698029     1,854  .384411019   R-squared       =    0.0851
-------------+----------------------------------   Adj R-squared   =    0.0801
       Total |  778.967211     1,864  .417900864   Root MSE        =    .62001

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2009476   .0387925     5.18   0.000      .124866    .2770293
               exp |   .0349295   .0252766     1.38   0.167     -.014644    .0845031
            expsqr |  -.0011886   .0007398    -1.61   0.108    -.0026396    .0002624
         higheredu |   .3184581    .032129     9.91   0.000     .2554453    .3814709
     parent_secedu |   .0000957   .0448569     0.00   0.998    -.0878797    .0880711
    parent_highedu |   .0508919    .085636     0.59   0.552    -.1170611     .218845
parent_partymember |   .0637172   .0514146     1.24   0.215    -.0371194    .1645539
               _m1 |   .2286538   .1856667     1.23   0.218    -.1354841    .5927916
               _m2 |  -1.300281   .6300798    -2.06   0.039    -2.536021   -.0645405
               _m3 |  -1.387294   .5553971    -2.50   0.013    -2.476563   -.2980246
             _cons |   6.520442   .7950438     8.20   0.000     4.961167    8.079717
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.021705          .        .       .            .           .
        rho1 |    .226212          .        .       .            .           .
        rho2 |  -1.286395          .        .       .            .           .
        rho3 |  -1.372479          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250
> , 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
   higheredu |      1,865    .3163539    .4651775          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
          m1 |      1,865    1.112156    .1936098   .6536492   2.083905
          m2 |      1,865    -.537424    .1471293  -.7260021   -.033357
-------------+---------------------------------------------------------
          m3 |      1,865   -.3192815    .1957288  -.7260016  -.0026045

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Non-specified High
> eredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) All parent indicators & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1
> 992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymembe
> r ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -8078.8061
Iteration 2:  Log likelihood =  -7911.762
Iteration 3:  Log likelihood = -7889.2893
Iteration 4:  Log likelihood = -7888.4386
Iteration 5:  Log likelihood = -7888.4358

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(18)     =    3712.44
                                                  Prob > chi2     =     0.0000
Log likelihood = -7888.4358                       Pseudo R2       =     0.1905

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1487723   .0564114    -2.64   0.008    -.2593366    -.038208
         exp |   .3377558   .0258113    13.09   0.000     .2871665     .388345
      expsqr |  -.0066635   .0006555   -10.16   0.000    -.0079483   -.0053787
ins1_secge~e |   3.146607   .4324684     7.28   0.000     2.298984    3.994229
ins2_highe~e |   .1656096    .089736     1.85   0.065    -.0102698     .341489
ins3_vs_en~e |   .6070701   .4164226     1.46   0.145    -.2091033    1.423243
parent_sec~u |  -.1341947   .0659984    -2.03   0.042    -.2635493   -.0048401
parent_hig~u |   -.594374   .1373232    -4.33   0.000    -.8635226   -.3252254
parent_par~r |  -.1816723   .0724654    -2.51   0.012     -.323702   -.0396427
       _cons |   -5.41706   .3248221   -16.68   0.000    -6.053699    -4.78042
-------------+----------------------------------------------------------------
3            |
        male |   .0786611   .0586253     1.34   0.180    -.0362424    .1935645
         exp |   .5579362   .0330371    16.89   0.000     .4931847    .6226877
      expsqr |   -.007165   .0007494    -9.56   0.000    -.0086338   -.0056963
ins1_secge~e |   8.584779   .4797552    17.89   0.000     7.644476    9.525081
ins2_highe~e |   .5007066   .0999275     5.01   0.000     .3048522    .6965609
ins3_vs_en~e |  -.6740965   .4685839    -1.44   0.150    -1.592504     .244311
parent_sec~u |  -.8360797   .0799741   -10.45   0.000    -.9928261   -.6793333
parent_hig~u |  -1.294107     .25006    -5.18   0.000    -1.784216   -.8039985
parent_par~r |  -1.099121   .0857355   -12.82   0.000    -1.267159   -.9310821
       _cons |  -10.60915   .4348344   -24.40   0.000    -11.46141   -9.756888
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(24, 1840)     =     12.08
       Model |  106.015899        24  4.41732914   Prob > F        =    0.0000
    Residual |  672.951311     1,840  .365734408   R-squared       =    0.1361
-------------+----------------------------------   Adj R-squared   =    0.1248
       Total |  778.967211     1,864  .417900864   Root MSE        =    .60476

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1859915   .0392077     4.74   0.000     .1090954    .2628877
               exp |   .0580856   .0268484     2.16   0.031     .0054291    .1107421
            expsqr |  -.0015952   .0007682    -2.08   0.038    -.0031019   -.0000885
         higheredu |   .3269946   .0321545    10.17   0.000     .2639315    .3900577
     parent_secedu |  -.0199074   .0443989    -0.45   0.654    -.1069849    .0671701
    parent_highedu |  -.0010002   .0870693    -0.01   0.991    -.1717652    .1697649
parent_partymember |   .0446526   .0513571     0.87   0.385    -.0560717    .1453769
      provincedum2 |  -.4121213   .0808464    -5.10   0.000    -.5706817   -.2535609
      provincedum3 |  -.3460649   .0843503    -4.10   0.000    -.5114972   -.1806325
      provincedum4 |  -.3561808   .0787793    -4.52   0.000     -.510687   -.2016746
      provincedum5 |   .0319414   .0744024     0.43   0.668    -.1139807    .1778634
      provincedum6 |  -.1346359   .0889453    -1.51   0.130    -.3090802    .0398084
      provincedum7 |  -.1546731   .0770811    -2.01   0.045    -.3058487   -.0034976
      provincedum8 |  -.2926563   .0826436    -3.54   0.000    -.4547415   -.1305712
      provincedum9 |  -.0455954   .0772524    -0.59   0.555     -.197107    .1059162
     provincedum10 |  -.1673431   .0764494    -2.19   0.029    -.3172798   -.0174065
     provincedum11 |   .0562666   .0729552     0.77   0.441    -.0868171    .1993503
     provincedum12 |  -.2683493   .0816091    -3.29   0.001    -.4284054   -.1082932
     provincedum13 |  -.0838104   .0802009    -1.05   0.296    -.2411048     .073484
     provincedum14 |  -.2975764   .0889368    -3.35   0.001    -.4720041   -.1231487
     provincedum15 |  -.1455178   .0976149    -1.49   0.136    -.3369653    .0459298
               _m1 |    .376996   .1990275     1.89   0.058    -.0133475    .7673395
               _m2 |  -1.739444   .6743082    -2.58   0.010    -3.061934   -.4169544
               _m3 |  -1.402178     .56549    -2.48   0.013    -2.511248   -.2931085
             _cons |   6.018351   .8390884     7.17   0.000     4.372685    7.664016
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.248246          .        .       .            .           .
        rho1 |   .3374324          .        .       .            .           .
        rho2 |  -1.556899          .        .       .            .           .
        rho3 |  -1.255027          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
   higheredu |      1,865    .3163539    .4651775          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
provincedum2 |      1,865    .0654155     .247324          0          1
provincedum3 |      1,865     .044504    .2062674          0          1
-------------+---------------------------------------------------------
provincedum4 |      1,865    .0697051    .2547177          0          1
provincedum5 |      1,865    .0756032    .2644331          0          1
provincedum6 |      1,865    .0493298    .2166137          0          1
provincedum7 |      1,865    .0900804    .2863737          0          1
provincedum8 |      1,865    .0756032    .2644331          0          1
-------------+---------------------------------------------------------
provincedum9 |      1,865    .0654155     .247324          0          1
provinced~10 |      1,865    .0702413    .2556218          0          1
provinced~11 |      1,865    .1115282    .3148695          0          1
provinced~12 |      1,865    .0595174     .236654          0          1
provinced~13 |      1,865    .0670241    .2501308          0          1
-------------+---------------------------------------------------------
provinced~14 |      1,865     .044504    .2062674          0          1
provinced~15 |      1,865    .0300268    .1707068          0          1
          m1 |      1,865    1.112156    .1936098   .6536492   2.083905
          m2 |      1,865    -.537424    .1471293  -.7260021   -.033357
          m3 |      1,865   -.3192815    .1957288  -.7260016  -.0026045

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Non-specified High
> eredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) All parent indicators & Specified higher education, Sec Gen + inrange(birthyear, 1971, 
> 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entr
> ant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymember ) dm
> f(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -8078.8061
Iteration 2:  Log likelihood =  -7911.762
Iteration 3:  Log likelihood = -7889.2893
Iteration 4:  Log likelihood = -7888.4386
Iteration 5:  Log likelihood = -7888.4358

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(18)     =    3712.44
                                                  Prob > chi2     =     0.0000
Log likelihood = -7888.4358                       Pseudo R2       =     0.1905

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1487723   .0564114    -2.64   0.008    -.2593366    -.038208
         exp |   .3377558   .0258113    13.09   0.000     .2871665     .388345
      expsqr |  -.0066635   .0006555   -10.16   0.000    -.0079483   -.0053787
ins1_secge~e |   3.146607   .4324684     7.28   0.000     2.298984    3.994229
ins2_highe~e |   .1656096    .089736     1.85   0.065    -.0102698     .341489
ins3_vs_en~e |   .6070701   .4164226     1.46   0.145    -.2091033    1.423243
parent_sec~u |  -.1341947   .0659984    -2.03   0.042    -.2635493   -.0048401
parent_hig~u |   -.594374   .1373232    -4.33   0.000    -.8635226   -.3252254
parent_par~r |  -.1816723   .0724654    -2.51   0.012     -.323702   -.0396427
       _cons |   -5.41706   .3248221   -16.68   0.000    -6.053699    -4.78042
-------------+----------------------------------------------------------------
3            |
        male |   .0786611   .0586253     1.34   0.180    -.0362424    .1935645
         exp |   .5579362   .0330371    16.89   0.000     .4931847    .6226877
      expsqr |   -.007165   .0007494    -9.56   0.000    -.0086338   -.0056963
ins1_secge~e |   8.584779   .4797552    17.89   0.000     7.644476    9.525081
ins2_highe~e |   .5007066   .0999275     5.01   0.000     .3048522    .6965609
ins3_vs_en~e |  -.6740965   .4685839    -1.44   0.150    -1.592504     .244311
parent_sec~u |  -.8360797   .0799741   -10.45   0.000    -.9928261   -.6793333
parent_hig~u |  -1.294107     .25006    -5.18   0.000    -1.784216   -.8039985
parent_par~r |  -1.099121   .0857355   -12.82   0.000    -1.267159   -.9310821
       _cons |  -10.60915   .4348344   -24.40   0.000    -11.46141   -9.756888
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(12, 4824)     =     47.29
       Model |  258.451003        12  21.5375836   Prob > F        =    0.0000
    Residual |  2197.01635     4,824  .455434567   R-squared       =    0.1053
-------------+----------------------------------   Adj R-squared   =    0.1030
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .67486

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2214834   .0220232    10.06   0.000     .1783078    .2646589
               exp |   .0229321   .0133134     1.72   0.085    -.0031681    .0490324
            expsqr |  -.0008164   .0003953    -2.07   0.039    -.0015913   -.0000414
        highvocedu |   .1898226   .0306031     6.20   0.000     .1298266    .2498186
        highgenedu |   .5348935   .0295412    18.11   0.000     .4769792    .5928078
          adultedu |   .2869034   .0359039     7.99   0.000     .2165153    .3572915
     parent_secedu |   .0116493   .0252745     0.46   0.645    -.0379003    .0611989
    parent_highedu |    .083166   .0429222     1.94   0.053    -.0009809     .167313
parent_partymember |   .0151752   .0277963     0.55   0.585    -.0393182    .0696686
               _m1 |  -.3112938   .2695839    -1.15   0.248    -.8398012    .2172135
               _m2 |   -.011821   .1192676    -0.10   0.921    -.2456399    .2219979
               _m3 |  -.3733469   .2388258    -1.56   0.118    -.8415543    .0948606
             _cons |     7.7729   .0612847   126.83   0.000     7.652754    7.893046
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .5007323          .        .       .            .           .
        rho1 |  -.4399139          .        .       .            .           .
        rho2 |  -.0167052          .        .       .            .           .
        rho3 |   -.527606          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrang
> e(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
  highvocedu |      4,837    .2464337    .4309786          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,837    .4085177    .4916106          0          1
    adultedu |      4,837    .1145338    .3184914          0          1
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
-------------+---------------------------------------------------------
          m1 |      4,837   -.2755419    .0782857  -.4723033  -.0271048
          m2 |      4,837    .4325643    .3494834  -.0053328   2.405284
          m3 |      4,837   -.2286897    .2017897  -.7259995  -.0002039

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Specified Highered
> u,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) All parent indicators & Specified higher education, Sec Gen + inrange(birthyear, 1971, 
> 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_high
> edu parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -8078.8061
Iteration 2:  Log likelihood =  -7911.762
Iteration 3:  Log likelihood = -7889.2893
Iteration 4:  Log likelihood = -7888.4386
Iteration 5:  Log likelihood = -7888.4358

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(18)     =    3712.44
                                                  Prob > chi2     =     0.0000
Log likelihood = -7888.4358                       Pseudo R2       =     0.1905

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1487723   .0564114    -2.64   0.008    -.2593366    -.038208
         exp |   .3377558   .0258113    13.09   0.000     .2871665     .388345
      expsqr |  -.0066635   .0006555   -10.16   0.000    -.0079483   -.0053787
ins1_secge~e |   3.146607   .4324684     7.28   0.000     2.298984    3.994229
ins2_highe~e |   .1656096    .089736     1.85   0.065    -.0102698     .341489
ins3_vs_en~e |   .6070701   .4164226     1.46   0.145    -.2091033    1.423243
parent_sec~u |  -.1341947   .0659984    -2.03   0.042    -.2635493   -.0048401
parent_hig~u |   -.594374   .1373232    -4.33   0.000    -.8635226   -.3252254
parent_par~r |  -.1816723   .0724654    -2.51   0.012     -.323702   -.0396427
       _cons |   -5.41706   .3248221   -16.68   0.000    -6.053699    -4.78042
-------------+----------------------------------------------------------------
3            |
        male |   .0786611   .0586253     1.34   0.180    -.0362424    .1935645
         exp |   .5579362   .0330371    16.89   0.000     .4931847    .6226877
      expsqr |   -.007165   .0007494    -9.56   0.000    -.0086338   -.0056963
ins1_secge~e |   8.584779   .4797552    17.89   0.000     7.644476    9.525081
ins2_highe~e |   .5007066   .0999275     5.01   0.000     .3048522    .6965609
ins3_vs_en~e |  -.6740965   .4685839    -1.44   0.150    -1.592504     .244311
parent_sec~u |  -.8360797   .0799741   -10.45   0.000    -.9928261   -.6793333
parent_hig~u |  -1.294107     .25006    -5.18   0.000    -1.784216   -.8039985
parent_par~r |  -1.099121   .0857355   -12.82   0.000    -1.267159   -.9310821
       _cons |  -10.60915   .4348344   -24.40   0.000    -11.46141   -9.756888
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(26, 4810)     =     37.86
       Model |  417.166522        26  16.0448662   Prob > F        =    0.0000
    Residual |  2038.30083     4,810  .423763167   R-squared       =    0.1699
-------------+----------------------------------   Adj R-squared   =    0.1654
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .65097

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1950305   .0214709     9.08   0.000     .1529377    .2371232
               exp |   .0602303   .0135436     4.45   0.000     .0336786     .086782
            expsqr |  -.0014601    .000392    -3.72   0.000    -.0022287   -.0006916
        highvocedu |   .1825006    .029743     6.14   0.000     .1241908    .2408105
        highgenedu |   .4973421   .0292402    17.01   0.000      .440018    .5546662
          adultedu |   .2662843   .0350275     7.60   0.000     .1976145    .3349542
     parent_secedu |   .0043653   .0246886     0.18   0.860    -.0440356    .0527663
    parent_highedu |  -.0234063   .0433725    -0.54   0.589    -.1084363    .0616236
parent_partymember |  -.0059932   .0271048    -0.22   0.825     -.059131    .0471446
      provincedum2 |  -.6225537   .0502926   -12.38   0.000    -.7211503   -.5239572
      provincedum3 |  -.3068422   .0473247    -6.48   0.000    -.3996203   -.2140642
      provincedum4 |  -.4558323   .0502717    -9.07   0.000    -.5543879   -.3572768
      provincedum5 |  -.0676673   .0455745    -1.48   0.138    -.1570142    .0216796
      provincedum6 |  -.4009526   .0535326    -7.49   0.000     -.505901   -.2960043
      provincedum7 |  -.3560941   .0504277    -7.06   0.000    -.4549554   -.2572328
      provincedum8 |   -.594905   .0496954   -11.97   0.000    -.6923306   -.4974793
      provincedum9 |  -.1595619   .0470556    -3.39   0.001    -.2518124   -.0673115
     provincedum10 |  -.2154679   .0489836    -4.40   0.000    -.3114981   -.1194377
     provincedum11 |  -.0900028   .0424194    -2.12   0.034    -.1731641   -.0068414
     provincedum12 |  -.2696063   .0529478    -5.09   0.000    -.3734081   -.1658045
     provincedum13 |  -.2312352   .0487856    -4.74   0.000    -.3268774    -.135593
     provincedum14 |  -.2945156    .066229    -4.45   0.000    -.4243546   -.1646765
     provincedum15 |  -.4421029   .0578131    -7.65   0.000    -.5554431   -.3287627
               _m1 |   .6056052   .2817429     2.15   0.032     .0532602     1.15795
               _m2 |  -.2833889   .1208194    -2.35   0.019    -.5202502   -.0465276
               _m3 |  -.3379781   .2321541    -1.46   0.146    -.7931063    .1171501
             _cons |   8.084833   .0709029   114.03   0.000      7.94583    8.223835
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .5559571          .        .       .            .           .
        rho1 |   .8122113          .        .       .            .           .
        rho2 |  -.3800688          .        .       .            .           .
        rho3 |  -.4532815          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
  highvocedu |      4,837    .2464337    .4309786          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,837    .4085177    .4916106          0          1
    adultedu |      4,837    .1145338    .3184914          0          1
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
-------------+---------------------------------------------------------
provincedum2 |      4,837    .0597478    .2370435          0          1
provincedum3 |      4,837    .0649163    .2464035          0          1
provincedum4 |      4,837    .0587141    .2351131          0          1
provincedum5 |      4,837    .0793881    .2703714          0          1
provincedum6 |      4,837    .0529254    .2239077          0          1
-------------+---------------------------------------------------------
provincedum7 |      4,837    .0632624    .2434594          0          1
provincedum8 |      4,837    .0756667    .2644915          0          1
provincedum9 |      4,837    .0692578    .2539183          0          1
provinced~10 |      4,837    .0618152    .2408445          0          1
provinced~11 |      4,837     .130246    .3366087          0          1
-------------+---------------------------------------------------------
provinced~12 |      4,837    .0504445     .218883          0          1
provinced~13 |      4,837    .0667769    .2496611          0          1
provinced~14 |      4,837    .0274964    .1635416          0          1
provinced~15 |      4,837    .0361795    .1867557          0          1
          m1 |      4,837   -.2755419    .0782857  -.4723033  -.0271048
-------------+---------------------------------------------------------
          m2 |      4,837    .4325643    .3494834  -.0053328   2.405284
          m3 |      4,837   -.2286897    .2017897  -.7259995  -.0002039

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Specified Highered
> u, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) All parent indicators & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1
> 992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel
> (educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_
> entrant_relative  parent_secedu parent_highedu parent_partymember ) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -8078.8061
Iteration 2:  Log likelihood =  -7911.762
Iteration 3:  Log likelihood = -7889.2893
Iteration 4:  Log likelihood = -7888.4386
Iteration 5:  Log likelihood = -7888.4358

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(18)     =    3712.44
                                                  Prob > chi2     =     0.0000
Log likelihood = -7888.4358                       Pseudo R2       =     0.1905

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1487723   .0564114    -2.64   0.008    -.2593366    -.038208
         exp |   .3377558   .0258113    13.09   0.000     .2871665     .388345
      expsqr |  -.0066635   .0006555   -10.16   0.000    -.0079483   -.0053787
ins1_secge~e |   3.146607   .4324684     7.28   0.000     2.298984    3.994229
ins2_highe~e |   .1656096    .089736     1.85   0.065    -.0102698     .341489
ins3_vs_en~e |   .6070701   .4164226     1.46   0.145    -.2091033    1.423243
parent_sec~u |  -.1341947   .0659984    -2.03   0.042    -.2635493   -.0048401
parent_hig~u |   -.594374   .1373232    -4.33   0.000    -.8635226   -.3252254
parent_par~r |  -.1816723   .0724654    -2.51   0.012     -.323702   -.0396427
       _cons |   -5.41706   .3248221   -16.68   0.000    -6.053699    -4.78042
-------------+----------------------------------------------------------------
3            |
        male |   .0786611   .0586253     1.34   0.180    -.0362424    .1935645
         exp |   .5579362   .0330371    16.89   0.000     .4931847    .6226877
      expsqr |   -.007165   .0007494    -9.56   0.000    -.0086338   -.0056963
ins1_secge~e |   8.584779   .4797552    17.89   0.000     7.644476    9.525081
ins2_highe~e |   .5007066   .0999275     5.01   0.000     .3048522    .6965609
ins3_vs_en~e |  -.6740965   .4685839    -1.44   0.150    -1.592504     .244311
parent_sec~u |  -.8360797   .0799741   -10.45   0.000    -.9928261   -.6793333
parent_hig~u |  -1.294107     .25006    -5.18   0.000    -1.784216   -.8039985
parent_par~r |  -1.099121   .0857355   -12.82   0.000    -1.267159   -.9310821
       _cons |  -10.60915   .4348344   -24.40   0.000    -11.46141   -9.756888
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(10, 4826)     =     35.43
       Model |  167.922173        10  16.7922173   Prob > F        =    0.0000
    Residual |  2287.54518     4,826  .474004389   R-squared       =    0.0684
-------------+----------------------------------   Adj R-squared   =    0.0665
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .68848

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2098827   .0224433     9.35   0.000     .1658836    .2538818
               exp |    .031878   .0135623     2.35   0.019     .0052898    .0584663
            expsqr |  -.0010754   .0004026    -2.67   0.008    -.0018646   -.0002861
         higheredu |   .3550034   .0267461    13.27   0.000     .3025689    .4074379
     parent_secedu |    .017161    .025777     0.67   0.506    -.0333736    .0676956
    parent_highedu |   .0989003   .0437602     2.26   0.024     .0131104    .1846903
parent_partymember |   .0199571   .0283439     0.70   0.481    -.0356099     .075524
               _m1 |   .0286852   .2734896     0.10   0.916    -.5074791    .5648495
               _m2 |  -.0509995   .1216371    -0.42   0.675    -.2894636    .1874646
               _m3 |  -.3497616    .243519    -1.44   0.151    -.8271698    .1276466
             _cons |   7.851831   .0619364   126.77   0.000     7.730408    7.973255
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4934225          .        .       .            .           .
        rho1 |   .0408365          .        .       .            .           .
        rho2 |  -.0726033          .        .       .            .           .
        rho3 |  -.4979235          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250
> , 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
   higheredu |      4,837    .7694852    .4212059          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
          m1 |      4,837   -.2755419    .0782857  -.4723033  -.0271048
          m2 |      4,837    .4325643    .3494834  -.0053328   2.405284
-------------+---------------------------------------------------------
          m3 |      4,837   -.2286897    .2017897  -.7259995  -.0002039

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Non-specified High
> eredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) All parent indicators & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1
> 992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymembe
> r ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -8078.8061
Iteration 2:  Log likelihood =  -7911.762
Iteration 3:  Log likelihood = -7889.2893
Iteration 4:  Log likelihood = -7888.4386
Iteration 5:  Log likelihood = -7888.4358

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(18)     =    3712.44
                                                  Prob > chi2     =     0.0000
Log likelihood = -7888.4358                       Pseudo R2       =     0.1905

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1487723   .0564114    -2.64   0.008    -.2593366    -.038208
         exp |   .3377558   .0258113    13.09   0.000     .2871665     .388345
      expsqr |  -.0066635   .0006555   -10.16   0.000    -.0079483   -.0053787
ins1_secge~e |   3.146607   .4324684     7.28   0.000     2.298984    3.994229
ins2_highe~e |   .1656096    .089736     1.85   0.065    -.0102698     .341489
ins3_vs_en~e |   .6070701   .4164226     1.46   0.145    -.2091033    1.423243
parent_sec~u |  -.1341947   .0659984    -2.03   0.042    -.2635493   -.0048401
parent_hig~u |   -.594374   .1373232    -4.33   0.000    -.8635226   -.3252254
parent_par~r |  -.1816723   .0724654    -2.51   0.012     -.323702   -.0396427
       _cons |   -5.41706   .3248221   -16.68   0.000    -6.053699    -4.78042
-------------+----------------------------------------------------------------
3            |
        male |   .0786611   .0586253     1.34   0.180    -.0362424    .1935645
         exp |   .5579362   .0330371    16.89   0.000     .4931847    .6226877
      expsqr |   -.007165   .0007494    -9.56   0.000    -.0086338   -.0056963
ins1_secge~e |   8.584779   .4797552    17.89   0.000     7.644476    9.525081
ins2_highe~e |   .5007066   .0999275     5.01   0.000     .3048522    .6965609
ins3_vs_en~e |  -.6740965   .4685839    -1.44   0.150    -1.592504     .244311
parent_sec~u |  -.8360797   .0799741   -10.45   0.000    -.9928261   -.6793333
parent_hig~u |  -1.294107     .25006    -5.18   0.000    -1.784216   -.8039985
parent_par~r |  -1.099121   .0857355   -12.82   0.000    -1.267159   -.9310821
       _cons |  -10.60915   .4348344   -24.40   0.000    -11.46141   -9.756888
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(24, 4812)     =     32.57
       Model |  343.163723        24  14.2984884   Prob > F        =    0.0000
    Residual |  2112.30363     4,812  .438965842   R-squared       =    0.1398
-------------+----------------------------------   Adj R-squared   =    0.1355
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .66254

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |     .18151   .0218199     8.32   0.000      .138733    .2242869
               exp |   .0739764   .0137406     5.38   0.000     .0470385    .1009143
            expsqr |  -.0018003   .0003979    -4.52   0.000    -.0025804   -.0010203
         higheredu |   .3239518   .0262349    12.35   0.000     .2725194    .3753841
     parent_secedu |   .0053263   .0251232     0.21   0.832    -.0439266    .0545792
    parent_highedu |  -.0297002   .0441329    -0.67   0.501    -.1162208    .0568204
parent_partymember |  -.0062757   .0275779    -0.23   0.820    -.0603411    .0477897
      provincedum2 |  -.6902659   .0509022   -13.56   0.000    -.7900575   -.5904743
      provincedum3 |  -.3406499   .0480913    -7.08   0.000    -.4349309   -.2463689
      provincedum4 |  -.4815224   .0511237    -9.42   0.000    -.5817483   -.3812966
      provincedum5 |  -.0942402   .0463044    -2.04   0.042    -.1850179   -.0034625
      provincedum6 |  -.4571732   .0542906    -8.42   0.000    -.5636076   -.3507388
      provincedum7 |   -.409638   .0511249    -8.01   0.000    -.5098662   -.3094099
      provincedum8 |  -.6634083   .0502911   -13.19   0.000    -.7620018   -.5648148
      provincedum9 |  -.2049219   .0477248    -4.29   0.000    -.2984843   -.1113595
     provincedum10 |  -.2789669   .0496063    -5.62   0.000     -.376218   -.1817158
     provincedum11 |  -.1454946   .0429472    -3.39   0.001    -.2296909   -.0612984
     provincedum12 |  -.3212488   .0537406    -5.98   0.000    -.4266049   -.2158927
     provincedum13 |  -.2901767   .0494413    -5.87   0.000    -.3871043   -.1932491
     provincedum14 |  -.3332087   .0673251    -4.95   0.000    -.4651967   -.2012207
     provincedum15 |  -.4513975   .0588217    -7.67   0.000    -.5667148   -.3360801
               _m1 |   1.063198   .2842393     3.74   0.000     .5059587    1.620437
               _m2 |   -.365832   .1227902    -2.98   0.003     -.606557    -.125107
               _m3 |   -.320811   .2361566    -1.36   0.174    -.7837859    .1421638
             _cons |   8.217624   .0712672   115.31   0.000     8.077908     8.35734
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .7770106          .        .       .            .           .
        rho1 |   1.206148          .        .       .            .           .
        rho2 |  -.4150192          .        .       .            .           .
        rho3 |  -.3639451          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
   higheredu |      4,837    .7694852    .4212059          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
provincedum2 |      4,837    .0597478    .2370435          0          1
provincedum3 |      4,837    .0649163    .2464035          0          1
-------------+---------------------------------------------------------
provincedum4 |      4,837    .0587141    .2351131          0          1
provincedum5 |      4,837    .0793881    .2703714          0          1
provincedum6 |      4,837    .0529254    .2239077          0          1
provincedum7 |      4,837    .0632624    .2434594          0          1
provincedum8 |      4,837    .0756667    .2644915          0          1
-------------+---------------------------------------------------------
provincedum9 |      4,837    .0692578    .2539183          0          1
provinced~10 |      4,837    .0618152    .2408445          0          1
provinced~11 |      4,837     .130246    .3366087          0          1
provinced~12 |      4,837    .0504445     .218883          0          1
provinced~13 |      4,837    .0667769    .2496611          0          1
-------------+---------------------------------------------------------
provinced~14 |      4,837    .0274964    .1635416          0          1
provinced~15 |      4,837    .0361795    .1867557          0          1
          m1 |      4,837   -.2755419    .0782857  -.4723033  -.0271048
          m2 |      4,837    .4325643    .3494834  -.0053328   2.405284
          m3 |      4,837   -.2286897    .2017897  -.7259995  -.0002039

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Non-specified High
> eredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) Parent Edu & Specified higher education, Sec Voc + inrange(birthyear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative  parent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9780.5672
Iteration 1:  Log likelihood = -8176.0646
Iteration 2:  Log likelihood = -8028.4719
Iteration 3:  Log likelihood = -8009.6917
Iteration 4:  Log likelihood = -8009.0558
Iteration 5:  Log likelihood =  -8009.054

Multinomial logistic regression                   Number of obs   =       9552
                                                  LR chi2(16)     =    3543.03
                                                  Prob > chi2     =     0.0000
Log likelihood =  -8009.054                       Pseudo R2       =     0.1811

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1498773   .0562716    -2.66   0.008    -.2601677   -.0395869
         exp |   .3383485   .0257007    13.16   0.000     .2879762    .3887209
      expsqr |  -.0067048   .0006518   -10.29   0.000    -.0079824   -.0054272
ins1_secge~e |   3.217035    .432749     7.43   0.000     2.368863    4.065208
ins2_highe~e |   .1623623   .0899907     1.80   0.071    -.0140161    .3387408
ins3_vs_en~e |   .6231461   .4158739     1.50   0.134    -.1919517    1.438244
parent_sec~u |  -.1656876   .0646129    -2.56   0.010    -.2923267   -.0390486
parent_hig~u |  -.6624628   .1347136    -4.92   0.000    -.9264966   -.3984289
       _cons |  -5.460478   .3247003   -16.82   0.000    -6.096879   -4.824077
-------------+----------------------------------------------------------------
3            |
        male |      .0776   .0578559     1.34   0.180    -.0357955    .1909955
         exp |   .5432133   .0324293    16.75   0.000      .479653    .6067737
      expsqr |  -.0070256   .0007353    -9.56   0.000    -.0084667   -.0055845
ins1_secge~e |   8.555475   .4759428    17.98   0.000     7.622644    9.488306
ins2_highe~e |    .483758   .0986498     4.90   0.000     .2904079    .6771081
ins3_vs_en~e |    -.63543    .464711    -1.37   0.172    -1.546247    .2753869
parent_sec~u |  -1.010588   .0784388   -12.88   0.000    -1.164325   -.8568505
parent_hig~u |  -1.597307   .2459399    -6.49   0.000    -2.079341   -1.115274
       _cons |  -10.49268   .4282927   -24.50   0.000    -11.33212   -9.653244
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,873
-------------+----------------------------------   F(11, 1861)     =     17.57
       Model |  74.2468198        11  6.74971089   Prob > F        =    0.0000
    Residual |  715.044975     1,861  .384226209   R-squared       =    0.0941
-------------+----------------------------------   Adj R-squared   =    0.0887
       Total |  789.291795     1,872  .421630233   Root MSE        =    .61986

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .1926867   .0407458     4.73   0.000     .1127746    .2725989
           exp |   .0470524   .0279849     1.68   0.093    -.0078326    .1019374
        expsqr |   -.001629   .0008294    -1.96   0.050    -.0032557   -2.33e-06
    highvocedu |   .2112483   .0465971     4.53   0.000     .1198601    .3026364
    highgenedu |   .5560286   .0863256     6.44   0.000     .3867234    .7253338
      adultedu |   .3493661   .0400176     8.73   0.000     .2708819    .4278503
 parent_secedu |    .032741   .0513722     0.64   0.524    -.0680122    .1334941
parent_highedu |   .0563576   .0854381     0.66   0.510     -.111207    .2239221
           _m1 |   .3556633   .2069865     1.72   0.086    -.0502868    .7616134
           _m2 |  -1.519005   .6675245    -2.28   0.023     -2.82818   -.2098291
           _m3 |  -1.642168     .59977    -2.74   0.006     -2.81846   -.4658752
         _cons |   6.122365   .8678944     7.05   0.000     4.420216    7.824513
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.324424          .        .       .            .           .
        rho1 |   .3090477          .        .       .            .           .
        rho2 |  -1.319914          .        .       .            .           .
        rho3 |  -1.426934          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 2
> 50, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,873     8.33294    .6493306   5.521461   10.12663
        male |      1,873    .5317672    .4991231          0          1
         exp |      1,873    18.05392    6.408276          3         32
      expsqr |      1,873    366.9883    235.0513          9       1024
  highvocedu |      1,873    .1190603     .323946          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,873    .0293647    .1688715          0          1
    adultedu |      1,873    .1681794    .3741254          0          1
parent_sec~u |      1,873    .2979178    .4574653          0          1
parent_hig~u |      1,873    .0427122    .2022615          0          1
          m1 |      1,873    1.113934    .1874908   .7269459    2.01031
-------------+---------------------------------------------------------
          m2 |      1,873    -.536096    .1446546  -.7259985  -.0393804
          m3 |      1,873   -.3248981    .1920044  -.7257156   -.004018

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Specified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) Parent Edu & Specified higher education, Sec Voc + inrange(birthyear, 1971, 1992) + Pro
> vincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(mon
> thlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu ) dmf(2) showml
> ogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9780.5672
Iteration 1:  Log likelihood = -8176.0646
Iteration 2:  Log likelihood = -8028.4719
Iteration 3:  Log likelihood = -8009.6917
Iteration 4:  Log likelihood = -8009.0558
Iteration 5:  Log likelihood =  -8009.054

Multinomial logistic regression                   Number of obs   =       9552
                                                  LR chi2(16)     =    3543.03
                                                  Prob > chi2     =     0.0000
Log likelihood =  -8009.054                       Pseudo R2       =     0.1811

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1498773   .0562716    -2.66   0.008    -.2601677   -.0395869
         exp |   .3383485   .0257007    13.16   0.000     .2879762    .3887209
      expsqr |  -.0067048   .0006518   -10.29   0.000    -.0079824   -.0054272
ins1_secge~e |   3.217035    .432749     7.43   0.000     2.368863    4.065208
ins2_highe~e |   .1623623   .0899907     1.80   0.071    -.0140161    .3387408
ins3_vs_en~e |   .6231461   .4158739     1.50   0.134    -.1919517    1.438244
parent_sec~u |  -.1656876   .0646129    -2.56   0.010    -.2923267   -.0390486
parent_hig~u |  -.6624628   .1347136    -4.92   0.000    -.9264966   -.3984289
       _cons |  -5.460478   .3247003   -16.82   0.000    -6.096879   -4.824077
-------------+----------------------------------------------------------------
3            |
        male |      .0776   .0578559     1.34   0.180    -.0357955    .1909955
         exp |   .5432133   .0324293    16.75   0.000      .479653    .6067737
      expsqr |  -.0070256   .0007353    -9.56   0.000    -.0084667   -.0055845
ins1_secge~e |   8.555475   .4759428    17.98   0.000     7.622644    9.488306
ins2_highe~e |    .483758   .0986498     4.90   0.000     .2904079    .6771081
ins3_vs_en~e |    -.63543    .464711    -1.37   0.172    -1.546247    .2753869
parent_sec~u |  -1.010588   .0784388   -12.88   0.000    -1.164325   -.8568505
parent_hig~u |  -1.597307   .2459399    -6.49   0.000    -2.079341   -1.115274
       _cons |  -10.49268   .4282927   -24.50   0.000    -11.33212   -9.653244
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,873
-------------+----------------------------------   F(25, 1847)     =     12.63
       Model |  115.260688        25  4.61042752   Prob > F        =    0.0000
    Residual |  674.031107     1,847  .364932922   R-squared       =    0.1460
-------------+----------------------------------   Adj R-squared   =    0.1345
       Total |  789.291795     1,872  .421630233   Root MSE        =     .6041

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .1790545   .0412071     4.35   0.000     .0982372    .2598718
           exp |    .067431   .0295254     2.28   0.022     .0095243    .1253377
        expsqr |  -.0019684   .0008598    -2.29   0.022    -.0036547   -.0002822
    highvocedu |   .2224132   .0459014     4.85   0.000     .1323891    .3124374
    highgenedu |   .5700658   .0850728     6.70   0.000     .4032169    .7369147
      adultedu |   .3613281   .0398949     9.06   0.000     .2830843     .439572
 parent_secedu |   .0100134   .0512859     0.20   0.845     -.090571    .1105979
parent_highedu |   .0022977   .0872123     0.03   0.979    -.1687474    .1733429
  provincedum2 |  -.3885876   .0805994    -4.82   0.000     -.546663   -.2305122
  provincedum3 |  -.3244762    .084137    -3.86   0.000    -.4894898   -.1594626
  provincedum4 |  -.3256762   .0784711    -4.15   0.000    -.4795775   -.1717749
  provincedum5 |   .0668226   .0743439     0.90   0.369    -.0789843    .2126295
  provincedum6 |  -.1138845   .0886709    -1.28   0.199    -.2877902    .0600212
  provincedum7 |  -.1359686   .0770396    -1.76   0.078    -.2870624    .0151253
  provincedum8 |   -.270537   .0823997    -3.28   0.001    -.4321432   -.1089307
  provincedum9 |  -.0263953   .0772957    -0.34   0.733    -.1779914    .1252008
 provincedum10 |  -.1417436   .0763546    -1.86   0.064     -.291494    .0080069
 provincedum11 |   .0878692   .0726878     1.21   0.227    -.0546896     .230428
 provincedum12 |  -.2457909   .0815832    -3.01   0.003     -.405796   -.0857858
 provincedum13 |  -.0583744   .0801871    -0.73   0.467    -.2156412    .0988924
 provincedum14 |  -.3028368   .0884812    -3.42   0.001    -.4763705   -.1293031
 provincedum15 |  -.1455583   .0976069    -1.49   0.136    -.3369898    .0458732
           _m1 |   .4822564    .219689     2.20   0.028     .0513914    .9131213
           _m2 |  -1.855706   .7114415    -2.61   0.009     -3.25102   -.4603918
           _m3 |  -1.604194   .6116344    -2.62   0.009    -2.803761   -.4046262
         _cons |   5.716673   .9119522     6.27   0.000     3.928108    7.505239
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.503895          .        .       .            .           .
        rho1 |   .3932505          .        .       .            .           .
        rho2 |  -1.513214          .        .       .            .           .
        rho3 |  -1.308122          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) 
> & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,873     8.33294    .6493306   5.521461   10.12663
        male |      1,873    .5317672    .4991231          0          1
         exp |      1,873    18.05392    6.408276          3         32
      expsqr |      1,873    366.9883    235.0513          9       1024
  highvocedu |      1,873    .1190603     .323946          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,873    .0293647    .1688715          0          1
    adultedu |      1,873    .1681794    .3741254          0          1
parent_sec~u |      1,873    .2979178    .4574653          0          1
parent_hig~u |      1,873    .0427122    .2022615          0          1
provincedum2 |      1,873    .0651361    .2468318          0          1
-------------+---------------------------------------------------------
provincedum3 |      1,873    .0448478    .2070251          0          1
provincedum4 |      1,873    .0704752    .2560145          0          1
provincedum5 |      1,873    .0758142    .2647713          0          1
provincedum6 |      1,873     .049653     .217285          0          1
provincedum7 |      1,873    .0902296    .2865869          0          1
-------------+---------------------------------------------------------
provincedum8 |      1,873    .0752803    .2639136          0          1
provincedum9 |      1,873    .0651361    .2468318          0          1
provinced~10 |      1,873    .0699413    .2551161          0          1
provinced~11 |      1,873    .1115857    .3149401          0          1
provinced~12 |      1,873    .0592632    .2361797          0          1
-------------+---------------------------------------------------------
provinced~13 |      1,873    .0667379    .2496341          0          1
provinced~14 |      1,873    .0448478    .2070251          0          1
provinced~15 |      1,873    .0298986     .170353          0          1
          m1 |      1,873    1.113934    .1874908   .7269459    2.01031
          m2 |      1,873    -.536096    .1446546  -.7259985  -.0393804
-------------+---------------------------------------------------------
          m3 |      1,873   -.3248981    .1920044  -.7257156   -.004018

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) Parent Edu & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu if i
> nrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp ex
> psqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  p
> arent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9780.5672
Iteration 1:  Log likelihood = -8176.0646
Iteration 2:  Log likelihood = -8028.4719
Iteration 3:  Log likelihood = -8009.6917
Iteration 4:  Log likelihood = -8009.0558
Iteration 5:  Log likelihood =  -8009.054

Multinomial logistic regression                   Number of obs   =       9552
                                                  LR chi2(16)     =    3543.03
                                                  Prob > chi2     =     0.0000
Log likelihood =  -8009.054                       Pseudo R2       =     0.1811

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1498773   .0562716    -2.66   0.008    -.2601677   -.0395869
         exp |   .3383485   .0257007    13.16   0.000     .2879762    .3887209
      expsqr |  -.0067048   .0006518   -10.29   0.000    -.0079824   -.0054272
ins1_secge~e |   3.217035    .432749     7.43   0.000     2.368863    4.065208
ins2_highe~e |   .1623623   .0899907     1.80   0.071    -.0140161    .3387408
ins3_vs_en~e |   .6231461   .4158739     1.50   0.134    -.1919517    1.438244
parent_sec~u |  -.1656876   .0646129    -2.56   0.010    -.2923267   -.0390486
parent_hig~u |  -.6624628   .1347136    -4.92   0.000    -.9264966   -.3984289
       _cons |  -5.460478   .3247003   -16.82   0.000    -6.096879   -4.824077
-------------+----------------------------------------------------------------
3            |
        male |      .0776   .0578559     1.34   0.180    -.0357955    .1909955
         exp |   .5432133   .0324293    16.75   0.000      .479653    .6067737
      expsqr |  -.0070256   .0007353    -9.56   0.000    -.0084667   -.0055845
ins1_secge~e |   8.555475   .4759428    17.98   0.000     7.622644    9.488306
ins2_highe~e |    .483758   .0986498     4.90   0.000     .2904079    .6771081
ins3_vs_en~e |    -.63543    .464711    -1.37   0.172    -1.546247    .2753869
parent_sec~u |  -1.010588   .0784388   -12.88   0.000    -1.164325   -.8568505
parent_hig~u |  -1.597307   .2459399    -6.49   0.000    -2.079341   -1.115274
       _cons |  -10.49268   .4282927   -24.50   0.000    -11.33212   -9.653244
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,873
-------------+----------------------------------   F(9, 1863)      =     19.64
       Model |  68.3951258         9  7.59945842   Prob > F        =    0.0000
    Residual |  720.896669     1,863  .386954734   R-squared       =    0.0867
-------------+----------------------------------   Adj R-squared   =    0.0822
       Total |  789.291795     1,872  .421630233   Root MSE        =    .62206

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .1885181   .0408736     4.61   0.000     .1083552    .2686809
           exp |   .0534269   .0280036     1.91   0.057    -.0014948    .1083486
        expsqr |  -.0017813    .000831    -2.14   0.032    -.0034111   -.0001515
     higheredu |     .31657   .0321316     9.85   0.000     .2535522    .3795878
 parent_secedu |   .0364235   .0515265     0.71   0.480    -.0646323    .1374793
parent_highedu |   .0651528   .0857069     0.76   0.447    -.1029388    .2332445
           _m1 |   .3725826   .2076039     1.79   0.073    -.0345781    .7797434
           _m2 |  -1.531444   .6697086    -2.29   0.022    -2.844902   -.2179861
           _m3 |  -1.649381   .6016874    -2.74   0.006    -2.829433   -.4693286
         _cons |   6.036061   .8706762     6.93   0.000     4.328457    7.743664
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.344936          .        .       .            .           .
        rho1 |   .3212712          .        .       .            .           .
        rho2 |  -1.320536          .        .       .            .           .
        rho3 |  -1.422231          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu  
> m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,873     8.33294    .6493306   5.521461   10.12663
        male |      1,873    .5317672    .4991231          0          1
         exp |      1,873    18.05392    6.408276          3         32
      expsqr |      1,873    366.9883    235.0513          9       1024
   higheredu |      1,873    .3166044    .4652759          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,873    .2979178    .4574653          0          1
parent_hig~u |      1,873    .0427122    .2022615          0          1
          m1 |      1,873    1.113934    .1874908   .7269459    2.01031
          m2 |      1,873    -.536096    .1446546  -.7259985  -.0393804
          m3 |      1,873   -.3248981    .1920044  -.7257156   -.004018

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Non-specified Higheredu,) pva
> lue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) Parent Edu & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1992) + Prov
> incedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu prov
> incedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 250
> 00), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative 
> ins3_vs_entrant_relative  parent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9780.5672
Iteration 1:  Log likelihood = -8176.0646
Iteration 2:  Log likelihood = -8028.4719
Iteration 3:  Log likelihood = -8009.6917
Iteration 4:  Log likelihood = -8009.0558
Iteration 5:  Log likelihood =  -8009.054

Multinomial logistic regression                   Number of obs   =       9552
                                                  LR chi2(16)     =    3543.03
                                                  Prob > chi2     =     0.0000
Log likelihood =  -8009.054                       Pseudo R2       =     0.1811

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1498773   .0562716    -2.66   0.008    -.2601677   -.0395869
         exp |   .3383485   .0257007    13.16   0.000     .2879762    .3887209
      expsqr |  -.0067048   .0006518   -10.29   0.000    -.0079824   -.0054272
ins1_secge~e |   3.217035    .432749     7.43   0.000     2.368863    4.065208
ins2_highe~e |   .1623623   .0899907     1.80   0.071    -.0140161    .3387408
ins3_vs_en~e |   .6231461   .4158739     1.50   0.134    -.1919517    1.438244
parent_sec~u |  -.1656876   .0646129    -2.56   0.010    -.2923267   -.0390486
parent_hig~u |  -.6624628   .1347136    -4.92   0.000    -.9264966   -.3984289
       _cons |  -5.460478   .3247003   -16.82   0.000    -6.096879   -4.824077
-------------+----------------------------------------------------------------
3            |
        male |      .0776   .0578559     1.34   0.180    -.0357955    .1909955
         exp |   .5432133   .0324293    16.75   0.000      .479653    .6067737
      expsqr |  -.0070256   .0007353    -9.56   0.000    -.0084667   -.0055845
ins1_secge~e |   8.555475   .4759428    17.98   0.000     7.622644    9.488306
ins2_highe~e |    .483758   .0986498     4.90   0.000     .2904079    .6771081
ins3_vs_en~e |    -.63543    .464711    -1.37   0.172    -1.546247    .2753869
parent_sec~u |  -1.010588   .0784388   -12.88   0.000    -1.164325   -.8568505
parent_hig~u |  -1.597307   .2459399    -6.49   0.000    -2.079341   -1.115274
       _cons |  -10.49268   .4282927   -24.50   0.000    -11.33212   -9.653244
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,873
-------------+----------------------------------   F(23, 1849)     =     12.93
       Model |   109.38311        23  4.75578739   Prob > F        =    0.0000
    Residual |  679.908685     1,849  .367716974   R-squared       =    0.1386
-------------+----------------------------------   Adj R-squared   =    0.1279
       Total |  789.291795     1,872  .421630233   Root MSE        =     .6064

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .1738576    .041343     4.21   0.000     .0927738    .2549414
           exp |   .0747947   .0295469     2.53   0.011      .016846    .1327434
        expsqr |  -.0021411   .0008615    -2.49   0.013    -.0038308   -.0004514
     higheredu |   .3270789   .0321296    10.18   0.000     .2640647    .3900931
 parent_secedu |   .0129876   .0514523     0.25   0.801    -.0879231    .1138982
parent_highedu |   .0076868   .0875182     0.09   0.930     -.163958    .1793316
  provincedum2 |  -.4078882   .0807594    -5.05   0.000    -.5662774   -.2494991
  provincedum3 |  -.3331402   .0843788    -3.95   0.000     -.498628   -.1676524
  provincedum4 |  -.3464649   .0785447    -4.41   0.000    -.5005105   -.1924194
  provincedum5 |   .0457405    .074414     0.61   0.539    -.1002038    .1916849
  provincedum6 |  -.1275317   .0889429    -1.43   0.152    -.3019708    .0469075
  provincedum7 |  -.1454242   .0771116    -1.89   0.059    -.2966592    .0058107
  provincedum8 |  -.2876511   .0825694    -3.48   0.001      -.44959   -.1257121
  provincedum9 |   -.041132    .077487    -0.53   0.596    -.1931032    .1108391
 provincedum10 |  -.1624644   .0764687    -2.12   0.034    -.3124386   -.0124903
 provincedum11 |   .0674727   .0727648     0.93   0.354    -.0752372    .2101825
 provincedum12 |  -.2618998   .0817912    -3.20   0.001    -.4223126   -.1014869
 provincedum13 |  -.0762577   .0803259    -0.95   0.343    -.2337968    .0812814
 provincedum14 |  -.3150111    .088731    -3.55   0.000    -.4890345   -.1409877
 provincedum15 |  -.1489738   .0979695    -1.52   0.129    -.3411164    .0431687
           _m1 |   .5089328   .2203878     2.31   0.021     .0766977    .9411678
           _m2 |   -1.91896   .7139685    -2.69   0.007    -3.319229   -.5186913
           _m3 |  -1.632468   .6138613    -2.66   0.008    -2.836402    -.428534
         _cons |   5.591379   .9148735     6.11   0.000     3.797086    7.385673
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.575106          .        .       .            .           .
        rho1 |   .4055137          .        .       .            .           .
        rho2 |  -1.529013          .        .       .            .           .
        rho3 |  -1.300738          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> rovincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,873     8.33294    .6493306   5.521461   10.12663
        male |      1,873    .5317672    .4991231          0          1
         exp |      1,873    18.05392    6.408276          3         32
      expsqr |      1,873    366.9883    235.0513          9       1024
   higheredu |      1,873    .3166044    .4652759          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,873    .2979178    .4574653          0          1
parent_hig~u |      1,873    .0427122    .2022615          0          1
provincedum2 |      1,873    .0651361    .2468318          0          1
provincedum3 |      1,873    .0448478    .2070251          0          1
provincedum4 |      1,873    .0704752    .2560145          0          1
-------------+---------------------------------------------------------
provincedum5 |      1,873    .0758142    .2647713          0          1
provincedum6 |      1,873     .049653     .217285          0          1
provincedum7 |      1,873    .0902296    .2865869          0          1
provincedum8 |      1,873    .0752803    .2639136          0          1
provincedum9 |      1,873    .0651361    .2468318          0          1
-------------+---------------------------------------------------------
provinced~10 |      1,873    .0699413    .2551161          0          1
provinced~11 |      1,873    .1115857    .3149401          0          1
provinced~12 |      1,873    .0592632    .2361797          0          1
provinced~13 |      1,873    .0667379    .2496341          0          1
provinced~14 |      1,873    .0448478    .2070251          0          1
-------------+---------------------------------------------------------
provinced~15 |      1,873    .0298986     .170353          0          1
          m1 |      1,873    1.113934    .1874908   .7269459    2.01031
          m2 |      1,873    -.536096    .1446546  -.7259985  -.0393804
          m3 |      1,873   -.3248981    .1920044  -.7257156   -.004018

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Non-specified Higheredu, Prov
> ince Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) Parent Edu & Specified higher education, Sec Gen + inrange(birthyear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative  parent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9780.5672
Iteration 1:  Log likelihood = -8176.0646
Iteration 2:  Log likelihood = -8028.4719
Iteration 3:  Log likelihood = -8009.6917
Iteration 4:  Log likelihood = -8009.0558
Iteration 5:  Log likelihood =  -8009.054

Multinomial logistic regression                   Number of obs   =       9552
                                                  LR chi2(16)     =    3543.03
                                                  Prob > chi2     =     0.0000
Log likelihood =  -8009.054                       Pseudo R2       =     0.1811

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1498773   .0562716    -2.66   0.008    -.2601677   -.0395869
         exp |   .3383485   .0257007    13.16   0.000     .2879762    .3887209
      expsqr |  -.0067048   .0006518   -10.29   0.000    -.0079824   -.0054272
ins1_secge~e |   3.217035    .432749     7.43   0.000     2.368863    4.065208
ins2_highe~e |   .1623623   .0899907     1.80   0.071    -.0140161    .3387408
ins3_vs_en~e |   .6231461   .4158739     1.50   0.134    -.1919517    1.438244
parent_sec~u |  -.1656876   .0646129    -2.56   0.010    -.2923267   -.0390486
parent_hig~u |  -.6624628   .1347136    -4.92   0.000    -.9264966   -.3984289
       _cons |  -5.460478   .3247003   -16.82   0.000    -6.096879   -4.824077
-------------+----------------------------------------------------------------
3            |
        male |      .0776   .0578559     1.34   0.180    -.0357955    .1909955
         exp |   .5432133   .0324293    16.75   0.000      .479653    .6067737
      expsqr |  -.0070256   .0007353    -9.56   0.000    -.0084667   -.0055845
ins1_secge~e |   8.555475   .4759428    17.98   0.000     7.622644    9.488306
ins2_highe~e |    .483758   .0986498     4.90   0.000     .2904079    .6771081
ins3_vs_en~e |    -.63543    .464711    -1.37   0.172    -1.546247    .2753869
parent_sec~u |  -1.010588   .0784388   -12.88   0.000    -1.164325   -.8568505
parent_hig~u |  -1.597307   .2459399    -6.49   0.000    -2.079341   -1.115274
       _cons |  -10.49268   .4282927   -24.50   0.000    -11.33212   -9.653244
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,851
-------------+----------------------------------   F(11, 4839)     =     51.81
       Model |   259.94893        11  23.6317209   Prob > F        =    0.0000
    Residual |  2207.14941     4,839  .456116844   R-squared       =    0.1054
-------------+----------------------------------   Adj R-squared   =    0.1033
       Total |  2467.09834     4,850  .508680069   Root MSE        =    .67536

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2175596   .0226452     9.61   0.000     .1731646    .2619545
           exp |   .0284271   .0144144     1.97   0.049     .0001684    .0566859
        expsqr |   -.001005   .0004405    -2.28   0.023    -.0018685   -.0001414
    highvocedu |   .1880228   .0304898     6.17   0.000      .128249    .2477966
    highgenedu |   .5331388   .0293908    18.14   0.000     .4755195    .5907581
      adultedu |   .2855952   .0357172     8.00   0.000     .2155733    .3556171
 parent_secedu |   .0195493   .0274783     0.71   0.477    -.0343207    .0734192
parent_highedu |   .0816556   .0419695     1.95   0.052    -.0006238     .163935
           _m1 |  -.1881421   .2935453    -0.64   0.522    -.7636243      .38734
           _m2 |   .0222864   .1277088     0.17   0.861    -.2280808    .2726537
           _m3 |  -.3500534   .2658409    -1.32   0.188    -.8712224    .1711156
         _cons |   7.768296   .0616722   125.96   0.000     7.647391    7.889202
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4842011          .        .       .            .           .
        rho1 |  -.2703791          .        .       .            .           .
        rho2 |   .0320279          .        .       .            .           .
        rho3 |  -.5030619          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 2
> 50, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |      4,851    .5635951    .4959903          0          1
         exp |      4,851    15.23913    6.990282          0         33
      expsqr |      4,851    281.0849    234.1988          0       1089
  highvocedu |      4,851    .2459287    .4306809          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,851    .4083694    .4915828          0          1
    adultedu |      4,851    .1146155    .3185902          0          1
parent_sec~u |      4,851    .3984745    .4896346          0          1
parent_hig~u |      4,851    .1043084    .3056917          0          1
          m1 |      4,851   -.2745917     .077046  -.4654832  -.0253575
-------------+---------------------------------------------------------
          m2 |      4,851    .4379265    .3470647   -.006029   2.331815
          m3 |      4,851   -.2356731    .2016179  -.7259493  -.0003567

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Specified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) Parent Edu & Specified higher education, Sec Gen + inrange(birthyear, 1971, 1992) + Pro
> vincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(mon
> thlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu ) dmf(2) showml
> ogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9780.5672
Iteration 1:  Log likelihood = -8176.0646
Iteration 2:  Log likelihood = -8028.4719
Iteration 3:  Log likelihood = -8009.6917
Iteration 4:  Log likelihood = -8009.0558
Iteration 5:  Log likelihood =  -8009.054

Multinomial logistic regression                   Number of obs   =       9552
                                                  LR chi2(16)     =    3543.03
                                                  Prob > chi2     =     0.0000
Log likelihood =  -8009.054                       Pseudo R2       =     0.1811

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1498773   .0562716    -2.66   0.008    -.2601677   -.0395869
         exp |   .3383485   .0257007    13.16   0.000     .2879762    .3887209
      expsqr |  -.0067048   .0006518   -10.29   0.000    -.0079824   -.0054272
ins1_secge~e |   3.217035    .432749     7.43   0.000     2.368863    4.065208
ins2_highe~e |   .1623623   .0899907     1.80   0.071    -.0140161    .3387408
ins3_vs_en~e |   .6231461   .4158739     1.50   0.134    -.1919517    1.438244
parent_sec~u |  -.1656876   .0646129    -2.56   0.010    -.2923267   -.0390486
parent_hig~u |  -.6624628   .1347136    -4.92   0.000    -.9264966   -.3984289
       _cons |  -5.460478   .3247003   -16.82   0.000    -6.096879   -4.824077
-------------+----------------------------------------------------------------
3            |
        male |      .0776   .0578559     1.34   0.180    -.0357955    .1909955
         exp |   .5432133   .0324293    16.75   0.000      .479653    .6067737
      expsqr |  -.0070256   .0007353    -9.56   0.000    -.0084667   -.0055845
ins1_secge~e |   8.555475   .4759428    17.98   0.000     7.622644    9.488306
ins2_highe~e |    .483758   .0986498     4.90   0.000     .2904079    .6771081
ins3_vs_en~e |    -.63543    .464711    -1.37   0.172    -1.546247    .2753869
parent_sec~u |  -1.010588   .0784388   -12.88   0.000    -1.164325   -.8568505
parent_hig~u |  -1.597307   .2459399    -6.49   0.000    -2.079341   -1.115274
       _cons |  -10.49268   .4282927   -24.50   0.000    -11.33212   -9.653244
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,851
-------------+----------------------------------   F(25, 4825)     =     39.41
       Model |  418.383601        25   16.735344   Prob > F        =    0.0000
    Residual |  2048.71474     4,825   .42460409   R-squared       =    0.1696
-------------+----------------------------------   Adj R-squared   =    0.1653
       Total |  2467.09834     4,850  .508680069   Root MSE        =    .65162

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .1898763   .0220929     8.59   0.000     .1465641    .2331885
           exp |   .0675137   .0146098     4.62   0.000     .0388719    .0961555
        expsqr |  -.0017228   .0004369    -3.94   0.000    -.0025794   -.0008663
    highvocedu |   .1829368   .0296431     6.17   0.000     .1248228    .2410509
    highgenedu |   .4974685   .0291031    17.09   0.000     .4404131    .5545239
      adultedu |   .2669051   .0348486     7.66   0.000      .198586    .3352243
 parent_secedu |   .0113976   .0269276     0.42   0.672    -.0413928     .064188
parent_highedu |  -.0332889   .0428651    -0.78   0.437    -.1173241    .0507462
  provincedum2 |  -.6203675   .0503089   -12.33   0.000    -.7189959   -.5217391
  provincedum3 |  -.3020789   .0473675    -6.38   0.000    -.3949408    -.209217
  provincedum4 |  -.4518317   .0502031    -9.00   0.000    -.5502526   -.3534108
  provincedum5 |  -.0606233   .0454959    -1.33   0.183     -.149816    .0285693
  provincedum6 |  -.3916036   .0535068    -7.32   0.000    -.4965012   -.2867059
  provincedum7 |  -.3539337   .0504162    -7.02   0.000    -.4527724   -.2550949
  provincedum8 |  -.5923019    .049709   -11.92   0.000    -.6897541   -.4948496
  provincedum9 |  -.1607791   .0469882    -3.42   0.001    -.2528974   -.0686609
 provincedum10 |  -.2157312   .0490512    -4.40   0.000    -.3118938   -.1195685
 provincedum11 |  -.0881037   .0423509    -2.08   0.038    -.1711307   -.0050768
 provincedum12 |  -.2723654    .052946    -5.14   0.000    -.3761637   -.1685671
 provincedum13 |  -.2264517   .0488242    -4.64   0.000    -.3221694   -.1307341
 provincedum14 |  -.2924377   .0662432    -4.41   0.000    -.4223045   -.1625708
 provincedum15 |  -.4401291   .0578331    -7.61   0.000    -.5535084   -.3267498
           _m1 |   .7650227   .3044262     2.51   0.012     .1682086    1.361837
           _m2 |  -.2375989   .1288445    -1.84   0.065    -.4901929     .014995
           _m3 |  -.3235626   .2588017    -1.25   0.211    -.8309319    .1838066
         _cons |   8.069559   .0711147   113.47   0.000     7.930142    8.208977
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .6035426          .        .       .            .           .
        rho1 |   .9847372          .        .       .            .           .
        rho2 |  -.3058374          .        .       .            .           .
        rho3 |  -.4164898          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) 
> & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,851    8.498547    .7132181   5.521461   10.12663
        male |      4,851    .5635951    .4959903          0          1
         exp |      4,851    15.23913    6.990282          0         33
      expsqr |      4,851    281.0849    234.1988          0       1089
  highvocedu |      4,851    .2459287    .4306809          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,851    .4083694    .4915828          0          1
    adultedu |      4,851    .1146155    .3185902          0          1
parent_sec~u |      4,851    .3984745    .4896346          0          1
parent_hig~u |      4,851    .1043084    .3056917          0          1
provincedum2 |      4,851    .0595753    .2367228          0          1
-------------+---------------------------------------------------------
provincedum3 |      4,851    .0647289    .2460723          0          1
provincedum4 |      4,851    .0589569    .2355683          0          1
provincedum5 |      4,851    .0797774    .2709762          0          1
provincedum6 |      4,851    .0529788    .2240142          0          1
provincedum7 |      4,851    .0632859    .2435016          0          1
-------------+---------------------------------------------------------
provincedum8 |      4,851    .0754484    .2641407          0          1
provincedum9 |      4,851    .0696764     .254627          0          1
provinced~10 |      4,851    .0616368    .2405195          0          1
provinced~11 |      4,851    .1304886    .3368749          0          1
provinced~12 |      4,851    .0505051    .2190073          0          1
-------------+---------------------------------------------------------
provinced~13 |      4,851    .0665842    .2493262          0          1
provinced~14 |      4,851     .027417    .1633121          0          1
provinced~15 |      4,851     .036075    .1864961          0          1
          m1 |      4,851   -.2745917     .077046  -.4654832  -.0253575
          m2 |      4,851    .4379265    .3470647   -.006029   2.331815
-------------+---------------------------------------------------------
          m3 |      4,851   -.2356731    .2016179  -.7259493  -.0003567

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) Parent Edu & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu if i
> nrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp ex
> psqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  p
> arent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9780.5672
Iteration 1:  Log likelihood = -8176.0646
Iteration 2:  Log likelihood = -8028.4719
Iteration 3:  Log likelihood = -8009.6917
Iteration 4:  Log likelihood = -8009.0558
Iteration 5:  Log likelihood =  -8009.054

Multinomial logistic regression                   Number of obs   =       9552
                                                  LR chi2(16)     =    3543.03
                                                  Prob > chi2     =     0.0000
Log likelihood =  -8009.054                       Pseudo R2       =     0.1811

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1498773   .0562716    -2.66   0.008    -.2601677   -.0395869
         exp |   .3383485   .0257007    13.16   0.000     .2879762    .3887209
      expsqr |  -.0067048   .0006518   -10.29   0.000    -.0079824   -.0054272
ins1_secge~e |   3.217035    .432749     7.43   0.000     2.368863    4.065208
ins2_highe~e |   .1623623   .0899907     1.80   0.071    -.0140161    .3387408
ins3_vs_en~e |   .6231461   .4158739     1.50   0.134    -.1919517    1.438244
parent_sec~u |  -.1656876   .0646129    -2.56   0.010    -.2923267   -.0390486
parent_hig~u |  -.6624628   .1347136    -4.92   0.000    -.9264966   -.3984289
       _cons |  -5.460478   .3247003   -16.82   0.000    -6.096879   -4.824077
-------------+----------------------------------------------------------------
3            |
        male |      .0776   .0578559     1.34   0.180    -.0357955    .1909955
         exp |   .5432133   .0324293    16.75   0.000      .479653    .6067737
      expsqr |  -.0070256   .0007353    -9.56   0.000    -.0084667   -.0055845
ins1_secge~e |   8.555475   .4759428    17.98   0.000     7.622644    9.488306
ins2_highe~e |    .483758   .0986498     4.90   0.000     .2904079    .6771081
ins3_vs_en~e |    -.63543    .464711    -1.37   0.172    -1.546247    .2753869
parent_sec~u |  -1.010588   .0784388   -12.88   0.000    -1.164325   -.8568505
parent_hig~u |  -1.597307   .2459399    -6.49   0.000    -2.079341   -1.115274
       _cons |  -10.49268   .4282927   -24.50   0.000    -11.33212   -9.653244
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,851
-------------+----------------------------------   F(9, 4841)      =     39.62
       Model |  169.246438         9  18.8051597   Prob > F        =    0.0000
    Residual |   2297.8519     4,841  .474664718   R-squared       =    0.0686
-------------+----------------------------------   Adj R-squared   =    0.0669
       Total |  2467.09834     4,850  .508680069   Root MSE        =    .68896

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |    .207031    .023076     8.97   0.000     .1617915    .2522705
           exp |   .0370246   .0146904     2.52   0.012     .0082248    .0658243
        expsqr |  -.0012474   .0004489    -2.78   0.005    -.0021275   -.0003673
     higheredu |   .3536703   .0265744    13.31   0.000     .3015723    .4057683
 parent_secedu |   .0244937   .0280181     0.87   0.382    -.0304345     .079422
parent_highedu |   .0992445   .0427783     2.32   0.020     .0153795    .1831095
           _m1 |   .1448622   .2982498     0.49   0.627    -.4398428    .7295672
           _m2 |  -.0020873   .1302603    -0.02   0.987    -.2574566     .253282
           _m3 |  -.2918361   .2709935    -1.08   0.282    -.8231064    .2394342
         _cons |   7.848126   .0622976   125.98   0.000     7.725994    7.970257
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4929792          .        .       .            .           .
        rho1 |   .2063197          .        .       .            .           .
        rho2 |  -.0029728          .        .       .            .           .
        rho3 |  -.4156471          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu  
> m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,851    8.498547    .7132181   5.521461   10.12663
        male |      4,851    .5635951    .4959903          0          1
         exp |      4,851    15.23913    6.990282          0         33
      expsqr |      4,851    281.0849    234.1988          0       1089
   higheredu |      4,851    .7689136     .421571          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,851    .3984745    .4896346          0          1
parent_hig~u |      4,851    .1043084    .3056917          0          1
          m1 |      4,851   -.2745917     .077046  -.4654832  -.0253575
          m2 |      4,851    .4379265    .3470647   -.006029   2.331815
          m3 |      4,851   -.2356731    .2016179  -.7259493  -.0003567

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Non-specified Higheredu,) pva
> lue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) Parent Edu & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1992) + Prov
> incedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu prov
> incedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 250
> 00), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative 
> ins3_vs_entrant_relative  parent_secedu parent_highedu ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9780.5672
Iteration 1:  Log likelihood = -8176.0646
Iteration 2:  Log likelihood = -8028.4719
Iteration 3:  Log likelihood = -8009.6917
Iteration 4:  Log likelihood = -8009.0558
Iteration 5:  Log likelihood =  -8009.054

Multinomial logistic regression                   Number of obs   =       9552
                                                  LR chi2(16)     =    3543.03
                                                  Prob > chi2     =     0.0000
Log likelihood =  -8009.054                       Pseudo R2       =     0.1811

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1498773   .0562716    -2.66   0.008    -.2601677   -.0395869
         exp |   .3383485   .0257007    13.16   0.000     .2879762    .3887209
      expsqr |  -.0067048   .0006518   -10.29   0.000    -.0079824   -.0054272
ins1_secge~e |   3.217035    .432749     7.43   0.000     2.368863    4.065208
ins2_highe~e |   .1623623   .0899907     1.80   0.071    -.0140161    .3387408
ins3_vs_en~e |   .6231461   .4158739     1.50   0.134    -.1919517    1.438244
parent_sec~u |  -.1656876   .0646129    -2.56   0.010    -.2923267   -.0390486
parent_hig~u |  -.6624628   .1347136    -4.92   0.000    -.9264966   -.3984289
       _cons |  -5.460478   .3247003   -16.82   0.000    -6.096879   -4.824077
-------------+----------------------------------------------------------------
3            |
        male |      .0776   .0578559     1.34   0.180    -.0357955    .1909955
         exp |   .5432133   .0324293    16.75   0.000      .479653    .6067737
      expsqr |  -.0070256   .0007353    -9.56   0.000    -.0084667   -.0055845
ins1_secge~e |   8.555475   .4759428    17.98   0.000     7.622644    9.488306
ins2_highe~e |    .483758   .0986498     4.90   0.000     .2904079    .6771081
ins3_vs_en~e |    -.63543    .464711    -1.37   0.172    -1.546247    .2753869
parent_sec~u |  -1.010588   .0784388   -12.88   0.000    -1.164325   -.8568505
parent_hig~u |  -1.597307   .2459399    -6.49   0.000    -2.079341   -1.115274
       _cons |  -10.49268   .4282927   -24.50   0.000    -11.33212   -9.653244
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,851
-------------+----------------------------------   F(23, 4827)     =     34.05
       Model |  344.403719        23  14.9740747   Prob > F        =    0.0000
    Residual |  2122.69462     4,827  .439754427   R-squared       =    0.1396
-------------+----------------------------------   Adj R-squared   =    0.1355
       Total |  2467.09834     4,850  .508680069   Root MSE        =    .66314

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .1770735   .0224508     7.89   0.000     .1330597    .2210872
           exp |   .0811827     .01483     5.47   0.000     .0521091    .1102563
        expsqr |   -.002058   .0004438    -4.64   0.000    -.0029281    -.001188
     higheredu |   .3246539   .0260754    12.45   0.000     .2735342    .3757736
 parent_secedu |   .0114587   .0273939     0.42   0.676    -.0422458    .0651633
parent_highedu |  -.0399489   .0436094    -0.92   0.360    -.1254432    .0455453
  provincedum2 |  -.6885903   .0509108   -13.53   0.000    -.7883987    -.588782
  provincedum3 |   -.335597   .0481319    -6.97   0.000    -.4299575   -.2412365
  provincedum4 |  -.4780279    .051047    -9.36   0.000    -.5781032   -.3779526
  provincedum5 |   -.087441   .0462203    -1.89   0.059    -.1780539    .0031719
  provincedum6 |  -.4479329   .0542599    -8.26   0.000    -.5543071   -.3415587
  provincedum7 |  -.4073907   .0511092    -7.97   0.000     -.507588   -.3071934
  provincedum8 |  -.6612645   .0502963   -13.15   0.000    -.7598681   -.5626609
  provincedum9 |  -.2050162   .0476573    -4.30   0.000    -.2984462   -.1115862
 provincedum10 |  -.2798565   .0496653    -5.63   0.000    -.3772231   -.1824899
 provincedum11 |  -.1441677   .0428704    -3.36   0.001    -.2282132   -.0601221
 provincedum12 |  -.3238934   .0537341    -6.03   0.000    -.4292368     -.21855
 provincedum13 |  -.2849125   .0494793    -5.76   0.000    -.3819145   -.1879104
 provincedum14 |  -.3321604     .06733    -4.93   0.000    -.4641579   -.2001629
 provincedum15 |  -.4494605    .058837    -7.64   0.000    -.5648077   -.3341132
           _m1 |   1.221709   .3076138     3.97   0.000     .6186459    1.824772
           _m2 |  -.3076055   .1309954    -2.35   0.019    -.5644161   -.0507949
           _m3 |  -.2796989   .2631931    -1.06   0.288    -.7956774    .2362795
         _cons |    8.20262   .0714531   114.80   0.000     8.062539    8.342701
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .8534118          .        .       .            .           .
        rho1 |   1.322478          .        .       .            .           .
        rho2 |  -.3329774          .        .       .            .           .
        rho3 |  -.3027691          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> rovincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,851    8.498547    .7132181   5.521461   10.12663
        male |      4,851    .5635951    .4959903          0          1
         exp |      4,851    15.23913    6.990282          0         33
      expsqr |      4,851    281.0849    234.1988          0       1089
   higheredu |      4,851    .7689136     .421571          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,851    .3984745    .4896346          0          1
parent_hig~u |      4,851    .1043084    .3056917          0          1
provincedum2 |      4,851    .0595753    .2367228          0          1
provincedum3 |      4,851    .0647289    .2460723          0          1
provincedum4 |      4,851    .0589569    .2355683          0          1
-------------+---------------------------------------------------------
provincedum5 |      4,851    .0797774    .2709762          0          1
provincedum6 |      4,851    .0529788    .2240142          0          1
provincedum7 |      4,851    .0632859    .2435016          0          1
provincedum8 |      4,851    .0754484    .2641407          0          1
provincedum9 |      4,851    .0696764     .254627          0          1
-------------+---------------------------------------------------------
provinced~10 |      4,851    .0616368    .2405195          0          1
provinced~11 |      4,851    .1304886    .3368749          0          1
provinced~12 |      4,851    .0505051    .2190073          0          1
provinced~13 |      4,851    .0665842    .2493262          0          1
provinced~14 |      4,851     .027417    .1633121          0          1
-------------+---------------------------------------------------------
provinced~15 |      4,851     .036075    .1864961          0          1
          m1 |      4,851   -.2745917     .077046  -.4654832  -.0253575
          m2 |      4,851    .4379265    .3470647   -.006029   2.331815
          m3 |      4,851   -.2356731    .2016179  -.7259493  -.0003567

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Non-specified Higheredu, Prov
> ince Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) Parent Party Membership & Specified higher education, Sec Voc + inrange(birthyear, 1971
> , 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=
> male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_
> relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9795.5782
Iteration 1:  Log likelihood = -8194.9912
Iteration 2:  Log likelihood = -8055.9036
Iteration 3:  Log likelihood = -8041.6135
Iteration 4:  Log likelihood = -8041.3167
Iteration 5:  Log likelihood = -8041.3165

Multinomial logistic regression                   Number of obs   =       9562
                                                  LR chi2(14)     =    3508.52
                                                  Prob > chi2     =     0.0000
Log likelihood = -8041.3165                       Pseudo R2       =     0.1791

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1434978   .0561342    -2.56   0.011    -.2535187   -.0334768
         exp |   .3460674   .0256011    13.52   0.000     .2958902    .3962446
      expsqr |  -.0067892   .0006507   -10.43   0.000    -.0080646   -.0055139
ins1_secge~e |   3.208712    .430188     7.46   0.000     2.365559    4.051865
ins2_highe~e |   .1517008   .0891524     1.70   0.089    -.0230347    .3264364
ins3_vs_en~e |   .5673045   .4138097     1.37   0.170    -.2437476    1.378357
parent_par~r |  -.3259135   .0679651    -4.80   0.000    -.4591227   -.1927043
       _cons |   -5.56751   .3209546   -17.35   0.000    -6.196569    -4.93845
-------------+----------------------------------------------------------------
3            |
        male |   .0805033   .0577607     1.39   0.163    -.0327057    .1937123
         exp |    .577084   .0326426    17.68   0.000     .5131056    .6410623
      expsqr |  -.0074088   .0007398   -10.01   0.000    -.0088588   -.0059589
ins1_secge~e |   8.647813   .4742478    18.23   0.000     7.718305    9.577322
ins2_highe~e |   .4963708     .09729     5.10   0.000     .3056859    .6870557
ins3_vs_en~e |  -.6648155   .4627461    -1.44   0.151    -1.571781    .2421501
parent_par~r |   -1.40612   .0818601   -17.18   0.000    -1.566562   -1.245677
       _cons |  -11.06511    .430152   -25.72   0.000    -11.90819   -10.22203
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,876
-------------+----------------------------------   F(10, 1865)     =     18.28
       Model |  70.0578078        10  7.00578078   Prob > F        =    0.0000
    Residual |  714.837582     1,865  .383290929   R-squared       =    0.0893
-------------+----------------------------------   Adj R-squared   =    0.0844
       Total |   784.89539     1,875  .418610875   Root MSE        =     .6191

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1874301     .04151     4.52   0.000     .1060191     .268841
               exp |    .040826   .0286682     1.42   0.155    -.0153993    .0970512
            expsqr |   -.001407    .000854    -1.65   0.100    -.0030819    .0002679
        highvocedu |   .2041501   .0465411     4.39   0.000      .112872    .2954282
        highgenedu |   .5584129   .0859027     6.50   0.000     .3899372    .7268885
          adultedu |    .347288   .0398873     8.71   0.000     .2690595    .4255164
parent_partymember |   .0559772   .0540272     1.04   0.300    -.0499829    .1619374
               _m1 |   .3295212   .2169961     1.52   0.129    -.0960596    .7551019
               _m2 |  -1.512508   .7084992    -2.13   0.033    -2.902043   -.1229731
               _m3 |  -1.566496   .6214235    -2.52   0.012    -2.785255   -.3477373
             _cons |   6.213158   .9145773     6.79   0.000     4.419456    8.006861
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.260195          .        .       .            .           .
        rho1 |    .293538          .        .       .            .           .
        rho2 |  -1.347345          .        .       .            .           .
        rho3 |  -1.395437          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,876    8.333664    .6470014   5.521461   10.12663
        male |      1,876    .5319829    .4991091          0          1
         exp |      1,876     18.0661    6.409901          3         32
      expsqr |      1,876    367.4488    235.3005          9       1024
  highvocedu |      1,876    .1178038    .3224617          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,876    .0293177    .1687405          0          1
    adultedu |      1,876    .1684435    .3743594          0          1
parent_par~r |      1,876     .206823    .4051355          0          1
          m1 |      1,876    1.117796    .1869726    .754169   2.059168
          m2 |      1,876    -.537058    .1452294  -.7259957  -.0351315
-------------+---------------------------------------------------------
          m3 |      1,876   -.3249838     .191616  -.7259199  -.0058722

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Specified Higher
> edu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) Parent Party Membership & Specified higher education, Sec Voc + inrange(birthyear, 1971
> , 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearnin
> g, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9795.5782
Iteration 1:  Log likelihood = -8194.9912
Iteration 2:  Log likelihood = -8055.9036
Iteration 3:  Log likelihood = -8041.6135
Iteration 4:  Log likelihood = -8041.3167
Iteration 5:  Log likelihood = -8041.3165

Multinomial logistic regression                   Number of obs   =       9562
                                                  LR chi2(14)     =    3508.52
                                                  Prob > chi2     =     0.0000
Log likelihood = -8041.3165                       Pseudo R2       =     0.1791

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1434978   .0561342    -2.56   0.011    -.2535187   -.0334768
         exp |   .3460674   .0256011    13.52   0.000     .2958902    .3962446
      expsqr |  -.0067892   .0006507   -10.43   0.000    -.0080646   -.0055139
ins1_secge~e |   3.208712    .430188     7.46   0.000     2.365559    4.051865
ins2_highe~e |   .1517008   .0891524     1.70   0.089    -.0230347    .3264364
ins3_vs_en~e |   .5673045   .4138097     1.37   0.170    -.2437476    1.378357
parent_par~r |  -.3259135   .0679651    -4.80   0.000    -.4591227   -.1927043
       _cons |   -5.56751   .3209546   -17.35   0.000    -6.196569    -4.93845
-------------+----------------------------------------------------------------
3            |
        male |   .0805033   .0577607     1.39   0.163    -.0327057    .1937123
         exp |    .577084   .0326426    17.68   0.000     .5131056    .6410623
      expsqr |  -.0074088   .0007398   -10.01   0.000    -.0088588   -.0059589
ins1_secge~e |   8.647813   .4742478    18.23   0.000     7.718305    9.577322
ins2_highe~e |   .4963708     .09729     5.10   0.000     .3056859    .6870557
ins3_vs_en~e |  -.6648155   .4627461    -1.44   0.151    -1.571781    .2421501
parent_par~r |   -1.40612   .0818601   -17.18   0.000    -1.566562   -1.245677
       _cons |  -11.06511    .430152   -25.72   0.000    -11.90819   -10.22203
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,876
-------------+----------------------------------   F(24, 1851)     =     12.62
       Model |   110.40486        24  4.60020251   Prob > F        =    0.0000
    Residual |   674.49053     1,851  .364392507   R-squared       =    0.1407
-------------+----------------------------------   Adj R-squared   =    0.1295
       Total |   784.89539     1,875  .418610875   Root MSE        =    .60365

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1825506   .0419492     4.35   0.000     .1002779    .2648233
               exp |   .0573347   .0302108     1.90   0.058    -.0019162    .1165855
            expsqr |  -.0015796    .000882    -1.79   0.073    -.0033095    .0001502
        highvocedu |   .2141637   .0458963     4.67   0.000     .1241497    .3041777
        highgenedu |    .570051   .0846274     6.74   0.000     .4040757    .7360263
          adultedu |    .356458   .0397916     8.96   0.000     .2784168    .4344992
parent_partymember |   .0108564   .0550653     0.20   0.844    -.0971403    .1188531
      provincedum2 |  -.3956472   .0809993    -4.88   0.000    -.5545068   -.2367876
      provincedum3 |  -.3263793   .0841326    -3.88   0.000     -.491384   -.1613746
      provincedum4 |  -.3348669   .0785386    -4.26   0.000    -.4889005   -.1808333
      provincedum5 |   .0627798   .0743886     0.84   0.399    -.0831146    .2086742
      provincedum6 |  -.1409291   .0887977    -1.59   0.113    -.3150832     .033225
      provincedum7 |  -.1346813   .0771225    -1.75   0.081    -.2859374    .0165749
      provincedum8 |  -.2735441   .0824312    -3.32   0.001    -.4352119   -.1118763
      provincedum9 |  -.0299927   .0770739    -0.39   0.697    -.1811536    .1211683
     provincedum10 |  -.1398139   .0761359    -1.84   0.066    -.2891352    .0095074
     provincedum11 |   .0809154   .0726455     1.11   0.265    -.0615604    .2233912
     provincedum12 |  -.2387588   .0814869    -2.93   0.003    -.3985746   -.0789429
     provincedum13 |  -.0465762   .0798644    -0.58   0.560    -.2032101    .1100576
     provincedum14 |  -.2767245   .0889607    -3.11   0.002    -.4511983   -.1022506
     provincedum15 |  -.1358887   .0967642    -1.40   0.160    -.3256671    .0538897
               _m1 |   .4124093   .2292573     1.80   0.072    -.0372207    .8620393
               _m2 |  -1.756122   .7508345    -2.34   0.019    -3.228693   -.2835502
               _m3 |  -1.405611   .6309957    -2.23   0.026    -2.643149   -.1680728
             _cons |   5.950974   .9583487     6.21   0.000     4.071416    7.830532
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.295036          .        .       .            .           .
        rho1 |   .3623995          .        .       .            .           .
        rho2 |   -1.54317          .        .       .            .           .
        rho3 |  -1.235163          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(
> monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,876    8.333664    .6470014   5.521461   10.12663
        male |      1,876    .5319829    .4991091          0          1
         exp |      1,876     18.0661    6.409901          3         32
      expsqr |      1,876    367.4488    235.3005          9       1024
  highvocedu |      1,876    .1178038    .3224617          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,876    .0293177    .1687405          0          1
    adultedu |      1,876    .1684435    .3743594          0          1
parent_par~r |      1,876     .206823    .4051355          0          1
provincedum2 |      1,876     .065032     .246648          0          1
provincedum3 |      1,876    .0447761    .2068672          0          1
-------------+---------------------------------------------------------
provincedum4 |      1,876    .0703625    .2558251          0          1
provincedum5 |      1,876    .0751599    .2637195          0          1
provincedum6 |      1,876    .0495736    .2171201          0          1
provincedum7 |      1,876    .0895522    .2856153          0          1
provincedum8 |      1,876    .0751599    .2637195          0          1
-------------+---------------------------------------------------------
provincedum9 |      1,876     .065032     .246648          0          1
provinced~10 |      1,876    .0698294    .2549273          0          1
provinced~11 |      1,876    .1130064     .316685          0          1
provinced~12 |      1,876    .0591684    .2360026          0          1
provinced~13 |      1,876    .0682303    .2522079          0          1
-------------+---------------------------------------------------------
provinced~14 |      1,876    .0442431    .2056895          0          1
provinced~15 |      1,876    .0298507    .1702208          0          1
          m1 |      1,876    1.117796    .1869726    .754169   2.059168
          m2 |      1,876    -.537058    .1452294  -.7259957  -.0351315
          m3 |      1,876   -.3249838     .191616  -.7259199  -.0058722

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Specified Higher
> edu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) Parent Party Membership & Combined higher education, Sec Voc + inrange(birthyear, 1971,
>  1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_partymember if inrange(bir
> thyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_
> secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_part
> ymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9795.5782
Iteration 1:  Log likelihood = -8194.9912
Iteration 2:  Log likelihood = -8055.9036
Iteration 3:  Log likelihood = -8041.6135
Iteration 4:  Log likelihood = -8041.3167
Iteration 5:  Log likelihood = -8041.3165

Multinomial logistic regression                   Number of obs   =       9562
                                                  LR chi2(14)     =    3508.52
                                                  Prob > chi2     =     0.0000
Log likelihood = -8041.3165                       Pseudo R2       =     0.1791

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1434978   .0561342    -2.56   0.011    -.2535187   -.0334768
         exp |   .3460674   .0256011    13.52   0.000     .2958902    .3962446
      expsqr |  -.0067892   .0006507   -10.43   0.000    -.0080646   -.0055139
ins1_secge~e |   3.208712    .430188     7.46   0.000     2.365559    4.051865
ins2_highe~e |   .1517008   .0891524     1.70   0.089    -.0230347    .3264364
ins3_vs_en~e |   .5673045   .4138097     1.37   0.170    -.2437476    1.378357
parent_par~r |  -.3259135   .0679651    -4.80   0.000    -.4591227   -.1927043
       _cons |   -5.56751   .3209546   -17.35   0.000    -6.196569    -4.93845
-------------+----------------------------------------------------------------
3            |
        male |   .0805033   .0577607     1.39   0.163    -.0327057    .1937123
         exp |    .577084   .0326426    17.68   0.000     .5131056    .6410623
      expsqr |  -.0074088   .0007398   -10.01   0.000    -.0088588   -.0059589
ins1_secge~e |   8.647813   .4742478    18.23   0.000     7.718305    9.577322
ins2_highe~e |   .4963708     .09729     5.10   0.000     .3056859    .6870557
ins3_vs_en~e |  -.6648155   .4627461    -1.44   0.151    -1.571781    .2421501
parent_par~r |   -1.40612   .0818601   -17.18   0.000    -1.566562   -1.245677
       _cons |  -11.06511    .430152   -25.72   0.000    -11.90819   -10.22203
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,876
-------------+----------------------------------   F(8, 1867)      =     20.67
       Model |  63.8716722         8  7.98395902   Prob > F        =    0.0000
    Residual |  721.023718     1,867  .386193743   R-squared       =    0.0814
-------------+----------------------------------   Adj R-squared   =    0.0774
       Total |   784.89539     1,875  .418610875   Root MSE        =    .62144

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1875223   .0416645     4.50   0.000     .1058085    .2692362
               exp |   .0435143   .0287002     1.52   0.130    -.0127735    .0998022
            expsqr |  -.0014409   .0008558    -1.68   0.092    -.0031194    .0002376
         higheredu |    .313599   .0319466     9.82   0.000     .2509443    .3762538
parent_partymember |   .0581183   .0542142     1.07   0.284    -.0482085     .164445
               _m1 |   .3155312   .2177879     1.45   0.148    -.1116022    .7426646
               _m2 |   -1.44593   .7109803    -2.03   0.042     -2.84033   -.0515305
               _m3 |  -1.494751   .6235127    -2.40   0.017    -2.717606   -.2718957
             _cons |   6.251235   .9177603     6.81   0.000     4.451291    8.051179
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.186337          .        .       .            .           .
        rho1 |   .2896931          .        .       .            .           .
        rho2 |  -1.327527          .        .       .            .           .
        rho3 |   -1.37235          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_partymember  m1 m2 m3 i
> f inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_partymember m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,876    8.333664    .6470014   5.521461   10.12663
        male |      1,876    .5319829    .4991091          0          1
         exp |      1,876     18.0661    6.409901          3         32
      expsqr |      1,876    367.4488    235.3005          9       1024
   higheredu |      1,876     .315565    .4648644          0          1
-------------+---------------------------------------------------------
parent_par~r |      1,876     .206823    .4051355          0          1
          m1 |      1,876    1.117796    .1869726    .754169   2.059168
          m2 |      1,876    -.537058    .1452294  -.7259957  -.0351315
          m3 |      1,876   -.3249838     .191616  -.7259199  -.0058722

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Non-specified Hi
> gheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) Parent Party Membership & Combined higher education, Sec Voc + inrange(birthyear, 1971,
>  1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_partymember provincedum2-p
> rovincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9795.5782
Iteration 1:  Log likelihood = -8194.9912
Iteration 2:  Log likelihood = -8055.9036
Iteration 3:  Log likelihood = -8041.6135
Iteration 4:  Log likelihood = -8041.3167
Iteration 5:  Log likelihood = -8041.3165

Multinomial logistic regression                   Number of obs   =       9562
                                                  LR chi2(14)     =    3508.52
                                                  Prob > chi2     =     0.0000
Log likelihood = -8041.3165                       Pseudo R2       =     0.1791

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1434978   .0561342    -2.56   0.011    -.2535187   -.0334768
         exp |   .3460674   .0256011    13.52   0.000     .2958902    .3962446
      expsqr |  -.0067892   .0006507   -10.43   0.000    -.0080646   -.0055139
ins1_secge~e |   3.208712    .430188     7.46   0.000     2.365559    4.051865
ins2_highe~e |   .1517008   .0891524     1.70   0.089    -.0230347    .3264364
ins3_vs_en~e |   .5673045   .4138097     1.37   0.170    -.2437476    1.378357
parent_par~r |  -.3259135   .0679651    -4.80   0.000    -.4591227   -.1927043
       _cons |   -5.56751   .3209546   -17.35   0.000    -6.196569    -4.93845
-------------+----------------------------------------------------------------
3            |
        male |   .0805033   .0577607     1.39   0.163    -.0327057    .1937123
         exp |    .577084   .0326426    17.68   0.000     .5131056    .6410623
      expsqr |  -.0074088   .0007398   -10.01   0.000    -.0088588   -.0059589
ins1_secge~e |   8.647813   .4742478    18.23   0.000     7.718305    9.577322
ins2_highe~e |   .4963708     .09729     5.10   0.000     .3056859    .6870557
ins3_vs_en~e |  -.6648155   .4627461    -1.44   0.151    -1.571781    .2421501
parent_par~r |   -1.40612   .0818601   -17.18   0.000    -1.566562   -1.245677
       _cons |  -11.06511    .430152   -25.72   0.000    -11.90819   -10.22203
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,876
-------------+----------------------------------   F(22, 1853)     =     12.90
       Model |  104.253651        22  4.73880234   Prob > F        =    0.0000
    Residual |  680.641739     1,853  .367318801   R-squared       =    0.1328
-------------+----------------------------------   Adj R-squared   =    0.1225
       Total |   784.89539     1,875  .418610875   Root MSE        =    .60607

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1821028   .0421124     4.32   0.000       .09951    .2646955
               exp |   .0605069   .0302554     2.00   0.046     .0011687    .1198451
            expsqr |  -.0016182   .0008843    -1.83   0.067    -.0033524     .000116
         higheredu |   .3222253   .0319857    10.07   0.000     .2594935    .3849571
parent_partymember |   .0095943   .0552795     0.17   0.862    -.0988224     .118011
      provincedum2 |  -.4142294    .081195    -5.10   0.000    -.5734727    -.254986
      provincedum3 |  -.3375002   .0843788    -4.00   0.000    -.5029878   -.1720126
      provincedum4 |   -.353376   .0786812    -4.49   0.000    -.5076891   -.1990629
      provincedum5 |   .0414833   .0744851     0.56   0.578    -.1046003    .1875669
      provincedum6 |  -.1534588   .0891009    -1.72   0.085    -.3282074    .0212899
      provincedum7 |  -.1429036   .0772327    -1.85   0.064    -.2943759    .0085687
      provincedum8 |  -.2892465   .0826383    -3.50   0.000    -.4513205   -.1271725
      provincedum9 |  -.0436288   .0772967    -0.56   0.573    -.1952265    .1079689
     provincedum10 |  -.1596267   .0762854    -2.09   0.037     -.309241   -.0100124
     provincedum11 |   .0618367   .0727718     0.85   0.396    -.0808867    .2045601
     provincedum12 |  -.2544468   .0817212    -3.11   0.002    -.4147221   -.0941716
     provincedum13 |  -.0635413   .0800393    -0.79   0.427     -.220518    .0934353
     provincedum14 |  -.2888071   .0892247    -3.24   0.001    -.4637986   -.1138155
     provincedum15 |  -.1367465   .0971498    -1.41   0.159     -.327281    .0537881
               _m1 |   .4044012   .2301642     1.76   0.079    -.0470072    .8558095
               _m2 |  -1.730145   .7537073    -2.30   0.022     -3.20835   -.2519403
               _m3 |  -1.347034   .6333192    -2.13   0.034    -2.589128   -.1049399
             _cons |   5.964798   .9617645     6.20   0.000     4.078543    7.851054
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.249521          .        .       .            .           .
        rho1 |   .3617768          .        .       .            .           .
        rho2 |  -1.547786          .        .       .            .           .
        rho3 |  -1.205055          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum
> 2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 
> 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum2-provin
> cedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,876    8.333664    .6470014   5.521461   10.12663
        male |      1,876    .5319829    .4991091          0          1
         exp |      1,876     18.0661    6.409901          3         32
      expsqr |      1,876    367.4488    235.3005          9       1024
   higheredu |      1,876     .315565    .4648644          0          1
-------------+---------------------------------------------------------
parent_par~r |      1,876     .206823    .4051355          0          1
provincedum2 |      1,876     .065032     .246648          0          1
provincedum3 |      1,876    .0447761    .2068672          0          1
provincedum4 |      1,876    .0703625    .2558251          0          1
provincedum5 |      1,876    .0751599    .2637195          0          1
-------------+---------------------------------------------------------
provincedum6 |      1,876    .0495736    .2171201          0          1
provincedum7 |      1,876    .0895522    .2856153          0          1
provincedum8 |      1,876    .0751599    .2637195          0          1
provincedum9 |      1,876     .065032     .246648          0          1
provinced~10 |      1,876    .0698294    .2549273          0          1
-------------+---------------------------------------------------------
provinced~11 |      1,876    .1130064     .316685          0          1
provinced~12 |      1,876    .0591684    .2360026          0          1
provinced~13 |      1,876    .0682303    .2522079          0          1
provinced~14 |      1,876    .0442431    .2056895          0          1
provinced~15 |      1,876    .0298507    .1702208          0          1
-------------+---------------------------------------------------------
          m1 |      1,876    1.117796    .1869726    .754169   2.059168
          m2 |      1,876    -.537058    .1452294  -.7259957  -.0351315
          m3 |      1,876   -.3249838     .191616  -.7259199  -.0058722

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Non-specified Hi
> gheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) Parent Party Membership & Specified higher education, Sec Gen + inrange(birthyear, 1971
> , 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=
> male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_
> relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9795.5782
Iteration 1:  Log likelihood = -8194.9912
Iteration 2:  Log likelihood = -8055.9036
Iteration 3:  Log likelihood = -8041.6135
Iteration 4:  Log likelihood = -8041.3167
Iteration 5:  Log likelihood = -8041.3165

Multinomial logistic regression                   Number of obs   =       9562
                                                  LR chi2(14)     =    3508.52
                                                  Prob > chi2     =     0.0000
Log likelihood = -8041.3165                       Pseudo R2       =     0.1791

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1434978   .0561342    -2.56   0.011    -.2535187   -.0334768
         exp |   .3460674   .0256011    13.52   0.000     .2958902    .3962446
      expsqr |  -.0067892   .0006507   -10.43   0.000    -.0080646   -.0055139
ins1_secge~e |   3.208712    .430188     7.46   0.000     2.365559    4.051865
ins2_highe~e |   .1517008   .0891524     1.70   0.089    -.0230347    .3264364
ins3_vs_en~e |   .5673045   .4138097     1.37   0.170    -.2437476    1.378357
parent_par~r |  -.3259135   .0679651    -4.80   0.000    -.4591227   -.1927043
       _cons |   -5.56751   .3209546   -17.35   0.000    -6.196569    -4.93845
-------------+----------------------------------------------------------------
3            |
        male |   .0805033   .0577607     1.39   0.163    -.0327057    .1937123
         exp |    .577084   .0326426    17.68   0.000     .5131056    .6410623
      expsqr |  -.0074088   .0007398   -10.01   0.000    -.0088588   -.0059589
ins1_secge~e |   8.647813   .4742478    18.23   0.000     7.718305    9.577322
ins2_highe~e |   .4963708     .09729     5.10   0.000     .3056859    .6870557
ins3_vs_en~e |  -.6648155   .4627461    -1.44   0.151    -1.571781    .2421501
parent_par~r |   -1.40612   .0818601   -17.18   0.000    -1.566562   -1.245677
       _cons |  -11.06511    .430152   -25.72   0.000    -11.90819   -10.22203
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,848
-------------+----------------------------------   F(10, 4837)     =     56.94
       Model |  259.009045        10  25.9009045   Prob > F        =    0.0000
    Residual |  2200.30927     4,837   .45489131   R-squared       =    0.1053
-------------+----------------------------------   Adj R-squared   =    0.1035
       Total |  2459.31831     4,847   .50738979   Root MSE        =    .67446

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2126318   .0226758     9.38   0.000     .1681769    .2570867
               exp |   .0359459   .0148478     2.42   0.016     .0068376    .0650543
            expsqr |  -.0012639   .0004504    -2.81   0.005     -.002147   -.0003808
        highvocedu |   .1887161   .0304413     6.20   0.000     .1290373    .2483949
        highgenedu |   .5332786    .029168    18.28   0.000     .4760961    .5904611
          adultedu |   .2868961   .0357141     8.03   0.000     .2168803    .3569119
parent_partymember |   .0465611   .0286986     1.62   0.105    -.0097012    .1028235
               _m1 |   .0301822   .3038061     0.10   0.921    -.5654158    .6257802
               _m2 |   .0042215   .1245599     0.03   0.973    -.2399726    .2484155
               _m3 |  -.4333027   .2592792    -1.67   0.095    -.9416078    .0750025
             _cons |    7.78182   .0592731   131.29   0.000     7.665618    7.898022
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4855482          .        .       .            .           .
        rho1 |   .0433147          .        .       .            .           .
        rho2 |   .0060582          .        .       .            .           .
        rho3 |   -.621835          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |      4,848    .5633251    .4960249          0          1
         exp |      4,848    15.23123    6.985171          0         33
      expsqr |      4,848    280.7729    233.9759          0       1089
  highvocedu |      4,848    .2469059     .431256          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,848    .4080033    .4915144          0          1
    adultedu |      4,848    .1146865    .3186761          0          1
parent_par~r |      4,848    .2547442    .4357623          0          1
          m1 |      4,848   -.2766616    .0737611  -.4573975  -.0291447
          m2 |      4,848    .4395555    .3452197   -.004413   2.383419
-------------+---------------------------------------------------------
          m3 |      4,848   -.2372592    .1978795  -.7259316  -.0004079

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Specified Higher
> edu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) Parent Party Membership & Specified higher education, Sec Gen + inrange(birthyear, 1971
> , 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearnin
> g, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9795.5782
Iteration 1:  Log likelihood = -8194.9912
Iteration 2:  Log likelihood = -8055.9036
Iteration 3:  Log likelihood = -8041.6135
Iteration 4:  Log likelihood = -8041.3167
Iteration 5:  Log likelihood = -8041.3165

Multinomial logistic regression                   Number of obs   =       9562
                                                  LR chi2(14)     =    3508.52
                                                  Prob > chi2     =     0.0000
Log likelihood = -8041.3165                       Pseudo R2       =     0.1791

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1434978   .0561342    -2.56   0.011    -.2535187   -.0334768
         exp |   .3460674   .0256011    13.52   0.000     .2958902    .3962446
      expsqr |  -.0067892   .0006507   -10.43   0.000    -.0080646   -.0055139
ins1_secge~e |   3.208712    .430188     7.46   0.000     2.365559    4.051865
ins2_highe~e |   .1517008   .0891524     1.70   0.089    -.0230347    .3264364
ins3_vs_en~e |   .5673045   .4138097     1.37   0.170    -.2437476    1.378357
parent_par~r |  -.3259135   .0679651    -4.80   0.000    -.4591227   -.1927043
       _cons |   -5.56751   .3209546   -17.35   0.000    -6.196569    -4.93845
-------------+----------------------------------------------------------------
3            |
        male |   .0805033   .0577607     1.39   0.163    -.0327057    .1937123
         exp |    .577084   .0326426    17.68   0.000     .5131056    .6410623
      expsqr |  -.0074088   .0007398   -10.01   0.000    -.0088588   -.0059589
ins1_secge~e |   8.647813   .4742478    18.23   0.000     7.718305    9.577322
ins2_highe~e |   .4963708     .09729     5.10   0.000     .3056859    .6870557
ins3_vs_en~e |  -.6648155   .4627461    -1.44   0.151    -1.571781    .2421501
parent_par~r |   -1.40612   .0818601   -17.18   0.000    -1.566562   -1.245677
       _cons |  -11.06511    .430152   -25.72   0.000    -11.90819   -10.22203
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,848
-------------+----------------------------------   F(24, 4823)     =     41.17
       Model |  418.143754        24  17.4226564   Prob > F        =    0.0000
    Residual |  2041.17456     4,823  .423216786   R-squared       =    0.1700
-------------+----------------------------------   Adj R-squared   =    0.1659
       Total |  2459.31831     4,847   .50738979   Root MSE        =    .65055

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1926034   .0221128     8.71   0.000     .1492523    .2359546
               exp |   .0719028   .0151017     4.76   0.000     .0422965    .1015091
            expsqr |  -.0018023   .0004472    -4.03   0.000    -.0026791   -.0009256
        highvocedu |   .1823519   .0295911     6.16   0.000     .1243398    .2403639
        highgenedu |   .4969222   .0289376    17.17   0.000     .4401914     .553653
          adultedu |    .268065    .034851     7.69   0.000     .1997412    .3363889
parent_partymember |  -.0089529   .0286824    -0.31   0.755    -.0651835    .0472776
      provincedum2 |  -.6236386   .0502132   -12.42   0.000    -.7220793   -.5251978
      provincedum3 |   -.295317   .0471618    -6.26   0.000    -.3877757   -.2028583
      provincedum4 |  -.4548519    .050101    -9.08   0.000    -.5530727   -.3566311
      provincedum5 |  -.0637763   .0454466    -1.40   0.161    -.1528724    .0253198
      provincedum6 |   -.403343   .0534687    -7.54   0.000    -.5081659     -.29852
      provincedum7 |  -.3534242   .0502892    -7.03   0.000    -.4520139   -.2548344
      provincedum8 |  -.5984689   .0495424   -12.08   0.000    -.6955945   -.5013432
      provincedum9 |  -.1593193   .0468834    -3.40   0.001    -.2512322   -.0674064
     provincedum10 |  -.2178653   .0488186    -4.46   0.000    -.3135721   -.1221585
     provincedum11 |  -.0923555   .0421906    -2.19   0.029    -.1750683   -.0096427
     provincedum12 |  -.2687251   .0528455    -5.09   0.000    -.3723264   -.1651237
     provincedum13 |  -.2308465   .0485528    -4.75   0.000     -.326032    -.135661
     provincedum14 |  -.3020013   .0662207    -4.56   0.000    -.4318241   -.1721785
     provincedum15 |  -.4398977   .0575558    -7.64   0.000    -.5527333    -.327062
               _m1 |   .8640478   .3144793     2.75   0.006     .2475251    1.480571
               _m2 |  -.2058984   .1256148    -1.64   0.101    -.4521606    .0403638
               _m3 |  -.2251976   .2527231    -0.89   0.373    -.7206501    .2702549
             _cons |   8.068657   .0676225   119.32   0.000     7.936086    8.201228
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .6307136          .        .       .            .           .
        rho1 |   1.087982          .        .       .            .           .
        rho2 |  -.2592608          .        .       .            .           .
        rho3 |  -.2835617          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(
> monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,848    8.499482     .712313   5.521461   10.12663
        male |      4,848    .5633251    .4960249          0          1
         exp |      4,848    15.23123    6.985171          0         33
      expsqr |      4,848    280.7729    233.9759          0       1089
  highvocedu |      4,848    .2469059     .431256          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,848    .4080033    .4915144          0          1
    adultedu |      4,848    .1146865    .3186761          0          1
parent_par~r |      4,848    .2547442    .4357623          0          1
provincedum2 |      4,848    .0598185    .2371747          0          1
provincedum3 |      4,848    .0653878    .2472344          0          1
-------------+---------------------------------------------------------
provincedum4 |      4,848    .0587871    .2352501          0          1
provincedum5 |      4,848    .0792079    .2700909          0          1
provincedum6 |      4,848    .0528053    .2236676          0          1
provincedum7 |      4,848    .0635314    .2439414          0          1
provincedum8 |      4,848     .075495    .2642157          0          1
-------------+---------------------------------------------------------
provincedum9 |      4,848    .0693069    .2540016          0          1
provinced~10 |      4,848    .0616749     .240589          0          1
provinced~11 |      4,848    .1301568    .3365105          0          1
provinced~12 |      4,848      .05033    .2186476          0          1
provinced~13 |      4,848    .0666254    .2493979          0          1
-------------+---------------------------------------------------------
provinced~14 |      4,848     .027434    .1633612          0          1
provinced~15 |      4,848    .0360974    .1865517          0          1
          m1 |      4,848   -.2766616    .0737611  -.4573975  -.0291447
          m2 |      4,848    .4395555    .3452197   -.004413   2.383419
          m3 |      4,848   -.2372592    .1978795  -.7259316  -.0004079

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Specified Higher
> edu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) Parent Party Membership & Combined higher education, Sec Gen + inrange(birthyear, 1971,
>  1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_partymember if inrange(bir
> thyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_
> secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_part
> ymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9795.5782
Iteration 1:  Log likelihood = -8194.9912
Iteration 2:  Log likelihood = -8055.9036
Iteration 3:  Log likelihood = -8041.6135
Iteration 4:  Log likelihood = -8041.3167
Iteration 5:  Log likelihood = -8041.3165

Multinomial logistic regression                   Number of obs   =       9562
                                                  LR chi2(14)     =    3508.52
                                                  Prob > chi2     =     0.0000
Log likelihood = -8041.3165                       Pseudo R2       =     0.1791

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1434978   .0561342    -2.56   0.011    -.2535187   -.0334768
         exp |   .3460674   .0256011    13.52   0.000     .2958902    .3962446
      expsqr |  -.0067892   .0006507   -10.43   0.000    -.0080646   -.0055139
ins1_secge~e |   3.208712    .430188     7.46   0.000     2.365559    4.051865
ins2_highe~e |   .1517008   .0891524     1.70   0.089    -.0230347    .3264364
ins3_vs_en~e |   .5673045   .4138097     1.37   0.170    -.2437476    1.378357
parent_par~r |  -.3259135   .0679651    -4.80   0.000    -.4591227   -.1927043
       _cons |   -5.56751   .3209546   -17.35   0.000    -6.196569    -4.93845
-------------+----------------------------------------------------------------
3            |
        male |   .0805033   .0577607     1.39   0.163    -.0327057    .1937123
         exp |    .577084   .0326426    17.68   0.000     .5131056    .6410623
      expsqr |  -.0074088   .0007398   -10.01   0.000    -.0088588   -.0059589
ins1_secge~e |   8.647813   .4742478    18.23   0.000     7.718305    9.577322
ins2_highe~e |   .4963708     .09729     5.10   0.000     .3056859    .6870557
ins3_vs_en~e |  -.6648155   .4627461    -1.44   0.151    -1.571781    .2421501
parent_par~r |   -1.40612   .0818601   -17.18   0.000    -1.566562   -1.245677
       _cons |  -11.06511    .430152   -25.72   0.000    -11.90819   -10.22203
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,848
-------------+----------------------------------   F(8, 4839)      =     44.23
       Model |   167.57202         8  20.9465025   Prob > F        =    0.0000
    Residual |  2291.74629     4,839  .473599151   R-squared       =    0.0681
-------------+----------------------------------   Adj R-squared   =    0.0666
       Total |  2459.31831     4,847   .50738979   Root MSE        =    .68819

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1989622   .0231062     8.61   0.000     .1536637    .2442608
               exp |   .0472878   .0151244     3.13   0.002     .0176372    .0769385
            expsqr |  -.0016093   .0004587    -3.51   0.000    -.0025086   -.0007099
         higheredu |   .3574264   .0264965    13.49   0.000     .3054812    .4093716
parent_partymember |   .0621928   .0292362     2.13   0.033     .0048765    .1195091
               _m1 |   .4286529    .308341     1.39   0.165    -.1758355    1.033141
               _m2 |  -.0452335   .1270367    -0.36   0.722     -.294283    .2038161
               _m3 |  -.4498052   .2644036    -1.70   0.089    -.9681563    .0685459
             _cons |   7.859832   .0599389   131.13   0.000     7.742324    7.977339
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .5535366          .        .       .            .           .
        rho1 |   .5761461          .        .       .            .           .
        rho2 |  -.0607976          .        .       .            .           .
        rho3 |  -.6045765          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_partymember  m1 m2 m3 i
> f inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_partymember m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,848    8.499482     .712313   5.521461   10.12663
        male |      4,848    .5633251    .4960249          0          1
         exp |      4,848    15.23123    6.985171          0         33
      expsqr |      4,848    280.7729    233.9759          0       1089
   higheredu |      4,848    .7695957    .4211351          0          1
-------------+---------------------------------------------------------
parent_par~r |      4,848    .2547442    .4357623          0          1
          m1 |      4,848   -.2766616    .0737611  -.4573975  -.0291447
          m2 |      4,848    .4395555    .3452197   -.004413   2.383419
          m3 |      4,848   -.2372592    .1978795  -.7259316  -.0004079

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Non-specified Hi
> gheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) Parent Party Membership & Combined higher education, Sec Gen + inrange(birthyear, 1971,
>  1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_partymember provincedum2-p
> rovincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative  parent_partymember ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9795.5782
Iteration 1:  Log likelihood = -8194.9912
Iteration 2:  Log likelihood = -8055.9036
Iteration 3:  Log likelihood = -8041.6135
Iteration 4:  Log likelihood = -8041.3167
Iteration 5:  Log likelihood = -8041.3165

Multinomial logistic regression                   Number of obs   =       9562
                                                  LR chi2(14)     =    3508.52
                                                  Prob > chi2     =     0.0000
Log likelihood = -8041.3165                       Pseudo R2       =     0.1791

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1434978   .0561342    -2.56   0.011    -.2535187   -.0334768
         exp |   .3460674   .0256011    13.52   0.000     .2958902    .3962446
      expsqr |  -.0067892   .0006507   -10.43   0.000    -.0080646   -.0055139
ins1_secge~e |   3.208712    .430188     7.46   0.000     2.365559    4.051865
ins2_highe~e |   .1517008   .0891524     1.70   0.089    -.0230347    .3264364
ins3_vs_en~e |   .5673045   .4138097     1.37   0.170    -.2437476    1.378357
parent_par~r |  -.3259135   .0679651    -4.80   0.000    -.4591227   -.1927043
       _cons |   -5.56751   .3209546   -17.35   0.000    -6.196569    -4.93845
-------------+----------------------------------------------------------------
3            |
        male |   .0805033   .0577607     1.39   0.163    -.0327057    .1937123
         exp |    .577084   .0326426    17.68   0.000     .5131056    .6410623
      expsqr |  -.0074088   .0007398   -10.01   0.000    -.0088588   -.0059589
ins1_secge~e |   8.647813   .4742478    18.23   0.000     7.718305    9.577322
ins2_highe~e |   .4963708     .09729     5.10   0.000     .3056859    .6870557
ins3_vs_en~e |  -.6648155   .4627461    -1.44   0.151    -1.571781    .2421501
parent_par~r |   -1.40612   .0818601   -17.18   0.000    -1.566562   -1.245677
       _cons |  -11.06511    .430152   -25.72   0.000    -11.90819   -10.22203
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,848
-------------+----------------------------------   F(22, 4825)     =     35.61
       Model |  343.558152        22  15.6162796   Prob > F        =    0.0000
    Residual |  2115.76016     4,825  .438499515   R-squared       =    0.1397
-------------+----------------------------------   Adj R-squared   =    0.1358
       Total |  2459.31831     4,847   .50738979   Root MSE        =    .66219

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1777454   .0224713     7.91   0.000     .1336913    .2217994
               exp |   .0881295   .0153182     5.75   0.000     .0580988    .1181602
            expsqr |  -.0022152   .0004539    -4.88   0.000    -.0031051   -.0013254
         higheredu |   .3264356   .0260248    12.54   0.000     .2754152    .3774561
parent_partymember |  -.0069367   .0291778    -0.24   0.812    -.0641385    .0502651
      provincedum2 |  -.6935296   .0508151   -13.65   0.000    -.7931503   -.5939088
      provincedum3 |  -.3280541   .0479344    -6.84   0.000    -.4220275   -.2340807
      provincedum4 |  -.4811101   .0509535    -9.44   0.000    -.5810023    -.381218
      provincedum5 |  -.0906167    .046178    -1.96   0.050    -.1811466   -.0000869
      provincedum6 |  -.4632412   .0542108    -8.55   0.000     -.569519   -.3569633
      provincedum7 |  -.4099816   .0509708    -8.04   0.000    -.5099075   -.3100556
      provincedum8 |  -.6689729   .0501273   -13.35   0.000    -.7672452   -.5707006
      provincedum9 |  -.2063872   .0475461    -4.34   0.000    -.2995992   -.1131752
     provincedum10 |  -.2829353   .0494329    -5.72   0.000    -.3798464   -.1860242
     provincedum11 |   -.151505   .0426917    -3.55   0.000    -.2352002   -.0678098
     provincedum12 |  -.3224022   .0536319    -6.01   0.000    -.4275451   -.2172593
     provincedum13 |  -.2937499    .049182    -5.97   0.000    -.3901689   -.1973308
     provincedum14 |  -.3438489   .0673136    -5.11   0.000    -.4758142   -.2118836
     provincedum15 |  -.4489776   .0585663    -7.67   0.000    -.5637942    -.334161
               _m1 |   1.372318   .3174349     4.32   0.000     .7500005    1.994635
               _m2 |  -.2964938    .127659    -2.32   0.020    -.5467637    -.046224
               _m3 |   -.229036    .257117    -0.89   0.373    -.7331025    .2750306
             _cons |    8.19753   .0679766   120.59   0.000     8.064265    8.330795
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .9468117          .        .       .            .           .
        rho1 |   1.410337          .        .       .            .           .
        rho2 |   -.304708          .        .       .            .           .
        rho3 |  -.2353813          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum
> 2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 
> 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum2-provin
> cedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,848    8.499482     .712313   5.521461   10.12663
        male |      4,848    .5633251    .4960249          0          1
         exp |      4,848    15.23123    6.985171          0         33
      expsqr |      4,848    280.7729    233.9759          0       1089
   higheredu |      4,848    .7695957    .4211351          0          1
-------------+---------------------------------------------------------
parent_par~r |      4,848    .2547442    .4357623          0          1
provincedum2 |      4,848    .0598185    .2371747          0          1
provincedum3 |      4,848    .0653878    .2472344          0          1
provincedum4 |      4,848    .0587871    .2352501          0          1
provincedum5 |      4,848    .0792079    .2700909          0          1
-------------+---------------------------------------------------------
provincedum6 |      4,848    .0528053    .2236676          0          1
provincedum7 |      4,848    .0635314    .2439414          0          1
provincedum8 |      4,848     .075495    .2642157          0          1
provincedum9 |      4,848    .0693069    .2540016          0          1
provinced~10 |      4,848    .0616749     .240589          0          1
-------------+---------------------------------------------------------
provinced~11 |      4,848    .1301568    .3365105          0          1
provinced~12 |      4,848      .05033    .2186476          0          1
provinced~13 |      4,848    .0666254    .2493979          0          1
provinced~14 |      4,848     .027434    .1633612          0          1
provinced~15 |      4,848    .0360974    .1865517          0          1
-------------+---------------------------------------------------------
          m1 |      4,848   -.2766616    .0737611  -.4573975  -.0291447
          m2 |      4,848    .4395555    .3452197   -.004413   2.383419
          m3 |      4,848   -.2372592    .1978795  -.7259316  -.0004079

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Non-specified Hi
> gheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) All Parent Indicators & Keyschool & Specified higher education, Sec Voc + inrange(birth
> year, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(m
> onthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_hi
> ghedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partym
> ember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -7352.1947
Iteration 2:  Log likelihood = -7051.1021
Iteration 3:  Log likelihood = -6983.4072
Iteration 4:  Log likelihood = -6976.9905
Iteration 5:  Log likelihood = -6976.8858
Iteration 6:  Log likelihood = -6976.8857

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(20)     =    5535.54
                                                  Prob > chi2     =     0.0000
Log likelihood = -6976.8857                       Pseudo R2       =     0.2840

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1556643   .0606264    -2.57   0.010    -.2744899   -.0368388
         exp |   .2589546   .0272344     9.51   0.000      .205576    .3123331
      expsqr |  -.0053573   .0006907    -7.76   0.000    -.0067111   -.0040036
ins1_secge~e |   2.202189   .4634967     4.75   0.000     1.293752    3.110626
ins2_highe~e |   -.017252    .095508    -0.18   0.857    -.2044442    .1699402
ins3_vs_en~e |   .3539465   .4409922     0.80   0.422    -.5103825    1.218275
parent_sec~u |  -.0614298   .0710068    -0.87   0.387    -.2006005     .077741
parent_hig~u |  -.4025051   .1477972    -2.72   0.006    -.6921824   -.1128279
parent_par~r |  -.1233013   .0775884    -1.59   0.112    -.2753718    .0287693
   Keyschool |  -2.792365   .1175577   -23.75   0.000    -3.022774   -2.561956
       _cons |  -3.565356   .3451879   -10.33   0.000    -4.241912     -2.8888
-------------+----------------------------------------------------------------
3            |
        male |    .074124   .0635667     1.17   0.244    -.0504644    .1987124
         exp |   .5154765    .035519    14.51   0.000     .4458605    .5850925
      expsqr |  -.0066011   .0008094    -8.16   0.000    -.0081875   -.0050147
ins1_secge~e |   8.220712   .5125694    16.04   0.000     7.216094    9.225329
ins2_highe~e |   .2763574   .1060317     2.61   0.009     .0685392    .4841757
ins3_vs_en~e |  -1.116555   .4927499    -2.27   0.023    -2.082327   -.1507831
parent_sec~u |  -.7463763   .0854933    -8.73   0.000    -.9139402   -.5788125
parent_hig~u |  -1.268732   .2620937    -4.84   0.000    -1.782426   -.7550374
parent_par~r |  -1.061614   .0918426   -11.56   0.000    -1.241623    -.881606
   Keyschool |  -3.583582   .1572143   -22.79   0.000    -3.891717   -3.275448
       _cons |  -9.234386   .4639778   -19.90   0.000    -10.14377   -8.325006
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(13, 1851)     =     14.53
       Model |  72.1251366        13  5.54808743   Prob > F        =    0.0000
    Residual |  706.842074     1,851   .38187038   R-squared       =    0.0926
-------------+----------------------------------   Adj R-squared   =    0.0862
       Total |  778.967211     1,864  .417900864   Root MSE        =    .61796

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2344355   .0333308     7.03   0.000     .1690655    .2998055
               exp |   .0111365   .0217981     0.51   0.609    -.0316149     .053888
            expsqr |  -.0005064   .0006116    -0.83   0.408    -.0017059    .0006932
        highvocedu |   .2215365   .0472126     4.69   0.000     .1289409    .3141321
        highgenedu |   .5714748   .0863764     6.62   0.000     .4020694    .7408802
          adultedu |   .3580972   .0403059     8.88   0.000     .2790474     .437147
     parent_secedu |  -.0291473    .040366    -0.72   0.470     -.108315    .0500203
    parent_highedu |   .0886666   .0811612     1.09   0.275    -.0705106    .2478437
parent_partymember |    .029635   .0458793     0.65   0.518    -.0603456    .1196156
         Keyschool |   .1840811   .1959745     0.94   0.348    -.2002732    .5684354
               _m1 |   .0540191   .1652361     0.33   0.744    -.2700495    .3780878
               _m2 |  -.2772366   .2577052    -1.08   0.282      -.78266    .2281869
               _m3 |  -.5851582   .2652376    -2.21   0.027    -1.105355   -.0649619
             _cons |   7.693928   .4022423    19.13   0.000     6.905032    8.482824
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4549514          .        .       .            .           .
        rho1 |   .0800876          .        .       .            .           .
        rho2 |  -.4110248          .        .       .            .           .
        rho3 |  -.8675426          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
  highvocedu |      1,865    .1179625    .3226502          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,865    .0294906    .1692226          0          1
    adultedu |      1,865    .1689008    .3747648          0          1
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
-------------+---------------------------------------------------------
   Keyschool |      1,865    .0439678    .2050785          0          1
          m1 |      1,865    1.002848    .2982591   .6347529   2.509659
          m2 |      1,865   -.4623128    .1512875  -.7259998    .653807
          m3 |      1,865   -.3502564    .2008468    -.72598  -.0002757

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Specif
> ied Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) All Parent Indicators & Keyschool & Specified higher education, Sec Voc + inrange(birth
> year, 1971, 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secg
> en_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu p
> arent_highedu parent_partymember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -7352.1947
Iteration 2:  Log likelihood = -7051.1021
Iteration 3:  Log likelihood = -6983.4072
Iteration 4:  Log likelihood = -6976.9905
Iteration 5:  Log likelihood = -6976.8858
Iteration 6:  Log likelihood = -6976.8857

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(20)     =    5535.54
                                                  Prob > chi2     =     0.0000
Log likelihood = -6976.8857                       Pseudo R2       =     0.2840

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1556643   .0606264    -2.57   0.010    -.2744899   -.0368388
         exp |   .2589546   .0272344     9.51   0.000      .205576    .3123331
      expsqr |  -.0053573   .0006907    -7.76   0.000    -.0067111   -.0040036
ins1_secge~e |   2.202189   .4634967     4.75   0.000     1.293752    3.110626
ins2_highe~e |   -.017252    .095508    -0.18   0.857    -.2044442    .1699402
ins3_vs_en~e |   .3539465   .4409922     0.80   0.422    -.5103825    1.218275
parent_sec~u |  -.0614298   .0710068    -0.87   0.387    -.2006005     .077741
parent_hig~u |  -.4025051   .1477972    -2.72   0.006    -.6921824   -.1128279
parent_par~r |  -.1233013   .0775884    -1.59   0.112    -.2753718    .0287693
   Keyschool |  -2.792365   .1175577   -23.75   0.000    -3.022774   -2.561956
       _cons |  -3.565356   .3451879   -10.33   0.000    -4.241912     -2.8888
-------------+----------------------------------------------------------------
3            |
        male |    .074124   .0635667     1.17   0.244    -.0504644    .1987124
         exp |   .5154765    .035519    14.51   0.000     .4458605    .5850925
      expsqr |  -.0066011   .0008094    -8.16   0.000    -.0081875   -.0050147
ins1_secge~e |   8.220712   .5125694    16.04   0.000     7.216094    9.225329
ins2_highe~e |   .2763574   .1060317     2.61   0.009     .0685392    .4841757
ins3_vs_en~e |  -1.116555   .4927499    -2.27   0.023    -2.082327   -.1507831
parent_sec~u |  -.7463763   .0854933    -8.73   0.000    -.9139402   -.5788125
parent_hig~u |  -1.268732   .2620937    -4.84   0.000    -1.782426   -.7550374
parent_par~r |  -1.061614   .0918426   -11.56   0.000    -1.241623    -.881606
   Keyschool |  -3.583582   .1572143   -22.79   0.000    -3.891717   -3.275448
       _cons |  -9.234386   .4639778   -19.90   0.000    -10.14377   -8.325006
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(27, 1837)     =     11.31
       Model |  111.036234        27   4.1124531   Prob > F        =    0.0000
    Residual |  667.930977     1,837   .36359879   R-squared       =    0.1425
-------------+----------------------------------   Adj R-squared   =    0.1299
       Total |  778.967211     1,864  .417900864   Root MSE        =    .60299

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |    .238691   .0328186     7.27   0.000     .1743253    .3030567
               exp |   .0165648   .0219678     0.75   0.451    -.0265197    .0596492
            expsqr |   -.000468    .000614    -0.76   0.446    -.0016721    .0007361
        highvocedu |   .2364735   .0465474     5.08   0.000     .1451821    .3277649
        highgenedu |   .5930751   .0851576     6.96   0.000     .4260593    .7600909
          adultedu |    .377373   .0400958     9.41   0.000     .2987348    .4560112
     parent_secedu |   -.053518   .0408034    -1.31   0.190    -.1335439    .0265078
    parent_highedu |   .0743992   .0802983     0.93   0.354    -.0830863    .2318847
parent_partymember |   .0092185   .0470834     0.20   0.845    -.0831242    .1015611
         Keyschool |   .1431888   .2003115     0.71   0.475    -.2496735     .536051
      provincedum2 |   -.336553   .0765006    -4.40   0.000    -.4865903   -.1865157
      provincedum3 |  -.3103679   .0838239    -3.70   0.000    -.4747679   -.1459678
      provincedum4 |  -.2792543   .0748464    -3.73   0.000    -.4260473   -.1324612
      provincedum5 |   .0931934   .0726714     1.28   0.200    -.0493338    .2357207
      provincedum6 |    -.05198   .0837594    -0.62   0.535    -.2162537    .1122936
      provincedum7 |  -.0724882   .0704504    -1.03   0.304    -.2106596    .0656831
      provincedum8 |  -.1993967     .07566    -2.64   0.008    -.3477854    -.051008
      provincedum9 |   .0111749    .074586     0.15   0.881    -.1351074    .1574572
     provincedum10 |  -.0957128   .0731918    -1.31   0.191    -.2392607     .047835
     provincedum11 |   .1409209    .067449     2.09   0.037     .0086362    .2732056
     provincedum12 |  -.1912196   .0774367    -2.47   0.014    -.3430929   -.0393463
     provincedum13 |  -.0005579   .0751005    -0.01   0.994    -.1478493    .1467335
     provincedum14 |  -.2327556   .0852084    -2.73   0.006    -.3998712   -.0656401
     provincedum15 |  -.1027876   .0951537    -1.08   0.280    -.2894083    .0838332
               _m1 |    .048802   .1666281     0.29   0.770    -.2779983    .3756024
               _m2 |   -.229609   .2548199    -0.90   0.368     -.729376     .270158
               _m3 |   -.334519   .2812686    -1.19   0.234    -.8861588    .2171208
             _cons |   7.790422   .4108709    18.96   0.000     6.984599    8.596245
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3873142          .        .       .            .           .
        rho1 |   .0784163          .        .       .            .           .
        rho2 |  -.3689412          .        .       .            .           .
        rho3 |  -.5375131          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if in
> range(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
  highvocedu |      1,865    .1179625    .3226502          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,865    .0294906    .1692226          0          1
    adultedu |      1,865    .1689008    .3747648          0          1
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
-------------+---------------------------------------------------------
   Keyschool |      1,865    .0439678    .2050785          0          1
provincedum2 |      1,865    .0654155     .247324          0          1
provincedum3 |      1,865     .044504    .2062674          0          1
provincedum4 |      1,865    .0697051    .2547177          0          1
provincedum5 |      1,865    .0756032    .2644331          0          1
-------------+---------------------------------------------------------
provincedum6 |      1,865    .0493298    .2166137          0          1
provincedum7 |      1,865    .0900804    .2863737          0          1
provincedum8 |      1,865    .0756032    .2644331          0          1
provincedum9 |      1,865    .0654155     .247324          0          1
provinced~10 |      1,865    .0702413    .2556218          0          1
-------------+---------------------------------------------------------
provinced~11 |      1,865    .1115282    .3148695          0          1
provinced~12 |      1,865    .0595174     .236654          0          1
provinced~13 |      1,865    .0670241    .2501308          0          1
provinced~14 |      1,865     .044504    .2062674          0          1
provinced~15 |      1,865    .0300268    .1707068          0          1
-------------+---------------------------------------------------------
          m1 |      1,865    1.002848    .2982591   .6347529   2.509659
          m2 |      1,865   -.4623128    .1512875  -.7259998    .653807
          m3 |      1,865   -.3502564    .2008468    -.72598  -.0002757

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Specif
> ied Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) All Parent Indicators & Keyschool & Combined higher education, Sec Voc + inrange(birthy
> ear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 2
> 5000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relativ
> e ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymember Keyschool) dmf(
> 2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -7352.1947
Iteration 2:  Log likelihood = -7051.1021
Iteration 3:  Log likelihood = -6983.4072
Iteration 4:  Log likelihood = -6976.9905
Iteration 5:  Log likelihood = -6976.8858
Iteration 6:  Log likelihood = -6976.8857

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(20)     =    5535.54
                                                  Prob > chi2     =     0.0000
Log likelihood = -6976.8857                       Pseudo R2       =     0.2840

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1556643   .0606264    -2.57   0.010    -.2744899   -.0368388
         exp |   .2589546   .0272344     9.51   0.000      .205576    .3123331
      expsqr |  -.0053573   .0006907    -7.76   0.000    -.0067111   -.0040036
ins1_secge~e |   2.202189   .4634967     4.75   0.000     1.293752    3.110626
ins2_highe~e |   -.017252    .095508    -0.18   0.857    -.2044442    .1699402
ins3_vs_en~e |   .3539465   .4409922     0.80   0.422    -.5103825    1.218275
parent_sec~u |  -.0614298   .0710068    -0.87   0.387    -.2006005     .077741
parent_hig~u |  -.4025051   .1477972    -2.72   0.006    -.6921824   -.1128279
parent_par~r |  -.1233013   .0775884    -1.59   0.112    -.2753718    .0287693
   Keyschool |  -2.792365   .1175577   -23.75   0.000    -3.022774   -2.561956
       _cons |  -3.565356   .3451879   -10.33   0.000    -4.241912     -2.8888
-------------+----------------------------------------------------------------
3            |
        male |    .074124   .0635667     1.17   0.244    -.0504644    .1987124
         exp |   .5154765    .035519    14.51   0.000     .4458605    .5850925
      expsqr |  -.0066011   .0008094    -8.16   0.000    -.0081875   -.0050147
ins1_secge~e |   8.220712   .5125694    16.04   0.000     7.216094    9.225329
ins2_highe~e |   .2763574   .1060317     2.61   0.009     .0685392    .4841757
ins3_vs_en~e |  -1.116555   .4927499    -2.27   0.023    -2.082327   -.1507831
parent_sec~u |  -.7463763   .0854933    -8.73   0.000    -.9139402   -.5788125
parent_hig~u |  -1.268732   .2620937    -4.84   0.000    -1.782426   -.7550374
parent_par~r |  -1.061614   .0918426   -11.56   0.000    -1.241623    -.881606
   Keyschool |  -3.583582   .1572143   -22.79   0.000    -3.891717   -3.275448
       _cons |  -9.234386   .4639778   -19.90   0.000    -10.14377   -8.325006
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(11, 1853)     =     15.65
       Model |  66.1996047        11  6.01814588   Prob > F        =    0.0000
    Residual |  712.767606     1,853   .38465602   R-squared       =    0.0850
-------------+----------------------------------   Adj R-squared   =    0.0796
       Total |  778.967211     1,864  .417900864   Root MSE        =    .62021

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2318162   .0334439     6.93   0.000     .1662245    .2974079
               exp |    .016028   .0217967     0.74   0.462    -.0267206    .0587767
            expsqr |   -.000615   .0006125    -1.00   0.315    -.0018162    .0005862
         higheredu |   .3269593   .0326744    10.01   0.000     .2628769    .3910418
     parent_secedu |  -.0282632   .0404987    -0.70   0.485    -.1076911    .0511646
    parent_highedu |   .0972596   .0814223     1.19   0.232    -.0624294    .2569486
parent_partymember |   .0339296   .0460223     0.74   0.461    -.0563314    .1241907
         Keyschool |   .1737606    .196595     0.88   0.377    -.2118103    .5593316
               _m1 |   .0614261   .1657354     0.37   0.711    -.2636216    .3864739
               _m2 |  -.2665525   .2583112    -1.03   0.302    -.7731641    .2400591
               _m3 |  -.5659956   .2660794    -2.13   0.034    -1.087842   -.0441486
             _cons |   7.650079    .403551    18.96   0.000     6.858616    8.441541
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4536911          .        .       .            .           .
        rho1 |   .0911954          .        .       .            .           .
        rho2 |  -.3957333          .        .       .            .           .
        rho3 |  -.8402972          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
   higheredu |      1,865    .3163539    .4651775          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
   Keyschool |      1,865    .0439678    .2050785          0          1
          m1 |      1,865    1.002848    .2982591   .6347529   2.509659
-------------+---------------------------------------------------------
          m2 |      1,865   -.4623128    .1512875  -.7259998    .653807
          m3 |      1,865   -.3502564    .2008468    -.72598  -.0002757

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Non-sp
> ecified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) All Parent Indicators & Keyschool & Combined higher education, Sec Voc + inrange(birthy
> ear, 1971, 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inr
> ange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative i
> ns2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_
> partymember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -7352.1947
Iteration 2:  Log likelihood = -7051.1021
Iteration 3:  Log likelihood = -6983.4072
Iteration 4:  Log likelihood = -6976.9905
Iteration 5:  Log likelihood = -6976.8858
Iteration 6:  Log likelihood = -6976.8857

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(20)     =    5535.54
                                                  Prob > chi2     =     0.0000
Log likelihood = -6976.8857                       Pseudo R2       =     0.2840

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1556643   .0606264    -2.57   0.010    -.2744899   -.0368388
         exp |   .2589546   .0272344     9.51   0.000      .205576    .3123331
      expsqr |  -.0053573   .0006907    -7.76   0.000    -.0067111   -.0040036
ins1_secge~e |   2.202189   .4634967     4.75   0.000     1.293752    3.110626
ins2_highe~e |   -.017252    .095508    -0.18   0.857    -.2044442    .1699402
ins3_vs_en~e |   .3539465   .4409922     0.80   0.422    -.5103825    1.218275
parent_sec~u |  -.0614298   .0710068    -0.87   0.387    -.2006005     .077741
parent_hig~u |  -.4025051   .1477972    -2.72   0.006    -.6921824   -.1128279
parent_par~r |  -.1233013   .0775884    -1.59   0.112    -.2753718    .0287693
   Keyschool |  -2.792365   .1175577   -23.75   0.000    -3.022774   -2.561956
       _cons |  -3.565356   .3451879   -10.33   0.000    -4.241912     -2.8888
-------------+----------------------------------------------------------------
3            |
        male |    .074124   .0635667     1.17   0.244    -.0504644    .1987124
         exp |   .5154765    .035519    14.51   0.000     .4458605    .5850925
      expsqr |  -.0066011   .0008094    -8.16   0.000    -.0081875   -.0050147
ins1_secge~e |   8.220712   .5125694    16.04   0.000     7.216094    9.225329
ins2_highe~e |   .2763574   .1060317     2.61   0.009     .0685392    .4841757
ins3_vs_en~e |  -1.116555   .4927499    -2.27   0.023    -2.082327   -.1507831
parent_sec~u |  -.7463763   .0854933    -8.73   0.000    -.9139402   -.5788125
parent_hig~u |  -1.268732   .2620937    -4.84   0.000    -1.782426   -.7550374
parent_par~r |  -1.061614   .0918426   -11.56   0.000    -1.241623    -.881606
   Keyschool |  -3.583582   .1572143   -22.79   0.000    -3.891717   -3.275448
       _cons |  -9.234386   .4639778   -19.90   0.000    -10.14377   -8.325006
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(25, 1839)     =     11.45
       Model |  104.912365        25  4.19649462   Prob > F        =    0.0000
    Residual |  674.054845     1,839  .366533358   R-squared       =    0.1347
-------------+----------------------------------   Adj R-squared   =    0.1229
       Total |  778.967211     1,864  .417900864   Root MSE        =    .60542

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2371558   .0329443     7.20   0.000     .1725435     .301768
               exp |   .0210201   .0220001     0.96   0.339    -.0221277    .0641679
            expsqr |   -.000557   .0006156    -0.90   0.366    -.0017644    .0006505
         higheredu |   .3438876   .0326108    10.55   0.000     .2799295    .4078457
     parent_secedu |  -.0542015   .0409431    -1.32   0.186    -.1345014    .0260983
    parent_highedu |   .0833463   .0805848     1.03   0.301    -.0747011    .2413937
parent_partymember |   .0103961   .0472679     0.22   0.826    -.0823083    .1031006
         Keyschool |    .133056   .2009977     0.66   0.508    -.2611517    .5272638
      provincedum2 |  -.3529312    .076704    -4.60   0.000    -.5033674   -.2024951
      provincedum3 |  -.3179218   .0840918    -3.78   0.000    -.4828473   -.1529963
      provincedum4 |  -.2958814   .0750091    -3.94   0.000    -.4429934   -.1487695
      provincedum5 |   .0738227   .0727923     1.01   0.311    -.0689416     .216587
      provincedum6 |  -.0620231   .0840574    -0.74   0.461    -.2268811    .1028349
      provincedum7 |  -.0775496   .0705644    -1.10   0.272    -.2159443     .060845
      provincedum8 |  -.2126568   .0758796    -2.80   0.005    -.3614761   -.0638375
      provincedum9 |  -.0015612   .0748007    -0.02   0.983    -.1482644    .1451419
     provincedum10 |  -.1143006   .0733449    -1.56   0.119    -.2581486    .0295473
     provincedum11 |   .1238539   .0675816     1.83   0.067    -.0086908    .2563986
     provincedum12 |  -.2044687   .0776806    -2.63   0.009    -.3568201   -.0521173
     provincedum13 |  -.0153727   .0752834    -0.20   0.838    -.1630227    .1322772
     provincedum14 |  -.2426438   .0854633    -2.84   0.005    -.4102591   -.0750285
     provincedum15 |    -.10276   .0955312    -1.08   0.282     -.290121    .0846009
               _m1 |   .0515934   .1671443     0.31   0.758    -.2762192    .3794059
               _m2 |  -.2116242   .2554793    -0.83   0.408    -.7126841    .2894358
               _m3 |  -.2984438   .2821762    -1.06   0.290    -.8518632    .2549756
             _cons |   7.774189   .4124883    18.85   0.000     6.965195    8.583184
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3854267          .        .       .            .           .
        rho1 |   .0831042          .        .       .            .           .
        rho2 |  -.3408744          .        .       .            .           .
        rho3 |  -.4807194          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971
> , 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
   higheredu |      1,865    .3163539    .4651775          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
   Keyschool |      1,865    .0439678    .2050785          0          1
provincedum2 |      1,865    .0654155     .247324          0          1
-------------+---------------------------------------------------------
provincedum3 |      1,865     .044504    .2062674          0          1
provincedum4 |      1,865    .0697051    .2547177          0          1
provincedum5 |      1,865    .0756032    .2644331          0          1
provincedum6 |      1,865    .0493298    .2166137          0          1
provincedum7 |      1,865    .0900804    .2863737          0          1
-------------+---------------------------------------------------------
provincedum8 |      1,865    .0756032    .2644331          0          1
provincedum9 |      1,865    .0654155     .247324          0          1
provinced~10 |      1,865    .0702413    .2556218          0          1
provinced~11 |      1,865    .1115282    .3148695          0          1
provinced~12 |      1,865    .0595174     .236654          0          1
-------------+---------------------------------------------------------
provinced~13 |      1,865    .0670241    .2501308          0          1
provinced~14 |      1,865     .044504    .2062674          0          1
provinced~15 |      1,865    .0300268    .1707068          0          1
          m1 |      1,865    1.002848    .2982591   .6347529   2.509659
          m2 |      1,865   -.4623128    .1512875  -.7259998    .653807
-------------+---------------------------------------------------------
          m3 |      1,865   -.3502564    .2008468    -.72598  -.0002757

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Non-sp
> ecified Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) All Parent Indicators & Keyschool & Specified higher education, Sec Gen + inrange(birth
> year, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(m
> onthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_hi
> ghedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partym
> ember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -7352.1947
Iteration 2:  Log likelihood = -7051.1021
Iteration 3:  Log likelihood = -6983.4072
Iteration 4:  Log likelihood = -6976.9905
Iteration 5:  Log likelihood = -6976.8858
Iteration 6:  Log likelihood = -6976.8857

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(20)     =    5535.54
                                                  Prob > chi2     =     0.0000
Log likelihood = -6976.8857                       Pseudo R2       =     0.2840

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1556643   .0606264    -2.57   0.010    -.2744899   -.0368388
         exp |   .2589546   .0272344     9.51   0.000      .205576    .3123331
      expsqr |  -.0053573   .0006907    -7.76   0.000    -.0067111   -.0040036
ins1_secge~e |   2.202189   .4634967     4.75   0.000     1.293752    3.110626
ins2_highe~e |   -.017252    .095508    -0.18   0.857    -.2044442    .1699402
ins3_vs_en~e |   .3539465   .4409922     0.80   0.422    -.5103825    1.218275
parent_sec~u |  -.0614298   .0710068    -0.87   0.387    -.2006005     .077741
parent_hig~u |  -.4025051   .1477972    -2.72   0.006    -.6921824   -.1128279
parent_par~r |  -.1233013   .0775884    -1.59   0.112    -.2753718    .0287693
   Keyschool |  -2.792365   .1175577   -23.75   0.000    -3.022774   -2.561956
       _cons |  -3.565356   .3451879   -10.33   0.000    -4.241912     -2.8888
-------------+----------------------------------------------------------------
3            |
        male |    .074124   .0635667     1.17   0.244    -.0504644    .1987124
         exp |   .5154765    .035519    14.51   0.000     .4458605    .5850925
      expsqr |  -.0066011   .0008094    -8.16   0.000    -.0081875   -.0050147
ins1_secge~e |   8.220712   .5125694    16.04   0.000     7.216094    9.225329
ins2_highe~e |   .2763574   .1060317     2.61   0.009     .0685392    .4841757
ins3_vs_en~e |  -1.116555   .4927499    -2.27   0.023    -2.082327   -.1507831
parent_sec~u |  -.7463763   .0854933    -8.73   0.000    -.9139402   -.5788125
parent_hig~u |  -1.268732   .2620937    -4.84   0.000    -1.782426   -.7550374
parent_par~r |  -1.061614   .0918426   -11.56   0.000    -1.241623    -.881606
   Keyschool |  -3.583582   .1572143   -22.79   0.000    -3.891717   -3.275448
       _cons |  -9.234386   .4639778   -19.90   0.000    -10.14377   -8.325006
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(13, 4823)     =     43.58
       Model |  258.134837        13  19.8565259   Prob > F        =    0.0000
    Residual |  2197.33252     4,823  .455594551   R-squared       =    0.1051
-------------+----------------------------------   Adj R-squared   =    0.1027
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .67498

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2236994   .0212852    10.51   0.000     .1819707    .2654282
               exp |   .0288672   .0100403     2.88   0.004     .0091836    .0485508
            expsqr |  -.0008682   .0002958    -2.94   0.003    -.0014481   -.0002884
        highvocedu |   .1825656   .0306462     5.96   0.000      .122485    .2426462
        highgenedu |   .5152674   .0298979    17.23   0.000     .4566538    .5738809
          adultedu |   .2864354   .0359547     7.97   0.000     .2159478     .356923
     parent_secedu |  -.0046404    .023774    -0.20   0.845    -.0512483    .0419675
    parent_highedu |   .0567959   .0380908     1.49   0.136    -.0178794    .1314713
parent_partymember |  -.0021223   .0257506    -0.08   0.934    -.0526053    .0483607
         Keyschool |   .1982411   .1081132     1.83   0.067      -.01371    .4101923
               _m1 |   -.335089   .2804344    -1.19   0.232    -.8848683    .2146903
               _m2 |   .0089936   .1373249     0.07   0.948    -.2602259     .278213
               _m3 |  -.2831518   .2451915    -1.15   0.248     -.763839    .1975354
             _cons |   7.663919   .0991623    77.29   0.000     7.469515    7.858322
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4856906          .        .       .            .           .
        rho1 |  -.4808175          .        .       .            .           .
        rho2 |   .0129049          .        .       .            .           .
        rho3 |  -.4062931          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
  highvocedu |      4,837    .2464337    .4309786          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,837    .4085177    .4916106          0          1
    adultedu |      4,837    .1145338    .3184914          0          1
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
-------------+---------------------------------------------------------
   Keyschool |      4,837    .4721935    .4992778          0          1
          m1 |      4,837   -.2221122    .1562564  -.5088259  -.0087885
          m2 |      4,837    .3649332    .4151831  -.0125023   2.435786
          m3 |      4,837   -.1770829    .2080353  -.7259063  -.0000187

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Specif
> ied Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) All Parent Indicators & Keyschool & Specified higher education, Sec Gen + inrange(birth
> year, 1971, 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secg
> en_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu p
> arent_highedu parent_partymember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -7352.1947
Iteration 2:  Log likelihood = -7051.1021
Iteration 3:  Log likelihood = -6983.4072
Iteration 4:  Log likelihood = -6976.9905
Iteration 5:  Log likelihood = -6976.8858
Iteration 6:  Log likelihood = -6976.8857

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(20)     =    5535.54
                                                  Prob > chi2     =     0.0000
Log likelihood = -6976.8857                       Pseudo R2       =     0.2840

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1556643   .0606264    -2.57   0.010    -.2744899   -.0368388
         exp |   .2589546   .0272344     9.51   0.000      .205576    .3123331
      expsqr |  -.0053573   .0006907    -7.76   0.000    -.0067111   -.0040036
ins1_secge~e |   2.202189   .4634967     4.75   0.000     1.293752    3.110626
ins2_highe~e |   -.017252    .095508    -0.18   0.857    -.2044442    .1699402
ins3_vs_en~e |   .3539465   .4409922     0.80   0.422    -.5103825    1.218275
parent_sec~u |  -.0614298   .0710068    -0.87   0.387    -.2006005     .077741
parent_hig~u |  -.4025051   .1477972    -2.72   0.006    -.6921824   -.1128279
parent_par~r |  -.1233013   .0775884    -1.59   0.112    -.2753718    .0287693
   Keyschool |  -2.792365   .1175577   -23.75   0.000    -3.022774   -2.561956
       _cons |  -3.565356   .3451879   -10.33   0.000    -4.241912     -2.8888
-------------+----------------------------------------------------------------
3            |
        male |    .074124   .0635667     1.17   0.244    -.0504644    .1987124
         exp |   .5154765    .035519    14.51   0.000     .4458605    .5850925
      expsqr |  -.0066011   .0008094    -8.16   0.000    -.0081875   -.0050147
ins1_secge~e |   8.220712   .5125694    16.04   0.000     7.216094    9.225329
ins2_highe~e |   .2763574   .1060317     2.61   0.009     .0685392    .4841757
ins3_vs_en~e |  -1.116555   .4927499    -2.27   0.023    -2.082327   -.1507831
parent_sec~u |  -.7463763   .0854933    -8.73   0.000    -.9139402   -.5788125
parent_hig~u |  -1.268732   .2620937    -4.84   0.000    -1.782426   -.7550374
parent_par~r |  -1.061614   .0918426   -11.56   0.000    -1.241623    -.881606
   Keyschool |  -3.583582   .1572143   -22.79   0.000    -3.891717   -3.275448
       _cons |  -9.234386   .4639778   -19.90   0.000    -10.14377   -8.325006
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(27, 4809)     =     36.55
       Model |  418.099541        27  15.4851682   Prob > F        =    0.0000
    Residual |  2037.36781     4,809   .42365727   R-squared       =    0.1703
-------------+----------------------------------   Adj R-squared   =    0.1656
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .65089

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2235574    .020603    10.85   0.000     .1831661    .2639487
               exp |   .0319517   .0097804     3.27   0.001     .0127776    .0511258
            expsqr |  -.0007982   .0002874    -2.78   0.006    -.0013617   -.0002347
        highvocedu |   .1889545   .0296801     6.37   0.000     .1307678    .2471411
        highgenedu |   .4985927   .0292132    17.07   0.000     .4413213     .555864
          adultedu |   .2775501    .034943     7.94   0.000      .209046    .3460543
     parent_secedu |    .003834   .0230983     0.17   0.868    -.0414492    .0491171
    parent_highedu |    .039599   .0369612     1.07   0.284    -.0328619      .11206
parent_partymember |   -.000877   .0249291    -0.04   0.972    -.0497495    .0479954
         Keyschool |   .1323753   .1066529     1.24   0.215    -.0767132    .3414638
      provincedum2 |  -.5951221   .0486927   -12.22   0.000    -.6905821   -.4996621
      provincedum3 |   -.302074   .0473159    -6.38   0.000    -.3948348   -.2093132
      provincedum4 |  -.4258665   .0487768    -8.73   0.000    -.5214914   -.3302416
      provincedum5 |  -.0481961   .0446029    -1.08   0.280    -.1356383     .039246
      provincedum6 |  -.3605452   .0508784    -7.09   0.000    -.4602902   -.2608003
      provincedum7 |  -.3217354   .0480319    -6.70   0.000    -.4158999    -.227571
      provincedum8 |  -.5493363   .0459309   -11.96   0.000    -.6393819   -.4592908
      provincedum9 |  -.1386955    .046326    -2.99   0.003    -.2295156   -.0478755
     provincedum10 |  -.1948248   .0480391    -4.06   0.000    -.2890034   -.1006462
     provincedum11 |  -.0518414   .0399692    -1.30   0.195    -.1301994    .0265166
     provincedum12 |   -.236173    .051317    -4.60   0.000    -.3367778   -.1355682
     provincedum13 |  -.2050071   .0472767    -4.34   0.000    -.2976911   -.1123231
     provincedum14 |  -.2433791   .0641317    -3.79   0.000    -.3691065   -.1176517
     provincedum15 |  -.4287645   .0574097    -7.47   0.000    -.5413139   -.3162152
               _m1 |  -.1784637   .2761435    -0.65   0.518    -.7198314    .3629039
               _m2 |   .0093726   .1333402     0.07   0.944    -.2520351    .2707803
               _m3 |  -.0676471   .2376816    -0.28   0.776    -.5336117    .3983176
             _cons |   7.946822   .1037268    76.61   0.000      7.74347    8.150174
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4279863          .        .       .            .           .
        rho1 |  -.2727942          .        .       .            .           .
        rho2 |   .0143267          .        .       .            .           .
        rho3 |  -.1034032          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if in
> range(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
  highvocedu |      4,837    .2464337    .4309786          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,837    .4085177    .4916106          0          1
    adultedu |      4,837    .1145338    .3184914          0          1
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
-------------+---------------------------------------------------------
   Keyschool |      4,837    .4721935    .4992778          0          1
provincedum2 |      4,837    .0597478    .2370435          0          1
provincedum3 |      4,837    .0649163    .2464035          0          1
provincedum4 |      4,837    .0587141    .2351131          0          1
provincedum5 |      4,837    .0793881    .2703714          0          1
-------------+---------------------------------------------------------
provincedum6 |      4,837    .0529254    .2239077          0          1
provincedum7 |      4,837    .0632624    .2434594          0          1
provincedum8 |      4,837    .0756667    .2644915          0          1
provincedum9 |      4,837    .0692578    .2539183          0          1
provinced~10 |      4,837    .0618152    .2408445          0          1
-------------+---------------------------------------------------------
provinced~11 |      4,837     .130246    .3366087          0          1
provinced~12 |      4,837    .0504445     .218883          0          1
provinced~13 |      4,837    .0667769    .2496611          0          1
provinced~14 |      4,837    .0274964    .1635416          0          1
provinced~15 |      4,837    .0361795    .1867557          0          1
-------------+---------------------------------------------------------
          m1 |      4,837   -.2221122    .1562564  -.5088259  -.0087885
          m2 |      4,837    .3649332    .4151831  -.0125023   2.435786
          m3 |      4,837   -.1770829    .2080353  -.7259063  -.0000187

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Specif
> ied Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) All Parent Indicators & Keyschool & Combined higher education, Sec Gen + inrange(birthy
> ear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 2
> 5000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relativ
> e ins3_vs_entrant_relative  parent_secedu parent_highedu parent_partymember Keyschool) dmf(
> 2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -7352.1947
Iteration 2:  Log likelihood = -7051.1021
Iteration 3:  Log likelihood = -6983.4072
Iteration 4:  Log likelihood = -6976.9905
Iteration 5:  Log likelihood = -6976.8858
Iteration 6:  Log likelihood = -6976.8857

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(20)     =    5535.54
                                                  Prob > chi2     =     0.0000
Log likelihood = -6976.8857                       Pseudo R2       =     0.2840

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1556643   .0606264    -2.57   0.010    -.2744899   -.0368388
         exp |   .2589546   .0272344     9.51   0.000      .205576    .3123331
      expsqr |  -.0053573   .0006907    -7.76   0.000    -.0067111   -.0040036
ins1_secge~e |   2.202189   .4634967     4.75   0.000     1.293752    3.110626
ins2_highe~e |   -.017252    .095508    -0.18   0.857    -.2044442    .1699402
ins3_vs_en~e |   .3539465   .4409922     0.80   0.422    -.5103825    1.218275
parent_sec~u |  -.0614298   .0710068    -0.87   0.387    -.2006005     .077741
parent_hig~u |  -.4025051   .1477972    -2.72   0.006    -.6921824   -.1128279
parent_par~r |  -.1233013   .0775884    -1.59   0.112    -.2753718    .0287693
   Keyschool |  -2.792365   .1175577   -23.75   0.000    -3.022774   -2.561956
       _cons |  -3.565356   .3451879   -10.33   0.000    -4.241912     -2.8888
-------------+----------------------------------------------------------------
3            |
        male |    .074124   .0635667     1.17   0.244    -.0504644    .1987124
         exp |   .5154765    .035519    14.51   0.000     .4458605    .5850925
      expsqr |  -.0066011   .0008094    -8.16   0.000    -.0081875   -.0050147
ins1_secge~e |   8.220712   .5125694    16.04   0.000     7.216094    9.225329
ins2_highe~e |   .2763574   .1060317     2.61   0.009     .0685392    .4841757
ins3_vs_en~e |  -1.116555   .4927499    -2.27   0.023    -2.082327   -.1507831
parent_sec~u |  -.7463763   .0854933    -8.73   0.000    -.9139402   -.5788125
parent_hig~u |  -1.268732   .2620937    -4.84   0.000    -1.782426   -.7550374
parent_par~r |  -1.061614   .0918426   -11.56   0.000    -1.241623    -.881606
   Keyschool |  -3.583582   .1572143   -22.79   0.000    -3.891717   -3.275448
       _cons |  -9.234386   .4639778   -19.90   0.000    -10.14377   -8.325006
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(11, 4825)     =     34.21
       Model |   177.67426        11  16.1522054   Prob > F        =    0.0000
    Residual |  2277.79309     4,825   .47208147   R-squared       =    0.0724
-------------+----------------------------------   Adj R-squared   =    0.0702
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .68708

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2164667    .021648    10.00   0.000     .1740267    .2589067
               exp |   .0312454   .0102185     3.06   0.002     .0112126    .0512783
            expsqr |  -.0010019   .0003008    -3.33   0.001    -.0015916   -.0004123
         higheredu |   .3406555   .0267654    12.73   0.000     .2881832    .3931278
     parent_secedu |    .005511   .0241872     0.23   0.820    -.0419068    .0529289
    parent_highedu |   .0871815   .0387029     2.25   0.024     .0113061    .1630569
parent_partymember |   .0093923   .0261942     0.36   0.720    -.0419602    .0607449
         Keyschool |   .1798894   .1100222     1.64   0.102    -.0358043    .3955831
               _m1 |  -.0994805   .2845586    -0.35   0.727     -.657345     .458384
               _m2 |  -.0036618   .1397748    -0.03   0.979    -.2776841    .2703605
               _m3 |  -.2922626   .2495045    -1.17   0.242    -.7814052    .1968799
             _cons |   7.749316   .1004018    77.18   0.000     7.552482    7.946149
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4829387          .        .       .            .           .
        rho1 |  -.1431502          .        .       .            .           .
        rho2 |  -.0052692          .        .       .            .           .
        rho3 |  -.4205593          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
   higheredu |      4,837    .7694852    .4212059          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
   Keyschool |      4,837    .4721935    .4992778          0          1
          m1 |      4,837   -.2221122    .1562564  -.5088259  -.0087885
-------------+---------------------------------------------------------
          m2 |      4,837    .3649332    .4151831  -.0125023   2.435786
          m3 |      4,837   -.1770829    .2080353  -.7259063  -.0000187

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Non-sp
> ecified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) All Parent Indicators & Keyschool & Combined higher education, Sec Gen + inrange(birthy
> ear, 1971, 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inr
> ange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative i
> ns2_highedu_entrant_relative ins3_vs_entrant_relative  parent_secedu parent_highedu parent_
> partymember Keyschool) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -9744.6569
Iteration 1:  Log likelihood = -7352.1947
Iteration 2:  Log likelihood = -7051.1021
Iteration 3:  Log likelihood = -6983.4072
Iteration 4:  Log likelihood = -6976.9905
Iteration 5:  Log likelihood = -6976.8858
Iteration 6:  Log likelihood = -6976.8857

Multinomial logistic regression                   Number of obs   =       9519
                                                  LR chi2(20)     =    5535.54
                                                  Prob > chi2     =     0.0000
Log likelihood = -6976.8857                       Pseudo R2       =     0.2840

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1556643   .0606264    -2.57   0.010    -.2744899   -.0368388
         exp |   .2589546   .0272344     9.51   0.000      .205576    .3123331
      expsqr |  -.0053573   .0006907    -7.76   0.000    -.0067111   -.0040036
ins1_secge~e |   2.202189   .4634967     4.75   0.000     1.293752    3.110626
ins2_highe~e |   -.017252    .095508    -0.18   0.857    -.2044442    .1699402
ins3_vs_en~e |   .3539465   .4409922     0.80   0.422    -.5103825    1.218275
parent_sec~u |  -.0614298   .0710068    -0.87   0.387    -.2006005     .077741
parent_hig~u |  -.4025051   .1477972    -2.72   0.006    -.6921824   -.1128279
parent_par~r |  -.1233013   .0775884    -1.59   0.112    -.2753718    .0287693
   Keyschool |  -2.792365   .1175577   -23.75   0.000    -3.022774   -2.561956
       _cons |  -3.565356   .3451879   -10.33   0.000    -4.241912     -2.8888
-------------+----------------------------------------------------------------
3            |
        male |    .074124   .0635667     1.17   0.244    -.0504644    .1987124
         exp |   .5154765    .035519    14.51   0.000     .4458605    .5850925
      expsqr |  -.0066011   .0008094    -8.16   0.000    -.0081875   -.0050147
ins1_secge~e |   8.220712   .5125694    16.04   0.000     7.216094    9.225329
ins2_highe~e |   .2763574   .1060317     2.61   0.009     .0685392    .4841757
ins3_vs_en~e |  -1.116555   .4927499    -2.27   0.023    -2.082327   -.1507831
parent_sec~u |  -.7463763   .0854933    -8.73   0.000    -.9139402   -.5788125
parent_hig~u |  -1.268732   .2620937    -4.84   0.000    -1.782426   -.7550374
parent_par~r |  -1.061614   .0918426   -11.56   0.000    -1.241623    -.881606
   Keyschool |  -3.583582   .1572143   -22.79   0.000    -3.891717   -3.275448
       _cons |  -9.234386   .4639778   -19.90   0.000    -10.14377   -8.325006
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(25, 4811)     =     31.88
       Model |  348.942699        25  13.9577079   Prob > F        =    0.0000
    Residual |  2106.52466     4,811  .437855884   R-squared       =    0.1421
-------------+----------------------------------   Adj R-squared   =    0.1377
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .66171

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2181603   .0209318    10.42   0.000     .1771243    .2591962
               exp |   .0340108   .0099413     3.42   0.001     .0145213    .0535002
            expsqr |  -.0009095   .0002919    -3.12   0.002    -.0014818   -.0003373
         higheredu |    .330267   .0260416    12.68   0.000     .2792135    .3813205
     parent_secedu |   .0120859   .0234721     0.51   0.607    -.0339301     .058102
    parent_highedu |   .0634972   .0375268     1.69   0.091    -.0100725    .1370668
parent_partymember |   .0091619    .025328     0.36   0.718    -.0404926    .0588163
         Keyschool |   .1097428   .1083891     1.01   0.311    -.1027494     .322235
      provincedum2 |  -.6418089   .0493333   -13.01   0.000    -.7385246   -.5450931
      provincedum3 |  -.3276803   .0480525    -6.82   0.000    -.4218852   -.2334754
      provincedum4 |    -.43574   .0495754    -8.79   0.000    -.5329305   -.3385495
      provincedum5 |  -.0628934   .0452882    -1.39   0.165     -.151679    .0258922
      provincedum6 |  -.3921345   .0516299    -7.60   0.000    -.4933526   -.2909163
      provincedum7 |  -.3566264   .0487121    -7.32   0.000    -.4521245   -.2611284
      provincedum8 |  -.5905422   .0465573   -12.68   0.000    -.6818158   -.4992685
      provincedum9 |  -.1688299    .046983    -3.59   0.000     -.260938   -.0767218
     provincedum10 |  -.2436846   .0486721    -5.01   0.000    -.3391041    -.148265
     provincedum11 |   -.084053   .0405271    -2.07   0.038    -.1635046   -.0046014
     provincedum12 |  -.2679286   .0521047    -5.14   0.000    -.3700776   -.1657796
     provincedum13 |  -.2498657   .0479261    -5.21   0.000    -.3438227   -.1559086
     provincedum14 |  -.2511666   .0651889    -3.85   0.000    -.3789666   -.1233665
     provincedum15 |  -.4319853   .0583475    -7.40   0.000     -.546373   -.3175976
               _m1 |   .0531803   .2798037     0.19   0.849     -.495363    .6017235
               _m2 |  -.0012991   .1355442    -0.01   0.992    -.2670276    .2644295
               _m3 |  -.0531645   .2415607    -0.22   0.826    -.5267339    .4204049
             _cons |   8.065324   .1048273    76.94   0.000     7.859815    8.270834
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .4363888          .        .       .            .           .
        rho1 |   .0805033          .        .       .            .           .
        rho2 |  -.0019665          .        .       .            .           .
        rho3 |  -.0804795          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971
> , 1992) & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
   higheredu |      4,837    .7694852    .4212059          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
   Keyschool |      4,837    .4721935    .4992778          0          1
provincedum2 |      4,837    .0597478    .2370435          0          1
-------------+---------------------------------------------------------
provincedum3 |      4,837    .0649163    .2464035          0          1
provincedum4 |      4,837    .0587141    .2351131          0          1
provincedum5 |      4,837    .0793881    .2703714          0          1
provincedum6 |      4,837    .0529254    .2239077          0          1
provincedum7 |      4,837    .0632624    .2434594          0          1
-------------+---------------------------------------------------------
provincedum8 |      4,837    .0756667    .2644915          0          1
provincedum9 |      4,837    .0692578    .2539183          0          1
provinced~10 |      4,837    .0618152    .2408445          0          1
provinced~11 |      4,837     .130246    .3366087          0          1
provinced~12 |      4,837    .0504445     .218883          0          1
-------------+---------------------------------------------------------
provinced~13 |      4,837    .0667769    .2496611          0          1
provinced~14 |      4,837    .0274964    .1635416          0          1
provinced~15 |      4,837    .0361795    .1867557          0          1
          m1 |      4,837   -.2221122    .1562564  -.5088259  -.0087885
          m2 |      4,837    .3649332    .4151831  -.0125023   2.435786
-------------+---------------------------------------------------------
          m3 |      4,837   -.1770829    .2080353  -.7259063  -.0000187

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Non-sp
> ecified Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent BothStages.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Sel
> mlog Urban Parent BothStages.log
  log type:  text
 closed on:   6 Aug 2024, 18:09:39
---------------------------------------------------------------------------------------------
