---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Sel
> mlog Urban Parent NoFirstStage.log
  log type:  text
 opened on:   6 Aug 2024, 18:10:04

. use "`datapath'", clear

. 
. *Step Zero: A New Dataset for Merging
. 
. gen headsecedu = .
(36,259 missing values generated)

. gen headhighedu = .
(36,259 missing values generated)

. gen spousesecedu = .
(36,259 missing values generated)

. gen spousehighedu = .
(36,259 missing values generated)

. gen headparty = .
(36,259 missing values generated)

. gen spouseparty = .
(36,259 missing values generated)

. gen spouseparentsecedu = .
(36,259 missing values generated)

. gen spouseparenthighedu = .
(36,259 missing values generated)

. gen spouseparentparty = .
(36,259 missing values generated)

. gen headparentsecedu = .
(36,259 missing values generated)

. gen headparenthighedu = .
(36,259 missing values generated)

. gen headparentparty = .
(36,259 missing values generated)

. replace headsecedu = 1 if A02 == 1 & inrange(A13_1, 4, 9)
(6,181 real changes made)

. replace headsecedu = 0 if A02 == 1 & inrange(A13_1, 1, 3)
(5,310 real changes made)

. replace headhighedu = 1 if A02 == 1 & inrange(A13_1, 7, 9)
(3,235 real changes made)

. replace headhighedu = 0 if A02 == 1 & inrange(A13_1, 1, 6)
(8,256 real changes made)

. replace spousesecedu = 1 if A02 == 2 & inrange(A13_1, 4, 9)
(4,780 real changes made)

. replace spousesecedu = 0 if A02 == 2 & inrange(A13_1, 1, 3)
(5,112 real changes made)

. replace spousehighedu = 1 if A02 == 2 & inrange(A13_1, 7, 9)
(2,420 real changes made)

. replace spousehighedu = 0 if A02 == 2 & inrange(A13_1, 1, 6)
(7,472 real changes made)

. replace headparty = 1 if A02 == 1 & A07_1 == 1
(2,477 real changes made)

. replace headparty = 0 if A02 == 1 & inrange(A07_1, 2, 4)
(9,027 real changes made)

. replace spouseparty = 1 if A02 == 2 & A07_1 == 1
(1,231 real changes made)

. replace spouseparty = 0 if A02 == 2 & inrange(A07_1, 2, 4)
(8,672 real changes made)

. replace spouseparentsecedu = 0 if A02 == 5 & inrange(A13_1, 1, 3)
(239 real changes made)

. replace spouseparentsecedu = 1 if A02 == 5 & inrange(A13_1, 4, 9)
(63 real changes made)

. replace spouseparenthighedu = 0 if A02 == 5 & inrange(A13_1, 1, 6)
(289 real changes made)

. replace spouseparenthighedu = 1 if A02 == 5 & inrange(A13_1, 7, 9)
(13 real changes made)

. replace spouseparentparty = 0 if A02 == 5 & inrange(A07_1, 2, 4)
(273 real changes made)

. replace spouseparentparty = 1 if A02 == 5 & A07_1 == 1
(33 real changes made)

. replace headparentsecedu = 0 if A02 == 4 & inrange(A13_1, 1, 3)
(1,208 real changes made)

. replace headparentsecedu = 1 if A02 == 4 & inrange(A13_1, 4, 9)
(308 real changes made)

. replace headparenthighedu = 0 if A02 == 4 & inrange(A13_1, 1, 6)
(1,450 real changes made)

. replace headparenthighedu = 1 if A02 == 4 & inrange(A13_1, 7, 9)
(66 real changes made)

. replace headparentparty = 0 if A02 == 4 & inrange(A07_1, 2, 4)
(1,366 real changes made)

. replace headparentparty = 1 if A02 == 4 & A07_1 == 1
(160 real changes made)

. collapse (max) headsecedu headhighedu spousesecedu spousehighedu headparty spouseparty spou
> separentsecedu spouseparenthighedu spouseparentparty headparentsecedu headparenthighedu hea
> dparentparty, by(hhcode)

. 
. save "`folderpath'/`logname'.dta", replace
(file /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog
    Urban Parent NoFirstStage.dta not found)
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog
    Urban Parent NoFirstStage.dta saved

. 
. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. 
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for secjun
. gen jun_log_monthlyearning = log_monthlyearning if secjun == 1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *6) Instrument
. 
. gen yearat15 = birthyear+15

. local obsnum = _N

. 
. forval i =  1/`obsnum' {
  2.         
.         *extract the observation's year at age 15
.         qui sum yearat15  in `i'
  3.         local yearvalue = round(mod(r(mean),100))
  4.         
.         *get the variables' names for this observation
.         *graduates of mid and sec schools
.         if inrange(`yearvalue', 0, 9) {
  5.                 local czgrad_year = "czgrad0`yearvalue'"
  6.                 local gzgrad_year = "gzgrad0`yearvalue'"
  7.         }
  8.         else {
  9.                 local czgrad_year = "czgrad`yearvalue'"
 10.                 local gzgrad_year = "gzgrad`yearvalue'"
 11.         }
 12.         *entrants of sec and universities
.         if inrange(`yearvalue'+1, 0, 9) {
 13.                 local gzentrant_year = "gzentrant0`=`yearvalue'+1'"
 14.                 local gxentrant_year = "gxentrant0`=`yearvalue'+1'"
 15.                 local vsentrant_year = "vsentrant0`=`yearvalue'+1'"
 16.                 local tsentrant_year = "tsentrant0`=`yearvalue'+1'"
 17.         }
 18.         else{
 19.                 if `yearvalue' == 99 {
 20.                 local gzentrant_year = "gzentrant00"
 21.                 local gxentrant_year = "gxentrant00"
 22.                 local vsentrant_year = "vsentrant00"
 23.                 local tsentrant_year = "tsentrant00"
 24.                 }
 25.         else {
 26.                 local gzentrant_year = "gzentrant`=`yearvalue'+1'"
 27.                 local gxentrant_year = "gxentrant`=`yearvalue'+1'"
 28.                 local vsentrant_year = "vsentrant`=`yearvalue'+1'"
 29.                 local tsentrant_year = "tsentrant`=`yearvalue'+1'"
 30.         }
 31.         }
 32.         
.         
.         *For Ins 1 & 2: check whether the variable names exist (whether we have those years
> ' or not)
.         capture ds `czgrad_year' `gzgrad_year' `gzentrant_year' `gxentrant_year'
 33.         if _rc == 0 {
 34.                 *generate/replace the instrument
.                 capture ds ins1_secgen_entrant_relative ins2_highedu_entrant_relative
 35.                 if _rc!=0 {
 36.                         qui gen ins1_secgen_entrant_relative = `gzentrant_year'/`czgrad_
> year' if _n == `i'
 37.                         qui gen ins2_highedu_entrant_relative = `gxentrant_year'/`gzgrad
> _year' if _n == `i'
 38.                 
.                 }
 39.                 else {
 40.                         qui replace ins1_secgen_entrant_relative = `gzentrant_year'/`czg
> rad_year' if _n == `i'
 41.                         qui replace ins2_highedu_entrant_relative = `gxentrant_year'/`gz
> grad_year' if _n == `i'
 42.                 }
 43.         }
 44.         
.         *For Ins 3
.         capture ds `czgrad_year' `vsentrant_year'
 45.         if _rc == 0 {
 46.                 *generate/replace the instrument
.                 capture ds ins3_vs_entrant_relative
 47.                 if _rc!=0 {
 48.                         qui gen ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_year
> ' if _n == `i'
 49.                 }
 50.                 else {
 51.                         qui replace ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_
> year' if _n == `i'
 52.                 }
 53.         }
 54. }

. 
. 
. sum ins1_secgen_entrant_relative, d

                ins1_secgen_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1551793       .0699308
 5%     .1673149       .0699308
10%      .186534       .0699308       Obs              14,600
25%      .212766       .0699308       Sum of wgt.      14,600

50%     .2705238                      Mean           .3109947
                        Largest       Std. dev.      .1165706
75%     .4141782       .6448125
90%     .4786784       .6448125       Variance       .0135887
95%     .5186297       .6448125       Skewness       .6285488
99%     .5868049       .6448125       Kurtosis       2.318413

. sum ins2_highedu_entrant_relative, d

                ins2_highedu_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .152784       .0821429
 5%     .1734805       .0886667
10%     .2178154       .0925698       Obs              14,600
25%     .2949015       .1380375       Sum of wgt.      14,600

50%      .563901                      Mean           .6110964
                        Largest       Std. dev.      .4193773
75%     .8148931       2.985416
90%     1.023507       2.985416       Variance       .1758773
95%     1.167059       2.985416       Skewness       2.172976
99%     2.425508       2.985416       Kurtosis       10.34083

. sum ins3_vs_entrant_relative, d

                  ins3_vs_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1185751       .0849628
 5%     .1372715       .0849628
10%     .1456793       .0852398       Obs              14,942
25%      .184019       .0852398       Sum of wgt.      14,942

50%     .2320418                      Mean            .249079
                        Largest       Std. dev.      .0890765
75%     .3028006       .6566039
90%     .3705537       .6566039       Variance       .0079346
95%     .4302979       .6566039       Skewness       .9809564
99%     .5072184       .6566039       Kurtosis       4.050356

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. *The specific two; Do that for rural after special care.
. replace province_code = 51 if province_code==.
(2 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.00
         44 |      4,331       11.94       79.95
         50 |      2,115        5.83       85.78
         51 |      2,798        7.72       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *8) Parent Indicators
. merge m:1 hhcode using "`folderpath'/`logname'.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            36,259  (_merge==3)
    -----------------------------------------

. *parent_secedu
. gen parent_secedu = 0 if (A02==1 & (inrange(H03_R1, 1, 3) | inrange(H03_R2, 1, 3))) | (A02=
> =2 & (inrange(H03_R3, 1, 3) | inrange(H03_R4, 1, 3)))
(25,313 missing values generated)

. replace parent_secedu = 0 if A02 ==3 & (headsecedu == 0 | spousesecedu == 0)
(6,013 real changes made)

. replace parent_secedu = 0 if (A02 == 2 & spouseparentsecedu == 0) | (A02 == 1 & headparents
> ecedu == 0)
(241 real changes made)

. replace parent_secedu=1 if (A02==1 & (inrange(H03_R1, 4, 9) | inrange(H03_R2, 4, 9)))|(A02=
> =2 & (inrange(H03_R3, 4, 9) | inrange(H03_R4, 4, 9)))
(2,797 real changes made)

. replace parent_secedu = 1 if A02 ==3 & (headsecedu == 1 | spousesecedu == 1)
(5,871 real changes made)

. replace parent_secedu = 1 if (A02 == 2 & spouseparentsecedu == 1) | (A02 == 1 & headparents
> ecedu == 1)
(60 real changes made)

. tab parent_secedu

parent_sece |
         du |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,468       60.68       60.68
          1 |      8,728       39.32      100.00
------------+-----------------------------------
      Total |     22,196      100.00

.  *parent_highedu
. gen parent_highedu = 0 if (A02==1 & (inrange(H03_R1, 1, 6) | inrange(H03_R2, 1, 6))) | (A02
> ==2 & (inrange(H03_R3, 1, 6) | inrange(H03_R4, 1, 6)))
(24,480 missing values generated)

. replace parent_highedu = 0 if A02 == 3 & (headhighedu == 0 | spousehighedu == 0)
(8,028 real changes made)

. replace parent_highedu = 0 if (A02 == 2 & spouseparenthighedu == 0) | (A02 == 1 & headparen
> thighedu == 0)
(256 real changes made)

. replace parent_highedu=1 if (A02==1 & (inrange(H03_R1, 7, 9) | inrange(H03_R2, 7, 9)))|(A02
> ==2 & (inrange(H03_R3, 7, 9) | inrange(H03_R4, 7, 9)))
(546 real changes made)

. replace parent_highedu = 1 if A02 == 3 & (headhighedu == 1 | spousehighedu == 1)
(3,206 real changes made)

. replace parent_highedu = 1 if (A02 == 2 & spouseparenthighedu == 1) | (A02 == 1 & headparen
> thighedu == 1)
(18 real changes made)

. tab parent_highedu

parent_high |
        edu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,426       83.01       83.01
          1 |      3,770       16.99      100.00
------------+-----------------------------------
      Total |     22,196      100.00

. *parent_partymember
. gen parent_partymember = 0 if ((A02==1 & (inrange(H07_R1, 2, 4) | inrange(H07_R2, 2, 4))) |
>  (A02==2 & (inrange(H07_R3, 2, 4) | inrange(H07_R4, 2, 4))))
(24,599 missing values generated)

. replace parent_partymember = 0 if A02 == 3 & (headparty == 0 | spouseparty == 0)
(9,506 real changes made)

. replace parent_partymember = 0 if (A02 == 2 & spouseparentparty == 0) | (A02 == 1 & headpar
> entparty == 0)
(246 real changes made)

. replace parent_partymember=1 if (A02==1 & (H07_R1 == 1 | H07_R2 == 1)) | (A02==2 & (H07_R3 
> == 1 | H07_R4 == 1))
(2,132 real changes made)

. replace parent_partymember = 1 if A02 == 3 & (headparty == 1 | spouseparty == 1)
(2,343 real changes made)

. replace parent_partymember = 1 if (A02 == 2 & spouseparentparty == 1) | (A02 == 1 & headpar
> entparty == 1)
(42 real changes made)

. tab parent_partymember

parent_part |
    ymember |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,694       79.66       79.66
          1 |      4,517       20.34      100.00
------------+-----------------------------------
      Total |     22,211      100.00

. 
. *9) Key School Indicator
. 
. gen Keyschool = 0 if A14 != .

. replace Keyschool = 1 if inrange(A14, 1, 3)
(5,933 real changes made)

. 
. *10) GaoKao Indicator
. gen TakeGaoKao = 1 if A15_1 == 1
(27,995 missing values generated)

. replace TakeGaoKao = 0 if A15_1 == 2
(22,524 real changes made)

. tab TakeGaoKao

 TakeGaoKao |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,524       73.16       73.16
          1 |      8,264       26.84      100.00
------------+-----------------------------------
      Total |     30,788      100.00

. tab TakeGaoKao educat

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |     2,910      3,884      8,219 |    15,013 
         1 |       631      7,499         80 |     8,210 
-----------+---------------------------------+----------
     Total |     3,541     11,383      8,299 |    23,223 

. tab TakeGaoKao educat if male==1

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |     1,459      2,029      4,141 |     7,629 
         1 |       324      3,958         41 |     4,323 
-----------+---------------------------------+----------
     Total |     1,783      5,987      4,182 |    11,952 

. tab TakeGaoKao educat if male==0

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |     1,451      1,855      4,078 |     7,384 
         1 |       307      3,541         39 |     3,887 
-----------+---------------------------------+----------
     Total |     1,758      5,396      4,117 |    11,271 

. 
. *Step Two: Regressions
. 
. *1) All parent indicators & Specified higher education, Sec Voc + inrange(birthyear, 1971, 
> 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entr
> ant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(12, 1852)     =     15.97
       Model |  73.0569029        12  6.08807524   Prob > F        =    0.0000
    Residual |  705.910308     1,852  .381161073   R-squared       =    0.0938
-------------+----------------------------------   Adj R-squared   =    0.0879
       Total |  778.967211     1,864  .417900864   Root MSE        =    .61738

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2004412   .0370007     5.42   0.000     .1278737    .2730087
               exp |   .0531191   .0296654     1.79   0.074     -.005062    .1113001
            expsqr |  -.0018424    .000886    -2.08   0.038      -.00358   -.0001048
        highvocedu |   .2136804   .0466379     4.58   0.000      .122212    .3051488
        highgenedu |   .5712202   .0860188     6.64   0.000     .4025161    .7399243
          adultedu |   .3520944   .0399694     8.81   0.000     .2737046    .4304843
     parent_secedu |  -.0759723    .034297    -2.22   0.027    -.1432372   -.0087074
    parent_highedu |   .0443692   .0761608     0.58   0.560    -.1050008    .1937391
parent_partymember |  -.0315122   .0377499    -0.83   0.404    -.1055491    .0425246
               _m1 |   .4456049   .2296876     1.94   0.053     -.004869    .8960787
               _m2 |  -1.425814   .6510678    -2.19   0.029    -2.702717   -.1489097
               _m3 |  -1.584003   .5785108    -2.74   0.006    -2.718604   -.4494008
             _cons |   6.071592    .866606     7.01   0.000     4.371964    7.771219
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.321314          .        .       .            .           .
        rho1 |   .3876563          .        .       .            .           .
        rho2 |  -1.240394          .        .       .            .           .
        rho3 |  -1.378012          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrang
> e(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
  highvocedu |      1,865    .1179625    .3226502          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,865    .0294906    .1692226          0          1
    adultedu |      1,865    .1689008    .3747648          0          1
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
-------------+---------------------------------------------------------
          m1 |      1,865    1.126717    .1777359   .8143778    1.98121
          m2 |      1,865   -.5290168    .1438865   -.726001  -.0397592
          m3 |      1,865   -.3423902     .187798  -.7252195  -.0051956

. outreg2 using "`xlspath'", replace ctitle(All Parent Indicators, Sec Voc, Specified Highere
> du,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) All parent indicators & Specified higher education, Sec Voc + inrange(birthyear, 1971, 
> 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(26, 1838)     =     11.80
       Model |  111.441128        26  4.28619724   Prob > F        =    0.0000
    Residual |  667.526082     1,838  .363180676   R-squared       =    0.1431
-------------+----------------------------------   Adj R-squared   =    0.1309
       Total |  778.967211     1,864  .417900864   Root MSE        =    .60264

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1984147   .0376864     5.26   0.000      .124502    .2723275
               exp |    .061448   .0316243     1.94   0.052    -.0005754    .1234714
            expsqr |  -.0017835   .0009332    -1.91   0.056    -.0036137    .0000467
        highvocedu |   .2221276   .0460241     4.83   0.000     .1318627    .3123926
        highgenedu |       .582   .0848764     6.86   0.000     .4155357    .7484643
          adultedu |   .3613562   .0399074     9.05   0.000     .2830876    .4396248
     parent_secedu |  -.0757025   .0337899    -2.24   0.025    -.1419731    -.009432
    parent_highedu |   .0532839   .0745557     0.71   0.475     -.092939    .1995067
parent_partymember |  -.0221974   .0371326    -0.60   0.550    -.0950239    .0506291
      provincedum2 |  -.3803934    .081607    -4.66   0.000    -.5404456   -.2203413
      provincedum3 |   -.311029   .0851623    -3.65   0.000     -.478054   -.1440039
      provincedum4 |  -.3185978   .0795479    -4.01   0.000    -.4746116    -.162584
      provincedum5 |   .0724452    .075197     0.96   0.335    -.0750354    .2199257
      provincedum6 |  -.0951918   .0903185    -1.05   0.292    -.2723294    .0819458
      provincedum7 |  -.1261686    .078522    -1.61   0.108    -.2801703    .0278331
      provincedum8 |  -.2563827   .0829188    -3.09   0.002    -.4190077   -.0937578
      provincedum9 |  -.0212492   .0780212    -0.27   0.785    -.1742687    .1317703
     provincedum10 |  -.1346285   .0765429    -1.76   0.079    -.2847487    .0154917
     provincedum11 |    .087586   .0736701     1.19   0.235       -.0569    .2320719
     provincedum12 |  -.2390743   .0824212    -2.90   0.004    -.4007233   -.0774254
     provincedum13 |  -.0519959   .0812271    -0.64   0.522     -.211303    .1073111
     provincedum14 |   -.265273   .0891407    -2.98   0.003    -.4401007   -.0904453
     provincedum15 |  -.1382613    .097798    -1.41   0.158    -.3300682    .0535455
               _m1 |   .4599875   .2460542     1.87   0.062    -.0225877    .9425627
               _m2 |  -1.487807   .7083732    -2.10   0.036    -2.877108   -.0985062
               _m3 |  -1.288951   .6014434    -2.14   0.032    -2.468535   -.1093667
             _cons |   6.073044   .9283693     6.54   0.000     4.252275    7.893814
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.163276          .        .       .            .           .
        rho1 |   .4264859          .        .       .            .           .
        rho2 |  -1.379448          .        .       .            .           .
        rho3 |  -1.195074          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
  highvocedu |      1,865    .1179625    .3226502          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,865    .0294906    .1692226          0          1
    adultedu |      1,865    .1689008    .3747648          0          1
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
-------------+---------------------------------------------------------
provincedum2 |      1,865    .0654155     .247324          0          1
provincedum3 |      1,865     .044504    .2062674          0          1
provincedum4 |      1,865    .0697051    .2547177          0          1
provincedum5 |      1,865    .0756032    .2644331          0          1
provincedum6 |      1,865    .0493298    .2166137          0          1
-------------+---------------------------------------------------------
provincedum7 |      1,865    .0900804    .2863737          0          1
provincedum8 |      1,865    .0756032    .2644331          0          1
provincedum9 |      1,865    .0654155     .247324          0          1
provinced~10 |      1,865    .0702413    .2556218          0          1
provinced~11 |      1,865    .1115282    .3148695          0          1
-------------+---------------------------------------------------------
provinced~12 |      1,865    .0595174     .236654          0          1
provinced~13 |      1,865    .0670241    .2501308          0          1
provinced~14 |      1,865     .044504    .2062674          0          1
provinced~15 |      1,865    .0300268    .1707068          0          1
          m1 |      1,865    1.126717    .1777359   .8143778    1.98121
-------------+---------------------------------------------------------
          m2 |      1,865   -.5290168    .1438865   -.726001  -.0397592
          m3 |      1,865   -.3423902     .187798  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Specified Highered
> u, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) All parent indicators & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1
> 992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel
> (educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_
> entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(10, 1854)     =     17.42
       Model |  66.8958229        10  6.68958229   Prob > F        =    0.0000
    Residual |  712.071388     1,854  .384073025   R-squared       =    0.0859
-------------+----------------------------------   Adj R-squared   =    0.0809
       Total |  778.967211     1,864  .417900864   Root MSE        =    .61974

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2001211   .0371391     5.39   0.000     .1272823    .2729599
               exp |   .0561394   .0296953     1.89   0.059    -.0021003    .1143791
            expsqr |  -.0018872   .0008878    -2.13   0.034    -.0036284   -.0001459
         higheredu |   .3204331   .0321195     9.98   0.000     .2574389    .3834274
     parent_secedu |  -.0743356   .0344211    -2.16   0.031    -.1418438   -.0068274
    parent_highedu |   .0550845   .0763916     0.72   0.471    -.0947382    .2049071
parent_partymember |  -.0263476    .037843    -0.70   0.486     -.100567    .0478718
               _m1 |   .4332594   .2305405     1.88   0.060    -.0188868    .8854055
               _m2 |  -1.347922   .6532592    -2.06   0.039    -2.629123    -.066721
               _m3 |  -1.505839   .5803864    -2.59   0.010    -2.644118   -.3675591
             _cons |   6.113669   .8695795     7.03   0.000     4.408212    7.819127
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.235582          .        .       .            .           .
        rho1 |   .3897734          .        .       .            .           .
        rho2 |  -1.212632          .        .       .            .           .
        rho3 |  -1.354699          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250
> , 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
   higheredu |      1,865    .3163539    .4651775          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
          m1 |      1,865    1.126717    .1777359   .8143778    1.98121
          m2 |      1,865   -.5290168    .1438865   -.726001  -.0397592
-------------+---------------------------------------------------------
          m3 |      1,865   -.3423902     .187798  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Non-specified High
> eredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) All parent indicators & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1
> 992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(24, 1840)     =     11.98
       Model |  105.264415        24  4.38601729   Prob > F        =    0.0000
    Residual |  673.702795     1,840  .366142824   R-squared       =    0.1351
-------------+----------------------------------   Adj R-squared   =    0.1239
       Total |  778.967211     1,864  .417900864   Root MSE        =     .6051

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1975585    .037834     5.22   0.000     .1233564    .2717606
               exp |   .0647322   .0316784     2.04   0.041     .0026028    .1268615
            expsqr |  -.0018273   .0009357    -1.95   0.051    -.0036625    7.90e-06
         higheredu |   .3283866    .032179    10.20   0.000     .2652754    .3914978
     parent_secedu |  -.0737864   .0339173    -2.18   0.030    -.1403068   -.0072659
    parent_highedu |   .0651514   .0747851     0.87   0.384    -.0815212     .211824
parent_partymember |  -.0180869    .037245    -0.49   0.627    -.0911339    .0549601
      provincedum2 |  -.3987336    .081815    -4.87   0.000    -.5591936   -.2382736
      provincedum3 |  -.3200221   .0854389    -3.75   0.000    -.4875895   -.1524546
      provincedum4 |  -.3367463   .0797054    -4.22   0.000    -.4930688   -.1804237
      provincedum5 |   .0516298   .0753099     0.69   0.493    -.0960721    .1993318
      provincedum6 |  -.1077566   .0906344    -1.19   0.235    -.2855137    .0700004
      provincedum7 |  -.1328862   .0786413    -1.69   0.091    -.2871217    .0213494
      provincedum8 |  -.2717443   .0831355    -3.27   0.001     -.434794   -.1086945
      provincedum9 |  -.0348993   .0782549    -0.45   0.656    -.1883771    .1185785
     provincedum10 |  -.1541861   .0767038    -2.01   0.045    -.3046217   -.0037505
     provincedum11 |   .0691067   .0738116     0.94   0.349    -.0756565    .2138699
     provincedum12 |  -.2536555   .0826759    -3.07   0.002     -.415804    -.091507
     provincedum13 |  -.0679669   .0814185    -0.83   0.404    -.2276493    .0917154
     provincedum14 |  -.2774067   .0894153    -3.10   0.002    -.4527728   -.1020406
     provincedum15 |  -.1385101   .0981945    -1.41   0.159    -.3310946    .0540743
               _m1 |   .4518991   .2470431     1.83   0.068    -.0326151    .9364133
               _m2 |  -1.449731   .7110605    -2.04   0.042    -2.844301   -.0551604
               _m3 |  -1.224391   .6036287    -2.03   0.043    -2.408261   -.0405222
             _cons |   6.093838   .9316689     6.54   0.000     4.266599    7.921078
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.111861          .        .       .            .           .
        rho1 |   .4285645          .        .       .            .           .
        rho2 |  -1.374871          .        .       .            .           .
        rho3 |  -1.161168          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
   higheredu |      1,865    .3163539    .4651775          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
provincedum2 |      1,865    .0654155     .247324          0          1
provincedum3 |      1,865     .044504    .2062674          0          1
-------------+---------------------------------------------------------
provincedum4 |      1,865    .0697051    .2547177          0          1
provincedum5 |      1,865    .0756032    .2644331          0          1
provincedum6 |      1,865    .0493298    .2166137          0          1
provincedum7 |      1,865    .0900804    .2863737          0          1
provincedum8 |      1,865    .0756032    .2644331          0          1
-------------+---------------------------------------------------------
provincedum9 |      1,865    .0654155     .247324          0          1
provinced~10 |      1,865    .0702413    .2556218          0          1
provinced~11 |      1,865    .1115282    .3148695          0          1
provinced~12 |      1,865    .0595174     .236654          0          1
provinced~13 |      1,865    .0670241    .2501308          0          1
-------------+---------------------------------------------------------
provinced~14 |      1,865     .044504    .2062674          0          1
provinced~15 |      1,865    .0300268    .1707068          0          1
          m1 |      1,865    1.126717    .1777359   .8143778    1.98121
          m2 |      1,865   -.5290168    .1438865   -.726001  -.0397592
          m3 |      1,865   -.3423902     .187798  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Voc, Non-specified High
> eredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) All parent indicators & Specified higher education, Sec Gen + inrange(birthyear, 1971, 
> 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entr
> ant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(12, 4824)     =     47.72
       Model |  260.530619        12  21.7108849   Prob > F        =    0.0000
    Residual |  2194.93674     4,824  .455003469   R-squared       =    0.1061
-------------+----------------------------------   Adj R-squared   =    0.1039
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .67454

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2043613   .0224664     9.10   0.000     .1603169    .2484058
               exp |   .0584917   .0169743     3.45   0.001     .0252144    .0917691
            expsqr |  -.0020184    .000546    -3.70   0.000    -.0030888   -.0009481
        highvocedu |   .1858465   .0304821     6.10   0.000     .1260876    .2456054
        highgenedu |   .5293551   .0294585    17.97   0.000     .4716029    .5871072
          adultedu |   .2804936   .0357993     7.84   0.000     .2103106    .3506766
     parent_secedu |  -.0183968    .022586    -0.81   0.415    -.0626757    .0258822
    parent_highedu |   .0468115   .0365541     1.28   0.200    -.0248512    .1184742
parent_partymember |   -.017848   .0244786    -0.73   0.466    -.0658372    .0301412
               _m1 |   .5772668   .3702876     1.56   0.119    -.1486657    1.303199
               _m2 |   .0177675   .1214838     0.15   0.884    -.2203962    .2559311
               _m3 |  -.5411169   .2765589    -1.96   0.050    -1.083298    .0010645
             _cons |   7.785241   .0592751   131.34   0.000     7.669035    7.901448
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .5898066          .        .       .            .           .
        rho1 |   .7516605          .        .       .            .           .
        rho2 |    .023135          .        .       .            .           .
        rho3 |  -.7045897          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrang
> e(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
  highvocedu |      4,837    .2464337    .4309786          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,837    .4085177    .4916106          0          1
    adultedu |      4,837    .1145338    .3184914          0          1
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
-------------+---------------------------------------------------------
          m1 |      4,837   -.2757319    .0699284  -.4284056  -.0389473
          m2 |      4,837    .4594164    .3457812   .0001547   2.301244
          m3 |      4,837   -.2558632    .1983774   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Specified Highered
> u,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) All parent indicators & Specified higher education, Sec Gen + inrange(birthyear, 1971, 
> 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(26, 4810)     =     38.19
       Model |  420.178709        26  16.1607196   Prob > F        =    0.0000
    Residual |  2035.28865     4,810  .423136933   R-squared       =    0.1711
-------------+----------------------------------   Adj R-squared   =    0.1666
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .65049

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |    .185784   .0219949     8.45   0.000     .1426639     .228904
               exp |   .0916346   .0173917     5.27   0.000     .0575389    .1257303
            expsqr |  -.0024509   .0005504    -4.45   0.000    -.0035299    -.001372
        highvocedu |   .1766677   .0296184     5.96   0.000     .1186022    .2347333
        highgenedu |   .4883606   .0291739    16.74   0.000     .4311663    .5455549
          adultedu |   .2604128   .0349095     7.46   0.000     .1919743    .3288513
     parent_secedu |   .0029834   .0219262     0.14   0.892     -.040002    .0459687
    parent_highedu |   .0379282   .0353685     1.07   0.284    -.0314102    .1072665
parent_partymember |  -.0037483   .0236619    -0.16   0.874    -.0501363    .0426398
      provincedum2 |  -.6271756   .0505056   -12.42   0.000    -.7261897   -.5281614
      provincedum3 |  -.2893093     .04747    -6.09   0.000    -.3823722   -.1962463
      provincedum4 |  -.4528193   .0503451    -8.99   0.000    -.5515187   -.3541199
      provincedum5 |  -.0583283   .0455568    -1.28   0.200    -.1476405     .030984
      provincedum6 |   -.399695   .0537574    -7.44   0.000     -.505084    -.294306
      provincedum7 |  -.3534877    .050657    -6.98   0.000    -.4527986   -.2541767
      provincedum8 |  -.6055916   .0499372   -12.13   0.000    -.7034914   -.5076917
      provincedum9 |  -.1557699   .0470743    -3.31   0.001    -.2480571   -.0634827
     provincedum10 |  -.2263523   .0491208    -4.61   0.000    -.3226516    -.130053
     provincedum11 |   -.096579   .0425812    -2.27   0.023    -.1800576   -.0131005
     provincedum12 |   -.268727    .053029    -5.07   0.000     -.372688   -.1647659
     provincedum13 |  -.2281073   .0488799    -4.67   0.000    -.3239343   -.1322803
     provincedum14 |  -.3116139   .0664241    -4.69   0.000    -.4418356   -.1813922
     provincedum15 |  -.4489627   .0579216    -7.75   0.000    -.5625155   -.3354099
               _m1 |   1.342462   .3842629     3.49   0.000     .5891307    2.095793
               _m2 |  -.1364538   .1229386    -1.11   0.267    -.3774696     .104562
               _m3 |  -.2065646   .2730389    -0.76   0.449    -.7418457    .3287165
             _cons |    8.05762   .0676855   119.04   0.000     7.924925    8.190314
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .8894093          .        .       .            .           .
        rho1 |   1.423479          .        .       .            .           .
        rho2 |  -.1446888          .        .       .            .           .
        rho3 |  -.2190308          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
  highvocedu |      4,837    .2464337    .4309786          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,837    .4085177    .4916106          0          1
    adultedu |      4,837    .1145338    .3184914          0          1
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
-------------+---------------------------------------------------------
provincedum2 |      4,837    .0597478    .2370435          0          1
provincedum3 |      4,837    .0649163    .2464035          0          1
provincedum4 |      4,837    .0587141    .2351131          0          1
provincedum5 |      4,837    .0793881    .2703714          0          1
provincedum6 |      4,837    .0529254    .2239077          0          1
-------------+---------------------------------------------------------
provincedum7 |      4,837    .0632624    .2434594          0          1
provincedum8 |      4,837    .0756667    .2644915          0          1
provincedum9 |      4,837    .0692578    .2539183          0          1
provinced~10 |      4,837    .0618152    .2408445          0          1
provinced~11 |      4,837     .130246    .3366087          0          1
-------------+---------------------------------------------------------
provinced~12 |      4,837    .0504445     .218883          0          1
provinced~13 |      4,837    .0667769    .2496611          0          1
provinced~14 |      4,837    .0274964    .1635416          0          1
provinced~15 |      4,837    .0361795    .1867557          0          1
          m1 |      4,837   -.2757319    .0699284  -.4284056  -.0389473
-------------+---------------------------------------------------------
          m2 |      4,837    .4594164    .3457812   .0001547   2.301244
          m3 |      4,837   -.2558632    .1983774   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Specified Highered
> u, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) All parent indicators & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1
> 992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel
> (educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_
> entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(10, 4826)     =     36.04
       Model |  170.621885        10  17.0621885   Prob > F        =    0.0000
    Residual |  2284.84547     4,826  .473444979   R-squared       =    0.0695
-------------+----------------------------------   Adj R-squared   =    0.0676
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .68807

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1965394   .0228817     8.59   0.000     .1516809     .241398
               exp |   .0645376    .017305     3.73   0.000      .030612    .0984633
            expsqr |  -.0021703   .0005567    -3.90   0.000    -.0032616   -.0010789
         higheredu |   .3489827   .0266186    13.11   0.000     .2967981    .4011674
     parent_secedu |  -.0083596   .0230277    -0.36   0.717    -.0535044    .0367852
    parent_highedu |   .0942354    .037127     2.54   0.011     .0214497    .1670212
parent_partymember |   -.007933   .0249573    -0.32   0.751    -.0568606    .0409947
               _m1 |   .8326135   .3772472     2.21   0.027     .0930372     1.57219
               _m2 |   .0095471   .1238775     0.08   0.939    -.2333092    .2524035
               _m3 |  -.4317518   .2814338    -1.53   0.125    -.9834903    .1199867
             _cons |   7.856496   .0599383   131.08   0.000      7.73899    7.974003
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .6804356          .        .       .            .           .
        rho1 |   1.009369          .        .       .            .           .
        rho2 |   .0115739          .        .       .            .           .
        rho3 |  -.5234084          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250
> , 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
   higheredu |      4,837    .7694852    .4212059          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
          m1 |      4,837   -.2757319    .0699284  -.4284056  -.0389473
          m2 |      4,837    .4594164    .3457812   .0001547   2.301244
-------------+---------------------------------------------------------
          m3 |      4,837   -.2558632    .1983774   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Non-specified High
> eredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) All parent indicators & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1
> 992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(24, 4812)     =     33.08
       Model |  347.787511        24  14.4911463   Prob > F        =    0.0000
    Residual |  2107.67984     4,812  .438004955   R-squared       =    0.1416
-------------+----------------------------------   Adj R-squared   =    0.1374
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .66182

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1760281   .0223397     7.88   0.000     .1322321    .2198242
               exp |   .1027927   .0176691     5.82   0.000     .0681532    .1374322
            expsqr |  -.0026868   .0005595    -4.80   0.000    -.0037838   -.0015898
         higheredu |   .3158477   .0261046    12.10   0.000     .2646707    .3670247
     parent_secedu |   .0120008   .0222969     0.54   0.590    -.0317114    .0557129
    parent_highedu |   .0758748   .0358609     2.12   0.034      .005571    .1461786
parent_partymember |   .0057444   .0240606     0.24   0.811    -.0414254    .0529142
      provincedum2 |  -.6974665   .0510823   -13.65   0.000    -.7976111   -.5973219
      provincedum3 |   -.322447   .0482267    -6.69   0.000    -.4169934   -.2279005
      provincedum4 |   -.479533   .0511776    -9.37   0.000    -.5798646   -.3792015
      provincedum5 |  -.0855365   .0462744    -1.85   0.065    -.1762556    .0051825
      provincedum6 |  -.4579412   .0544913    -8.40   0.000     -.564769   -.3511133
      provincedum7 |  -.4086414   .0513342    -7.96   0.000      -.50928   -.3080028
      provincedum8 |  -.6759279   .0505011   -13.38   0.000    -.7749332   -.5769225
      provincedum9 |  -.2012519   .0477269    -4.22   0.000    -.2948185   -.1076853
     provincedum10 |  -.2898767   .0497216    -5.83   0.000    -.3873538   -.1923996
     provincedum11 |  -.1533343   .0430841    -3.56   0.000    -.2377987   -.0688698
     provincedum12 |  -.3211027   .0537974    -5.97   0.000    -.4265702   -.2156351
     provincedum13 |   -.287361   .0495142    -5.80   0.000    -.3844315   -.1902905
     provincedum14 |  -.3521106   .0674932    -5.22   0.000    -.4844282   -.2197931
     provincedum15 |  -.4584539   .0589073    -7.78   0.000    -.5739391   -.3429687
               _m1 |   1.716711    .389855     4.40   0.000     .9524173    2.481005
               _m2 |  -.1855712   .1249656    -1.48   0.138    -.4305609    .0594186
               _m3 |  -.0965606   .2771392    -0.35   0.728    -.6398802    .4467589
             _cons |   8.177623   .0680581   120.16   0.000     8.044198    8.311048
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.192671          .        .       .            .           .
        rho1 |   1.571944          .        .       .            .           .
        rho2 |  -.1699223          .        .       .            .           .
        rho3 |  -.0884178          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
   higheredu |      4,837    .7694852    .4212059          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
provincedum2 |      4,837    .0597478    .2370435          0          1
provincedum3 |      4,837    .0649163    .2464035          0          1
-------------+---------------------------------------------------------
provincedum4 |      4,837    .0587141    .2351131          0          1
provincedum5 |      4,837    .0793881    .2703714          0          1
provincedum6 |      4,837    .0529254    .2239077          0          1
provincedum7 |      4,837    .0632624    .2434594          0          1
provincedum8 |      4,837    .0756667    .2644915          0          1
-------------+---------------------------------------------------------
provincedum9 |      4,837    .0692578    .2539183          0          1
provinced~10 |      4,837    .0618152    .2408445          0          1
provinced~11 |      4,837     .130246    .3366087          0          1
provinced~12 |      4,837    .0504445     .218883          0          1
provinced~13 |      4,837    .0667769    .2496611          0          1
-------------+---------------------------------------------------------
provinced~14 |      4,837    .0274964    .1635416          0          1
provinced~15 |      4,837    .0361795    .1867557          0          1
          m1 |      4,837   -.2757319    .0699284  -.4284056  -.0389473
          m2 |      4,837    .4594164    .3457812   .0001547   2.301244
          m3 |      4,837   -.2558632    .1983774   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators, Sec Gen, Non-specified High
> eredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) Parent Edu & Specified higher education, Sec Voc + inrange(birthyear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,873
-------------+----------------------------------   F(11, 1861)     =     17.77
       Model |  75.0265277        11  6.82059343   Prob > F        =    0.0000
    Residual |  714.265268     1,861  .383807237   R-squared       =    0.0951
-------------+----------------------------------   Adj R-squared   =    0.0897
       Total |  789.291795     1,872  .421630233   Root MSE        =    .61952

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2007907   .0370843     5.41   0.000     .1280596    .2735219
           exp |   .0581519   .0297008     1.96   0.050    -.0000986    .1164023
        expsqr |  -.0020201   .0008873    -2.28   0.023    -.0037604   -.0002798
    highvocedu |   .2135417   .0465509     4.59   0.000     .1222442    .3048392
    highgenedu |   .5711752   .0862933     6.62   0.000     .4019335     .740417
      adultedu |   .3514237   .0399965     8.79   0.000     .2729811    .4298664
 parent_secedu |  -.0819752   .0334526    -2.45   0.014    -.1475838   -.0163665
parent_highedu |   .0368349   .0756788     0.49   0.627    -.1115893    .1852591
           _m1 |   .4979168   .2300073     2.16   0.031     .0468174    .9490163
           _m2 |   -1.55367   .6524634    -2.38   0.017    -2.833307   -.2740329
           _m3 |  -1.702629   .5797361    -2.94   0.003    -2.839631    -.565628
         _cons |    5.87339   .8681946     6.77   0.000     4.170652    7.576127
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.491887          .        .       .            .           .
        rho1 |   .4076514          .        .       .            .           .
        rho2 |  -1.272011          .        .       .            .           .
        rho3 |  -1.393966          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 2
> 50, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,873     8.33294    .6493306   5.521461   10.12663
        male |      1,873    .5317672    .4991231          0          1
         exp |      1,873    18.05392    6.408276          3         32
      expsqr |      1,873    366.9883    235.0513          9       1024
  highvocedu |      1,873    .1190603     .323946          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,873    .0293647    .1688715          0          1
    adultedu |      1,873    .1681794    .3741254          0          1
parent_sec~u |      1,873    .2979178    .4574653          0          1
parent_hig~u |      1,873    .0427122    .2022615          0          1
          m1 |      1,873    1.126604    .1774881   .8143778    1.98121
-------------+---------------------------------------------------------
          m2 |      1,873   -.5291805    .1438503   -.726001  -.0397592
          m3 |      1,873     -.34222    .1877157  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Specified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) Parent Edu & Specified higher education, Sec Voc + inrange(birthyear, 1971, 1992) + Pro
> vincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(mon
> thlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,873
-------------+----------------------------------   F(25, 1847)     =     12.57
       Model |   114.76434        25  4.59057358   Prob > F        =    0.0000
    Residual |  674.527456     1,847  .365201654   R-squared       =    0.1454
-------------+----------------------------------   Adj R-squared   =    0.1338
       Total |  789.291795     1,872  .421630233   Root MSE        =    .60432

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .1978047   .0377313     5.24   0.000     .1238043    .2718051
           exp |   .0668512   .0316377     2.11   0.035     .0048017    .1289006
        expsqr |  -.0019618    .000934    -2.10   0.036    -.0037937   -.0001299
    highvocedu |   .2230708   .0459049     4.86   0.000     .1330399    .3131017
    highgenedu |   .5813514   .0850962     6.83   0.000     .4144565    .7482463
      adultedu |   .3623795   .0399195     9.08   0.000     .2840874    .4406716
 parent_secedu |  -.0797089   .0329248    -2.42   0.016    -.1442827   -.0151351
parent_highedu |   .0484981   .0740413     0.66   0.513    -.0967154    .1937117
  provincedum2 |  -.3794555   .0816736    -4.65   0.000    -.5396378   -.2192732
  provincedum3 |  -.3062667   .0850276    -3.60   0.000     -.473027   -.1395064
  provincedum4 |  -.3168785   .0793913    -3.99   0.000    -.4725846   -.1611724
  provincedum5 |   .0769303   .0751185     1.02   0.306    -.0703959    .2242564
  provincedum6 |  -.0979217   .0902261    -1.09   0.278    -.2748776    .0790342
  provincedum7 |  -.1250263   .0786049    -1.59   0.112      -.27919    .0291374
  provincedum8 |  -.2586511   .0830976    -3.11   0.002    -.4216261   -.0956761
  provincedum9 |  -.0210121   .0781987    -0.27   0.788    -.1743794    .1323551
 provincedum10 |  -.1366629   .0767469    -1.78   0.075    -.2871827    .0138568
 provincedum11 |   .0922287   .0736308     1.25   0.211    -.0521796     .236637
 provincedum12 |  -.2391925   .0825929    -2.90   0.004    -.4011778   -.0772072
 provincedum13 |  -.0523539   .0813975    -0.64   0.520    -.2119946    .1072869
 provincedum14 |  -.2944672   .0890623    -3.31   0.001    -.4691406   -.1197938
 provincedum15 |  -.1419785   .0980533    -1.45   0.148    -.3342855    .0503285
           _m1 |   .5136028    .246159     2.09   0.037     .0308236    .9963819
           _m2 |  -1.593671   .7095417    -2.25   0.025    -2.985259    -.202083
           _m3 |  -1.383433   .6024671    -2.30   0.022    -2.565021   -.2018445
         _cons |   5.888799   .9292344     6.34   0.000     4.066339    7.711259
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.298315          .        .       .            .           .
        rho1 |   .4507516          .        .       .            .           .
        rho2 |  -1.398649          .        .       .            .           .
        rho3 |  -1.214138          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) 
> & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,873     8.33294    .6493306   5.521461   10.12663
        male |      1,873    .5317672    .4991231          0          1
         exp |      1,873    18.05392    6.408276          3         32
      expsqr |      1,873    366.9883    235.0513          9       1024
  highvocedu |      1,873    .1190603     .323946          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,873    .0293647    .1688715          0          1
    adultedu |      1,873    .1681794    .3741254          0          1
parent_sec~u |      1,873    .2979178    .4574653          0          1
parent_hig~u |      1,873    .0427122    .2022615          0          1
provincedum2 |      1,873    .0651361    .2468318          0          1
-------------+---------------------------------------------------------
provincedum3 |      1,873    .0448478    .2070251          0          1
provincedum4 |      1,873    .0704752    .2560145          0          1
provincedum5 |      1,873    .0758142    .2647713          0          1
provincedum6 |      1,873     .049653     .217285          0          1
provincedum7 |      1,873    .0902296    .2865869          0          1
-------------+---------------------------------------------------------
provincedum8 |      1,873    .0752803    .2639136          0          1
provincedum9 |      1,873    .0651361    .2468318          0          1
provinced~10 |      1,873    .0699413    .2551161          0          1
provinced~11 |      1,873    .1115857    .3149401          0          1
provinced~12 |      1,873    .0592632    .2361797          0          1
-------------+---------------------------------------------------------
provinced~13 |      1,873    .0667379    .2496341          0          1
provinced~14 |      1,873    .0448478    .2070251          0          1
provinced~15 |      1,873    .0298986     .170353          0          1
          m1 |      1,873    1.126604    .1774881   .8143778    1.98121
          m2 |      1,873   -.5291805    .1438503   -.726001  -.0397592
-------------+---------------------------------------------------------
          m3 |      1,873     -.34222    .1877157  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) Parent Edu & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu if i
> nrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp ex
> psqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) d
> mf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,873
-------------+----------------------------------   F(9, 1863)      =     19.78
       Model |  68.8378295         9  7.64864772   Prob > F        =    0.0000
    Residual |  720.453966     1,863  .386717105   R-squared       =    0.0872
-------------+----------------------------------   Adj R-squared   =    0.0828
       Total |  789.291795     1,872  .421630233   Root MSE        =    .62187

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2002782   .0372212     5.38   0.000     .1272786    .2732777
           exp |    .061592     .02972     2.07   0.038      .003304      .11988
        expsqr |  -.0020743    .000889    -2.33   0.020    -.0038179   -.0003307
     higheredu |   .3197241   .0321153     9.96   0.000     .2567384    .3827098
 parent_secedu |  -.0792241   .0335714    -2.36   0.018    -.1450656   -.0133825
parent_highedu |   .0492129   .0758962     0.65   0.517    -.0996376    .1980633
           _m1 |   .4874745   .2308583     2.11   0.035     .0347065    .9402426
           _m2 |  -1.472625   .6546183    -2.25   0.025    -2.756487   -.1887626
           _m3 |   -1.62156   .5815758    -2.79   0.005    -2.762169   -.4809518
         _cons |   5.912562   .8711389     6.79   0.000     4.204051    7.621073
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.396235          .        .       .            .           .
        rho1 |   .4125462          .        .       .            .           .
        rho2 |  -1.246272          .        .       .            .           .
        rho3 |  -1.372315          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu  
> m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,873     8.33294    .6493306   5.521461   10.12663
        male |      1,873    .5317672    .4991231          0          1
         exp |      1,873    18.05392    6.408276          3         32
      expsqr |      1,873    366.9883    235.0513          9       1024
   higheredu |      1,873    .3166044    .4652759          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,873    .2979178    .4574653          0          1
parent_hig~u |      1,873    .0427122    .2022615          0          1
          m1 |      1,873    1.126604    .1774881   .8143778    1.98121
          m2 |      1,873   -.5291805    .1438503   -.726001  -.0397592
          m3 |      1,873     -.34222    .1877157  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Non-specified Higheredu,) pva
> lue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) Parent Edu & Combined higher education, Sec Voc + inrange(birthyear, 1971, 1992) + Prov
> incedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu prov
> incedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 250
> 00), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative 
> ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,873
-------------+----------------------------------   F(23, 1849)     =     12.83
       Model |   108.59756        23  4.72163304   Prob > F        =    0.0000
    Residual |  680.694235     1,849  .368141826   R-squared       =    0.1376
-------------+----------------------------------   Adj R-squared   =    0.1269
       Total |  789.291795     1,872  .421630233   Root MSE        =    .60675

--------------------------------------------------------------------------------
voc_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .1967132   .0378759     5.19   0.000     .1224292    .2709972
           exp |   .0705724   .0316812     2.23   0.026     .0084377    .1327072
        expsqr |  -.0020148   .0009364    -2.15   0.032    -.0038513   -.0001783
     higheredu |   .3288329   .0321506    10.23   0.000     .2657776    .3918882
 parent_secedu |  -.0768983   .0330476    -2.33   0.020    -.1417129   -.0120837
parent_highedu |    .061674   .0742584     0.83   0.406    -.0839652    .2073132
  provincedum2 |  -.3985774   .0818644    -4.87   0.000    -.5591339   -.2380209
  provincedum3 |  -.3156677   .0852935    -3.70   0.000    -.4829494   -.1483859
  provincedum4 |  -.3370113   .0795005    -4.24   0.000    -.4929316   -.1810911
  provincedum5 |   .0556798   .0752146     0.74   0.459    -.0918347    .2031944
  provincedum6 |  -.1114403   .0905282    -1.23   0.218    -.2889885    .0661078
  provincedum7 |  -.1329334   .0787003    -1.69   0.091    -.2872841    .0214173
  provincedum8 |   -.274644   .0832992    -3.30   0.001    -.4380145   -.1112736
  provincedum9 |  -.0350499   .0784263    -0.45   0.655    -.1888633    .1187636
 provincedum10 |  -.1564134   .0769009    -2.03   0.042    -.3072351   -.0055917
 provincedum11 |   .0729289   .0737489     0.99   0.323     -.071711    .2175688
 provincedum12 |  -.2542475   .0828374    -3.07   0.002    -.4167121   -.0917828
 provincedum13 |  -.0688623   .0815745    -0.84   0.399    -.2288501    .0911255
 provincedum14 |  -.3070678   .0893316    -3.44   0.001    -.4822693   -.1318663
 provincedum15 |  -.1424494    .098446    -1.45   0.148    -.3355265    .0506277
           _m1 |   .5075725   .2471352     2.05   0.040     .0228793    .9922658
           _m2 |  -1.557034    .712193    -2.19   0.029     -2.95382   -.1602466
           _m3 |  -1.318119   .6046189    -2.18   0.029    -2.503926   -.1323113
         _cons |   5.903544   .9324507     6.33   0.000     4.074777    7.732311
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.244131          .        .       .            .           .
        rho1 |   .4550563          .        .       .            .           .
        rho2 |  -1.395934          .        .       .            .           .
        rho3 |  -1.181739          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> rovincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,873     8.33294    .6493306   5.521461   10.12663
        male |      1,873    .5317672    .4991231          0          1
         exp |      1,873    18.05392    6.408276          3         32
      expsqr |      1,873    366.9883    235.0513          9       1024
   higheredu |      1,873    .3166044    .4652759          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,873    .2979178    .4574653          0          1
parent_hig~u |      1,873    .0427122    .2022615          0          1
provincedum2 |      1,873    .0651361    .2468318          0          1
provincedum3 |      1,873    .0448478    .2070251          0          1
provincedum4 |      1,873    .0704752    .2560145          0          1
-------------+---------------------------------------------------------
provincedum5 |      1,873    .0758142    .2647713          0          1
provincedum6 |      1,873     .049653     .217285          0          1
provincedum7 |      1,873    .0902296    .2865869          0          1
provincedum8 |      1,873    .0752803    .2639136          0          1
provincedum9 |      1,873    .0651361    .2468318          0          1
-------------+---------------------------------------------------------
provinced~10 |      1,873    .0699413    .2551161          0          1
provinced~11 |      1,873    .1115857    .3149401          0          1
provinced~12 |      1,873    .0592632    .2361797          0          1
provinced~13 |      1,873    .0667379    .2496341          0          1
provinced~14 |      1,873    .0448478    .2070251          0          1
-------------+---------------------------------------------------------
provinced~15 |      1,873    .0298986     .170353          0          1
          m1 |      1,873    1.126604    .1774881   .8143778    1.98121
          m2 |      1,873   -.5291805    .1438503   -.726001  -.0397592
          m3 |      1,873     -.34222    .1877157  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Voc, Non-specified Higheredu, Prov
> ince Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) Parent Edu & Specified higher education, Sec Gen + inrange(birthyear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,851
-------------+----------------------------------   F(11, 4839)     =     52.33
       Model |  262.257617        11  23.8416016   Prob > F        =    0.0000
    Residual |  2204.84072     4,839  .455639744   R-squared       =    0.1063
-------------+----------------------------------   Adj R-squared   =    0.1043
       Total |  2467.09834     4,850  .508680069   Root MSE        =    .67501

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .2036484   .0224577     9.07   0.000     .1596212    .2476757
           exp |     .05792   .0169699     3.41   0.001     .0246514    .0911887
        expsqr |  -.0020173   .0005458    -3.70   0.000    -.0030874   -.0009472
    highvocedu |   .1849241   .0304004     6.08   0.000     .1253256    .2445227
    highgenedu |   .5285827    .029299    18.04   0.000     .4711433    .5860221
      adultedu |    .279748   .0356574     7.85   0.000     .2098434    .3496527
 parent_secedu |  -.0205452   .0222226    -0.92   0.355    -.0641117    .0230213
parent_highedu |   .0388917   .0352695     1.10   0.270    -.0302525    .1080359
           _m1 |   .5661454   .3703785     1.53   0.126    -.1599647    1.292256
           _m2 |   .0276125   .1214848     0.23   0.820    -.2105529    .2657779
           _m3 |  -.5292301   .2766154    -1.91   0.056    -1.071522    .0130617
         _cons |   7.786799    .059159   131.62   0.000      7.67082    7.902778
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .5852277          .        .       .            .           .
        rho1 |   .7400577          .        .       .            .           .
        rho2 |   .0360947          .        .       .            .           .
        rho3 |  -.6918024          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 2
> 50, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |      4,851    .5635951    .4959903          0          1
         exp |      4,851    15.23913    6.990282          0         33
      expsqr |      4,851    281.0849    234.1988          0       1089
  highvocedu |      4,851    .2459287    .4306809          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,851    .4083694    .4915828          0          1
    adultedu |      4,851    .1146155    .3185902          0          1
parent_sec~u |      4,851    .3984745    .4896346          0          1
parent_hig~u |      4,851    .1043084    .3056917          0          1
          m1 |      4,851   -.2757061    .0699263  -.4284056  -.0389473
-------------+---------------------------------------------------------
          m2 |      4,851    .4595574     .345719   .0001547   2.301244
          m3 |      4,851   -.2560021    .1984405   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Specified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) Parent Edu & Specified higher education, Sec Gen + inrange(birthyear, 1971, 1992) + Pro
> vincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(mon
> thlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,851
-------------+----------------------------------   F(25, 4825)     =     39.75
       Model |  421.310136        25  16.8524054   Prob > F        =    0.0000
    Residual |   2045.7882     4,825  .423997555   R-squared       =    0.1708
-------------+----------------------------------   Adj R-squared   =    0.1665
       Total |  2467.09834     4,850  .508680069   Root MSE        =    .65115

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .1848598   .0219916     8.41   0.000     .1417463    .2279732
           exp |   .0914201    .017392     5.26   0.000     .0573237    .1255164
        expsqr |  -.0024621   .0005504    -4.47   0.000    -.0035411    -.001383
    highvocedu |   .1776638   .0295506     6.01   0.000     .1197312    .2355964
    highgenedu |   .4897416   .0290287    16.87   0.000     .4328322    .5466511
      adultedu |   .2612063   .0347779     7.51   0.000     .1930258    .3293868
 parent_secedu |   .0032497   .0215884     0.15   0.880    -.0390735    .0455729
parent_highedu |   .0357814   .0341462     1.05   0.295    -.0311607    .1027236
  provincedum2 |  -.6251687   .0505491   -12.37   0.000    -.7242679   -.5260695
  provincedum3 |  -.2882637   .0475139    -6.07   0.000    -.3814127   -.1951148
  provincedum4 |  -.4505131    .050289    -8.96   0.000    -.5491024   -.3519238
  provincedum5 |  -.0552571    .045493    -1.21   0.225    -.1444441    .0339298
  provincedum6 |  -.3927471   .0537367    -7.31   0.000    -.4980956   -.2873986
  provincedum7 |  -.3534108   .0506715    -6.97   0.000    -.4527501   -.2540716
  provincedum8 |  -.6025641   .0499732   -12.06   0.000    -.7005343    -.504594
  provincedum9 |  -.1587586    .047011    -3.38   0.001    -.2509216   -.0665957
 provincedum10 |  -.2245669   .0491632    -4.57   0.000    -.3209491   -.1281847
 provincedum11 |  -.0955112   .0425447    -2.24   0.025    -.1789183   -.0121041
 provincedum12 |  -.2728985   .0530245    -5.15   0.000    -.3768508   -.1689463
 provincedum13 |  -.2257159   .0489171    -4.61   0.000    -.3216156   -.1298162
 provincedum14 |  -.3088842   .0664647    -4.65   0.000    -.4391853   -.1785831
 provincedum15 |  -.4480347    .057978    -7.73   0.000    -.5616981   -.3343714
           _m1 |    1.33286    .384365     3.47   0.001     .5793297    2.086391
           _m2 |   -.126102   .1229631    -1.03   0.305    -.3671657    .1149617
           _m3 |  -.2019475   .2731681    -0.74   0.460    -.7374814    .3335863
         _cons |   8.054642    .067617   119.12   0.000     7.922082    8.187202
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .8826623          .        .       .            .           .
        rho1 |    1.41869          .        .       .            .           .
        rho2 |  -.1342223          .        .       .            .           .
        rho3 |  -.2149519          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) 
> & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,851    8.498547    .7132181   5.521461   10.12663
        male |      4,851    .5635951    .4959903          0          1
         exp |      4,851    15.23913    6.990282          0         33
      expsqr |      4,851    281.0849    234.1988          0       1089
  highvocedu |      4,851    .2459287    .4306809          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,851    .4083694    .4915828          0          1
    adultedu |      4,851    .1146155    .3185902          0          1
parent_sec~u |      4,851    .3984745    .4896346          0          1
parent_hig~u |      4,851    .1043084    .3056917          0          1
provincedum2 |      4,851    .0595753    .2367228          0          1
-------------+---------------------------------------------------------
provincedum3 |      4,851    .0647289    .2460723          0          1
provincedum4 |      4,851    .0589569    .2355683          0          1
provincedum5 |      4,851    .0797774    .2709762          0          1
provincedum6 |      4,851    .0529788    .2240142          0          1
provincedum7 |      4,851    .0632859    .2435016          0          1
-------------+---------------------------------------------------------
provincedum8 |      4,851    .0754484    .2641407          0          1
provincedum9 |      4,851    .0696764     .254627          0          1
provinced~10 |      4,851    .0616368    .2405195          0          1
provinced~11 |      4,851    .1304886    .3368749          0          1
provinced~12 |      4,851    .0505051    .2190073          0          1
-------------+---------------------------------------------------------
provinced~13 |      4,851    .0665842    .2493262          0          1
provinced~14 |      4,851     .027417    .1633121          0          1
provinced~15 |      4,851     .036075    .1864961          0          1
          m1 |      4,851   -.2757061    .0699263  -.4284056  -.0389473
          m2 |      4,851    .4595574     .345719   .0001547   2.301244
-------------+---------------------------------------------------------
          m3 |      4,851   -.2560021    .1984405   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) Parent Edu & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu if i
> nrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp ex
> psqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) d
> mf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,851
-------------+----------------------------------   F(9, 4841)      =     40.32
       Model |  172.047046         9  19.1163385   Prob > F        =    0.0000
    Residual |  2295.05129     4,841  .474086199   R-squared       =    0.0697
-------------+----------------------------------   Adj R-squared   =    0.0680
       Total |  2467.09834     4,850  .508680069   Root MSE        =    .68854

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .1959743   .0228732     8.57   0.000     .1511325    .2408162
           exp |   .0639363   .0173003     3.70   0.000     .0300197    .0978528
        expsqr |   -.002165   .0005566    -3.89   0.000    -.0032561   -.0010739
     higheredu |   .3492881   .0264714    13.19   0.000      .297392    .4011842
 parent_secedu |  -.0087419   .0226518    -0.39   0.700    -.0531497     .035666
parent_highedu |   .0900665    .035784     2.52   0.012     .0199135    .1602194
           _m1 |   .8219859   .3773348     2.18   0.029     .0822384    1.561733
           _m2 |   .0186516   .1238792     0.15   0.880    -.2242078     .261511
           _m3 |  -.4210975   .2815109    -1.50   0.135    -.9729867    .1307917
         _cons |   7.858088   .0598118   131.38   0.000      7.74083    7.975347
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .6752119          .        .       .            .           .
        rho1 |   1.000332          .        .       .            .           .
        rho2 |   .0226985          .        .       .            .           .
        rho3 |  -.5124631          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu  
> m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu m1 m2 m3 
> if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,851    8.498547    .7132181   5.521461   10.12663
        male |      4,851    .5635951    .4959903          0          1
         exp |      4,851    15.23913    6.990282          0         33
      expsqr |      4,851    281.0849    234.1988          0       1089
   higheredu |      4,851    .7689136     .421571          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,851    .3984745    .4896346          0          1
parent_hig~u |      4,851    .1043084    .3056917          0          1
          m1 |      4,851   -.2757061    .0699263  -.4284056  -.0389473
          m2 |      4,851    .4595574     .345719   .0001547   2.301244
          m3 |      4,851   -.2560021    .1984405   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Non-specified Higheredu,) pva
> lue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) Parent Edu & Combined higher education, Sec Gen + inrange(birthyear, 1971, 1992) + Prov
> incedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu prov
> incedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 250
> 00), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative 
> ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,851
-------------+----------------------------------   F(23, 4827)     =     34.52
       Model |  348.514949        23  15.1528239   Prob > F        =    0.0000
    Residual |  2118.58339     4,827  .438902711   R-squared       =    0.1413
-------------+----------------------------------   Adj R-squared   =    0.1372
       Total |  2467.09834     4,850  .508680069   Root MSE        =     .6625

--------------------------------------------------------------------------------
gen_log_mont~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          male |   .1752279   .0223376     7.84   0.000     .1314359    .2190198
           exp |   .1025976     .01767     5.81   0.000     .0679564    .1372387
        expsqr |  -.0026953   .0005596    -4.82   0.000    -.0037924   -.0015982
     higheredu |   .3180157   .0259735    12.24   0.000     .2670959    .3689355
 parent_secedu |   .0139619   .0219486     0.64   0.525    -.0290673    .0569911
parent_highedu |   .0773769   .0345897     2.24   0.025     .0095653    .1451885
  provincedum2 |  -.6954738   .0511283   -13.60   0.000    -.7957086   -.5952391
  provincedum3 |  -.3217143   .0482707    -6.66   0.000    -.4163469   -.2270817
  provincedum4 |  -.4777716   .0511189    -9.35   0.000    -.5779878   -.3775553
  provincedum5 |  -.0830047   .0462076    -1.80   0.073    -.1735926    .0075833
  provincedum6 |  -.4510189   .0544718    -8.28   0.000    -.5578085   -.3442293
  provincedum7 |  -.4087431   .0513492    -7.96   0.000    -.5094109   -.3080753
  provincedum8 |  -.6731231    .050538   -13.32   0.000    -.7722006   -.5740456
  provincedum9 |  -.2037571    .047666    -4.27   0.000    -.2972041   -.1103101
 provincedum10 |  -.2884819   .0497633    -5.80   0.000    -.3860406   -.1909232
 provincedum11 |  -.1528284   .0430455    -3.55   0.000    -.2372171   -.0684397
 provincedum12 |  -.3253537   .0537934    -6.05   0.000    -.4308133   -.2198941
 provincedum13 |  -.2849232   .0495539    -5.75   0.000    -.3820714    -.187775
 provincedum14 |  -.3501974   .0675324    -5.19   0.000    -.4825916   -.2178031
 provincedum15 |  -.4576002   .0589656    -7.76   0.000    -.5731996   -.3420008
           _m1 |    1.70851   .3899633     4.38   0.000     .9440047    2.473016
           _m2 |  -.1758531   .1249954    -1.41   0.160    -.4209009    .0691948
           _m3 |  -.0925149   .2772993    -0.33   0.739     -.636148    .4511181
         _cons |   8.174953   .0679816   120.25   0.000     8.041678    8.308228
--------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.185294          .        .       .            .           .
        rho1 |   1.569295          .        .       .            .           .
        rho2 |   -.161524          .        .       .            .           .
        rho3 |  -.0849765          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> rovincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearn
> ing, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu provinced
> um2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,851    8.498547    .7132181   5.521461   10.12663
        male |      4,851    .5635951    .4959903          0          1
         exp |      4,851    15.23913    6.990282          0         33
      expsqr |      4,851    281.0849    234.1988          0       1089
   higheredu |      4,851    .7689136     .421571          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,851    .3984745    .4896346          0          1
parent_hig~u |      4,851    .1043084    .3056917          0          1
provincedum2 |      4,851    .0595753    .2367228          0          1
provincedum3 |      4,851    .0647289    .2460723          0          1
provincedum4 |      4,851    .0589569    .2355683          0          1
-------------+---------------------------------------------------------
provincedum5 |      4,851    .0797774    .2709762          0          1
provincedum6 |      4,851    .0529788    .2240142          0          1
provincedum7 |      4,851    .0632859    .2435016          0          1
provincedum8 |      4,851    .0754484    .2641407          0          1
provincedum9 |      4,851    .0696764     .254627          0          1
-------------+---------------------------------------------------------
provinced~10 |      4,851    .0616368    .2405195          0          1
provinced~11 |      4,851    .1304886    .3368749          0          1
provinced~12 |      4,851    .0505051    .2190073          0          1
provinced~13 |      4,851    .0665842    .2493262          0          1
provinced~14 |      4,851     .027417    .1633121          0          1
-------------+---------------------------------------------------------
provinced~15 |      4,851     .036075    .1864961          0          1
          m1 |      4,851   -.2757061    .0699263  -.4284056  -.0389473
          m2 |      4,851    .4595574     .345719   .0001547   2.301244
          m3 |      4,851   -.2560021    .1984405   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Parent Edu, Sec Gen, Non-specified Higheredu, Prov
> ince Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) Parent Party Membership & Specified higher education, Sec Voc + inrange(birthyear, 1971
> , 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=
> male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_
> relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,876
-------------+----------------------------------   F(10, 1865)     =     18.57
       Model |  71.0693913        10  7.10693913   Prob > F        =    0.0000
    Residual |  713.825999     1,865  .382748525   R-squared       =    0.0905
-------------+----------------------------------   Adj R-squared   =    0.0857
       Total |   784.89539     1,875  .418610875   Root MSE        =    .61867

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1924076   .0368227     5.23   0.000     .1201895    .2646257
               exp |   .0575039   .0294893     1.95   0.051    -.0003315    .1153394
            expsqr |  -.0019452   .0008806    -2.21   0.027    -.0036723   -.0002181
        highvocedu |   .2055219   .0464786     4.42   0.000     .1143664    .2966774
        highgenedu |   .5609933   .0858621     6.53   0.000     .3925975    .7293891
          adultedu |   .3484157    .039864     8.74   0.000      .270233    .4265985
parent_partymember |    -.04971   .0358833    -1.39   0.166    -.1200857    .0206657
               _m1 |   .4907922    .228246     2.15   0.032     .0431478    .9384366
               _m2 |  -1.517056   .6504376    -2.33   0.020    -2.792719   -.2413941
               _m3 |  -1.643235   .5784108    -2.84   0.005    -2.777635   -.5088343
             _cons |   5.899872   .8632081     6.83   0.000     4.206916    7.592827
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.427644          .        .       .            .           .
        rho1 |   .4107596          .        .       .            .           .
        rho2 |  -1.269673          .        .       .            .           .
        rho3 |  -1.375276          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,876    8.333664    .6470014   5.521461   10.12663
        male |      1,876    .5319829    .4991091          0          1
         exp |      1,876     18.0661    6.409901          3         32
      expsqr |      1,876    367.4488    235.3005          9       1024
  highvocedu |      1,876    .1178038    .3224617          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,876    .0293177    .1687405          0          1
    adultedu |      1,876    .1684435    .3743594          0          1
parent_par~r |      1,876     .206823    .4051355          0          1
          m1 |      1,876      1.1271    .1778646   .8143778    1.98121
          m2 |      1,876   -.5291116    .1439815   -.726001  -.0397592
-------------+---------------------------------------------------------
          m3 |      1,876   -.3422591    .1880328  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Specified Higher
> edu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) Parent Party Membership & Specified higher education, Sec Voc + inrange(birthyear, 1971
> , 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearnin
> g, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,876
-------------+----------------------------------   F(24, 1851)     =     12.62
       Model |  110.402479        24  4.60010331   Prob > F        =    0.0000
    Residual |  674.492911     1,851  .364393793   R-squared       =    0.1407
-------------+----------------------------------   Adj R-squared   =    0.1295
       Total |   784.89539     1,875  .418610875   Root MSE        =    .60365

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1923019    .037483     5.13   0.000     .1187886    .2658152
               exp |   .0645267   .0313867     2.06   0.040     .0029697    .1260837
            expsqr |  -.0018338   .0009265    -1.98   0.048     -.003651   -.0000167
        highvocedu |   .2149421   .0458484     4.69   0.000     .1250221     .304862
        highgenedu |   .5720645   .0846194     6.76   0.000      .406105     .738024
          adultedu |   .3577903   .0397807     8.99   0.000     .2797705      .43581
parent_partymember |  -.0398578     .03528    -1.13   0.259    -.1090506     .029335
      provincedum2 |  -.3913368   .0816033    -4.80   0.000    -.5513811   -.2312926
      provincedum3 |  -.3104482   .0850075    -3.65   0.000    -.4771689   -.1437275
      provincedum4 |  -.3233486   .0793626    -4.07   0.000    -.4789982    -.167699
      provincedum5 |   .0730537   .0752968     0.97   0.332     -.074622    .2207293
      provincedum6 |  -.1253583   .0900609    -1.39   0.164      -.30199    .0512734
      provincedum7 |  -.1256966   .0785783    -1.60   0.110     -.279808    .0284149
      provincedum8 |  -.2652219   .0829239    -3.20   0.001    -.4278561   -.1025876
      provincedum9 |  -.0262421   .0780543    -0.34   0.737    -.1793258    .1268416
     provincedum10 |   -.137237   .0766089    -1.79   0.073     -.287486    .0130119
     provincedum11 |   .0838332   .0735763     1.14   0.255    -.0604681    .2281345
     provincedum12 |  -.2332056   .0824278    -2.83   0.005    -.3948668   -.0715443
     provincedum13 |   -.041943   .0809834    -0.52   0.605    -.2007715    .1168855
     provincedum14 |  -.2643476   .0892035    -2.96   0.003    -.4392976   -.0893976
     provincedum15 |  -.1457468   .0979037    -1.49   0.137    -.3377601    .0462666
               _m1 |   .4919211   .2442867     2.01   0.044     .0128148    .9710275
               _m2 |  -1.558584   .7073671    -2.20   0.028    -2.945905    -.171263
               _m3 |  -1.316215   .6010694    -2.19   0.029     -2.49506   -.1373696
             _cons |   5.944288   .9239337     6.43   0.000     4.132226    7.756349
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.229641          .        .       .            .           .
        rho1 |   .4436151          .        .       .            .           .
        rho2 |  -1.405533          .        .       .            .           .
        rho3 |  -1.186964          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(
> monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,876    8.333664    .6470014   5.521461   10.12663
        male |      1,876    .5319829    .4991091          0          1
         exp |      1,876     18.0661    6.409901          3         32
      expsqr |      1,876    367.4488    235.3005          9       1024
  highvocedu |      1,876    .1178038    .3224617          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,876    .0293177    .1687405          0          1
    adultedu |      1,876    .1684435    .3743594          0          1
parent_par~r |      1,876     .206823    .4051355          0          1
provincedum2 |      1,876     .065032     .246648          0          1
provincedum3 |      1,876    .0447761    .2068672          0          1
-------------+---------------------------------------------------------
provincedum4 |      1,876    .0703625    .2558251          0          1
provincedum5 |      1,876    .0751599    .2637195          0          1
provincedum6 |      1,876    .0495736    .2171201          0          1
provincedum7 |      1,876    .0895522    .2856153          0          1
provincedum8 |      1,876    .0751599    .2637195          0          1
-------------+---------------------------------------------------------
provincedum9 |      1,876     .065032     .246648          0          1
provinced~10 |      1,876    .0698294    .2549273          0          1
provinced~11 |      1,876    .1130064     .316685          0          1
provinced~12 |      1,876    .0591684    .2360026          0          1
provinced~13 |      1,876    .0682303    .2522079          0          1
-------------+---------------------------------------------------------
provinced~14 |      1,876    .0442431    .2056895          0          1
provinced~15 |      1,876    .0298507    .1702208          0          1
          m1 |      1,876      1.1271    .1778646   .8143778    1.98121
          m2 |      1,876   -.5291116    .1439815   -.726001  -.0397592
          m3 |      1,876   -.3422591    .1880328  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Specified Higher
> edu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) Parent Party Membership & Combined higher education, Sec Voc + inrange(birthyear, 1971,
>  1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_partymember if inrange(bir
> thyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_
> secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) show
> mlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,876
-------------+----------------------------------   F(8, 1867)      =     21.02
       Model |  64.8564374         8  8.10705467   Prob > F        =    0.0000
    Residual |  720.038953     1,867  .385666284   R-squared       =    0.0826
-------------+----------------------------------   Adj R-squared   =    0.0787
       Total |   784.89539     1,875  .418610875   Root MSE        =    .62102

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1916454   .0369582     5.19   0.000     .1191616    .2641291
               exp |   .0607883   .0295107     2.06   0.040     .0029108    .1186657
            expsqr |  -.0019966   .0008823    -2.26   0.024     -.003727   -.0002663
         higheredu |   .3148135   .0319146     9.86   0.000     .2522214    .3774055
parent_partymember |  -.0425485   .0359561    -1.18   0.237    -.1130669    .0279699
               _m1 |   .4803005    .229092     2.10   0.036     .0309972    .9296037
               _m2 |  -1.444779   .6526576    -2.21   0.027    -2.724794   -.1647638
               _m3 |  -1.568694   .5803074    -2.70   0.007    -2.706814   -.4305749
             _cons |   5.933926   .8661122     6.85   0.000     4.235276    7.632576
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.343138          .        .       .            .           .
        rho1 |   .4144315          .        .       .            .           .
        rho2 |   -1.24664          .        .       .            .           .
        rho3 |  -1.353562          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_partymember  m1 m2 m3 i
> f inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_partymember m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,876    8.333664    .6470014   5.521461   10.12663
        male |      1,876    .5319829    .4991091          0          1
         exp |      1,876     18.0661    6.409901          3         32
      expsqr |      1,876    367.4488    235.3005          9       1024
   higheredu |      1,876     .315565    .4648644          0          1
-------------+---------------------------------------------------------
parent_par~r |      1,876     .206823    .4051355          0          1
          m1 |      1,876      1.1271    .1778646   .8143778    1.98121
          m2 |      1,876   -.5291116    .1439815   -.726001  -.0397592
          m3 |      1,876   -.3422591    .1880328  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Non-specified Hi
> gheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) Parent Party Membership & Combined higher education, Sec Voc + inrange(birthyear, 1971,
>  1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_partymember provincedum2-p
> rovincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,876
-------------+----------------------------------   F(22, 1853)     =     12.89
       Model |  104.205781        22  4.73662643   Prob > F        =    0.0000
    Residual |  680.689609     1,853  .367344635   R-squared       =    0.1328
-------------+----------------------------------   Adj R-squared   =    0.1225
       Total |   784.89539     1,875  .418610875   Root MSE        =    .60609

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1910693   .0376264     5.08   0.000     .1172746    .2648639
               exp |   .0678923   .0314333     2.16   0.031     .0062438    .1295408
            expsqr |  -.0018791   .0009289    -2.02   0.043    -.0037009   -.0000573
         higheredu |   .3233304    .031954    10.12   0.000     .2606608        .386
parent_partymember |  -.0335861   .0353751    -0.95   0.343    -.1029654    .0357932
      provincedum2 |  -.4091961   .0818148    -5.00   0.000    -.5696551   -.2487372
      provincedum3 |  -.3211815   .0852652    -3.77   0.000    -.4884074   -.1539556
      provincedum4 |  -.3412148   .0795204    -4.29   0.000    -.4971737   -.1852559
      provincedum5 |    .052336    .075412     0.69   0.488    -.0955654    .2002373
      provincedum6 |  -.1373085    .090378    -1.52   0.129    -.3145619     .039945
      provincedum7 |  -.1331579   .0786967    -1.69   0.091    -.2875013    .0211856
      provincedum8 |  -.2805794   .0831369    -3.37   0.001    -.4436313   -.1175275
      provincedum9 |  -.0391416   .0782946    -0.50   0.617    -.1926965    .1144132
     provincedum10 |  -.1565766   .0767714    -2.04   0.042    -.3071441   -.0060091
     provincedum11 |   .0654156   .0737192     0.89   0.375    -.0791659    .2099971
     provincedum12 |  -.2480856   .0826784    -3.00   0.003    -.4102381   -.0859331
     provincedum13 |  -.0580785   .0811743    -0.72   0.474    -.2172813    .1011242
     provincedum14 |   -.276293   .0894757    -3.09   0.002    -.4517768   -.1008092
     provincedum15 |  -.1458851   .0982983    -1.48   0.138    -.3386721    .0469018
               _m1 |   .4846221   .2452573     1.98   0.048     .0036123    .9656318
               _m2 |  -1.525008   .7100274    -2.15   0.032    -2.917546   -.1324703
               _m3 |  -1.254431   .6032421    -2.08   0.038    -2.437537    -.071326
             _cons |   5.960586   .9271256     6.43   0.000     4.142266    7.778907
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.180401          .        .       .            .           .
        rho1 |   .4460549          .        .       .            .           .
        rho2 |  -1.403645          .        .       .            .           .
        rho3 |  -1.154601          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum
> 2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 
> 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum2-provin
> cedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,876    8.333664    .6470014   5.521461   10.12663
        male |      1,876    .5319829    .4991091          0          1
         exp |      1,876     18.0661    6.409901          3         32
      expsqr |      1,876    367.4488    235.3005          9       1024
   higheredu |      1,876     .315565    .4648644          0          1
-------------+---------------------------------------------------------
parent_par~r |      1,876     .206823    .4051355          0          1
provincedum2 |      1,876     .065032     .246648          0          1
provincedum3 |      1,876    .0447761    .2068672          0          1
provincedum4 |      1,876    .0703625    .2558251          0          1
provincedum5 |      1,876    .0751599    .2637195          0          1
-------------+---------------------------------------------------------
provincedum6 |      1,876    .0495736    .2171201          0          1
provincedum7 |      1,876    .0895522    .2856153          0          1
provincedum8 |      1,876    .0751599    .2637195          0          1
provincedum9 |      1,876     .065032     .246648          0          1
provinced~10 |      1,876    .0698294    .2549273          0          1
-------------+---------------------------------------------------------
provinced~11 |      1,876    .1130064     .316685          0          1
provinced~12 |      1,876    .0591684    .2360026          0          1
provinced~13 |      1,876    .0682303    .2522079          0          1
provinced~14 |      1,876    .0442431    .2056895          0          1
provinced~15 |      1,876    .0298507    .1702208          0          1
-------------+---------------------------------------------------------
          m1 |      1,876      1.1271    .1778646   .8143778    1.98121
          m2 |      1,876   -.5291116    .1439815   -.726001  -.0397592
          m3 |      1,876   -.3422591    .1880328  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Voc, Non-specified Hi
> gheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) Parent Party Membership & Specified higher education, Sec Gen + inrange(birthyear, 1971
> , 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=
> male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_
> relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,848
-------------+----------------------------------   F(10, 4837)     =     57.27
       Model |  260.364837        10  26.0364837   Prob > F        =    0.0000
    Residual |  2198.95347     4,837  .454611014   R-squared       =    0.1059
-------------+----------------------------------   Adj R-squared   =    0.1040
       Total |  2459.31831     4,847   .50738979   Root MSE        =    .67425

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2065944   .0224181     9.22   0.000     .1626447    .2505441
               exp |   .0567896   .0169322     3.35   0.001     .0235948    .0899845
            expsqr |  -.0019633   .0005447    -3.60   0.000    -.0030311   -.0008956
        highvocedu |   .1851424   .0303689     6.10   0.000     .1256056    .2446792
        highgenedu |   .5299725   .0291428    18.19   0.000     .4728394    .5871056
          adultedu |   .2802934   .0356618     7.86   0.000       .21038    .3502068
parent_partymember |  -.0126092   .0225779    -0.56   0.577    -.0568721    .0316537
               _m1 |   .5442463    .369264     1.47   0.141    -.1796791    1.268172
               _m2 |   .0241717   .1212868     0.20   0.842    -.2136056     .261949
               _m3 |  -.5198413   .2760231    -1.88   0.060    -1.060972    .0212895
             _cons |   7.784505     .05861   132.82   0.000     7.669603    7.899407
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .5763342          .        .       .            .           .
        rho1 |   .7168995          .        .       .            .           .
        rho2 |   .0318398          .        .       .            .           .
        rho3 |  -.6847524          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |      4,848    .5633251    .4960249          0          1
         exp |      4,848    15.23123    6.985171          0         33
      expsqr |      4,848    280.7729    233.9759          0       1089
  highvocedu |      4,848    .2469059     .431256          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,848    .4080033    .4915144          0          1
    adultedu |      4,848    .1146865    .3186761          0          1
parent_par~r |      4,848    .2547442    .4357623          0          1
          m1 |      4,848    -.275734    .0699869  -.4284056  -.0389473
          m2 |      4,848    .4593262    .3458069   .0001547   2.301244
-------------+---------------------------------------------------------
          m3 |      4,848   -.2557728    .1983703   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Specified Higher
> edu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) Parent Party Membership & Specified higher education, Sec Gen + inrange(birthyear, 1971
> , 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_party
> member provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearnin
> g, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,848
-------------+----------------------------------   F(24, 4823)     =     41.46
       Model |  420.643019        24  17.5267925   Prob > F        =    0.0000
    Residual |  2038.67529     4,823  .422698588   R-squared       =    0.1710
-------------+----------------------------------   Adj R-squared   =    0.1669
       Total |  2459.31831     4,847   .50738979   Root MSE        =    .65015

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1873804   .0219478     8.54   0.000     .1443527    .2304081
               exp |   .0905313   .0173646     5.21   0.000     .0564887    .1245739
            expsqr |  -.0024184   .0005495    -4.40   0.000    -.0034956   -.0013412
        highvocedu |   .1781834    .029515     6.04   0.000     .1203206    .2360462
        highgenedu |   .4914704   .0289143    17.00   0.000     .4347852    .5481556
          adultedu |   .2620608    .034785     7.53   0.000     .1938664    .3302553
parent_partymember |   .0060833   .0218451     0.28   0.781    -.0367429    .0489096
      provincedum2 |  -.6292442   .0503328   -12.50   0.000    -.7279195   -.5305689
      provincedum3 |  -.2857197   .0472799    -6.04   0.000    -.3784099   -.1930295
      provincedum4 |  -.4554326   .0502131    -9.07   0.000    -.5538733    -.356992
      provincedum5 |  -.0603938   .0454689    -1.33   0.184    -.1495336     .028746
      provincedum6 |  -.4028507   .0536162    -7.51   0.000    -.5079629   -.2977385
      provincedum7 |  -.3542829   .0504669    -7.02   0.000    -.4532211   -.2553448
      provincedum8 |  -.6079701   .0497349   -12.22   0.000    -.7054731    -.510467
      provincedum9 |   -.159474   .0469298    -3.40   0.001    -.2514778   -.0674702
     provincedum10 |  -.2288492   .0490092    -4.67   0.000    -.3249295   -.1327688
     provincedum11 |  -.0997594   .0423962    -2.35   0.019    -.1828753   -.0166435
     provincedum12 |  -.2709003   .0529279    -5.12   0.000    -.3746631   -.1671375
     provincedum13 |  -.2320824   .0487081    -4.76   0.000    -.3275725   -.1365923
     provincedum14 |  -.3131123   .0663144    -4.72   0.000    -.4431188   -.1831058
     provincedum15 |  -.4502108   .0577832    -7.79   0.000    -.5634922   -.3369293
               _m1 |   1.320826   .3834351     3.44   0.001     .5691184    2.072534
               _m2 |   -.133385   .1227337    -1.09   0.277     -.373999    .1072291
               _m3 |  -.1915554   .2725415    -0.70   0.482    -.7258611    .3427503
             _cons |   8.064044   .0668493   120.63   0.000     7.932989    8.195099
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .8732561          .        .       .            .           .
        rho1 |   1.413432          .        .       .            .           .
        rho2 |  -.1427368          .        .       .            .           .
        rho3 |  -.2049857          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_pa
> rtymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(
> monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_partymembe
> r provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,848    8.499482     .712313   5.521461   10.12663
        male |      4,848    .5633251    .4960249          0          1
         exp |      4,848    15.23123    6.985171          0         33
      expsqr |      4,848    280.7729    233.9759          0       1089
  highvocedu |      4,848    .2469059     .431256          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,848    .4080033    .4915144          0          1
    adultedu |      4,848    .1146865    .3186761          0          1
parent_par~r |      4,848    .2547442    .4357623          0          1
provincedum2 |      4,848    .0598185    .2371747          0          1
provincedum3 |      4,848    .0653878    .2472344          0          1
-------------+---------------------------------------------------------
provincedum4 |      4,848    .0587871    .2352501          0          1
provincedum5 |      4,848    .0792079    .2700909          0          1
provincedum6 |      4,848    .0528053    .2236676          0          1
provincedum7 |      4,848    .0635314    .2439414          0          1
provincedum8 |      4,848     .075495    .2642157          0          1
-------------+---------------------------------------------------------
provincedum9 |      4,848    .0693069    .2540016          0          1
provinced~10 |      4,848    .0616749     .240589          0          1
provinced~11 |      4,848    .1301568    .3365105          0          1
provinced~12 |      4,848      .05033    .2186476          0          1
provinced~13 |      4,848    .0666254    .2493979          0          1
-------------+---------------------------------------------------------
provinced~14 |      4,848     .027434    .1633612          0          1
provinced~15 |      4,848    .0360974    .1865517          0          1
          m1 |      4,848    -.275734    .0699869  -.4284056  -.0389473
          m2 |      4,848    .4593262    .3458069   .0001547   2.301244
          m3 |      4,848   -.2557728    .1983703   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Specified Higher
> edu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) Parent Party Membership & Combined higher education, Sec Gen + inrange(birthyear, 1971,
>  1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_partymember if inrange(bir
> thyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_
> secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) show
> mlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,848
-------------+----------------------------------   F(8, 4839)      =     44.45
       Model |  168.361597         8  21.0451997   Prob > F        =    0.0000
    Residual |  2290.95671     4,839  .473435981   R-squared       =    0.0685
-------------+----------------------------------   Adj R-squared   =    0.0669
       Total |  2459.31831     4,847   .50738979   Root MSE        =    .68807

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1986699   .0228418     8.70   0.000     .1538896    .2434502
               exp |   .0619514   .0172707     3.59   0.000     .0280929    .0958098
            expsqr |  -.0021019   .0005556    -3.78   0.000    -.0031911   -.0010126
         higheredu |   .3522906   .0264425    13.32   0.000     .3004513    .4041299
parent_partymember |   .0126019    .022968     0.55   0.583    -.0324257    .0576296
               _m1 |   .7993051   .3763683     2.12   0.034     .0614522    1.537158
               _m2 |   .0162328   .1237249     0.13   0.896    -.2263241    .2587898
               _m3 |  -.4130754    .280994    -1.47   0.142    -.9639513    .1378005
             _cons |   7.867078    .059213   132.86   0.000     7.750994    7.983162
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .6641476          .        .       .            .           .
        rho1 |   .9807996          .        .       .            .           .
        rho2 |   .0199188          .        .       .            .           .
        rho3 |  -.5068705          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_partymember  m1 m2 m3 i
> f inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_partymember m1 m2 m3 if e(sampl
> e)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,848    8.499482     .712313   5.521461   10.12663
        male |      4,848    .5633251    .4960249          0          1
         exp |      4,848    15.23123    6.985171          0         33
      expsqr |      4,848    280.7729    233.9759          0       1089
   higheredu |      4,848    .7695957    .4211351          0          1
-------------+---------------------------------------------------------
parent_par~r |      4,848    .2547442    .4357623          0          1
          m1 |      4,848    -.275734    .0699869  -.4284056  -.0389473
          m2 |      4,848    .4593262    .3458069   .0001547   2.301244
          m3 |      4,848   -.2557728    .1983703   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Non-specified Hi
> gheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) Parent Party Membership & Combined higher education, Sec Gen + inrange(birthyear, 1971,
>  1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_partymember provincedum2-p
> rovincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,848
-------------+----------------------------------   F(22, 4825)     =     35.97
       Model |  346.496786        22  15.7498539   Prob > F        =    0.0000
    Residual |  2112.82153     4,825  .437890472   R-squared       =    0.1409
-------------+----------------------------------   Adj R-squared   =    0.1370
       Total |  2459.31831     4,847   .50738979   Root MSE        =    .66173

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1773672   .0222997     7.95   0.000     .1336496    .2210847
               exp |   .1012905   .0176501     5.74   0.000     .0666882    .1358927
            expsqr |    -.00265   .0005589    -4.74   0.000    -.0037456   -.0015544
         higheredu |   .3203419   .0259618    12.34   0.000      .269445    .3712388
parent_partymember |   .0280929   .0221682     1.27   0.205    -.0153669    .0715527
      provincedum2 |  -.7022545   .0509105   -13.79   0.000    -.8020622   -.6024467
      provincedum3 |   -.319477   .0480499    -6.65   0.000    -.4136767   -.2252772
      provincedum4 |  -.4831737   .0510599    -9.46   0.000    -.5832743   -.3830731
      provincedum5 |  -.0886902   .0461983    -1.92   0.055    -.1792599    .0018795
      provincedum6 |  -.4642796   .0543507    -8.54   0.000    -.5708316   -.3577275
      provincedum7 |  -.4126088   .0511402    -8.07   0.000     -.512867   -.3123506
      provincedum8 |  -.6799909   .0503056   -13.52   0.000    -.7786128    -.581369
      provincedum9 |  -.2072406   .0475859    -4.36   0.000    -.3005307   -.1139505
     provincedum10 |  -.2948901   .0496123    -5.94   0.000    -.3921529   -.1976274
     provincedum11 |  -.1603301   .0428852    -3.74   0.000    -.2444047   -.0762556
     provincedum12 |  -.3254965   .0537054    -6.06   0.000    -.4307836   -.2202095
     provincedum13 |  -.2958044   .0493296    -6.00   0.000    -.3925129    -.199096
     provincedum14 |  -.3552201   .0674051    -5.27   0.000    -.4873649   -.2230754
     provincedum15 |  -.4598683   .0587881    -7.82   0.000    -.5751198   -.3446168
               _m1 |   1.702659   .3891405     4.38   0.000     .9397662    2.465552
               _m2 |  -.1851218   .1247947    -1.48   0.138    -.4297762    .0595326
               _m3 |  -.0846278   .2767304    -0.31   0.760    -.6271455    .4578899
             _cons |   8.196262   .0671119   122.13   0.000     8.064692    8.327832
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.180134          .        .       .            .           .
        rho1 |   1.567336          .        .       .            .           .
        rho2 |  -.1704088          .        .       .            .           .
        rho3 |  -.0779018          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum
> 2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 
> 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_partymember provincedum2-provin
> cedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,848    8.499482     .712313   5.521461   10.12663
        male |      4,848    .5633251    .4960249          0          1
         exp |      4,848    15.23123    6.985171          0         33
      expsqr |      4,848    280.7729    233.9759          0       1089
   higheredu |      4,848    .7695957    .4211351          0          1
-------------+---------------------------------------------------------
parent_par~r |      4,848    .2547442    .4357623          0          1
provincedum2 |      4,848    .0598185    .2371747          0          1
provincedum3 |      4,848    .0653878    .2472344          0          1
provincedum4 |      4,848    .0587871    .2352501          0          1
provincedum5 |      4,848    .0792079    .2700909          0          1
-------------+---------------------------------------------------------
provincedum6 |      4,848    .0528053    .2236676          0          1
provincedum7 |      4,848    .0635314    .2439414          0          1
provincedum8 |      4,848     .075495    .2642157          0          1
provincedum9 |      4,848    .0693069    .2540016          0          1
provinced~10 |      4,848    .0616749     .240589          0          1
-------------+---------------------------------------------------------
provinced~11 |      4,848    .1301568    .3365105          0          1
provinced~12 |      4,848      .05033    .2186476          0          1
provinced~13 |      4,848    .0666254    .2493979          0          1
provinced~14 |      4,848     .027434    .1633612          0          1
provinced~15 |      4,848    .0360974    .1865517          0          1
-------------+---------------------------------------------------------
          m1 |      4,848    -.275734    .0699869  -.4284056  -.0389473
          m2 |      4,848    .4593262    .3458069   .0001547   2.301244
          m3 |      4,848   -.2557728    .1983703   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(Parent Party Membership, Sec Gen, Non-specified Hi
> gheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *1) All Parent Indicators & Keyschool & Specified higher education, Sec Voc + inrange(birth
> year, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(m
> onthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_hi
> ghedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(13, 1851)     =     14.86
       Model |  73.6109548        13  5.66238114   Prob > F        =    0.0000
    Residual |  705.356256     1,851  .381067669   R-squared       =    0.0945
-------------+----------------------------------   Adj R-squared   =    0.0881
       Total |  778.967211     1,864  .417900864   Root MSE        =    .61731

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2013062   .0370032     5.44   0.000     .1287339    .2738785
               exp |   .0524008   .0296677     1.77   0.078    -.0057849    .1105865
            expsqr |  -.0018198   .0008861    -2.05   0.040    -.0035576    -.000082
        highvocedu |   .2209159   .0470167     4.70   0.000     .1287046    .3131272
        highgenedu |   .5782495   .0862056     6.71   0.000      .409179      .74732
          adultedu |   .3580958   .0402733     8.89   0.000       .27911    .4370816
     parent_secedu |  -.0782113   .0343431    -2.28   0.023    -.1455666   -.0108561
    parent_highedu |   .0446082   .0761517     0.59   0.558     -.104744    .1939604
parent_partymember |   -.032573   .0377555    -0.86   0.388    -.1066209     .041475
         Keyschool |   .0858255   .0711774     1.21   0.228    -.0537709    .2254218
               _m1 |   .4298959   .2300287     1.87   0.062    -.0212471    .8810388
               _m2 |  -1.394493    .651506    -2.14   0.032    -2.672257   -.1167291
               _m3 |  -1.567042   .5786109    -2.71   0.007    -2.701841   -.4322439
             _cons |   6.110911   .8671132     7.05   0.000     4.410288    7.811534
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    1.28838          .        .       .            .           .
        rho1 |   .3787402          .        .       .            .           .
        rho2 |  -1.228554          .        .       .            .           .
        rho3 |  -1.380571          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
  highvocedu |      1,865    .1179625    .3226502          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,865    .0294906    .1692226          0          1
    adultedu |      1,865    .1689008    .3747648          0          1
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
-------------+---------------------------------------------------------
   Keyschool |      1,865    .0439678    .2050785          0          1
          m1 |      1,865    1.126717    .1777359   .8143778    1.98121
          m2 |      1,865   -.5290168    .1438865   -.726001  -.0397592
          m3 |      1,865   -.3423902     .187798  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Specif
> ied Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) All Parent Indicators & Keyschool & Specified higher education, Sec Voc + inrange(birth
> year, 1971, 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secg
> en_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlog
> it gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(27, 1837)     =     11.45
       Model |  112.227074        27  4.15655831   Prob > F        =    0.0000
    Residual |  666.740136     1,837  .362950537   R-squared       =    0.1441
-------------+----------------------------------   Adj R-squared   =    0.1315
       Total |  778.967211     1,864  .417900864   Root MSE        =    .60245

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1992915   .0376792     5.29   0.000     .1253929    .2731901
               exp |   .0607699   .0316177     1.92   0.055    -.0012404    .1227803
            expsqr |  -.0017647    .000933    -1.89   0.059    -.0035945    .0000651
        highvocedu |   .2308757    .046392     4.98   0.000     .1398892    .3218622
        highgenedu |   .5904799    .085045     6.94   0.000      .423685    .7572749
          adultedu |   .3691944   .0402488     9.17   0.000     .2902562    .4481325
     parent_secedu |  -.0782615   .0338239    -2.31   0.021    -.1445988   -.0119242
    parent_highedu |   .0538097    .074533     0.72   0.470    -.0923685     .199988
parent_partymember |  -.0231905   .0371269    -0.62   0.532    -.0960059     .049625
         Keyschool |   .1027726   .0698401     1.47   0.141    -.0342017    .2397468
      provincedum2 |  -.3796228   .0815828    -4.65   0.000    -.5396275    -.219618
      provincedum3 |  -.3125236   .0851414    -3.67   0.000    -.4795076   -.1455396
      provincedum4 |  -.3199423    .079528    -4.02   0.000    -.4759171   -.1639676
      provincedum5 |   .0736924   .0751779     0.98   0.327    -.0737509    .2211356
      provincedum6 |  -.0955173   .0902901    -1.06   0.290    -.2725993    .0815648
      provincedum7 |  -.1244172   .0785061    -1.58   0.113    -.2783878    .0295534
      provincedum8 |  -.2556675   .0828939    -3.08   0.002    -.4182438   -.0930913
      provincedum9 |  -.0245555   .0780288    -0.31   0.753      -.17759    .1284789
     provincedum10 |  -.1367125   .0765318    -1.79   0.074    -.2868109    .0133859
     provincedum11 |   .0892218   .0736552     1.21   0.226    -.0552348    .2336785
     provincedum12 |  -.2375998   .0824011    -2.88   0.004    -.3992095     -.07599
     provincedum13 |  -.0527033   .0812028    -0.65   0.516    -.2119628    .1065561
     provincedum14 |  -.2686023   .0891412    -3.01   0.003     -.443431   -.0937736
     provincedum15 |  -.1470889   .0979509    -1.50   0.133    -.3391957    .0450178
               _m1 |   .4426325   .2462588     1.80   0.072    -.0403442    .9256091
               _m2 |  -1.450248   .7086086    -2.05   0.041    -2.840011   -.0604853
               _m3 |  -1.273888   .6013399    -2.12   0.034    -2.453269   -.0945059
             _cons |   6.116689   .9285489     6.59   0.000     4.295567    7.937811
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.128721          .        .       .            .           .
        rho1 |   .4166294          .        .       .            .           .
        rho2 |  -1.365051          .        .       .            .           .
        rho3 |  -1.199051          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if in
> range(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
  highvocedu |      1,865    .1179625    .3226502          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,865    .0294906    .1692226          0          1
    adultedu |      1,865    .1689008    .3747648          0          1
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
-------------+---------------------------------------------------------
   Keyschool |      1,865    .0439678    .2050785          0          1
provincedum2 |      1,865    .0654155     .247324          0          1
provincedum3 |      1,865     .044504    .2062674          0          1
provincedum4 |      1,865    .0697051    .2547177          0          1
provincedum5 |      1,865    .0756032    .2644331          0          1
-------------+---------------------------------------------------------
provincedum6 |      1,865    .0493298    .2166137          0          1
provincedum7 |      1,865    .0900804    .2863737          0          1
provincedum8 |      1,865    .0756032    .2644331          0          1
provincedum9 |      1,865    .0654155     .247324          0          1
provinced~10 |      1,865    .0702413    .2556218          0          1
-------------+---------------------------------------------------------
provinced~11 |      1,865    .1115282    .3148695          0          1
provinced~12 |      1,865    .0595174     .236654          0          1
provinced~13 |      1,865    .0670241    .2501308          0          1
provinced~14 |      1,865     .044504    .2062674          0          1
provinced~15 |      1,865    .0300268    .1707068          0          1
-------------+---------------------------------------------------------
          m1 |      1,865    1.126717    .1777359   .8143778    1.98121
          m2 |      1,865   -.5290168    .1438865   -.726001  -.0397592
          m3 |      1,865   -.3423902     .187798  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Specif
> ied Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) All Parent Indicators & Keyschool & Combined higher education, Sec Voc + inrange(birthy
> ear, 1971, 1992)
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 2
> 5000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relativ
> e ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(11, 1853)     =     15.98
       Model |  67.4779479        11   6.1343589   Prob > F        =    0.0000
    Residual |  711.489263     1,853  .383966143   R-squared       =    0.0866
-------------+----------------------------------   Adj R-squared   =    0.0812
       Total |  778.967211     1,864  .417900864   Root MSE        =    .61965

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2010179    .037141     5.41   0.000     .1281752    .2738605
               exp |   .0553513    .029698     1.86   0.063    -.0028938    .1135965
            expsqr |  -.0018628   .0008879    -2.10   0.036    -.0036042   -.0001213
         higheredu |   .3271449   .0325744    10.04   0.000     .2632586    .3910312
     parent_secedu |  -.0766224   .0344664    -2.22   0.026    -.1442194   -.0090253
    parent_highedu |   .0553344   .0763813     0.72   0.469    -.0944679    .2051368
parent_partymember |  -.0274784   .0378489    -0.73   0.468    -.1017094    .0467525
         Keyschool |    .087957   .0714346     1.23   0.218    -.0521438    .2280578
               _m1 |   .4171671   .2308786     1.81   0.071    -.0356424    .8699766
               _m2 |  -1.315975   .6536834    -2.01   0.044    -2.598008   -.0339418
               _m3 |  -1.488607   .5804744    -2.56   0.010    -2.627059    -.350154
             _cons |   6.154331   .8700854     7.07   0.000      4.44788    7.860781
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.203547          .        .       .            .           .
        rho1 |   .3802581          .        .       .            .           .
        rho2 |  -1.199544          .        .       .            .           .
        rho3 |  -1.356902          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
   higheredu |      1,865    .3163539    .4651775          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
   Keyschool |      1,865    .0439678    .2050785          0          1
          m1 |      1,865    1.126717    .1777359   .8143778    1.98121
-------------+---------------------------------------------------------
          m2 |      1,865   -.5290168    .1438865   -.726001  -.0397592
          m3 |      1,865   -.3423902     .187798  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Non-sp
> ecified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) All Parent Indicators & Keyschool & Combined higher education, Sec Voc + inrange(birthy
> ear, 1971, 1992) + Provincedums
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inr
> ange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative i
> ns2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,865
-------------+----------------------------------   F(25, 1839)     =     11.60
       Model |  106.074124        25  4.24296495   Prob > F        =    0.0000
    Residual |  672.893087     1,839  .365901624   R-squared       =    0.1362
-------------+----------------------------------   Adj R-squared   =    0.1244
       Total |  778.967211     1,864  .417900864   Root MSE        =     .6049

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1984596   .0378264     5.25   0.000     .1242724    .2726468
               exp |    .064007   .0316717     2.02   0.043     .0018907    .1261233
            expsqr |  -.0018074   .0009355    -1.93   0.054    -.0036422    .0000274
         higheredu |   .3367454   .0326555    10.31   0.000     .2726997    .4007911
     parent_secedu |   -.076377   .0339508    -2.25   0.025    -.1429632   -.0097908
    parent_highedu |    .065687   .0747614     0.88   0.380    -.0809391     .212313
parent_partymember |  -.0191235   .0372393    -0.51   0.608    -.0921592    .0539122
         Keyschool |   .1043078   .0701188     1.49   0.137    -.0332131    .2418286
      provincedum2 |  -.3979064   .0817899    -4.86   0.000    -.5583173   -.2374955
      provincedum3 |  -.3214811   .0854164    -3.76   0.000    -.4890045   -.1539578
      provincedum4 |  -.3380356   .0796839    -4.24   0.000     -.494316   -.1817552
      provincedum5 |   .0529641   .0752905     0.70   0.482    -.0946997     .200628
      provincedum6 |  -.1080637   .0906048    -1.19   0.233    -.2857627    .0696353
      provincedum7 |  -.1310145   .0786254    -1.67   0.096     -.285219      .02319
      provincedum8 |  -.2709512   .0831098    -3.26   0.001    -.4339506   -.1079517
      provincedum9 |  -.0382502   .0782616    -0.49   0.625    -.1917411    .1152407
     provincedum10 |   -.156253   .0766911    -2.04   0.042    -.3066638   -.0058422
     provincedum11 |   .0708298   .0737963     0.96   0.337    -.0739036    .2155633
     provincedum12 |  -.2521175   .0826552    -3.05   0.002    -.4142254   -.0900097
     provincedum13 |  -.0686123   .0813928    -0.84   0.399    -.2282444    .0910198
     provincedum14 |  -.2808022    .089415    -3.14   0.002    -.4561678   -.1054367
     provincedum15 |  -.1474772   .0983471    -1.50   0.134    -.3403609    .0454065
               _m1 |   .4342776   .2472456     1.76   0.079    -.0506341    .9191892
               _m2 |  -1.411476   .7112913    -1.98   0.047    -2.806499   -.0164523
               _m3 |  -1.209103   .6035173    -2.00   0.045    -2.392754   -.0254514
             _cons |   6.138538   .9318466     6.59   0.000      4.31095    7.966127
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.077747          .        .       .            .           .
        rho1 |   .4183204          .        .       .            .           .
        rho2 |  -1.359612          .        .       .            .           .
        rho3 |  -1.164675          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971
> , 1992) & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |      1,865    8.333935    .6464525   5.521461   10.12663
        male |      1,865    .5319035     .499115          0          1
         exp |      1,865    18.05952    6.406994          3         32
      expsqr |      1,865    367.1737     235.023          9       1024
   higheredu |      1,865    .3163539    .4651775          0          1
-------------+---------------------------------------------------------
parent_sec~u |      1,865    .2986595    .4577929          0          1
parent_hig~u |      1,865    .0428954    .2026757          0          1
parent_par~r |      1,865    .2075067    .4056302          0          1
   Keyschool |      1,865    .0439678    .2050785          0          1
provincedum2 |      1,865    .0654155     .247324          0          1
-------------+---------------------------------------------------------
provincedum3 |      1,865     .044504    .2062674          0          1
provincedum4 |      1,865    .0697051    .2547177          0          1
provincedum5 |      1,865    .0756032    .2644331          0          1
provincedum6 |      1,865    .0493298    .2166137          0          1
provincedum7 |      1,865    .0900804    .2863737          0          1
-------------+---------------------------------------------------------
provincedum8 |      1,865    .0756032    .2644331          0          1
provincedum9 |      1,865    .0654155     .247324          0          1
provinced~10 |      1,865    .0702413    .2556218          0          1
provinced~11 |      1,865    .1115282    .3148695          0          1
provinced~12 |      1,865    .0595174     .236654          0          1
-------------+---------------------------------------------------------
provinced~13 |      1,865    .0670241    .2501308          0          1
provinced~14 |      1,865     .044504    .2062674          0          1
provinced~15 |      1,865    .0300268    .1707068          0          1
          m1 |      1,865    1.126717    .1777359   .8143778    1.98121
          m2 |      1,865   -.5290168    .1438865   -.726001  -.0397592
-------------+---------------------------------------------------------
          m3 |      1,865   -.3423902     .187798  -.7252195  -.0051956

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Voc, Non-sp
> ecified Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *5) All Parent Indicators & Keyschool & Specified higher education, Sec Gen + inrange(birth
> year, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(m
> onthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_hi
> ghedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(13, 4823)     =     44.35
       Model |   262.18718        13  20.1682446   Prob > F        =    0.0000
    Residual |  2193.28017     4,823  .454754338   R-squared       =    0.1068
-------------+----------------------------------   Adj R-squared   =    0.1044
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .67435

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2052276   .0224649     9.14   0.000     .1611862     .249269
               exp |   .0583307   .0169699     3.44   0.001      .025062    .0915993
            expsqr |  -.0020253   .0005458    -3.71   0.000    -.0030954   -.0009553
        highvocedu |   .1825366   .0305231     5.98   0.000     .1226974    .2423758
        highgenedu |   .5179428   .0300513    17.24   0.000     .4590285    .5768571
          adultedu |   .2812942    .035792     7.86   0.000     .2111256    .3514628
     parent_secedu |  -.0194088   .0225861    -0.86   0.390    -.0636878    .0248703
    parent_highedu |   .0437268   .0365798     1.20   0.232    -.0279863    .1154399
parent_partymember |  -.0182947    .024473    -0.75   0.455    -.0662729    .0296836
         Keyschool |   .0392645   .0205724     1.91   0.056    -.0010668    .0795957
               _m1 |    .560693    .370288     1.51   0.130    -.1652404    1.286626
               _m2 |   .0220889   .1214717     0.18   0.856     -.216051    .2602288
               _m3 |  -.5510472   .2765321    -1.99   0.046    -1.093176   -.0089182
             _cons |   7.767732   .0599648   129.54   0.000     7.650174     7.88529
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .586673          .        .       .            .           .
        rho1 |    .732027          .        .       .            .           .
        rho2 |   .0288387          .        .       .            .           .
        rho3 |  -.7194337          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 250, 25000)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |          0
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
  highvocedu |      4,837    .2464337    .4309786          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,837    .4085177    .4916106          0          1
    adultedu |      4,837    .1145338    .3184914          0          1
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
-------------+---------------------------------------------------------
   Keyschool |      4,837    .4721935    .4992778          0          1
          m1 |      4,837   -.2757319    .0699284  -.4284056  -.0389473
          m2 |      4,837    .4594164    .3457812   .0001547   2.301244
          m3 |      4,837   -.2558632    .1983774   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Specif
> ied Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *6) All Parent Indicators & Keyschool & Specified higher education, Sec Gen + inrange(birth
> year, 1971, 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember Keyschool provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992) & inrange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secg
> en_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlog
> it gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(27, 4809)     =     37.17
       Model |  423.978133        27  15.7028938   Prob > F        =    0.0000
    Residual |  2031.48922     4,809  .422434856   R-squared       =    0.1727
-------------+----------------------------------   Adj R-squared   =    0.1680
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .64995

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1865148    .021978     8.49   0.000     .1434279    .2296018
               exp |   .0922671   .0173785     5.31   0.000     .0581972     .126337
            expsqr |  -.0024787     .00055    -4.51   0.000    -.0035569   -.0014005
        highvocedu |   .1711931     .02965     5.77   0.000     .1130655    .2293208
        highgenedu |   .4698943    .029793    15.77   0.000     .4114864    .5283021
          adultedu |   .2607583   .0348807     7.48   0.000     .1923762    .3291403
     parent_secedu |    .001548   .0219132     0.07   0.944    -.0414119    .0445079
    parent_highedu |   .0328043   .0353804     0.93   0.354    -.0365575     .102166
parent_partymember |  -.0042151   .0236427    -0.18   0.859    -.0505657    .0421355
         Keyschool |   .0598592   .0199596     3.00   0.003     .0207292    .0989891
      provincedum2 |  -.6316352   .0504856   -12.51   0.000    -.7306102   -.5326603
      provincedum3 |  -.2894696   .0474306    -6.10   0.000    -.3824554   -.1964838
      provincedum4 |  -.4584539   .0503384    -9.11   0.000    -.5571401   -.3597677
      provincedum5 |  -.0627675   .0455431    -1.38   0.168    -.1520528    .0265178
      provincedum6 |  -.4062943   .0537578    -7.56   0.000    -.5116842   -.3009045
      provincedum7 |  -.3640681   .0507378    -7.18   0.000    -.4635373   -.2645988
      provincedum8 |  -.6147792   .0499897   -12.30   0.000     -.712782   -.5167764
      provincedum9 |  -.1562644   .0470355    -3.32   0.001    -.2484756   -.0640532
     provincedum10 |  -.2322639   .0491196    -4.73   0.000    -.3285609    -.135967
     provincedum11 |  -.1002658   .0425636    -2.36   0.019    -.1837099   -.0168218
     provincedum12 |  -.2723151   .0529985    -5.14   0.000    -.3762163   -.1684139
     provincedum13 |  -.2384489   .0489609    -4.87   0.000    -.3344347    -.142463
     provincedum14 |  -.3109851   .0663693    -4.69   0.000    -.4410993   -.1808708
     provincedum15 |  -.4556463   .0579164    -7.87   0.000    -.5691889   -.3421037
               _m1 |   1.338846   .3839459     3.49   0.000     .5861359    2.091555
               _m2 |  -.1381105   .1228378    -1.12   0.261    -.3789287    .1027077
               _m3 |  -.2261888   .2728907    -0.83   0.407    -.7611794    .3088019
             _cons |   8.036583   .0679922   118.20   0.000     7.903287    8.169878
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .8878212          .        .       .            .           .
        rho1 |   1.420914          .        .       .            .           .
        rho2 |  -.1465764          .        .       .            .           .
        rho3 |  -.2400536          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if in
> range(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
  highvocedu |      4,837    .2464337    .4309786          0          1
-------------+---------------------------------------------------------
  highgenedu |      4,837    .4085177    .4916106          0          1
    adultedu |      4,837    .1145338    .3184914          0          1
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
-------------+---------------------------------------------------------
   Keyschool |      4,837    .4721935    .4992778          0          1
provincedum2 |      4,837    .0597478    .2370435          0          1
provincedum3 |      4,837    .0649163    .2464035          0          1
provincedum4 |      4,837    .0587141    .2351131          0          1
provincedum5 |      4,837    .0793881    .2703714          0          1
-------------+---------------------------------------------------------
provincedum6 |      4,837    .0529254    .2239077          0          1
provincedum7 |      4,837    .0632624    .2434594          0          1
provincedum8 |      4,837    .0756667    .2644915          0          1
provincedum9 |      4,837    .0692578    .2539183          0          1
provinced~10 |      4,837    .0618152    .2408445          0          1
-------------+---------------------------------------------------------
provinced~11 |      4,837     .130246    .3366087          0          1
provinced~12 |      4,837    .0504445     .218883          0          1
provinced~13 |      4,837    .0667769    .2496611          0          1
provinced~14 |      4,837    .0274964    .1635416          0          1
provinced~15 |      4,837    .0361795    .1867557          0          1
-------------+---------------------------------------------------------
          m1 |      4,837   -.2757319    .0699284  -.4284056  -.0389473
          m2 |      4,837    .4594164    .3457812   .0001547   2.301244
          m3 |      4,837   -.2558632    .1983774   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Specif
> ied Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *7) All Parent Indicators & Keyschool & Combined higher education, Sec Gen + inrange(birthy
> ear, 1971, 1992)
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 2
> 5000), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relativ
> e ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(11, 4825)     =     34.74
       Model |  180.177994        11  16.3798176   Prob > F        =    0.0000
    Residual |  2275.28936     4,825  .471562562   R-squared       =    0.0734
-------------+----------------------------------   Adj R-squared   =    0.0713
       Total |  2455.46735     4,836  .507747592   Root MSE        =     .6867

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |     .19856   .0228406     8.69   0.000     .1537821    .2433379
               exp |   .0639495    .017271     3.70   0.000     .0300904    .0978086
            expsqr |  -.0021819   .0005556    -3.93   0.000    -.0032711   -.0010927
         higheredu |   .3357267   .0267284    12.56   0.000     .2833269    .3881264
     parent_secedu |  -.0113605   .0229915    -0.49   0.621    -.0564344    .0337134
    parent_highedu |   .0838687   .0371246     2.26   0.024     .0110876    .1566498
parent_partymember |  -.0094638     .02491    -0.38   0.704    -.0582986    .0393711
         Keyschool |   .0920579   .0204499     4.50   0.000     .0519669     .132149
               _m1 |   .7791351   .3766838     2.07   0.039     .0406632    1.517607
               _m2 |   .0187683    .123648     0.15   0.879    -.2236381    .2611746
               _m3 |  -.4697883   .2810008    -1.67   0.095    -1.020678    .0811014
             _cons |   7.808279   .0607704   128.49   0.000     7.689141    7.927417
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .6628366          .        .       .            .           .
        rho1 |   .9569947          .        .       .            .           .
        rho2 |   .0230527          .        .       .            .           .
        rho3 |  -.5770308          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyear
> ning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
   higheredu |      4,837    .7694852    .4212059          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
   Keyschool |      4,837    .4721935    .4992778          0          1
          m1 |      4,837   -.2757319    .0699284  -.4284056  -.0389473
-------------+---------------------------------------------------------
          m2 |      4,837    .4594164    .3457812   .0001547   2.301244
          m3 |      4,837   -.2558632    .1983774   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Non-sp
> ecified Higheredu,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. *8) All Parent Indicators & Keyschool & Combined higher education, Sec Gen + inrange(birthy
> ear, 1971, 1992) + Provincedums
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember Keyschool provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inr
> ange(monthlyearning, 250, 25000), sel(educat=male exp expsqr ins1_secgen_entrant_relative i
> ns2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -10787.817
Iteration 1:  Log likelihood = -9174.0216
Iteration 2:  Log likelihood = -9050.2211
Iteration 3:  Log likelihood = -9038.1636
Iteration 4:  Log likelihood = -9037.9626
Iteration 5:  Log likelihood = -9037.9626

Multinomial logistic regression                   Number of obs   =      10512
                                                  LR chi2(12)     =    3499.71
                                                  Prob > chi2     =     0.0000
Log likelihood = -9037.9626                       Pseudo R2       =     0.1622

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |  -.1493043   .0533636    -2.80   0.005    -.2538949   -.0447136
         exp |   .3399476    .024009    14.16   0.000     .2928907    .3870044
      expsqr |  -.0066188   .0006107   -10.84   0.000    -.0078158   -.0054218
ins1_secge~e |   3.292254   .4116129     8.00   0.000     2.485508    4.099001
ins2_highe~e |   .1431575   .0857449     1.67   0.095    -.0248994    .3112143
ins3_vs_en~e |   .8447551   .3934985     2.15   0.032     .0735121    1.615998
       _cons |  -5.661162   .3030003   -18.68   0.000    -6.255032   -5.067293
-------------+----------------------------------------------------------------
3            |
        male |  -.0269526   .0534543    -0.50   0.614    -.1317211    .0778158
         exp |   .5995568    .030202    19.85   0.000      .540362    .6587517
      expsqr |  -.0081319   .0006839   -11.89   0.000    -.0094723   -.0067914
ins1_secge~e |   8.926683    .445754    20.03   0.000     8.053021    9.800345
ins2_highe~e |   .4876176   .0907134     5.38   0.000     .3098227    .6654126
ins3_vs_en~e |  -.7294748   .4327347    -1.69   0.092    -1.577619    .1186697
       _cons |  -11.36596   .4004018   -28.39   0.000    -12.15073   -10.58119
------------------------------------------------------------------------------
(educat==2 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     4,837
-------------+----------------------------------   F(25, 4811)     =     33.15
       Model |   360.82472        25  14.4329888   Prob > F        =    0.0000
    Residual |  2094.64263     4,811  .435386122   R-squared       =    0.1469
-------------+----------------------------------   Adj R-squared   =    0.1425
       Total |  2455.46735     4,836  .507747592   Root MSE        =    .65984

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .1776293   .0222747     7.97   0.000     .1339606     .221298
               exp |   .1031826   .0176163     5.86   0.000     .0686465    .1377187
            expsqr |  -.0027224   .0005579    -4.88   0.000    -.0038161   -.0016286
         higheredu |   .2994947   .0261975    11.43   0.000     .2481356    .3508538
     parent_secedu |    .008676   .0222385     0.39   0.696    -.0349216    .0522735
    parent_highedu |   .0631747   .0358288     1.76   0.078    -.0070662    .1334155
parent_partymember |   .0042541   .0239901     0.18   0.859    -.0427775    .0512857
         Keyschool |   .1081104   .0197566     5.47   0.000     .0693784    .1468424
      provincedum2 |  -.7000807   .0509316   -13.75   0.000    -.7999299   -.6002315
      provincedum3 |  -.3200876   .0480843    -6.66   0.000    -.4143547   -.2258204
      provincedum4 |  -.4876728   .0510461    -9.55   0.000    -.5877465   -.3875992
      provincedum5 |  -.0920584   .0461513    -1.99   0.046     -.182536   -.0015807
      provincedum6 |  -.4655388   .0543459    -8.57   0.000    -.5720816    -.358996
      provincedum7 |  -.4238938   .0512564    -8.27   0.000    -.5243798   -.3234079
      provincedum8 |  -.6870519    .050391   -13.63   0.000    -.7858412   -.5882625
      provincedum9 |  -.1992298   .0475855    -4.19   0.000    -.2925191   -.1059406
     provincedum10 |  -.2956473    .049584    -5.96   0.000    -.3928545     -.19844
     provincedum11 |   -.155703   .0429573    -3.62   0.000    -.2399188   -.0714871
     provincedum12 |  -.3232949   .0536378    -6.03   0.000    -.4284496   -.2181402
     provincedum13 |  -.3012665   .0494313    -6.09   0.000    -.3981745   -.2043585
     provincedum14 |  -.3468002   .0672981    -5.15   0.000    -.4787354   -.2148651
     provincedum15 |  -.4704783    .058772    -8.01   0.000    -.5856983   -.3552582
               _m1 |   1.680044   .3887456     4.32   0.000      .917925    2.442163
               _m2 |   -.186304   .1245916    -1.50   0.135    -.4305604    .0579524
               _m3 |  -.1501955   .2764833    -0.54   0.587    -.6922291    .3918381
             _cons |   8.126899   .0684846   118.67   0.000     7.992637     8.26116
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   1.160946          .        .       .            .           .
        rho1 |   1.559246          .        .       .            .           .
        rho2 |  -.1729084          .        .       .            .           .
        rho3 |  -.1393962          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember Keyschool provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971
> , 1992) & inrange(monthlyearning, 250, 25000)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember Keyschool provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      4,837    8.499192    .7125641   5.521461   10.12663
        male |      4,837    .5635725    .4959933          0          1
         exp |      4,837     15.2332    6.985672          0         33
      expsqr |      4,837      280.84    233.9825          0       1089
   higheredu |      4,837    .7694852    .4212059          0          1
-------------+---------------------------------------------------------
parent_sec~u |      4,837    .3992144    .4897876          0          1
parent_hig~u |      4,837    .1046103    .3060823          0          1
parent_par~r |      4,837    .2549101    .4358557          0          1
   Keyschool |      4,837    .4721935    .4992778          0          1
provincedum2 |      4,837    .0597478    .2370435          0          1
-------------+---------------------------------------------------------
provincedum3 |      4,837    .0649163    .2464035          0          1
provincedum4 |      4,837    .0587141    .2351131          0          1
provincedum5 |      4,837    .0793881    .2703714          0          1
provincedum6 |      4,837    .0529254    .2239077          0          1
provincedum7 |      4,837    .0632624    .2434594          0          1
-------------+---------------------------------------------------------
provincedum8 |      4,837    .0756667    .2644915          0          1
provincedum9 |      4,837    .0692578    .2539183          0          1
provinced~10 |      4,837    .0618152    .2408445          0          1
provinced~11 |      4,837     .130246    .3366087          0          1
provinced~12 |      4,837    .0504445     .218883          0          1
-------------+---------------------------------------------------------
provinced~13 |      4,837    .0667769    .2496611          0          1
provinced~14 |      4,837    .0274964    .1635416          0          1
provinced~15 |      4,837    .0361795    .1867557          0          1
          m1 |      4,837   -.2757319    .0699284  -.4284056  -.0389473
          m2 |      4,837    .4594164    .3457812   .0001547   2.301244
-------------+---------------------------------------------------------
          m3 |      4,837   -.2558632    .1983774   -.726001  -.0012229

. outreg2 using "`xlspath'", append ctitle(All Parent Indicators & Keyschool, Sec Gen, Non-sp
> ecified Higheredu, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Selmlog Urban Pa
> rent NoFirstStage.xls
dir : seeout

. drop m1 m2 m3

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/New Selmlog/Parent Indicator/Sel
> mlog Urban Parent NoFirstStage.log
  log type:  text
 closed on:   6 Aug 2024, 18:11:44
---------------------------------------------------------------------------------------------
