---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Exp/IV Urban ATF&Birth Exp 1979 1971-1992.log
  log type:  text
 opened on:   6 Aug 2024, 17:34:23

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,362 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. **
. tab birthmonth, gen(birthmonthdum)

 birthmonth |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,940        8.11        8.11
          2 |      2,993        8.26       16.37
          3 |      2,883        7.95       24.32
          4 |      2,595        7.16       31.48
          5 |      2,755        7.60       39.08
          6 |      2,889        7.97       47.05
          7 |      2,830        7.81       54.86
          8 |      3,239        8.94       63.80
          9 |      3,187        8.79       72.59
         10 |      3,723       10.27       82.86
         11 |      3,121        8.61       91.47
         12 |      3,091        8.53      100.00
------------+-----------------------------------
      Total |     36,246      100.00

. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. *1)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  secgenhighedu secgenedu = t d td) if inrange(birthyear, 1971, 1992) & inrange(monthlyearni
> ng, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                       Number of obs =  10,621
                                                       F(17, 10603)  = 1279.12
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6722
                                                       Adj R-squared =  0.6717
                                                       Root MSE      =  0.2848

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1509439   .0026713   -56.51   0.000      -.15618   -.1457077
         expsqr |   .0004596   .0000696     6.60   0.000     .0003231    .0005962
 birthmonthdum2 |   -.007691   .0138209    -0.56   0.578    -.0347825    .0194006
 birthmonthdum3 |   .0217927   .0137584     1.58   0.113    -.0051763    .0487617
 birthmonthdum4 |   .0219742   .0143355     1.53   0.125    -.0061262    .0500745
 birthmonthdum5 |    .037923   .0140472     2.70   0.007     .0103879    .0654581
 birthmonthdum6 |   .0441671   .0137167     3.22   0.001     .0172798    .0710544
 birthmonthdum7 |   .0456219   .0138742     3.29   0.001     .0184259     .072818
 birthmonthdum8 |   .0620878   .0136117     4.56   0.000     .0354062    .0887694
 birthmonthdum9 |    .082325    .013425     6.13   0.000     .0560095    .1086406
birthmonthdum10 |   .0980764   .0127967     7.66   0.000     .0729925    .1231603
birthmonthdum11 |   .1006497   .0134928     7.46   0.000     .0742012    .1270981
birthmonthdum12 |   .1222088   .0135903     8.99   0.000     .0955692    .1488484
           male |  -.0112945   .0055464    -2.04   0.042    -.0221665   -.0004225
              t |  -.0111068   .0002003   -55.45   0.000    -.0114995   -.0107142
              d |   .0213655   .0116734     1.83   0.067    -.0015166    .0442476
             td |  -.0004121   .0002302    -1.79   0.073    -.0008634    .0000391
          _cons |   3.261184   .0323114   100.93   0.000     3.197848     3.32452
---------------------------------------------------------------------------------

                                                        Number of obs = 10,621
                                                        F(17, 10603)  = 893.15
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5888
                                                        Adj R-squared = 0.5882
                                                        Root MSE      = 0.3123

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1531358   .0029294   -52.28   0.000    -.1588779   -.1473937
         expsqr |   .0008737   .0000764    11.44   0.000      .000724    .0010234
 birthmonthdum2 |    .009986   .0151563     0.66   0.510    -.0197231    .0396951
 birthmonthdum3 |   .0163675   .0150877     1.08   0.278    -.0132073    .0459422
 birthmonthdum4 |   .0201813   .0157207     1.28   0.199    -.0106341    .0509968
 birthmonthdum5 |   .0448789   .0154044     2.91   0.004     .0146833    .0750745
 birthmonthdum6 |   .0480187    .015042     3.19   0.001     .0185334    .0775039
 birthmonthdum7 |    .045055   .0152148     2.96   0.003     .0152312    .0748788
 birthmonthdum8 |   .0759504   .0149269     5.09   0.000     .0466908      .10521
 birthmonthdum9 |   .0786149   .0147222     5.34   0.000     .0497567    .1074731
birthmonthdum10 |   .0952311   .0140331     6.79   0.000     .0677236    .1227387
birthmonthdum11 |   .1014783   .0147965     6.86   0.000     .0724743    .1304822
birthmonthdum12 |   .1181327   .0149035     7.93   0.000     .0889191    .1473463
           male |    .002891   .0060823     0.48   0.635    -.0090314    .0148134
              t |  -.0095218   .0002197   -43.35   0.000    -.0099524   -.0090913
              d |   .0299555   .0128013     2.34   0.019     .0048625    .0550485
             td |  -.0009799   .0002524    -3.88   0.000    -.0014747    -.000485
          _cons |   3.050015   .0354334    86.08   0.000     2.980559    3.119471
---------------------------------------------------------------------------------

                                                        Number of obs = 10,621
                                                        F(17, 10603)  = 571.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4782
                                                        Adj R-squared = 0.4773
                                                        Root MSE      = 0.3615

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1042941   .0033904   -30.76   0.000      -.11094   -.0976482
         expsqr |  -.0002817   .0000884    -3.19   0.001     -.000455   -.0001085
 birthmonthdum2 |   .0186905   .0175418     1.07   0.287    -.0156948    .0530758
 birthmonthdum3 |   .0259554   .0174625     1.49   0.137    -.0082744    .0601852
 birthmonthdum4 |   .0466579   .0181951     2.56   0.010     .0109921    .0823236
 birthmonthdum5 |   .0508201   .0178291     2.85   0.004     .0158718    .0857685
 birthmonthdum6 |   .0692403   .0174096     3.98   0.000     .0351141    .1033664
 birthmonthdum7 |   .0599786   .0176096     3.41   0.001     .0254606    .0944967
 birthmonthdum8 |   .0890168   .0172764     5.15   0.000     .0551518    .1228818
 birthmonthdum9 |   .0943619   .0170394     5.54   0.000     .0609615    .1277623
birthmonthdum10 |   .1037936   .0162419     6.39   0.000     .0719564    .1356309
birthmonthdum11 |   .1237631   .0171255     7.23   0.000      .090194    .1573322
birthmonthdum12 |   .1269849   .0172492     7.36   0.000     .0931732    .1607967
           male |   .0141725   .0070396     2.01   0.044     .0003735    .0279715
              t |   -.011081   .0002542   -43.59   0.000    -.0115793   -.0105826
              d |   .0080022   .0148162     0.54   0.589    -.0210404    .0370448
             td |   .0021199   .0002922     7.26   0.000     .0015472    .0026925
          _cons |   2.617761   .0410105    63.83   0.000     2.537373     2.69815
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(17)   =     329.21
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     1.3614

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -4.080183    7.51804    -0.54   0.587    -18.81527    10.65491
  secgenhighedu |   4.449636   6.737302     0.66   0.509    -8.755233    17.65451
      secgenedu |   .7381539   1.830457     0.40   0.687    -2.849476    4.325784
            exp |   .0879332    .083928     1.05   0.295    -.0765626     .252429
         expsqr |  -.0020343   .0019332    -1.05   0.293    -.0058234    .0017547
 birthmonthdum2 |  -.1308525   .1708144    -0.77   0.444    -.4656425    .2039376
 birthmonthdum3 |  -.0273159   .0663612    -0.41   0.681    -.1573815    .1027496
 birthmonthdum4 |  -.0379172   .0871644    -0.44   0.664    -.2087563     .132922
 birthmonthdum5 |  -.0792292   .1251961    -0.63   0.527    -.3246091    .1661507
 birthmonthdum6 |  -.0569301   .1300964    -0.44   0.662    -.3119144    .1980542
 birthmonthdum7 |  -.0417048   .0927734    -0.45   0.653    -.2235373    .1401276
 birthmonthdum8 |  -.1276519   .2116119    -0.60   0.546    -.5424035    .2870997
 birthmonthdum9 |  -.0554827   .0990966    -0.56   0.576    -.2497085    .1387432
birthmonthdum10 |  -.0530265   .1083062    -0.49   0.624    -.2653027    .1592497
birthmonthdum11 |  -.0890737   .1604159    -0.56   0.579    -.4034832    .2253357
birthmonthdum12 |  -.0651175   .1213371    -0.54   0.591    -.3029339     .172699
           male |   .2230425   .1325957     1.68   0.093    -.0368404    .4829253
          _cons |   7.226985   .7589825     9.52   0.000     5.739407    8.714564
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  149.544  (p = 0.0000)
  Wu-Hausman F(3,10600)           =    50.46  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.685  Chi-sq(17) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
birthmont~m2 |     10,621    .0786178     .269154          0          1
birthmonth~3 |     10,621    .0802184    .2716439          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,621    .0686376    .2528488          0          1
birthmonth~5 |     10,621    .0740985    .2619434          0          1
birthmonth~6 |     10,621     .081819    .2741017          0          1
birthmonth~7 |     10,621    .0780529    .2682675          0          1
birthmonth~8 |     10,621    .0843612    .2779418          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,621    .0895396    .2855345          0          1
birthmont~10 |     10,621    .1104416    .3134541          0          1
birthmont~11 |     10,621    .0875624    .2826707          0          1
birthmont~12 |     10,621    .0851144     .279065          0          1
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,621
                                                        F(31, 10589)  = 718.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6778
                                                        Adj R-squared = 0.6769
                                                        Root MSE      = 0.2825

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1518677   .0026586   -57.12   0.000     -.157079   -.1466563
         expsqr |   .0004693   .0000692     6.78   0.000     .0003337    .0006049
 birthmonthdum2 |  -.0067628   .0137196    -0.49   0.622    -.0336559    .0201303
 birthmonthdum3 |   .0210029   .0136645     1.54   0.124    -.0057821    .0477879
 birthmonthdum4 |   .0226668   .0142339     1.59   0.111    -.0052344     .050568
 birthmonthdum5 |   .0385371   .0139425     2.76   0.006     .0112071     .065867
 birthmonthdum6 |   .0447465   .0136182     3.29   0.001     .0180524    .0714407
 birthmonthdum7 |   .0457653    .013776     3.32   0.001     .0187617    .0727689
 birthmonthdum8 |    .064942   .0135129     4.81   0.000     .0384543    .0914298
 birthmonthdum9 |   .0843129   .0133358     6.32   0.000     .0581722    .1104535
birthmonthdum10 |   .1006939   .0127098     7.92   0.000     .0757802    .1256075
birthmonthdum11 |   .1024611   .0133962     7.65   0.000      .076202    .1287202
birthmonthdum12 |   .1230066   .0134981     9.11   0.000     .0965479    .1494654
           male |  -.0118687   .0055065    -2.16   0.031    -.0226625   -.0010749
   provincedum2 |   .0839362   .0150356     5.58   0.000     .0544637    .1134088
   provincedum3 |   .0841157   .0155962     5.39   0.000     .0535442    .1146871
   provincedum4 |  -.0101397   .0150648    -0.67   0.501    -.0396694    .0193901
   provincedum5 |   .0044458   .0138615     0.32   0.748    -.0227253     .031617
   provincedum6 |   .0741045   .0153466     4.83   0.000     .0440222    .1041868
   provincedum7 |   .0406563   .0144897     2.81   0.005     .0122538    .0690588
   provincedum8 |   .0461736   .0142046     3.25   0.001     .0183299    .0740173
   provincedum9 |  -.0154481     .01456    -1.06   0.289    -.0439884    .0130922
  provincedum10 |  -.0108293   .0149179    -0.73   0.468    -.0400711    .0184125
  provincedum11 |  -.0151128   .0126285    -1.20   0.231    -.0398671    .0096414
  provincedum12 |  -.0077226   .0155531    -0.50   0.620    -.0382096    .0227643
  provincedum13 |   .0130403   .0143909     0.91   0.365    -.0151686    .0412491
  provincedum14 |   .0326974   .0183451     1.78   0.075    -.0032624    .0686572
  provincedum15 |   .0996011   .0185088     5.38   0.000     .0633204    .1358818
              t |  -.0111208   .0001999   -55.64   0.000    -.0115127    -.010729
              d |   .0218816   .0116016     1.89   0.059    -.0008597    .0446229
             td |   -.000464   .0002287    -2.03   0.042    -.0009122   -.0000158
          _cons |   3.254845   .0327656    99.34   0.000     3.190618    3.319071
---------------------------------------------------------------------------------

                                                        Number of obs = 10,621
                                                        F(31, 10589)  = 497.33
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5928
                                                        Adj R-squared = 0.5916
                                                        Root MSE      = 0.3110

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1540509   .0029264   -52.64   0.000    -.1597872   -.1483147
         expsqr |   .0008819   .0000762    11.58   0.000     .0007326    .0010312
 birthmonthdum2 |   .0110572   .0151015     0.73   0.464    -.0185446    .0406591
 birthmonthdum3 |   .0163291   .0150408     1.09   0.278    -.0131538    .0458119
 birthmonthdum4 |   .0219905   .0156676     1.40   0.160     -.008721     .052702
 birthmonthdum5 |   .0454198   .0153468     2.96   0.003     .0153371    .0755025
 birthmonthdum6 |   .0484545   .0149898     3.23   0.001     .0190716    .0778373
 birthmonthdum7 |   .0451864   .0151636     2.98   0.003     .0154629      .07491
 birthmonthdum8 |   .0788968   .0148739     5.30   0.000     .0497412    .1080525
 birthmonthdum9 |   .0803853    .014679     5.48   0.000     .0516116    .1091589
birthmonthdum10 |   .0975145     .01399     6.97   0.000     .0700914    .1249376
birthmonthdum11 |   .1035895   .0147455     7.03   0.000     .0746854    .1324935
birthmonthdum12 |   .1187579   .0148577     7.99   0.000     .0896341    .1478817
           male |   .0020746   .0060611     0.34   0.732    -.0098063    .0139556
   provincedum2 |   .0498769     .01655     3.01   0.003     .0174358     .082318
   provincedum3 |   .0769518   .0171671     4.48   0.000     .0433011    .1106026
   provincedum4 |   -.018455   .0165822    -1.11   0.266    -.0509592    .0140491
   provincedum5 |  -.0051162   .0152577    -0.34   0.737    -.0350242    .0247917
   provincedum6 |   .0767212   .0168924     4.54   0.000     .0436089    .1098335
   provincedum7 |   .0323497   .0159491     2.03   0.043     .0010864     .063613
   provincedum8 |   .0430438   .0156353     2.75   0.006     .0123956    .0736919
   provincedum9 |   .0023156   .0160265     0.14   0.885    -.0290994    .0337306
  provincedum10 |  -.0098695   .0164205    -0.60   0.548    -.0420566    .0223177
  provincedum11 |  -.0010528   .0139005    -0.08   0.940    -.0283004    .0261947
  provincedum12 |  -.0136751   .0171196    -0.80   0.424    -.0472328    .0198826
  provincedum13 |   .0110378   .0158404     0.70   0.486    -.0200124    .0420879
  provincedum14 |  -.0002564   .0201929    -0.01   0.990    -.0398383    .0393254
  provincedum15 |   .0771418    .020373     3.79   0.000     .0372068    .1170768
              t |  -.0095347     .00022   -43.34   0.000     -.009966   -.0091034
              d |   .0298225   .0127701     2.34   0.020     .0047906    .0548544
             td |  -.0010444   .0002517    -4.15   0.000    -.0015377   -.0005511
          _cons |   3.048581   .0360659    84.53   0.000     2.977885    3.119277
---------------------------------------------------------------------------------

                                                        Number of obs = 10,621
                                                        F(31, 10589)  = 318.69
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4827
                                                        Adj R-squared = 0.4811
                                                        Root MSE      = 0.3602

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1056564   .0033889   -31.18   0.000    -.1122994   -.0990135
         expsqr |  -.0002711   .0000882    -3.07   0.002     -.000444   -.0000982
 birthmonthdum2 |   .0199515   .0174886     1.14   0.254    -.0143295    .0542324
 birthmonthdum3 |    .027504   .0174183     1.58   0.114    -.0066392    .0616472
 birthmonthdum4 |   .0501793   .0181442     2.77   0.006     .0146133    .0857454
 birthmonthdum5 |   .0515671   .0177727     2.90   0.004     .0167293    .0864049
 birthmonthdum6 |   .0694113   .0173592     4.00   0.000     .0353839    .1034387
 birthmonthdum7 |   .0606861   .0175605     3.46   0.001     .0262642     .095108
 birthmonthdum8 |   .0926127    .017225     5.38   0.000     .0588484    .1263769
 birthmonthdum9 |   .0966264   .0169993     5.68   0.000     .0633045    .1299483
birthmonthdum10 |   .1069614   .0162014     6.60   0.000     .0752036    .1387191
birthmonthdum11 |   .1261868   .0170763     7.39   0.000     .0927139    .1596596
birthmonthdum12 |   .1286542   .0172062     7.48   0.000     .0949268    .1623816
           male |   .0127073   .0070192     1.81   0.070    -.0010517    .0264663
   provincedum2 |   .0472274    .019166     2.46   0.014     .0096583    .0847964
   provincedum3 |   .0883887   .0198807     4.45   0.000     .0494188    .1273586
   provincedum4 |   -.036515   .0192033    -1.90   0.057    -.0741571     .001127
   provincedum5 |    .001494   .0176695     0.08   0.933    -.0331415    .0361294
   provincedum6 |   .0717316   .0195626     3.67   0.000     .0333853    .1100779
   provincedum7 |   .0178611   .0184702     0.97   0.334    -.0183439    .0540661
   provincedum8 |   .0708332   .0181068     3.91   0.000     .0353406    .1063259
   provincedum9 |   .0296636   .0185598     1.60   0.110    -.0067172    .0660443
  provincedum10 |  -.0001431    .019016    -0.01   0.994     -.037418    .0371319
  provincedum11 |   .0429488   .0160977     2.67   0.008     .0113943    .0745034
  provincedum12 |   .0217125   .0198257     1.10   0.273    -.0171496    .0605746
  provincedum13 |   .0258251   .0183443     1.41   0.159    -.0101331    .0617833
  provincedum14 |  -.0424072   .0233847    -1.81   0.070    -.0882456    .0034313
  provincedum15 |   .0663726   .0235934     2.81   0.005     .0201252    .1126201
              t |  -.0111167   .0002548   -43.63   0.000    -.0116162   -.0106173
              d |    .007143   .0147887     0.48   0.629    -.0218456    .0361316
             td |   .0020213   .0002915     6.93   0.000     .0014499    .0025926
          _cons |   2.615409   .0417668    62.62   0.000     2.533538    2.697279
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(31)   =     587.23
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      1.185

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -3.349956   7.674116    -0.44   0.662    -18.39095    11.69103
  secgenhighedu |   3.725068   6.801192     0.55   0.584    -9.605024    17.05516
      secgenedu |   .6113556    1.91239     0.32   0.749     -3.13686    4.359571
            exp |   .0796109   .0814544     0.98   0.328    -.0800368    .2392586
         expsqr |  -.0018362   .0018929    -0.97   0.332    -.0055463    .0018739
 birthmonthdum2 |   -.115561   .1735821    -0.67   0.506    -.4557757    .2246537
 birthmonthdum3 |  -.0208182   .0573099    -0.36   0.716    -.1331435    .0915072
 birthmonthdum4 |  -.0292891   .0916778    -0.32   0.749    -.2089743    .1503961
 birthmonthdum5 |  -.0659904    .122793    -0.54   0.591    -.3066602    .1746794
 birthmonthdum6 |  -.0433869   .1275916    -0.34   0.734    -.2934617     .206688
 birthmonthdum7 |  -.0338052   .0889794    -0.38   0.704    -.2082015    .1405912
 birthmonthdum8 |  -.1159224   .2175216    -0.53   0.594    -.5422568    .3104121
 birthmonthdum9 |  -.0516548   .0959389    -0.54   0.590    -.2396915     .136382
birthmonthdum10 |  -.0453895     .10568    -0.43   0.668    -.2525184    .1617395
birthmonthdum11 |  -.0765462   .1641776    -0.47   0.641    -.3983284     .245236
birthmonthdum12 |  -.0534478   .1185928    -0.45   0.652    -.2858854    .1789898
           male |   .2383462   .1312734     1.82   0.069     -.018945    .4956373
   provincedum2 |  -.4054828   .2262316    -1.79   0.073    -.8488886    .0379231
   provincedum3 |  -.2524831   .0782969    -3.22   0.001    -.4059422   -.0990239
   provincedum4 |  -.3538113   .1344611    -2.63   0.009    -.6173502   -.0902725
   provincedum5 |    .012718   .0896931     0.14   0.887    -.1630773    .1885132
   provincedum6 |  -.2227059   .1073187    -2.08   0.038    -.4330466   -.0123652
   provincedum7 |  -.2246091   .0852268    -2.64   0.008    -.3916505   -.0575677
   provincedum8 |  -.4640295   .0922634    -5.03   0.000    -.6448625   -.2831965
   provincedum9 |  -.2091924    .198827    -1.05   0.293    -.5988862    .1805013
  provincedum10 |  -.1809881   .0639073    -2.83   0.005    -.3062441    -.055732
  provincedum11 |  -.1362671   .1964945    -0.69   0.488    -.5213893     .248855
  provincedum12 |  -.2147324   .0664366    -3.23   0.001    -.3449457   -.0845191
  provincedum13 |  -.1621055   .0643509    -2.52   0.012    -.2882309     -.03598
  provincedum14 |  -.1275159   .3442661    -0.37   0.711    -.8022651    .5472333
  provincedum15 |  -.2963415   .1398589    -2.12   0.034    -.5704598   -.0222232
          _cons |   7.505807   .7186087    10.44   0.000      6.09736    8.914254
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  116.763  (p = 0.0000)
  Wu-Hausman F(3,10586)           =   39.224  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   6.073  Chi-sq(31) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
birthmont~m2 |     10,621    .0786178     .269154          0          1
birthmonth~3 |     10,621    .0802184    .2716439          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,621    .0686376    .2528488          0          1
birthmonth~5 |     10,621    .0740985    .2619434          0          1
birthmonth~6 |     10,621     .081819    .2741017          0          1
birthmonth~7 |     10,621    .0780529    .2682675          0          1
birthmonth~8 |     10,621    .0843612    .2779418          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,621    .0895396    .2855345          0          1
birthmont~10 |     10,621    .1104416    .3134541          0          1
birthmont~11 |     10,621    .0875624    .2826707          0          1
birthmont~12 |     10,621    .0851144     .279065          0          1
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 
> 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,674
                                                        F(16, 5657)   = 737.01
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6758
                                                        Adj R-squared = 0.6749
                                                        Root MSE      = 0.2827

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1552985   .0036552   -42.49   0.000    -.1624641   -.1481329
         expsqr |   .0005755   .0000944     6.09   0.000     .0003904    .0007606
 birthmonthdum2 |  -.0077723   .0188666    -0.41   0.680    -.0447579    .0292134
 birthmonthdum3 |   .0076664   .0187469     0.41   0.683    -.0290847    .0444175
 birthmonthdum4 |   .0210596   .0198778     1.06   0.289    -.0179085    .0600277
 birthmonthdum5 |   .0290594   .0189946     1.53   0.126    -.0081773     .066296
 birthmonthdum6 |   .0341938   .0186798     1.83   0.067    -.0024258    .0708134
 birthmonthdum7 |   .0634181   .0188529     3.36   0.001     .0264591    .1003771
 birthmonthdum8 |   .0617562   .0182879     3.38   0.001     .0259049    .0976074
 birthmonthdum9 |   .0878622   .0182331     4.82   0.000     .0521183     .123606
birthmonthdum10 |   .0916642   .0173001     5.30   0.000     .0577493    .1255791
birthmonthdum11 |   .0851078   .0182599     4.66   0.000     .0493113    .1209042
birthmonthdum12 |   .1102557    .018532     5.95   0.000     .0739259    .1465856
              t |  -.0108079   .0002684   -40.26   0.000    -.0113341   -.0102817
              d |   .0250125   .0158447     1.58   0.114    -.0060492    .0560743
             td |  -.0008834   .0003089    -2.86   0.004     -.001489   -.0002778
          _cons |   3.300327   .0442274    74.62   0.000     3.213625     3.38703
---------------------------------------------------------------------------------

                                                        Number of obs =  5,674
                                                        F(16, 5657)   = 530.80
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6002
                                                        Adj R-squared = 0.5991
                                                        Root MSE      = 0.3076

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1560647   .0039764   -39.25   0.000      -.16386   -.1482694
         expsqr |   .0009041   .0001027     8.80   0.000     .0007027    .0011055
 birthmonthdum2 |   .0092478   .0205246     0.45   0.652    -.0309883    .0494839
 birthmonthdum3 |   .0158093   .0203944     0.78   0.438    -.0241716    .0557902
 birthmonthdum4 |   .0320589   .0216247     1.48   0.138    -.0103338    .0744516
 birthmonthdum5 |   .0443352   .0206639     2.15   0.032     .0038261    .0848443
 birthmonthdum6 |   .0259039   .0203214     1.27   0.202    -.0139339    .0657417
 birthmonthdum7 |   .0542591   .0205098     2.65   0.008     .0140521    .0944662
 birthmonthdum8 |   .0819048   .0198951     4.12   0.000     .0429028    .1209067
 birthmonthdum9 |   .0925983   .0198355     4.67   0.000     .0537132    .1314834
birthmonthdum10 |   .0875915   .0188205     4.65   0.000      .050696    .1244869
birthmonthdum11 |   .0924175   .0198646     4.65   0.000     .0534752    .1313598
birthmonthdum12 |   .1240311   .0201606     6.15   0.000     .0845086    .1635537
              t |  -.0096212    .000292   -32.95   0.000    -.0101936   -.0090487
              d |   .0439431   .0172372     2.55   0.011     .0101516    .0777346
             td |  -.0012639   .0003361    -3.76   0.000    -.0019227   -.0006051
          _cons |   3.101848   .0481143    64.47   0.000     3.007525     3.19617
---------------------------------------------------------------------------------

                                                        Number of obs =  5,674
                                                        F(16, 5657)   = 337.86
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4886
                                                        Adj R-squared = 0.4872
                                                        Root MSE      = 0.3581

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1060528   .0046294   -22.91   0.000    -.1151282   -.0969774
         expsqr |  -.0002704   .0001196    -2.26   0.024    -.0005049   -.0000359
 birthmonthdum2 |   .0393693   .0238948     1.65   0.099    -.0074736    .0862123
 birthmonthdum3 |    .030423   .0237433     1.28   0.200    -.0161229    .0769689
 birthmonthdum4 |   .0831177   .0251755     3.30   0.001      .033764    .1324715
 birthmonthdum5 |   .0582346   .0240569     2.42   0.016     .0110737    .1053954
 birthmonthdum6 |    .056899   .0236583     2.41   0.016     .0105196    .1032783
 birthmonthdum7 |   .0782856   .0238776     3.28   0.001     .0314764    .1250948
 birthmonthdum8 |   .1017365   .0231619     4.39   0.000     .0563302    .1471427
 birthmonthdum9 |   .1116024   .0230925     4.83   0.000     .0663323    .1568726
birthmonthdum10 |   .1128002   .0219109     5.15   0.000     .0698464     .155754
birthmonthdum11 |   .1302278   .0231265     5.63   0.000      .084891    .1755646
birthmonthdum12 |   .1463361   .0234711     6.23   0.000     .1003238    .1923484
              t |  -.0111137     .00034   -32.69   0.000    -.0117802   -.0104473
              d |   .0222353   .0200676     1.11   0.268    -.0171049    .0615755
             td |    .001856   .0003912     4.74   0.000      .001089     .002623
          _cons |   2.653187   .0560148    47.37   0.000     2.543377    2.762997
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(16)   =     190.35
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .87374

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.999828   2.507066    -0.80   0.425    -6.913588    2.913932
  secgenhighedu |   2.779173   2.295247     1.21   0.226     -1.71943    7.277775
      secgenedu |  -.0943255   .5871097    -0.16   0.872    -1.245039    1.056388
            exp |   .0625163   .0219542     2.85   0.004     .0194869    .1055457
         expsqr |  -.0013854   .0005366    -2.58   0.010    -.0024371   -.0003338
 birthmonthdum2 |  -.0657195   .0835587    -0.79   0.432    -.2294915    .0980526
 birthmonthdum3 |  -.0122082   .0654527    -0.19   0.852    -.1404932    .1160768
 birthmonthdum4 |  -.0434605    .087985    -0.49   0.621    -.2159079     .128987
 birthmonthdum5 |  -.0169937   .0805763    -0.21   0.833    -.1749203     .140933
 birthmonthdum6 |   .0640976   .0583751     1.10   0.272    -.0503156    .1785108
 birthmonthdum7 |   .0586117   .0585346     1.00   0.317     -.056114    .1733373
 birthmonthdum8 |  -.0538346   .0984953    -0.55   0.585    -.2468819    .1392128
 birthmonthdum9 |  -.0360353    .070982    -0.51   0.612    -.1751574    .1030868
birthmonthdum10 |   -.021212   .0598232    -0.35   0.723    -.1384634    .0960393
birthmonthdum11 |   -.022323   .0840046    -0.27   0.790    -.1869691    .1423231
birthmonthdum12 |  -.0708978   .0969154    -0.73   0.464    -.2608486    .1190529
          _cons |   7.767709   .1875984    41.41   0.000     7.400023    8.135395
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  79.7898  (p = 0.0000)
  Wu-Hausman F(3,5654)            =  26.8808  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   7.602  Chi-sq(16) P-value = 0.9598

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
birthmont~m2 |      5,674    .0771942    .2669229          0          1
birthmonth~3 |      5,674    .0793091    .2702444          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,674    .0636235    .2441026          0          1
birthmonth~5 |      5,674    .0754318    .2641101          0          1
birthmonth~6 |      5,674    .0810716     .272969          0          1
birthmonth~7 |      5,674    .0780754    .2683139          0          1
birthmonth~8 |      5,674    .0882975    .2837521          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,674    .0897074    .2857873          0          1
birthmont~10 |      5,674    .1129714    .3165858          0          1
birthmont~11 |      5,674    .0888262    .2845178          0          1
birthmont~12 |      5,674    .0840677    .2775137          0          1
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,674
                                                        F(30, 5643)   = 404.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6825
                                                        Adj R-squared = 0.6809
                                                        Root MSE      = 0.2801

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |    -.15658   .0036371   -43.05   0.000    -.1637101   -.1494499
         expsqr |   .0005879   .0000937     6.27   0.000     .0004041    .0007716
 birthmonthdum2 |  -.0007476   .0187329    -0.04   0.968    -.0374714    .0359762
 birthmonthdum3 |   .0112486   .0186089     0.60   0.546    -.0252319    .0477292
 birthmonthdum4 |   .0274025   .0197292     1.39   0.165    -.0112743    .0660793
 birthmonthdum5 |   .0332636   .0188315     1.77   0.077    -.0036534    .0701807
 birthmonthdum6 |   .0376232    .018535     2.03   0.042     .0012875    .0739588
 birthmonthdum7 |    .066083   .0187091     3.53   0.000     .0294061      .10276
 birthmonthdum8 |   .0671403   .0181408     3.70   0.000     .0315774    .1027032
 birthmonthdum9 |   .0907939   .0181005     5.02   0.000     .0553099    .1262779
birthmonthdum10 |   .0963943   .0171677     5.61   0.000      .062739    .1300497
birthmonthdum11 |   .0910264   .0181225     5.02   0.000     .0554993    .1265534
birthmonthdum12 |   .1122373   .0183888     6.10   0.000     .0761881    .1482864
   provincedum2 |   .0947908   .0203783     4.65   0.000     .0548415    .1347401
   provincedum3 |   .0957169   .0213527     4.48   0.000     .0538573    .1375765
   provincedum4 |  -.0077534    .020761    -0.37   0.709     -.048453    .0329461
   provincedum5 |   .0044562   .0190032     0.23   0.815    -.0327974    .0417098
   provincedum6 |   .0784215   .0207347     3.78   0.000     .0377736    .1190694
   provincedum7 |   .0379272   .0201068     1.89   0.059    -.0014898    .0773441
   provincedum8 |   .0593221   .0194247     3.05   0.002     .0212422    .0974021
   provincedum9 |  -.0033429    .019761    -0.17   0.866    -.0420821    .0353963
  provincedum10 |  -.0065069     .02061    -0.32   0.752    -.0469105    .0338968
  provincedum11 |  -.0168907   .0173524    -0.97   0.330    -.0509082    .0171267
  provincedum12 |   -.012102   .0215267    -0.56   0.574    -.0543026    .0300987
  provincedum13 |   .0141441   .0198995     0.71   0.477    -.0248667    .0531548
  provincedum14 |   .0282061   .0257076     1.10   0.273    -.0221907    .0786028
  provincedum15 |   .1088844      .0256     4.25   0.000     .0586986    .1590703
              t |  -.0108497   .0002671   -40.62   0.000    -.0113733   -.0103261
              d |   .0256568   .0157379     1.63   0.103    -.0051956    .0565091
             td |  -.0009388   .0003066    -3.06   0.002    -.0015397   -.0003378
          _cons |   3.293322   .0448418    73.44   0.000     3.205414    3.381229
---------------------------------------------------------------------------------

                                                        Number of obs =  5,674
                                                        F(30, 5643)   = 288.35
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6052
                                                        Adj R-squared = 0.6031
                                                        Root MSE      = 0.3060

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1572127   .0039734   -39.57   0.000    -.1650021   -.1494233
         expsqr |    .000913   .0001024     8.92   0.000     .0007123    .0011137
 birthmonthdum2 |   .0145682   .0204652     0.71   0.477    -.0255514    .0546878
 birthmonthdum3 |   .0189699   .0203296     0.93   0.351     -.020884    .0588238
 birthmonthdum4 |   .0387254   .0215536     1.80   0.072    -.0035279    .0809786
 birthmonthdum5 |   .0477146   .0205729     2.32   0.020     .0073838    .0880453
 birthmonthdum6 |   .0287116   .0202489     1.42   0.156     -.010984    .0684072
 birthmonthdum7 |   .0561239   .0204391     2.75   0.006     .0160555    .0961923
 birthmonthdum8 |   .0866581   .0198183     4.37   0.000     .0478067    .1255095
 birthmonthdum9 |   .0956614   .0197743     4.84   0.000     .0568962    .1344266
birthmonthdum10 |   .0910413   .0187552     4.85   0.000     .0542739    .1278088
birthmonthdum11 |   .0973328   .0197983     4.92   0.000     .0585205     .136145
birthmonthdum12 |   .1255965   .0200892     6.25   0.000     .0862139    .1649791
   provincedum2 |   .0558261   .0222626     2.51   0.012     .0121827    .0994694
   provincedum3 |   .0742714   .0233272     3.18   0.001     .0285411    .1200017
   provincedum4 |  -.0260392   .0226808    -1.15   0.251    -.0705022    .0184239
   provincedum5 |  -.0065238   .0207604    -0.31   0.753    -.0472222    .0341746
   provincedum6 |   .0834882    .022652     3.69   0.000     .0390816    .1278947
   provincedum7 |   .0385934    .021966     1.76   0.079    -.0044684    .0816553
   provincedum8 |   .0601739   .0212209     2.84   0.005     .0185727    .1017751
   provincedum9 |    .006614   .0215883     0.31   0.759    -.0357074    .0489354
  provincedum10 |   .0005189   .0225158     0.02   0.982    -.0436208    .0446587
  provincedum11 |  -.0064511    .018957    -0.34   0.734    -.0436142    .0307119
  provincedum12 |  -.0141683   .0235173    -0.60   0.547    -.0602712    .0319346
  provincedum13 |   .0042699   .0217396     0.20   0.844    -.0383481     .046888
  provincedum14 |   .0100531   .0280848     0.36   0.720    -.0450038    .0651101
  provincedum15 |   .0826956   .0279672     2.96   0.003      .027869    .1375221
              t |  -.0096573   .0002918   -33.10   0.000    -.0102293   -.0090852
              d |   .0442204   .0171932     2.57   0.010     .0105152    .0779256
             td |  -.0013295   .0003349    -3.97   0.000     -.001986   -.0006729
          _cons |   3.099791   .0489883    63.28   0.000     3.003755    3.195827
---------------------------------------------------------------------------------

                                                        Number of obs =  5,674
                                                        F(30, 5643)   = 183.49
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4938
                                                        Adj R-squared = 0.4911
                                                        Root MSE      = 0.3567

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1075922   .0046316   -23.23   0.000    -.1166719   -.0985125
         expsqr |  -.0002647   .0001193    -2.22   0.027    -.0004987   -.0000308
 birthmonthdum2 |   .0424062   .0238551     1.78   0.076    -.0043589    .0891713
 birthmonthdum3 |   .0316722   .0236971     1.34   0.181    -.0147832    .0781276
 birthmonthdum4 |   .0899809   .0251237     3.58   0.000     .0407287    .1392331
 birthmonthdum5 |   .0606149   .0239806     2.53   0.012     .0136036    .1076261
 birthmonthdum6 |   .0579289   .0236029     2.45   0.014     .0116581    .1041998
 birthmonthdum7 |   .0790696   .0238246     3.32   0.001     .0323641    .1257751
 birthmonthdum8 |   .1064978    .023101     4.61   0.000      .061211    .1517847
 birthmonthdum9 |   .1158901   .0230497     5.03   0.000     .0707038    .1610764
birthmonthdum10 |   .1153038   .0218619     5.27   0.000     .0724461    .1581615
birthmonthdum11 |   .1335386   .0230777     5.79   0.000     .0882974    .1787798
birthmonthdum12 |   .1485636   .0234169     6.34   0.000     .1026575    .1944696
   provincedum2 |   .0495208   .0259503     1.91   0.056    -.0013517    .1003934
   provincedum3 |   .0836677   .0271912     3.08   0.002     .0303625    .1369729
   provincedum4 |  -.0379227   .0264377    -1.43   0.152    -.0897507    .0139053
   provincedum5 |   .0198486   .0241992     0.82   0.412    -.0275912    .0672884
   provincedum6 |   .0976305   .0264041     3.70   0.000     .0458683    .1493927
   provincedum7 |   .0284188   .0256045     1.11   0.267     -.021776    .0786135
   provincedum8 |   .0898698    .024736     3.63   0.000     .0413777    .1383619
   provincedum9 |   .0289967   .0251643     1.15   0.249    -.0203349    .0783283
  provincedum10 |   .0322759   .0262454     1.23   0.219    -.0191753     .083727
  provincedum11 |   .0526223   .0220971     2.38   0.017     .0093035    .0959412
  provincedum12 |   .0066322   .0274127     0.24   0.809    -.0471073    .0603716
  provincedum13 |   .0486503   .0253406     1.92   0.055    -.0010271    .0983277
  provincedum14 |  -.0390085   .0327368    -1.19   0.233    -.1031852    .0251682
  provincedum15 |   .0483104   .0325998     1.48   0.138    -.0155978    .1122185
              t |   -.011184   .0003401   -32.88   0.000    -.0118508   -.0105172
              d |   .0224462   .0200411     1.12   0.263    -.0168421    .0617344
             td |   .0017505   .0003904     4.48   0.000     .0009852    .0025158
          _cons |   2.645368   .0571028    46.33   0.000     2.533425    2.757312
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(30)   =     401.88
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .80064

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.594528   2.373421    -0.67   0.502    -6.246348    3.057292
  secgenhighedu |   2.337012   2.152115     1.09   0.278    -1.881057     6.55508
      secgenedu |  -.1188795   .5665956    -0.21   0.834    -1.229387    .9916274
            exp |   .0599003   .0195181     3.07   0.002     .0216456    .0981551
         expsqr |  -.0013154   .0004798    -2.74   0.006    -.0022559   -.0003749
 birthmonthdum2 |  -.0800625   .0754982    -1.06   0.289    -.2280363    .0679113
 birthmonthdum3 |  -.0136483   .0599984    -0.23   0.820    -.1312431    .1039464
 birthmonthdum4 |  -.0436912   .0843447    -0.52   0.604    -.2090038    .1216215
 birthmonthdum5 |  -.0181112   .0739342    -0.24   0.806    -.1630196    .1267971
 birthmonthdum6 |   .0535234   .0535347     1.00   0.317    -.0514027    .1584496
 birthmonthdum7 |    .048902   .0537174     0.91   0.363    -.0563822    .1541861
 birthmonthdum8 |  -.0578939   .0920574    -0.63   0.529    -.2383232    .1225353
 birthmonthdum9 |  -.0446149   .0670118    -0.67   0.506    -.1759555    .0867257
birthmonthdum10 |  -.0248743   .0540988    -0.46   0.646     -.130906    .0811574
birthmonthdum11 |  -.0260389   .0770789    -0.34   0.735    -.1771108    .1250329
birthmonthdum12 |  -.0668075   .0904089    -0.74   0.460    -.2440056    .1103906
   provincedum2 |  -.3727803   .1011637    -3.68   0.000    -.5710576   -.1745031
   provincedum3 |   -.124562   .0672061    -1.85   0.064    -.2562835    .0071595
   provincedum4 |  -.3152513    .083137    -3.79   0.000    -.4781968   -.1523059
   provincedum5 |   .0515982   .0573535     0.90   0.368    -.0608125     .164009
   provincedum6 |  -.1401657   .0705113    -1.99   0.047    -.2783654   -.0019661
   provincedum7 |  -.2085413   .0576281    -3.62   0.000    -.3214903   -.0955923
   provincedum8 |  -.4310047   .0639823    -6.74   0.000    -.5564077   -.3056018
   provincedum9 |  -.0954134    .066382    -1.44   0.151    -.2255198    .0346929
  provincedum10 |  -.1592708   .0666677    -2.39   0.017    -.2899371   -.0286045
  provincedum11 |  -.0376275   .0732903    -0.51   0.608    -.1812738    .1060189
  provincedum12 |  -.1764363   .0619781    -2.85   0.004    -.2979111   -.0549615
  provincedum13 |  -.1120472   .0585129    -1.91   0.056    -.2267304    .0026359
  provincedum14 |  -.2841665    .100493    -2.83   0.005    -.4811292   -.0872038
  provincedum15 |  -.3213414   .0950006    -3.38   0.001    -.5075392   -.1351436
          _cons |   7.956685   .1708493    46.57   0.000     7.621827    8.291544
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  61.4788  (p = 0.0000)
  Wu-Hausman F(3,5640)            =  20.5933  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  25.619  Chi-sq(30) P-value = 0.6944

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
birthmont~m2 |      5,674    .0771942    .2669229          0          1
birthmonth~3 |      5,674    .0793091    .2702444          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,674    .0636235    .2441026          0          1
birthmonth~5 |      5,674    .0754318    .2641101          0          1
birthmonth~6 |      5,674    .0810716     .272969          0          1
birthmonth~7 |      5,674    .0780754    .2683139          0          1
birthmonth~8 |      5,674    .0882975    .2837521          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,674    .0897074    .2857873          0          1
birthmont~10 |      5,674    .1129714    .3165858          0          1
birthmont~11 |      5,674    .0888262    .2845178          0          1
birthmont~12 |      5,674    .0840677    .2775137          0          1
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 
> 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,947
                                                        F(16, 4930)   = 622.76
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6690
                                                        Adj R-squared = 0.6679
                                                        Root MSE      = 0.2871

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1455756   .0039225   -37.11   0.000    -.1532653   -.1378858
         expsqr |   .0003181   .0001033     3.08   0.002     .0001156    .0005206
 birthmonthdum2 |  -.0067153   .0203034    -0.33   0.741    -.0465191    .0330885
 birthmonthdum3 |   .0386438   .0202535     1.91   0.056    -.0010621    .0783497
 birthmonthdum4 |   .0238333   .0207295     1.15   0.250    -.0168057    .0644724
 birthmonthdum5 |   .0487991   .0208668     2.34   0.019      .007891    .0897072
 birthmonthdum6 |   .0563386    .020217     2.79   0.005     .0167043    .0959729
 birthmonthdum7 |   .0251415   .0205165     1.23   0.220      -.01508    .0653629
 birthmonthdum8 |   .0627876   .0203801     3.08   0.002     .0228336    .1027417
 birthmonthdum9 |    .076447   .0198391     3.85   0.000     .0375536    .1153404
birthmonthdum10 |   .1050902   .0190076     5.53   0.000     .0678267    .1423536
birthmonthdum11 |   .1187524   .0200168     5.93   0.000     .0795106    .1579942
birthmonthdum12 |   .1360326   .0199886     6.81   0.000     .0968459    .1752192
              t |  -.0114827    .000301   -38.15   0.000    -.0120728   -.0108926
              d |   .0189049   .0172818     1.09   0.274    -.0149752     .052785
             td |    .000175   .0003452     0.51   0.612    -.0005018    .0008517
          _cons |   3.197692   .0472726    67.64   0.000     3.105017    3.290368
---------------------------------------------------------------------------------

                                                        Number of obs =  4,947
                                                        F(16, 4930)   = 421.25
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5775
                                                        Adj R-squared = 0.5762
                                                        Root MSE      = 0.3176

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1495939    .004338   -34.48   0.000    -.1580984   -.1410894
         expsqr |   .0008405   .0001142     7.36   0.000     .0006166    .0010644
 birthmonthdum2 |   .0120514   .0224545     0.54   0.591    -.0319694    .0560723
 birthmonthdum3 |   .0176938   .0223993     0.79   0.430    -.0262189    .0616064
 birthmonthdum4 |   .0077116   .0229257     0.34   0.737     -.037233    .0526562
 birthmonthdum5 |   .0452157   .0230775     1.96   0.050    -.0000266    .0904579
 birthmonthdum6 |   .0727443   .0223589     3.25   0.001     .0289108    .1165777
 birthmonthdum7 |   .0334236   .0226902     1.47   0.141    -.0110592    .0779065
 birthmonthdum8 |   .0687895   .0225393     3.05   0.002     .0246024    .1129766
 birthmonthdum9 |   .0622576    .021941     2.84   0.005     .0192435    .1052717
birthmonthdum10 |   .1035716   .0210215     4.93   0.000     .0623602     .144783
birthmonthdum11 |   .1112078   .0221375     5.02   0.000     .0678084    .1546072
birthmonthdum12 |   .1122827   .0221064     5.08   0.000     .0689444    .1556211
              t |   -.009405   .0003329   -28.25   0.000    -.0100576   -.0087524
              d |   .0165324   .0191128     0.86   0.387    -.0209372     .054002
             td |  -.0006384   .0003818    -1.67   0.095    -.0013869    .0001101
          _cons |   2.987802    .052281    57.15   0.000     2.885308    3.090296
---------------------------------------------------------------------------------

                                                        Number of obs =  4,947
                                                        F(16, 4930)   = 270.93
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4679
                                                        Adj R-squared = 0.4662
                                                        Root MSE      = 0.3654

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1022064   .0049911   -20.48   0.000    -.1119911   -.0924216
         expsqr |  -.0002927   .0001314    -2.23   0.026    -.0005504   -.0000351
 birthmonthdum2 |   -.003328   .0258348    -0.13   0.898    -.0539757    .0473197
 birthmonthdum3 |   .0216922   .0257713     0.84   0.400     -.028831    .0722153
 birthmonthdum4 |   .0086015   .0263769     0.33   0.744     -.043109     .060312
 birthmonthdum5 |   .0429879   .0265516     1.62   0.106     -.009065    .0950409
 birthmonthdum6 |   .0836029   .0257248     3.25   0.001     .0331708    .1340349
 birthmonthdum7 |   .0390585   .0261059     1.50   0.135    -.0121207    .0902377
 birthmonthdum8 |   .0749873   .0259323     2.89   0.004     .0241484    .1258262
 birthmonthdum9 |   .0750497   .0252439     2.97   0.003     .0255603     .124539
birthmonthdum10 |   .0930491    .024186     3.85   0.000     .0456338    .1404644
birthmonthdum11 |   .1157638   .0254701     4.55   0.000     .0658311    .1656965
birthmonthdum12 |   .1060704   .0254342     4.17   0.000     .0562079    .1559328
              t |  -.0110596    .000383   -28.88   0.000    -.0118105   -.0103088
              d |  -.0059609     .02199    -0.27   0.786    -.0490711    .0371493
             td |   .0024476   .0004393     5.57   0.000     .0015864    .0033087
          _cons |   2.589046   .0601513    43.04   0.000     2.471123     2.70697
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(16)   =     297.06
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .97076

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   2.986715   9.507502     0.31   0.753    -15.64765    21.62108
  secgenhighedu |  -2.031305   8.360007    -0.24   0.808    -18.41662    14.35401
      secgenedu |  -.7805081   2.745829    -0.28   0.776    -6.162233    4.601217
            exp |  -.0037995   .1440165    -0.03   0.979    -.2860667    .2784678
         expsqr |  -.0000659    .003217    -0.02   0.984    -.0063712    .0062394
 birthmonthdum2 |    -.01689   .1708916    -0.10   0.921    -.3518314    .3180514
 birthmonthdum3 |  -.1316451   .1728839    -0.76   0.446    -.4704914    .2072012
 birthmonthdum4 |  -.0518085   .1542745    -0.34   0.737    -.3541811     .250564
 birthmonthdum5 |   -.066662   .0778146    -0.86   0.392    -.2191759    .0858518
 birthmonthdum6 |   .0239782   .3112422     0.08   0.939    -.5860453    .6340017
 birthmonthdum7 |  -.0207198   .1635313    -0.13   0.899    -.3412352    .2997956
 birthmonthdum8 |   .0119407    .197139     0.06   0.952    -.3744447    .3983261
 birthmonthdum9 |  -.0269336   .0669701    -0.40   0.688    -.1581927    .1043255
birthmonthdum10 |   .0383672   .1359651     0.28   0.778    -.2281196    .3048539
birthmonthdum11 |  -.0040755   .1351131    -0.03   0.976    -.2688923    .2607413
birthmonthdum12 |  -.0262979   .0938747    -0.28   0.779    -.2102889    .1576932
          _cons |   8.130505    1.56173     5.21   0.000      5.06957    11.19144
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  72.8184  (p = 0.0000)
  Wu-Hausman F(3,4927)            =  24.5358  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   3.460  Chi-sq(16) P-value = 0.9996

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
birthmont~m2 |      4,947    .0802507    .2717083          0          1
birthmonth~3 |      4,947    .0812614    .2732637          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,947    .0743885    .2624286          0          1
birthmonth~5 |      4,947    .0725692    .2594543          0          1
birthmonth~6 |      4,947    .0826764    .2754203          0          1
birthmonth~7 |      4,947    .0780271    .2682413          0          1
birthmonth~8 |      4,947    .0798464    .2710826          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,947    .0893471    .2852729          0          1
birthmont~10 |      4,947    .1075399    .3098298          0          1
birthmont~11 |      4,947    .0861128    .2805589          0          1
birthmont~12 |      4,947    .0863149    .2808569          0          1
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,947
                                                        F(30, 4916)   = 338.27
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6737
                                                        Adj R-squared = 0.6717
                                                        Root MSE      = 0.2855

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1460993   .0039122   -37.35   0.000    -.1537689   -.1384298
         expsqr |   .0003221    .000103     3.13   0.002     .0001203     .000524
 birthmonthdum2 |  -.0110598   .0202125    -0.55   0.584    -.0506854    .0285657
 birthmonthdum3 |    .033982   .0202012     1.68   0.093    -.0056215    .0735854
 birthmonthdum4 |   .0193113   .0206534     0.94   0.350    -.0211785    .0598012
 birthmonthdum5 |   .0458499   .0207782     2.21   0.027     .0051153    .0865845
 birthmonthdum6 |   .0545827   .0201288     2.71   0.007     .0151213    .0940441
 birthmonthdum7 |   .0231081    .020426     1.13   0.258    -.0169359    .0631522
 birthmonthdum8 |   .0637318   .0202801     3.14   0.002     .0239738    .1034898
 birthmonthdum9 |   .0777839   .0197599     3.94   0.000     .0390457    .1165222
birthmonthdum10 |   .1053514    .018936     5.56   0.000     .0682285    .1424744
birthmonthdum11 |   .1165228   .0199393     5.84   0.000     .0774328    .1556128
birthmonthdum12 |   .1360178   .0199129     6.83   0.000     .0969796     .175056
   provincedum2 |   .0737246   .0223866     3.29   0.001     .0298369    .1176123
   provincedum3 |   .0720407   .0229158     3.14   0.002     .0271154    .1169659
   provincedum4 |  -.0113977   .0219584    -0.52   0.604     -.054446    .0316506
   provincedum5 |   .0067019   .0203285     0.33   0.742    -.0331512    .0465549
   provincedum6 |   .0710983   .0229201     3.10   0.002     .0261647    .1160319
   provincedum7 |   .0453119   .0209914     2.16   0.031     .0041594    .0864644
   provincedum8 |   .0334917   .0208874     1.60   0.109    -.0074569    .0744404
   provincedum9 |  -.0291989    .021638    -1.35   0.177     -.071619    .0132212
  provincedum10 |  -.0130337   .0216908    -0.60   0.548    -.0555573      .02949
  provincedum11 |  -.0095309   .0184895    -0.52   0.606    -.0457785    .0267167
  provincedum12 |  -.0001182   .0225719    -0.01   0.996    -.0443693    .0441329
  provincedum13 |   .0136751   .0209061     0.65   0.513    -.0273103    .0546604
  provincedum14 |    .038056    .026292     1.45   0.148     -.013488       .0896
  provincedum15 |   .0913037   .0268851     3.40   0.001     .0385969    .1440104
              t |  -.0114887   .0003024   -37.99   0.000    -.0120815   -.0108958
              d |   .0198388   .0172233     1.15   0.249    -.0139265    .0536041
             td |   .0001422   .0003441     0.41   0.679    -.0005324    .0008169
          _cons |   3.189303   .0480589    66.36   0.000     3.095087     3.28352
---------------------------------------------------------------------------------

                                                        Number of obs =  4,947
                                                        F(30, 4916)   = 227.22
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5810
                                                        Adj R-squared = 0.5784
                                                        Root MSE      = 0.3167

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1503042   .0043396   -34.64   0.000    -.1588118   -.1417965
         expsqr |   .0008507   .0001142     7.45   0.000     .0006268    .0010746
 birthmonthdum2 |   .0095203   .0224211     0.42   0.671    -.0344352    .0534758
 birthmonthdum3 |   .0151269   .0224086     0.68   0.500     -.028804    .0590579
 birthmonthdum4 |   .0062502   .0229102     0.27   0.785    -.0386641    .0511644
 birthmonthdum5 |   .0433723   .0230486     1.88   0.060    -.0018133     .088558
 birthmonthdum6 |   .0720087   .0223282     3.23   0.001     .0282353     .115782
 birthmonthdum7 |   .0318145   .0226579     1.40   0.160    -.0126051    .0762342
 birthmonthdum8 |   .0702174   .0224961     3.12   0.002      .026115    .1143198
 birthmonthdum9 |   .0636572   .0219191     2.90   0.004      .020686    .1066283
birthmonthdum10 |   .1048674   .0210051     4.99   0.000      .063688    .1460467
birthmonthdum11 |   .1102751   .0221181     4.99   0.000     .0669137    .1536364
birthmonthdum12 |    .112476   .0220888     5.09   0.000     .0691721    .1557799
   provincedum2 |   .0465057   .0248328     1.87   0.061    -.0021776     .095189
   provincedum3 |   .0811856   .0254198     3.19   0.001     .0313514    .1310199
   provincedum4 |  -.0084291   .0243578    -0.35   0.729    -.0561813     .039323
   provincedum5 |  -.0027169   .0225499    -0.12   0.904    -.0469247    .0414909
   provincedum6 |   .0695779   .0254246     2.74   0.006     .0197344    .1194214
   provincedum7 |   .0266637   .0232851     1.15   0.252    -.0189856    .0723129
   provincedum8 |   .0244387   .0231698     1.05   0.292    -.0209844    .0698617
   provincedum9 |  -.0026128   .0240024    -0.11   0.913    -.0496682    .0444425
  provincedum10 |  -.0201825    .024061    -0.84   0.402    -.0673527    .0269878
  provincedum11 |   .0073034   .0205098     0.36   0.722     -.032905    .0475117
  provincedum12 |  -.0128404   .0250384    -0.51   0.608    -.0619268     .036246
  provincedum13 |   .0181829   .0231905     0.78   0.433     -.027281    .0636467
  provincedum14 |  -.0107057   .0291649    -0.37   0.714    -.0678819    .0464705
  provincedum15 |   .0713781   .0298228     2.39   0.017     .0129121    .1298442
              t |  -.0093816   .0003355   -27.97   0.000    -.0100392    -.008724
              d |   .0160614   .0191053     0.84   0.401    -.0213935    .0535162
             td |  -.0007146   .0003817    -1.87   0.061     -.001463    .0000338
          _cons |   2.984586   .0533103    55.99   0.000     2.880074    3.089098
---------------------------------------------------------------------------------

                                                        Number of obs =  4,947
                                                        F(30, 4916)   = 147.26
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4733
                                                        Adj R-squared = 0.4701
                                                        Root MSE      = 0.3640

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1033086   .0049878   -20.71   0.000    -.1130869   -.0935303
         expsqr |  -.0002756   .0001313    -2.10   0.036     -.000533   -.0000183
 birthmonthdum2 |  -.0041597   .0257698    -0.16   0.872    -.0546801    .0463607
 birthmonthdum3 |    .023421   .0257555     0.91   0.363    -.0270712    .0739132
 birthmonthdum4 |   .0099238   .0263319     0.38   0.706    -.0416986    .0615461
 birthmonthdum5 |   .0405461   .0264911     1.53   0.126    -.0113882    .0924804
 birthmonthdum6 |   .0832162   .0256631     3.24   0.001     .0329052    .1335273
 birthmonthdum7 |   .0385422    .026042     1.48   0.139    -.0125118    .0895961
 birthmonthdum8 |   .0776054    .025856     3.00   0.003     .0269161    .1282947
 birthmonthdum9 |   .0754611   .0251928     3.00   0.003      .026072    .1248502
birthmonthdum10 |   .0960848   .0241423     3.98   0.000     .0487551    .1434145
birthmonthdum11 |   .1161548   .0254215     4.57   0.000     .0663172    .1659924
birthmonthdum12 |   .1072273   .0253878     4.22   0.000     .0574558    .1569988
   provincedum2 |   .0510444   .0285417     1.79   0.074      -.00491    .1069988
   provincedum3 |   .0967259   .0292164     3.31   0.001     .0394487     .154003
   provincedum4 |  -.0324581   .0279957    -1.16   0.246    -.0873423     .022426
   provincedum5 |  -.0185209   .0259178    -0.71   0.475    -.0693313    .0322895
   provincedum6 |   .0430336   .0292218     1.47   0.141    -.0142542    .1003214
   provincedum7 |   .0098202   .0267629     0.37   0.714    -.0426469    .0622874
   provincedum8 |   .0515721   .0266303     1.94   0.053    -.0006351    .1037794
   provincedum9 |   .0338373   .0275872     1.23   0.220     -.020246    .0879206
  provincedum10 |  -.0328123   .0276546    -1.19   0.235    -.0870276     .021403
  provincedum11 |   .0346209    .023573     1.47   0.142    -.0115927    .0808346
  provincedum12 |   .0389862    .028778     1.35   0.176    -.0174315    .0954038
  provincedum13 |   .0034906   .0266542     0.13   0.896    -.0487635    .0557446
  provincedum14 |  -.0452766   .0335208    -1.35   0.177    -.1109923    .0204391
  provincedum15 |   .0879107    .034277     2.56   0.010     .0207125    .1551089
              t |  -.0110229   .0003856   -28.59   0.000    -.0117788   -.0102671
              d |  -.0085742   .0219587    -0.39   0.696    -.0516231    .0344747
             td |   .0023324   .0004388     5.32   0.000     .0014723    .0031926
          _cons |   2.587988   .0612724    42.24   0.000     2.467866    2.708109
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(30)   =     926.60
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0962
                                                  Root MSE        =     .64848

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   1.116716   4.494978     0.25   0.804    -7.693279     9.92671
  secgenhighedu |  -.3937683   3.877591    -0.10   0.919    -7.993707     7.20617
      secgenedu |  -.2448873   1.380779    -0.18   0.859    -2.951164    2.461389
            exp |   .0264548   .0657209     0.40   0.687    -.1023558    .1552654
         expsqr |  -.0007128   .0014831    -0.48   0.631    -.0036196    .0021939
 birthmonthdum2 |  -.0148368   .0936379    -0.16   0.874    -.1983637      .16869
 birthmonthdum3 |   -.065465   .0764437    -0.86   0.392     -.215292    .0843619
 birthmonthdum4 |   .0072869   .0673015     0.11   0.914    -.1246217    .1391955
 birthmonthdum5 |  -.0511006   .0506045    -1.01   0.313    -.1502836    .0480824
 birthmonthdum6 |  -.0214199   .1560486    -0.14   0.891    -.3272695    .2844298
 birthmonthdum7 |  -.0297149   .0862767    -0.34   0.731    -.1988141    .1393843
 birthmonthdum8 |   -.016246   .1035264    -0.16   0.875     -.219154     .186662
 birthmonthdum9 |  -.0175458   .0448213    -0.39   0.695    -.1053939    .0703023
birthmonthdum10 |   .0243714   .0765043     0.32   0.750    -.1255743    .1743171
birthmonthdum11 |  -.0119854    .076942    -0.16   0.876    -.1627889    .1388181
birthmonthdum12 |   .0005793    .053843     0.01   0.991    -.1049511    .1061097
   provincedum2 |  -.6094624   .0959003    -6.36   0.000    -.7974235   -.4215013
   provincedum3 |  -.3072656   .1339407    -2.29   0.022    -.5697846   -.0447467
   provincedum4 |  -.4619705   .0558053    -8.28   0.000    -.5713469    -.352594
   provincedum5 |   -.078502   .0791751    -0.99   0.321    -.2336824    .0766784
   provincedum6 |  -.2457281   .0529839    -4.64   0.000    -.3495746   -.1418816
   provincedum7 |  -.3106399   .0982721    -3.16   0.002    -.5032497   -.1180301
   provincedum8 |  -.4408844   .0502695    -8.77   0.000    -.5394109    -.342358
   provincedum9 |  -.1418885   .1744924    -0.81   0.416    -.4838873    .2001103
  provincedum10 |  -.2048921   .0790755    -2.59   0.010    -.3598772   -.0499069
  provincedum11 |  -.0680353   .1263298    -0.54   0.590    -.3156372    .1795666
  provincedum12 |  -.2501535   .0528599    -4.73   0.000     -.353757     -.14655
  provincedum13 |  -.1718224    .049842    -3.45   0.001    -.2695108   -.0741339
  provincedum14 |  -.2736337   .2788058    -0.98   0.326    -.8200831    .2728157
  provincedum15 |  -.3331185   .0627277    -5.31   0.000    -.4560624   -.2101745
          _cons |   8.013394   .7062676    11.35   0.000     6.629135    9.397653
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  59.8289  (p = 0.0000)
  Wu-Hausman F(3,4913)            =  20.0484  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  29.008  Chi-sq(30) P-value = 0.5172

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
birthmont~m2 |      4,947    .0802507    .2717083          0          1
birthmonth~3 |      4,947    .0812614    .2732637          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,947    .0743885    .2624286          0          1
birthmonth~5 |      4,947    .0725692    .2594543          0          1
birthmonth~6 |      4,947    .0826764    .2754203          0          1
birthmonth~7 |      4,947    .0780271    .2682413          0          1
birthmonth~8 |      4,947    .0798464    .2710826          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,947    .0893471    .2852729          0          1
birthmont~10 |      4,947    .1075399    .3098298          0          1
birthmont~11 |      4,947    .0861128    .2805589          0          1
birthmont~12 |      4,947    .0863149    .2808569          0          1
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 
> 25000) & educat != ., first

First-stage regressions
-----------------------

                                                       Number of obs =  10,621
                                                       F(17, 10603)  = 1279.12
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6722
                                                       Adj R-squared =  0.6717
                                                       Root MSE      =  0.2848

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1509439   .0026713   -56.51   0.000      -.15618   -.1457077
         expsqr |   .0004596   .0000696     6.60   0.000     .0003231    .0005962
 birthmonthdum2 |   -.007691   .0138209    -0.56   0.578    -.0347825    .0194006
 birthmonthdum3 |   .0217927   .0137584     1.58   0.113    -.0051763    .0487617
 birthmonthdum4 |   .0219742   .0143355     1.53   0.125    -.0061262    .0500745
 birthmonthdum5 |    .037923   .0140472     2.70   0.007     .0103879    .0654581
 birthmonthdum6 |   .0441671   .0137167     3.22   0.001     .0172798    .0710544
 birthmonthdum7 |   .0456219   .0138742     3.29   0.001     .0184259     .072818
 birthmonthdum8 |   .0620878   .0136117     4.56   0.000     .0354062    .0887694
 birthmonthdum9 |    .082325    .013425     6.13   0.000     .0560095    .1086406
birthmonthdum10 |   .0980764   .0127967     7.66   0.000     .0729925    .1231603
birthmonthdum11 |   .1006497   .0134928     7.46   0.000     .0742012    .1270981
birthmonthdum12 |   .1222088   .0135903     8.99   0.000     .0955692    .1488484
           male |  -.0112945   .0055464    -2.04   0.042    -.0221665   -.0004225
              t |  -.0111068   .0002003   -55.45   0.000    -.0114995   -.0107142
              d |   .0213655   .0116734     1.83   0.067    -.0015166    .0442476
             td |  -.0004121   .0002302    -1.79   0.073    -.0008634    .0000391
          _cons |   3.261184   .0323114   100.93   0.000     3.197848     3.32452
---------------------------------------------------------------------------------

                                                        Number of obs = 10,621
                                                        F(17, 10603)  = 893.15
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5888
                                                        Adj R-squared = 0.5882
                                                        Root MSE      = 0.3123

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1531358   .0029294   -52.28   0.000    -.1588779   -.1473937
         expsqr |   .0008737   .0000764    11.44   0.000      .000724    .0010234
 birthmonthdum2 |    .009986   .0151563     0.66   0.510    -.0197231    .0396951
 birthmonthdum3 |   .0163675   .0150877     1.08   0.278    -.0132073    .0459422
 birthmonthdum4 |   .0201813   .0157207     1.28   0.199    -.0106341    .0509968
 birthmonthdum5 |   .0448789   .0154044     2.91   0.004     .0146833    .0750745
 birthmonthdum6 |   .0480187    .015042     3.19   0.001     .0185334    .0775039
 birthmonthdum7 |    .045055   .0152148     2.96   0.003     .0152312    .0748788
 birthmonthdum8 |   .0759504   .0149269     5.09   0.000     .0466908      .10521
 birthmonthdum9 |   .0786149   .0147222     5.34   0.000     .0497567    .1074731
birthmonthdum10 |   .0952311   .0140331     6.79   0.000     .0677236    .1227387
birthmonthdum11 |   .1014783   .0147965     6.86   0.000     .0724743    .1304822
birthmonthdum12 |   .1181327   .0149035     7.93   0.000     .0889191    .1473463
           male |    .002891   .0060823     0.48   0.635    -.0090314    .0148134
              t |  -.0095218   .0002197   -43.35   0.000    -.0099524   -.0090913
              d |   .0299555   .0128013     2.34   0.019     .0048625    .0550485
             td |  -.0009799   .0002524    -3.88   0.000    -.0014747    -.000485
          _cons |   3.050015   .0354334    86.08   0.000     2.980559    3.119471
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(16)   =    1026.95
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .77064

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.102781   .8020968    -1.37   0.169    -2.674862    .4693002
  secgenhighedu |   1.809626   .9008545     2.01   0.045     .0439838    3.575268
            exp |   .0554468   .0133252     4.16   0.000     .0293299    .0815638
         expsqr |  -.0012877   .0003147    -4.09   0.000    -.0019046   -.0006708
 birthmonthdum2 |  -.0683263   .0405696    -1.68   0.092    -.1478412    .0111885
 birthmonthdum3 |  -.0306985   .0372624    -0.82   0.410    -.1037316    .0423345
 birthmonthdum4 |  -.0161782   .0387716    -0.42   0.676    -.0921691    .0598128
 birthmonthdum5 |  -.0371865   .0392361    -0.95   0.343    -.1140878    .0397147
 birthmonthdum6 |  -.0119384    .037876    -0.32   0.753     -.086174    .0622972
 birthmonthdum7 |  -.0156679   .0377099    -0.42   0.678     -.089578    .0582422
 birthmonthdum8 |  -.0475126    .041158    -1.15   0.248    -.1281807    .0331556
 birthmonthdum9 |  -.0251646   .0365434    -0.69   0.491    -.0967884    .0464591
birthmonthdum10 |  -.0173842   .0354327    -0.49   0.624     -.086831    .0520626
birthmonthdum11 |  -.0304009   .0382422    -0.79   0.427    -.1053543    .0445525
birthmonthdum12 |  -.0241834   .0376283    -0.64   0.520    -.0979335    .0495667
           male |   .2748158   .0187615    14.65   0.000      .238044    .3115876
          _cons |   7.523709   .1053502    71.42   0.000     7.317227    7.730192
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  138.936  (p = 0.0000)
  Wu-Hausman F(2,10602)           =  70.2629  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .507535  (p = 0.4762)
  Basmann chi2(1)        =  .506699  (p = 0.4766)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  17.382  Chi-sq(17) P-value = 0.4288

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
birthmont~m2 |     10,621    .0786178     .269154          0          1
birthmonth~3 |     10,621    .0802184    .2716439          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,621    .0686376    .2528488          0          1
birthmonth~5 |     10,621    .0740985    .2619434          0          1
birthmonth~6 |     10,621     .081819    .2741017          0          1
birthmonth~7 |     10,621    .0780529    .2682675          0          1
birthmonth~8 |     10,621    .0843612    .2779418          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,621    .0895396    .2855345          0          1
birthmont~10 |     10,621    .1104416    .3134541          0          1
birthmont~11 |     10,621    .0875624    .2826707          0          1
birthmont~12 |     10,621    .0851144     .279065          0          1
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & in
> range(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,621
                                                        F(31, 10589)  = 718.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6778
                                                        Adj R-squared = 0.6769
                                                        Root MSE      = 0.2825

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1518677   .0026586   -57.12   0.000     -.157079   -.1466563
         expsqr |   .0004693   .0000692     6.78   0.000     .0003337    .0006049
 birthmonthdum2 |  -.0067628   .0137196    -0.49   0.622    -.0336559    .0201303
 birthmonthdum3 |   .0210029   .0136645     1.54   0.124    -.0057821    .0477879
 birthmonthdum4 |   .0226668   .0142339     1.59   0.111    -.0052344     .050568
 birthmonthdum5 |   .0385371   .0139425     2.76   0.006     .0112071     .065867
 birthmonthdum6 |   .0447465   .0136182     3.29   0.001     .0180524    .0714407
 birthmonthdum7 |   .0457653    .013776     3.32   0.001     .0187617    .0727689
 birthmonthdum8 |    .064942   .0135129     4.81   0.000     .0384543    .0914298
 birthmonthdum9 |   .0843129   .0133358     6.32   0.000     .0581722    .1104535
birthmonthdum10 |   .1006939   .0127098     7.92   0.000     .0757802    .1256075
birthmonthdum11 |   .1024611   .0133962     7.65   0.000      .076202    .1287202
birthmonthdum12 |   .1230066   .0134981     9.11   0.000     .0965479    .1494654
           male |  -.0118687   .0055065    -2.16   0.031    -.0226625   -.0010749
   provincedum2 |   .0839362   .0150356     5.58   0.000     .0544637    .1134088
   provincedum3 |   .0841157   .0155962     5.39   0.000     .0535442    .1146871
   provincedum4 |  -.0101397   .0150648    -0.67   0.501    -.0396694    .0193901
   provincedum5 |   .0044458   .0138615     0.32   0.748    -.0227253     .031617
   provincedum6 |   .0741045   .0153466     4.83   0.000     .0440222    .1041868
   provincedum7 |   .0406563   .0144897     2.81   0.005     .0122538    .0690588
   provincedum8 |   .0461736   .0142046     3.25   0.001     .0183299    .0740173
   provincedum9 |  -.0154481     .01456    -1.06   0.289    -.0439884    .0130922
  provincedum10 |  -.0108293   .0149179    -0.73   0.468    -.0400711    .0184125
  provincedum11 |  -.0151128   .0126285    -1.20   0.231    -.0398671    .0096414
  provincedum12 |  -.0077226   .0155531    -0.50   0.620    -.0382096    .0227643
  provincedum13 |   .0130403   .0143909     0.91   0.365    -.0151686    .0412491
  provincedum14 |   .0326974   .0183451     1.78   0.075    -.0032624    .0686572
  provincedum15 |   .0996011   .0185088     5.38   0.000     .0633204    .1358818
              t |  -.0111208   .0001999   -55.64   0.000    -.0115127    -.010729
              d |   .0218816   .0116016     1.89   0.059    -.0008597    .0446229
             td |   -.000464   .0002287    -2.03   0.042    -.0009122   -.0000158
          _cons |   3.254845   .0327656    99.34   0.000     3.190618    3.319071
---------------------------------------------------------------------------------

                                                        Number of obs = 10,621
                                                        F(31, 10589)  = 497.33
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5928
                                                        Adj R-squared = 0.5916
                                                        Root MSE      = 0.3110

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1540509   .0029264   -52.64   0.000    -.1597872   -.1483147
         expsqr |   .0008819   .0000762    11.58   0.000     .0007326    .0010312
 birthmonthdum2 |   .0110572   .0151015     0.73   0.464    -.0185446    .0406591
 birthmonthdum3 |   .0163291   .0150408     1.09   0.278    -.0131538    .0458119
 birthmonthdum4 |   .0219905   .0156676     1.40   0.160     -.008721     .052702
 birthmonthdum5 |   .0454198   .0153468     2.96   0.003     .0153371    .0755025
 birthmonthdum6 |   .0484545   .0149898     3.23   0.001     .0190716    .0778373
 birthmonthdum7 |   .0451864   .0151636     2.98   0.003     .0154629      .07491
 birthmonthdum8 |   .0788968   .0148739     5.30   0.000     .0497412    .1080525
 birthmonthdum9 |   .0803853    .014679     5.48   0.000     .0516116    .1091589
birthmonthdum10 |   .0975145     .01399     6.97   0.000     .0700914    .1249376
birthmonthdum11 |   .1035895   .0147455     7.03   0.000     .0746854    .1324935
birthmonthdum12 |   .1187579   .0148577     7.99   0.000     .0896341    .1478817
           male |   .0020746   .0060611     0.34   0.732    -.0098063    .0139556
   provincedum2 |   .0498769     .01655     3.01   0.003     .0174358     .082318
   provincedum3 |   .0769518   .0171671     4.48   0.000     .0433011    .1106026
   provincedum4 |   -.018455   .0165822    -1.11   0.266    -.0509592    .0140491
   provincedum5 |  -.0051162   .0152577    -0.34   0.737    -.0350242    .0247917
   provincedum6 |   .0767212   .0168924     4.54   0.000     .0436089    .1098335
   provincedum7 |   .0323497   .0159491     2.03   0.043     .0010864     .063613
   provincedum8 |   .0430438   .0156353     2.75   0.006     .0123956    .0736919
   provincedum9 |   .0023156   .0160265     0.14   0.885    -.0290994    .0337306
  provincedum10 |  -.0098695   .0164205    -0.60   0.548    -.0420566    .0223177
  provincedum11 |  -.0010528   .0139005    -0.08   0.940    -.0283004    .0261947
  provincedum12 |  -.0136751   .0171196    -0.80   0.424    -.0472328    .0198826
  provincedum13 |   .0110378   .0158404     0.70   0.486    -.0200124    .0420879
  provincedum14 |  -.0002564   .0201929    -0.01   0.990    -.0398383    .0393254
  provincedum15 |   .0771418    .020373     3.79   0.000     .0372068    .1170768
              t |  -.0095347     .00022   -43.34   0.000     -.009966   -.0091034
              d |   .0298225   .0127701     2.34   0.020     .0047906    .0548544
             td |  -.0010444   .0002517    -4.15   0.000    -.0015377   -.0005511
          _cons |   3.048581   .0360659    84.53   0.000     2.977885    3.119277
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(30)   =    1536.49
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      .7325

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   -.927715   .7521311    -1.23   0.217    -2.401865    .5464349
  secgenhighedu |   1.595049   .8433813     1.89   0.059    -.0579485    3.248046
            exp |   .0543645   .0123317     4.41   0.000     .0301947    .0785342
         expsqr |  -.0012503   .0002925    -4.27   0.000    -.0018236   -.0006769
 birthmonthdum2 |  -.0637822   .0385867    -1.65   0.098    -.1394108    .0118464
 birthmonthdum3 |  -.0206862   .0354259    -0.58   0.559    -.0901197    .0487473
 birthmonthdum4 |  -.0070517   .0369146    -0.19   0.849     -.079403    .0652996
 birthmonthdum5 |  -.0317923   .0372663    -0.85   0.394    -.1048328    .0412482
 birthmonthdum6 |   -.007091   .0359856    -0.20   0.844    -.0776216    .0634395
 birthmonthdum7 |  -.0122384   .0358643    -0.34   0.733    -.0825312    .0580543
 birthmonthdum8 |  -.0493972   .0391481    -1.26   0.207    -.1261261    .0273318
 birthmonthdum9 |  -.0268044   .0347579    -0.77   0.441    -.0949286    .0413199
birthmonthdum10 |  -.0164336   .0336545    -0.49   0.625    -.0823953     .049528
birthmonthdum11 |  -.0275576   .0364202    -0.76   0.449    -.0989398    .0438246
birthmonthdum12 |  -.0203434   .0357295    -0.57   0.569    -.0903719     .049685
           male |   .2793131   .0175986    15.87   0.000     .2448205    .3138057
   provincedum2 |  -.4740979   .0441984   -10.73   0.000    -.5607252   -.3874705
   provincedum3 |  -.2386258   .0403061    -5.92   0.000    -.3176244   -.1596273
   provincedum4 |  -.3915293   .0398658    -9.82   0.000    -.4696648   -.3133937
   provincedum5 |  -.0087855   .0366765    -0.24   0.811    -.0806701     .063099
   provincedum6 |  -.1955154   .0404551    -4.83   0.000    -.2748059   -.1162248
   provincedum7 |  -.2436981   .0375912    -6.48   0.000    -.3173755   -.1700207
   provincedum8 |  -.4414523   .0367002   -12.03   0.000    -.5133833   -.3695213
   provincedum9 |   -.149091   .0399978    -3.73   0.000    -.2274852   -.0706968
  provincedum10 |  -.1767853   .0386601    -4.57   0.000    -.2525578   -.1010128
  provincedum11 |  -.0760137   .0343375    -2.21   0.027    -.1433139   -.0087135
  provincedum12 |   -.212344   .0408081    -5.20   0.000    -.2923263   -.1323616
  provincedum13 |  -.1549216    .037275    -4.16   0.000    -.2279792    -.081864
  provincedum14 |  -.2340117   .0536871    -4.36   0.000    -.3392365    -.128787
  provincedum15 |   -.333161   .0490461    -6.79   0.000    -.4292896   -.2370323
          _cons |   7.729431   .1017059    76.00   0.000     7.530091    7.928771
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  107.153  (p = 0.0000)
  Wu-Hausman F(2,10588)           =  53.9541  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .267442  (p = 0.6051)
  Basmann chi2(1)        =  .266643  (p = 0.6056)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  45.933  Chi-sq(31) P-value = 0.0411

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
birthmont~m2 |     10,621    .0786178     .269154          0          1
birthmonth~3 |     10,621    .0802184    .2716439          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,621    .0686376    .2528488          0          1
birthmonth~5 |     10,621    .0740985    .2619434          0          1
birthmonth~6 |     10,621     .081819    .2741017          0          1
birthmonth~7 |     10,621    .0780529    .2682675          0          1
birthmonth~8 |     10,621    .0843612    .2779418          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,621    .0895396    .2855345          0          1
birthmont~10 |     10,621    .1104416    .3134541          0          1
birthmont~11 |     10,621    .0875624    .2826707          0          1
birthmont~12 |     10,621    .0851144     .279065          0          1
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000
> ) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,674
                                                        F(16, 5657)   = 737.01
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6758
                                                        Adj R-squared = 0.6749
                                                        Root MSE      = 0.2827

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1552985   .0036552   -42.49   0.000    -.1624641   -.1481329
         expsqr |   .0005755   .0000944     6.09   0.000     .0003904    .0007606
 birthmonthdum2 |  -.0077723   .0188666    -0.41   0.680    -.0447579    .0292134
 birthmonthdum3 |   .0076664   .0187469     0.41   0.683    -.0290847    .0444175
 birthmonthdum4 |   .0210596   .0198778     1.06   0.289    -.0179085    .0600277
 birthmonthdum5 |   .0290594   .0189946     1.53   0.126    -.0081773     .066296
 birthmonthdum6 |   .0341938   .0186798     1.83   0.067    -.0024258    .0708134
 birthmonthdum7 |   .0634181   .0188529     3.36   0.001     .0264591    .1003771
 birthmonthdum8 |   .0617562   .0182879     3.38   0.001     .0259049    .0976074
 birthmonthdum9 |   .0878622   .0182331     4.82   0.000     .0521183     .123606
birthmonthdum10 |   .0916642   .0173001     5.30   0.000     .0577493    .1255791
birthmonthdum11 |   .0851078   .0182599     4.66   0.000     .0493113    .1209042
birthmonthdum12 |   .1102557    .018532     5.95   0.000     .0739259    .1465856
              t |  -.0108079   .0002684   -40.26   0.000    -.0113341   -.0102817
              d |   .0250125   .0158447     1.58   0.114    -.0060492    .0560743
             td |  -.0008834   .0003089    -2.86   0.004     -.001489   -.0002778
          _cons |   3.300327   .0442274    74.62   0.000     3.213625     3.38703
---------------------------------------------------------------------------------

                                                        Number of obs =  5,674
                                                        F(16, 5657)   = 530.80
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6002
                                                        Adj R-squared = 0.5991
                                                        Root MSE      = 0.3076

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1560647   .0039764   -39.25   0.000      -.16386   -.1482694
         expsqr |   .0009041   .0001027     8.80   0.000     .0007027    .0011055
 birthmonthdum2 |   .0092478   .0205246     0.45   0.652    -.0309883    .0494839
 birthmonthdum3 |   .0158093   .0203944     0.78   0.438    -.0241716    .0557902
 birthmonthdum4 |   .0320589   .0216247     1.48   0.138    -.0103338    .0744516
 birthmonthdum5 |   .0443352   .0206639     2.15   0.032     .0038261    .0848443
 birthmonthdum6 |   .0259039   .0203214     1.27   0.202    -.0139339    .0657417
 birthmonthdum7 |   .0542591   .0205098     2.65   0.008     .0140521    .0944662
 birthmonthdum8 |   .0819048   .0198951     4.12   0.000     .0429028    .1209067
 birthmonthdum9 |   .0925983   .0198355     4.67   0.000     .0537132    .1314834
birthmonthdum10 |   .0875915   .0188205     4.65   0.000      .050696    .1244869
birthmonthdum11 |   .0924175   .0198646     4.65   0.000     .0534752    .1313598
birthmonthdum12 |   .1240311   .0201606     6.15   0.000     .0845086    .1635537
              t |  -.0096212    .000292   -32.95   0.000    -.0101936   -.0090487
              d |   .0439431   .0172372     2.55   0.011     .0101516    .0777346
             td |  -.0012639   .0003361    -3.76   0.000    -.0019227   -.0006051
          _cons |   3.101848   .0481143    64.47   0.000     3.007525     3.19617
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(15)   =     168.42
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .92883

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -2.346299   1.359187    -1.73   0.084    -5.010257    .3176598
  secgenhighedu |   3.070723   1.493976     2.06   0.040     .1425833    5.998862
            exp |   .0648074   .0177445     3.65   0.000     .0300289    .0995859
         expsqr |  -.0014407   .0004378    -3.29   0.001    -.0022987   -.0005827
 birthmonthdum2 |  -.0746055   .0665824    -1.12   0.263    -.2051046    .0558935
 birthmonthdum3 |  -.0167261   .0628308    -0.27   0.790    -.1398722      .10642
 birthmonthdum4 |  -.0531721   .0679637    -0.78   0.434    -.1863786    .0800343
 birthmonthdum5 |  -.0249918   .0673529    -0.37   0.711    -.1570011    .1070176
 birthmonthdum6 |   .0633994   .0618836     1.02   0.306    -.0578903    .1846891
 birthmonthdum7 |   .0580133   .0620992     0.93   0.350    -.0636989    .1797256
 birthmonthdum8 |  -.0655466   .0704109    -0.93   0.352    -.2035494    .0724562
 birthmonthdum9 |  -.0424849   .0622307    -0.68   0.495    -.1644547     .079485
birthmonthdum10 |   -.025414   .0571955    -0.44   0.657    -.1375152    .0866872
birthmonthdum11 |  -.0316913   .0642824    -0.49   0.622    -.1576825    .0942998
birthmonthdum12 |  -.0823449   .0698388    -1.18   0.238    -.2192264    .0545365
          _cons |   7.745625   .1357187    57.07   0.000     7.479621    8.011629
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  77.8816  (p = 0.0000)
  Wu-Hausman F(2,5656)            =  39.3575  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .022841  (p = 0.8799)
  Basmann chi2(1)        =  .022772  (p = 0.8801)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   6.714  Chi-sq(16) P-value = 0.9784

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
birthmont~m2 |      5,674    .0771942    .2669229          0          1
birthmonth~3 |      5,674    .0793091    .2702444          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,674    .0636235    .2441026          0          1
birthmonth~5 |      5,674    .0754318    .2641101          0          1
birthmonth~6 |      5,674    .0810716     .272969          0          1
birthmonth~7 |      5,674    .0780754    .2683139          0          1
birthmonth~8 |      5,674    .0882975    .2837521          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,674    .0897074    .2857873          0          1
birthmont~10 |      5,674    .1129714    .3165858          0          1
birthmont~11 |      5,674    .0888262    .2845178          0          1
birthmont~12 |      5,674    .0840677    .2775137          0          1
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange
> (monthlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,674
                                                        F(30, 5643)   = 404.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6825
                                                        Adj R-squared = 0.6809
                                                        Root MSE      = 0.2801

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |    -.15658   .0036371   -43.05   0.000    -.1637101   -.1494499
         expsqr |   .0005879   .0000937     6.27   0.000     .0004041    .0007716
 birthmonthdum2 |  -.0007476   .0187329    -0.04   0.968    -.0374714    .0359762
 birthmonthdum3 |   .0112486   .0186089     0.60   0.546    -.0252319    .0477292
 birthmonthdum4 |   .0274025   .0197292     1.39   0.165    -.0112743    .0660793
 birthmonthdum5 |   .0332636   .0188315     1.77   0.077    -.0036534    .0701807
 birthmonthdum6 |   .0376232    .018535     2.03   0.042     .0012875    .0739588
 birthmonthdum7 |    .066083   .0187091     3.53   0.000     .0294061      .10276
 birthmonthdum8 |   .0671403   .0181408     3.70   0.000     .0315774    .1027032
 birthmonthdum9 |   .0907939   .0181005     5.02   0.000     .0553099    .1262779
birthmonthdum10 |   .0963943   .0171677     5.61   0.000      .062739    .1300497
birthmonthdum11 |   .0910264   .0181225     5.02   0.000     .0554993    .1265534
birthmonthdum12 |   .1122373   .0183888     6.10   0.000     .0761881    .1482864
   provincedum2 |   .0947908   .0203783     4.65   0.000     .0548415    .1347401
   provincedum3 |   .0957169   .0213527     4.48   0.000     .0538573    .1375765
   provincedum4 |  -.0077534    .020761    -0.37   0.709     -.048453    .0329461
   provincedum5 |   .0044562   .0190032     0.23   0.815    -.0327974    .0417098
   provincedum6 |   .0784215   .0207347     3.78   0.000     .0377736    .1190694
   provincedum7 |   .0379272   .0201068     1.89   0.059    -.0014898    .0773441
   provincedum8 |   .0593221   .0194247     3.05   0.002     .0212422    .0974021
   provincedum9 |  -.0033429    .019761    -0.17   0.866    -.0420821    .0353963
  provincedum10 |  -.0065069     .02061    -0.32   0.752    -.0469105    .0338968
  provincedum11 |  -.0168907   .0173524    -0.97   0.330    -.0509082    .0171267
  provincedum12 |   -.012102   .0215267    -0.56   0.574    -.0543026    .0300987
  provincedum13 |   .0141441   .0198995     0.71   0.477    -.0248667    .0531548
  provincedum14 |   .0282061   .0257076     1.10   0.273    -.0221907    .0786028
  provincedum15 |   .1088844      .0256     4.25   0.000     .0586986    .1590703
              t |  -.0108497   .0002671   -40.62   0.000    -.0113733   -.0103261
              d |   .0256568   .0157379     1.63   0.103    -.0051956    .0565091
             td |  -.0009388   .0003066    -3.06   0.002    -.0015397   -.0003378
          _cons |   3.293322   .0448418    73.44   0.000     3.205414    3.381229
---------------------------------------------------------------------------------

                                                        Number of obs =  5,674
                                                        F(30, 5643)   = 288.35
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6052
                                                        Adj R-squared = 0.6031
                                                        Root MSE      = 0.3060

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1572127   .0039734   -39.57   0.000    -.1650021   -.1494233
         expsqr |    .000913   .0001024     8.92   0.000     .0007123    .0011137
 birthmonthdum2 |   .0145682   .0204652     0.71   0.477    -.0255514    .0546878
 birthmonthdum3 |   .0189699   .0203296     0.93   0.351     -.020884    .0588238
 birthmonthdum4 |   .0387254   .0215536     1.80   0.072    -.0035279    .0809786
 birthmonthdum5 |   .0477146   .0205729     2.32   0.020     .0073838    .0880453
 birthmonthdum6 |   .0287116   .0202489     1.42   0.156     -.010984    .0684072
 birthmonthdum7 |   .0561239   .0204391     2.75   0.006     .0160555    .0961923
 birthmonthdum8 |   .0866581   .0198183     4.37   0.000     .0478067    .1255095
 birthmonthdum9 |   .0956614   .0197743     4.84   0.000     .0568962    .1344266
birthmonthdum10 |   .0910413   .0187552     4.85   0.000     .0542739    .1278088
birthmonthdum11 |   .0973328   .0197983     4.92   0.000     .0585205     .136145
birthmonthdum12 |   .1255965   .0200892     6.25   0.000     .0862139    .1649791
   provincedum2 |   .0558261   .0222626     2.51   0.012     .0121827    .0994694
   provincedum3 |   .0742714   .0233272     3.18   0.001     .0285411    .1200017
   provincedum4 |  -.0260392   .0226808    -1.15   0.251    -.0705022    .0184239
   provincedum5 |  -.0065238   .0207604    -0.31   0.753    -.0472222    .0341746
   provincedum6 |   .0834882    .022652     3.69   0.000     .0390816    .1278947
   provincedum7 |   .0385934    .021966     1.76   0.079    -.0044684    .0816553
   provincedum8 |   .0601739   .0212209     2.84   0.005     .0185727    .1017751
   provincedum9 |    .006614   .0215883     0.31   0.759    -.0357074    .0489354
  provincedum10 |   .0005189   .0225158     0.02   0.982    -.0436208    .0446587
  provincedum11 |  -.0064511    .018957    -0.34   0.734    -.0436142    .0307119
  provincedum12 |  -.0141683   .0235173    -0.60   0.547    -.0602712    .0319346
  provincedum13 |   .0042699   .0217396     0.20   0.844    -.0383481     .046888
  provincedum14 |   .0100531   .0280848     0.36   0.720    -.0450038    .0651101
  provincedum15 |   .0826956   .0279672     2.96   0.003      .027869    .1375221
              t |  -.0096573   .0002918   -33.10   0.000    -.0102293   -.0090852
              d |   .0442204   .0171932     2.57   0.010     .0105152    .0779256
             td |  -.0013295   .0003349    -3.97   0.000     -.001986   -.0006729
          _cons |   3.099791   .0489883    63.28   0.000     3.003755    3.195827
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(29)   =     344.94
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .86416

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -2.028585   1.255601    -1.62   0.106    -4.489519    .4323486
  secgenhighedu |   2.700389   1.378891     1.96   0.050     -.002189    5.402966
            exp |   .0625365   .0161215     3.88   0.000     .0309389     .094134
         expsqr |  -.0013796   .0003987    -3.46   0.001    -.0021612   -.0005981
 birthmonthdum2 |  -.0904603   .0614749    -1.47   0.141     -.210949    .0300283
 birthmonthdum3 |  -.0190418   .0585134    -0.33   0.745    -.1337259    .0956423
 birthmonthdum4 |  -.0563491   .0636204    -0.89   0.376    -.1810427    .0683446
 birthmonthdum5 |  -.0277886   .0623671    -0.45   0.656    -.1500259    .0944488
 birthmonthdum6 |     .05299   .0577166     0.92   0.359    -.0601324    .1661124
 birthmonthdum7 |   .0485551   .0579514     0.84   0.402    -.0650276    .1621379
 birthmonthdum8 |  -.0724604   .0652494    -1.11   0.267    -.2003469    .0554261
 birthmonthdum9 |  -.0529906   .0580935    -0.91   0.362    -.1668518    .0608706
birthmonthdum10 |  -.0295796   .0531373    -0.56   0.578    -.1337268    .0745676
birthmonthdum11 |  -.0373311   .0595551    -0.63   0.531    -.1540569    .0793947
birthmonthdum12 |  -.0810089   .0646915    -1.25   0.210    -.2078019    .0457841
   provincedum2 |  -.3575602   .0761052    -4.70   0.000    -.5067235   -.2083968
   provincedum3 |  -.1199576   .0685615    -1.75   0.080    -.2543358    .0144205
   provincedum4 |  -.3042797   .0697592    -4.36   0.000    -.4410052   -.1675541
   provincedum5 |   .0539608   .0606987     0.89   0.374    -.0650064     .172928
   provincedum6 |  -.1478122   .0651516    -2.27   0.023     -.275507   -.0201174
   provincedum7 |  -.2093576    .062058    -3.37   0.001    -.3309889   -.0877262
   provincedum8 |  -.4376608   .0599718    -7.30   0.000    -.5552033   -.3201183
   provincedum9 |  -.1023966   .0619921    -1.65   0.099    -.2238988    .0191057
  provincedum10 |  -.1657462   .0637821    -2.60   0.009    -.2907567   -.0407356
  provincedum11 |  -.0487537   .0546036    -0.89   0.372    -.1557748    .0582673
  provincedum12 |  -.1772806   .0667538    -2.66   0.008    -.3081156   -.0464455
  provincedum13 |  -.1130703   .0629352    -1.80   0.072     -.236421    .0102803
  provincedum14 |  -.2705172   .0826715    -3.27   0.001    -.4325504   -.1084841
  provincedum15 |   -.309636   .0829938    -3.73   0.000    -.4723009    -.146971
          _cons |   7.932227   .1348091    58.84   0.000     7.668006    8.196448
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  58.2995  (p = 0.0000)
  Wu-Hausman F(2,5642)            =  29.2863  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .037788  (p = 0.8459)
  Basmann chi2(1)        =  .037582  (p = 0.8463)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  18.516  Chi-sq(30) P-value = 0.9496

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
birthmont~m2 |      5,674    .0771942    .2669229          0          1
birthmonth~3 |      5,674    .0793091    .2702444          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,674    .0636235    .2441026          0          1
birthmonth~5 |      5,674    .0754318    .2641101          0          1
birthmonth~6 |      5,674    .0810716     .272969          0          1
birthmonth~7 |      5,674    .0780754    .2683139          0          1
birthmonth~8 |      5,674    .0882975    .2837521          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,674    .0897074    .2857873          0          1
birthmont~10 |      5,674    .1129714    .3165858          0          1
birthmont~11 |      5,674    .0888262    .2845178          0          1
birthmont~12 |      5,674    .0840677    .2775137          0          1
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000
> ) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,947
                                                        F(16, 4930)   = 622.76
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6690
                                                        Adj R-squared = 0.6679
                                                        Root MSE      = 0.2871

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1455756   .0039225   -37.11   0.000    -.1532653   -.1378858
         expsqr |   .0003181   .0001033     3.08   0.002     .0001156    .0005206
 birthmonthdum2 |  -.0067153   .0203034    -0.33   0.741    -.0465191    .0330885
 birthmonthdum3 |   .0386438   .0202535     1.91   0.056    -.0010621    .0783497
 birthmonthdum4 |   .0238333   .0207295     1.15   0.250    -.0168057    .0644724
 birthmonthdum5 |   .0487991   .0208668     2.34   0.019      .007891    .0897072
 birthmonthdum6 |   .0563386    .020217     2.79   0.005     .0167043    .0959729
 birthmonthdum7 |   .0251415   .0205165     1.23   0.220      -.01508    .0653629
 birthmonthdum8 |   .0627876   .0203801     3.08   0.002     .0228336    .1027417
 birthmonthdum9 |    .076447   .0198391     3.85   0.000     .0375536    .1153404
birthmonthdum10 |   .1050902   .0190076     5.53   0.000     .0678267    .1423536
birthmonthdum11 |   .1187524   .0200168     5.93   0.000     .0795106    .1579942
birthmonthdum12 |   .1360326   .0199886     6.81   0.000     .0968459    .1752192
              t |  -.0114827    .000301   -38.15   0.000    -.0120728   -.0108926
              d |   .0189049   .0172818     1.09   0.274    -.0149752     .052785
             td |    .000175   .0003452     0.51   0.612    -.0005018    .0008517
          _cons |   3.197692   .0472726    67.64   0.000     3.105017    3.290368
---------------------------------------------------------------------------------

                                                        Number of obs =  4,947
                                                        F(16, 4930)   = 421.25
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5775
                                                        Adj R-squared = 0.5762
                                                        Root MSE      = 0.3176

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1495939    .004338   -34.48   0.000    -.1580984   -.1410894
         expsqr |   .0008405   .0001142     7.36   0.000     .0006166    .0010644
 birthmonthdum2 |   .0120514   .0224545     0.54   0.591    -.0319694    .0560723
 birthmonthdum3 |   .0176938   .0223993     0.79   0.430    -.0262189    .0616064
 birthmonthdum4 |   .0077116   .0229257     0.34   0.737     -.037233    .0526562
 birthmonthdum5 |   .0452157   .0230775     1.96   0.050    -.0000266    .0904579
 birthmonthdum6 |   .0727443   .0223589     3.25   0.001     .0289108    .1165777
 birthmonthdum7 |   .0334236   .0226902     1.47   0.141    -.0110592    .0779065
 birthmonthdum8 |   .0687895   .0225393     3.05   0.002     .0246024    .1129766
 birthmonthdum9 |   .0622576    .021941     2.84   0.005     .0192435    .1052717
birthmonthdum10 |   .1035716   .0210215     4.93   0.000     .0623602     .144783
birthmonthdum11 |   .1112078   .0221375     5.02   0.000     .0678084    .1546072
birthmonthdum12 |   .1122827   .0221064     5.08   0.000     .0689444    .1556211
              t |   -.009405   .0003329   -28.25   0.000    -.0100576   -.0087524
              d |   .0165324   .0191128     0.86   0.387    -.0209372     .054002
             td |  -.0006384   .0003818    -1.67   0.095    -.0013869    .0001101
          _cons |   2.987802    .052281    57.15   0.000     2.885308    3.090296
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(15)   =     669.53
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1017
                                                  Root MSE        =     .64653

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .3081811   .8419241     0.37   0.714     -1.34196    1.958322
  secgenhighedu |   .3085597   .9719263     0.32   0.751    -1.596381      2.2135
            exp |    .036397   .0181616     2.00   0.045     .0008009    .0719931
         expsqr |   -.000963   .0004153    -2.32   0.020     -.001777    -.000149
 birthmonthdum2 |  -.0606544   .0493887    -1.23   0.219    -.1574545    .0361457
 birthmonthdum3 |  -.0868974   .0475945    -1.83   0.068    -.1801808    .0063861
 birthmonthdum4 |  -.0130626   .0481217    -0.27   0.786    -.1073795    .0812542
 birthmonthdum5 |  -.0759496   .0470347    -1.61   0.106     -.168136    .0162367
 birthmonthdum6 |  -.0617134   .0515525    -1.20   0.231    -.1627544    .0393277
 birthmonthdum7 |   -.062498   .0477508    -1.31   0.191    -.1560878    .0310917
 birthmonthdum8 |  -.0401902    .048162    -0.83   0.404    -.1345861    .0542057
 birthmonthdum9 |  -.0274847   .0445835    -0.62   0.538    -.1148668    .0598974
birthmonthdum10 |   .0047337   .0446088     0.11   0.915    -.0826978    .0921653
birthmonthdum11 |  -.0370964   .0459525    -0.81   0.420    -.1271617     .052969
birthmonthdum12 |  -.0078276   .0451226    -0.17   0.862    -.0962662    .0806111
          _cons |   7.692126   .1638971    46.93   0.000     7.370893    8.013358
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  63.5617  (p = 0.0000)
  Wu-Hausman F(2,4929)            =  32.0774  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .182162  (p = 0.6695)
  Basmann chi2(1)        =  .181542  (p = 0.6701)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  12.958  Chi-sq(16) P-value = 0.6758

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
birthmont~m2 |      4,947    .0802507    .2717083          0          1
birthmonth~3 |      4,947    .0812614    .2732637          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,947    .0743885    .2624286          0          1
birthmonth~5 |      4,947    .0725692    .2594543          0          1
birthmonth~6 |      4,947    .0826764    .2754203          0          1
birthmonth~7 |      4,947    .0780271    .2682413          0          1
birthmonth~8 |      4,947    .0798464    .2710826          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,947    .0893471    .2852729          0          1
birthmont~10 |      4,947    .1075399    .3098298          0          1
birthmont~11 |      4,947    .0861128    .2805589          0          1
birthmont~12 |      4,947    .0863149    .2808569          0          1
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange
> (monthlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,947
                                                        F(30, 4916)   = 338.27
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6737
                                                        Adj R-squared = 0.6717
                                                        Root MSE      = 0.2855

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1460993   .0039122   -37.35   0.000    -.1537689   -.1384298
         expsqr |   .0003221    .000103     3.13   0.002     .0001203     .000524
 birthmonthdum2 |  -.0110598   .0202125    -0.55   0.584    -.0506854    .0285657
 birthmonthdum3 |    .033982   .0202012     1.68   0.093    -.0056215    .0735854
 birthmonthdum4 |   .0193113   .0206534     0.94   0.350    -.0211785    .0598012
 birthmonthdum5 |   .0458499   .0207782     2.21   0.027     .0051153    .0865845
 birthmonthdum6 |   .0545827   .0201288     2.71   0.007     .0151213    .0940441
 birthmonthdum7 |   .0231081    .020426     1.13   0.258    -.0169359    .0631522
 birthmonthdum8 |   .0637318   .0202801     3.14   0.002     .0239738    .1034898
 birthmonthdum9 |   .0777839   .0197599     3.94   0.000     .0390457    .1165222
birthmonthdum10 |   .1053514    .018936     5.56   0.000     .0682285    .1424744
birthmonthdum11 |   .1165228   .0199393     5.84   0.000     .0774328    .1556128
birthmonthdum12 |   .1360178   .0199129     6.83   0.000     .0969796     .175056
   provincedum2 |   .0737246   .0223866     3.29   0.001     .0298369    .1176123
   provincedum3 |   .0720407   .0229158     3.14   0.002     .0271154    .1169659
   provincedum4 |  -.0113977   .0219584    -0.52   0.604     -.054446    .0316506
   provincedum5 |   .0067019   .0203285     0.33   0.742    -.0331512    .0465549
   provincedum6 |   .0710983   .0229201     3.10   0.002     .0261647    .1160319
   provincedum7 |   .0453119   .0209914     2.16   0.031     .0041594    .0864644
   provincedum8 |   .0334917   .0208874     1.60   0.109    -.0074569    .0744404
   provincedum9 |  -.0291989    .021638    -1.35   0.177     -.071619    .0132212
  provincedum10 |  -.0130337   .0216908    -0.60   0.548    -.0555573      .02949
  provincedum11 |  -.0095309   .0184895    -0.52   0.606    -.0457785    .0267167
  provincedum12 |  -.0001182   .0225719    -0.01   0.996    -.0443693    .0441329
  provincedum13 |   .0136751   .0209061     0.65   0.513    -.0273103    .0546604
  provincedum14 |    .038056    .026292     1.45   0.148     -.013488       .0896
  provincedum15 |   .0913037   .0268851     3.40   0.001     .0385969    .1440104
              t |  -.0114887   .0003024   -37.99   0.000    -.0120815   -.0108958
              d |   .0198388   .0172233     1.15   0.249    -.0139265    .0536041
             td |   .0001422   .0003441     0.41   0.679    -.0005324    .0008169
          _cons |   3.189303   .0480589    66.36   0.000     3.095087     3.28352
---------------------------------------------------------------------------------

                                                        Number of obs =  4,947
                                                        F(30, 4916)   = 227.22
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5810
                                                        Adj R-squared = 0.5784
                                                        Root MSE      = 0.3167

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1503042   .0043396   -34.64   0.000    -.1588118   -.1417965
         expsqr |   .0008507   .0001142     7.45   0.000     .0006268    .0010746
 birthmonthdum2 |   .0095203   .0224211     0.42   0.671    -.0344352    .0534758
 birthmonthdum3 |   .0151269   .0224086     0.68   0.500     -.028804    .0590579
 birthmonthdum4 |   .0062502   .0229102     0.27   0.785    -.0386641    .0511644
 birthmonthdum5 |   .0433723   .0230486     1.88   0.060    -.0018133     .088558
 birthmonthdum6 |   .0720087   .0223282     3.23   0.001     .0282353     .115782
 birthmonthdum7 |   .0318145   .0226579     1.40   0.160    -.0126051    .0762342
 birthmonthdum8 |   .0702174   .0224961     3.12   0.002      .026115    .1143198
 birthmonthdum9 |   .0636572   .0219191     2.90   0.004      .020686    .1066283
birthmonthdum10 |   .1048674   .0210051     4.99   0.000      .063688    .1460467
birthmonthdum11 |   .1102751   .0221181     4.99   0.000     .0669137    .1536364
birthmonthdum12 |    .112476   .0220888     5.09   0.000     .0691721    .1557799
   provincedum2 |   .0465057   .0248328     1.87   0.061    -.0021776     .095189
   provincedum3 |   .0811856   .0254198     3.19   0.001     .0313514    .1310199
   provincedum4 |  -.0084291   .0243578    -0.35   0.729    -.0561813     .039323
   provincedum5 |  -.0027169   .0225499    -0.12   0.904    -.0469247    .0414909
   provincedum6 |   .0695779   .0254246     2.74   0.006     .0197344    .1194214
   provincedum7 |   .0266637   .0232851     1.15   0.252    -.0189856    .0723129
   provincedum8 |   .0244387   .0231698     1.05   0.292    -.0209844    .0698617
   provincedum9 |  -.0026128   .0240024    -0.11   0.913    -.0496682    .0444425
  provincedum10 |  -.0201825    .024061    -0.84   0.402    -.0673527    .0269878
  provincedum11 |   .0073034   .0205098     0.36   0.722     -.032905    .0475117
  provincedum12 |  -.0128404   .0250384    -0.51   0.608    -.0619268     .036246
  provincedum13 |   .0181829   .0231905     0.78   0.433     -.027281    .0636467
  provincedum14 |  -.0107057   .0291649    -0.37   0.714    -.0678819    .0464705
  provincedum15 |   .0713781   .0298228     2.39   0.017     .0129121    .1298442
              t |  -.0093816   .0003355   -27.97   0.000    -.0100392    -.008724
              d |   .0160614   .0191053     0.84   0.401    -.0213935    .0535162
             td |  -.0007146   .0003817    -1.87   0.061     -.001463    .0000338
          _cons |   2.984586   .0533103    55.99   0.000     2.880074    3.089098
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(29)   =     994.29
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1578
                                                  Root MSE        =       .626

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .3323255   .7748832     0.43   0.668    -1.186418    1.851069
  secgenhighedu |   .2740705   .8932833     0.31   0.759    -1.476733    2.024874
            exp |   .0377027    .016639     2.27   0.023     .0050909    .0703144
         expsqr |  -.0009663    .000383    -2.52   0.012    -.0017169   -.0002157
 birthmonthdum2 |  -.0289119   .0479748    -0.60   0.547    -.1229408     .065117
 birthmonthdum3 |   -.054813   .0456514    -1.20   0.230    -.1442881    .0346621
 birthmonthdum4 |   .0157018   .0460772     0.34   0.733    -.0746079    .1060115
 birthmonthdum5 |  -.0542984   .0456446    -1.19   0.234    -.1437602    .0351635
 birthmonthdum6 |  -.0475408   .0497828    -0.95   0.340    -.1451133    .0500317
 birthmonthdum7 |  -.0424471   .0461947    -0.92   0.358    -.1329871    .0480929
 birthmonthdum8 |  -.0324867   .0466197    -0.70   0.486    -.1238597    .0588862
 birthmonthdum9 |  -.0179643   .0432078    -0.42   0.678    -.1026501    .0667215
birthmonthdum10 |   .0133827   .0433226     0.31   0.757     -.071528    .0982935
birthmonthdum11 |  -.0228902   .0446519    -0.51   0.608    -.1104063    .0646259
birthmonthdum12 |   .0057408   .0437299     0.13   0.896    -.0799682    .0914499
   provincedum2 |  -.5952883   .0511694   -11.63   0.000    -.6955784   -.4949981
   provincedum3 |  -.3289783   .0524516    -6.27   0.000    -.4317815    -.226175
   provincedum4 |  -.4575468   .0481907    -9.49   0.000    -.5519987   -.3630948
   provincedum5 |  -.0671455   .0449533    -1.49   0.135    -.1552523    .0209613
   provincedum6 |  -.2471536   .0505556    -4.89   0.000    -.3462407   -.1480665
   provincedum7 |  -.2954865   .0468683    -6.30   0.000    -.3873467   -.2036264
   provincedum8 |  -.4438418   .0457796    -9.70   0.000    -.5335681   -.3541155
   provincedum9 |  -.1713457    .051634    -3.32   0.001    -.2725465    -.070145
  provincedum10 |   -.193998   .0480721    -4.04   0.000    -.2882175   -.0997784
  provincedum11 |  -.0889891    .043178    -2.06   0.039    -.1736164   -.0043618
  provincedum12 |  -.2514369   .0505474    -4.97   0.000     -.350508   -.1523658
  provincedum13 |  -.1743363   .0461278    -3.78   0.000    -.2647451   -.0839275
  provincedum14 |  -.2258384   .0689922    -3.27   0.001    -.3610607   -.0906161
  provincedum15 |  -.3307513   .0591669    -5.59   0.000    -.4467163   -.2147863
          _cons |   7.891319   .1527772    51.65   0.000     7.591882    8.190757
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  52.7507  (p = 0.0000)
  Wu-Hausman F(2,4915)            =  26.4872  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .033754  (p = 0.8542)
  Basmann chi2(1)        =  .033543  (p = 0.8547)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  29.223  Chi-sq(30) P-value = 0.5059

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
birthmont~m2 |      4,947    .0802507    .2717083          0          1
birthmonth~3 |      4,947    .0812614    .2732637          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,947    .0743885    .2624286          0          1
birthmonth~5 |      4,947    .0725692    .2594543          0          1
birthmonth~6 |      4,947    .0826764    .2754203          0          1
birthmonth~7 |      4,947    .0780271    .2682413          0          1
birthmonth~8 |      4,947    .0798464    .2710826          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,947    .0893471    .2852729          0          1
birthmont~10 |      4,947    .1075399    .3098298          0          1
birthmont~11 |      4,947    .0861128    .2805589          0          1
birthmont~12 |      4,947    .0863149    .2808569          0          1
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & educa
> t != ., first

First-stage regressions
-----------------------

                                                       Number of obs =  10,621
                                                       F(17, 10603)  = 1279.12
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6722
                                                       Adj R-squared =  0.6717
                                                       Root MSE      =  0.2848

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1509439   .0026713   -56.51   0.000      -.15618   -.1457077
         expsqr |   .0004596   .0000696     6.60   0.000     .0003231    .0005962
 birthmonthdum2 |   -.007691   .0138209    -0.56   0.578    -.0347825    .0194006
 birthmonthdum3 |   .0217927   .0137584     1.58   0.113    -.0051763    .0487617
 birthmonthdum4 |   .0219742   .0143355     1.53   0.125    -.0061262    .0500745
 birthmonthdum5 |    .037923   .0140472     2.70   0.007     .0103879    .0654581
 birthmonthdum6 |   .0441671   .0137167     3.22   0.001     .0172798    .0710544
 birthmonthdum7 |   .0456219   .0138742     3.29   0.001     .0184259     .072818
 birthmonthdum8 |   .0620878   .0136117     4.56   0.000     .0354062    .0887694
 birthmonthdum9 |    .082325    .013425     6.13   0.000     .0560095    .1086406
birthmonthdum10 |   .0980764   .0127967     7.66   0.000     .0729925    .1231603
birthmonthdum11 |   .1006497   .0134928     7.46   0.000     .0742012    .1270981
birthmonthdum12 |   .1222088   .0135903     8.99   0.000     .0955692    .1488484
           male |  -.0112945   .0055464    -2.04   0.042    -.0221665   -.0004225
              t |  -.0111068   .0002003   -55.45   0.000    -.0114995   -.0107142
              d |   .0213655   .0116734     1.83   0.067    -.0015166    .0442476
             td |  -.0004121   .0002302    -1.79   0.073    -.0008634    .0000391
          _cons |   3.261184   .0323114   100.93   0.000     3.197848     3.32452
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(15)   =    1393.05
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1022
                                                  Root MSE        =     .66037

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .5077952   .0197748    25.68   0.000     .4690373    .5465531
            exp |   .0307018   .0043541     7.05   0.000     .0221679    .0392357
         expsqr |  -.0007137   .0001131    -6.31   0.000    -.0009355    -.000492
 birthmonthdum2 |  -.0366836   .0320372    -1.15   0.252    -.0994753    .0261081
 birthmonthdum3 |   -.035242   .0318719    -1.11   0.269    -.0977097    .0272257
 birthmonthdum4 |   -.014701    .033218    -0.44   0.658    -.0798071    .0504051
 birthmonthdum5 |   -.017233   .0325267    -0.53   0.596    -.0809842    .0465181
 birthmonthdum6 |   .0040519   .0317317     0.13   0.898     -.058141    .0662448
 birthmonthdum7 |  -.0068949   .0320968    -0.21   0.830    -.0698035    .0560136
 birthmonthdum8 |  -.0102416   .0314819    -0.33   0.745    -.0719451    .0514618
 birthmonthdum9 |  -.0151521   .0310219    -0.49   0.625     -.075954    .0456498
birthmonthdum10 |  -.0014014   .0295874    -0.05   0.962    -.0593916    .0565889
birthmonthdum11 |  -.0068408   .0311911    -0.22   0.826    -.0679742    .0542927
birthmonthdum12 |  -.0070556   .0314055    -0.22   0.822    -.0686093    .0544982
           male |   .2974412   .0128576    23.13   0.000     .2722408    .3226415
          _cons |   7.702587   .0482407   159.67   0.000     7.608037    7.797137
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  134.642  (p = 0.0000)
  Wu-Hausman F(1,10604)           =  136.153  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  6.18649  (p = 0.0454)
  Basmann chi2(2)        =  6.17961  (p = 0.0455)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  31.481  Chi-sq(17) P-value = 0.0174

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
birthmont~m2 |     10,621    .0786178     .269154          0          1
birthmonth~3 |     10,621    .0802184    .2716439          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,621    .0686376    .2528488          0          1
birthmonth~5 |     10,621    .0740985    .2619434          0          1
birthmonth~6 |     10,621     .081819    .2741017          0          1
birthmonth~7 |     10,621    .0780529    .2682675          0          1
birthmonth~8 |     10,621    .0843612    .2779418          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,621    .0895396    .2855345          0          1
birthmont~10 |     10,621    .1104416    .3134541          0          1
birthmont~11 |     10,621    .0875624    .2826707          0          1
birthmont~12 |     10,621    .0851144     .279065          0          1
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthly
> earning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,621
                                                        F(31, 10589)  = 718.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6778
                                                        Adj R-squared = 0.6769
                                                        Root MSE      = 0.2825

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1518677   .0026586   -57.12   0.000     -.157079   -.1466563
         expsqr |   .0004693   .0000692     6.78   0.000     .0003337    .0006049
 birthmonthdum2 |  -.0067628   .0137196    -0.49   0.622    -.0336559    .0201303
 birthmonthdum3 |   .0210029   .0136645     1.54   0.124    -.0057821    .0477879
 birthmonthdum4 |   .0226668   .0142339     1.59   0.111    -.0052344     .050568
 birthmonthdum5 |   .0385371   .0139425     2.76   0.006     .0112071     .065867
 birthmonthdum6 |   .0447465   .0136182     3.29   0.001     .0180524    .0714407
 birthmonthdum7 |   .0457653    .013776     3.32   0.001     .0187617    .0727689
 birthmonthdum8 |    .064942   .0135129     4.81   0.000     .0384543    .0914298
 birthmonthdum9 |   .0843129   .0133358     6.32   0.000     .0581722    .1104535
birthmonthdum10 |   .1006939   .0127098     7.92   0.000     .0757802    .1256075
birthmonthdum11 |   .1024611   .0133962     7.65   0.000      .076202    .1287202
birthmonthdum12 |   .1230066   .0134981     9.11   0.000     .0965479    .1494654
           male |  -.0118687   .0055065    -2.16   0.031    -.0226625   -.0010749
   provincedum2 |   .0839362   .0150356     5.58   0.000     .0544637    .1134088
   provincedum3 |   .0841157   .0155962     5.39   0.000     .0535442    .1146871
   provincedum4 |  -.0101397   .0150648    -0.67   0.501    -.0396694    .0193901
   provincedum5 |   .0044458   .0138615     0.32   0.748    -.0227253     .031617
   provincedum6 |   .0741045   .0153466     4.83   0.000     .0440222    .1041868
   provincedum7 |   .0406563   .0144897     2.81   0.005     .0122538    .0690588
   provincedum8 |   .0461736   .0142046     3.25   0.001     .0183299    .0740173
   provincedum9 |  -.0154481     .01456    -1.06   0.289    -.0439884    .0130922
  provincedum10 |  -.0108293   .0149179    -0.73   0.468    -.0400711    .0184125
  provincedum11 |  -.0151128   .0126285    -1.20   0.231    -.0398671    .0096414
  provincedum12 |  -.0077226   .0155531    -0.50   0.620    -.0382096    .0227643
  provincedum13 |   .0130403   .0143909     0.91   0.365    -.0151686    .0412491
  provincedum14 |   .0326974   .0183451     1.78   0.075    -.0032624    .0686572
  provincedum15 |   .0996011   .0185088     5.38   0.000     .0633204    .1358818
              t |  -.0111208   .0001999   -55.64   0.000    -.0115127    -.010729
              d |   .0218816   .0116016     1.89   0.059    -.0008597    .0446229
             td |   -.000464   .0002287    -2.03   0.042    -.0009122   -.0000158
          _cons |   3.254845   .0327656    99.34   0.000     3.190618    3.319071
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(29)   =    1995.47
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1514
                                                  Root MSE        =     .64201

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .4941351   .0194787    25.37   0.000     .4559576    .5323125
            exp |   .0329156   .0042444     7.76   0.000     .0245967    .0412345
         expsqr |  -.0007507   .0001102    -6.81   0.000    -.0009668   -.0005347
 birthmonthdum2 |  -.0354443   .0311661    -1.14   0.255    -.0965287    .0256401
 birthmonthdum3 |   -.023602   .0310202    -0.76   0.447    -.0844006    .0371965
 birthmonthdum4 |  -.0038818   .0323211    -0.12   0.904    -.0672299    .0594664
 birthmonthdum5 |  -.0142633   .0316363    -0.45   0.652    -.0762693    .0477428
 birthmonthdum6 |   .0068493   .0308715     0.22   0.824    -.0536577    .0673564
 birthmonthdum7 |  -.0045329   .0312304    -0.15   0.885    -.0657434    .0566775
 birthmonthdum8 |  -.0159982   .0306226    -0.52   0.601    -.0760174     .044021
 birthmonthdum9 |  -.0180738   .0301943    -0.60   0.549    -.0772535    .0411059
birthmonthdum10 |  -.0026581    .028798    -0.09   0.926    -.0591011    .0537849
birthmonthdum11 |  -.0061857   .0303456    -0.20   0.838     -.065662    .0532907
birthmonthdum12 |  -.0056365    .030565    -0.18   0.854    -.0655428    .0542698
           male |   .2987864    .012509    23.89   0.000     .2742692    .3233036
   provincedum2 |  -.5141048   .0340135   -15.11   0.000    -.5807701   -.4474394
   provincedum3 |  -.2377746   .0353248    -6.73   0.000    -.3070099   -.1685393
   provincedum4 |  -.4067036   .0342261   -11.88   0.000    -.4737855   -.3396217
   provincedum5 |  -.0230314   .0314605    -0.73   0.464    -.0846928    .0386299
   provincedum6 |  -.1795294    .034675    -5.18   0.000    -.2474912   -.1115677
   provincedum7 |  -.2495567   .0328354    -7.60   0.000    -.3139129   -.1852005
   provincedum8 |  -.4395219    .032154   -13.67   0.000    -.5025426   -.3765011
   provincedum9 |  -.1242049   .0331053    -3.75   0.000    -.1890901   -.0593196
  provincedum10 |  -.1783087    .033877    -5.26   0.000    -.2447064    -.111911
  provincedum11 |  -.0566957   .0287333    -1.97   0.048    -.1130119   -.0003796
  provincedum12 |   -.224189   .0353432    -6.34   0.000    -.2934604   -.1549176
  provincedum13 |  -.1572869   .0326519    -4.82   0.000    -.2212834   -.0932904
  provincedum14 |   -.281366   .0416241    -6.76   0.000    -.3629477   -.1997842
  provincedum15 |  -.3534255   .0419489    -8.43   0.000     -.435644   -.2712071
          _cons |   7.884592    .052685   149.66   0.000     7.781331    7.987853
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  102.394  (p = 0.0000)
  Wu-Hausman F(1,10590)           =  103.089  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  5.00431  (p = 0.0819)
  Basmann chi2(2)        =  4.99159  (p = 0.0824)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  58.618  Chi-sq(31) P-value = 0.0020

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
birthmont~m2 |     10,621    .0786178     .269154          0          1
birthmonth~3 |     10,621    .0802184    .2716439          0          1
-------------+---------------------------------------------------------
birthmonth~4 |     10,621    .0686376    .2528488          0          1
birthmonth~5 |     10,621    .0740985    .2619434          0          1
birthmonth~6 |     10,621     .081819    .2741017          0          1
birthmonth~7 |     10,621    .0780529    .2682675          0          1
birthmonth~8 |     10,621    .0843612    .2779418          0          1
-------------+---------------------------------------------------------
birthmonth~9 |     10,621    .0895396    .2855345          0          1
birthmont~10 |     10,621    .1104416    .3134541          0          1
birthmont~11 |     10,621    .0875624    .2826707          0          1
birthmont~12 |     10,621    .0851144     .279065          0          1
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu  = t
>  d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 1
>  & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,674
                                                        F(16, 5657)   = 737.01
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6758
                                                        Adj R-squared = 0.6749
                                                        Root MSE      = 0.2827

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1552985   .0036552   -42.49   0.000    -.1624641   -.1481329
         expsqr |   .0005755   .0000944     6.09   0.000     .0003904    .0007606
 birthmonthdum2 |  -.0077723   .0188666    -0.41   0.680    -.0447579    .0292134
 birthmonthdum3 |   .0076664   .0187469     0.41   0.683    -.0290847    .0444175
 birthmonthdum4 |   .0210596   .0198778     1.06   0.289    -.0179085    .0600277
 birthmonthdum5 |   .0290594   .0189946     1.53   0.126    -.0081773     .066296
 birthmonthdum6 |   .0341938   .0186798     1.83   0.067    -.0024258    .0708134
 birthmonthdum7 |   .0634181   .0188529     3.36   0.001     .0264591    .1003771
 birthmonthdum8 |   .0617562   .0182879     3.38   0.001     .0259049    .0976074
 birthmonthdum9 |   .0878622   .0182331     4.82   0.000     .0521183     .123606
birthmonthdum10 |   .0916642   .0173001     5.30   0.000     .0577493    .1255791
birthmonthdum11 |   .0851078   .0182599     4.66   0.000     .0493113    .1209042
birthmonthdum12 |   .1102557    .018532     5.95   0.000     .0739259    .1465856
              t |  -.0108079   .0002684   -40.26   0.000    -.0113341   -.0102817
              d |   .0250125   .0158447     1.58   0.114    -.0060492    .0560743
             td |  -.0008834   .0003089    -2.86   0.004     -.001489   -.0002778
          _cons |   3.300327   .0442274    74.62   0.000     3.213625     3.38703
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(14)   =     315.61
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0340
                                                  Root MSE        =     .66995

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .4463204   .0269854    16.54   0.000     .3934301    .4992108
            exp |   .0327453   .0061006     5.37   0.000     .0207883    .0447022
         expsqr |  -.0006624   .0001584    -4.18   0.000    -.0009728   -.0003519
 birthmonthdum2 |  -.0245766   .0447005    -0.55   0.582     -.112188    .0630348
 birthmonthdum3 |   .0092255   .0443941     0.21   0.835    -.0777853    .0962364
 birthmonthdum4 |  -.0142902   .0470837    -0.30   0.762    -.1065726    .0779921
 birthmonthdum5 |    .027469    .044957     0.61   0.541    -.0606452    .1155832
 birthmonthdum6 |   .0456308   .0441977     1.03   0.302    -.0409951    .1322568
 birthmonthdum7 |   .0451577   .0445631     1.01   0.311    -.0421844    .1324998
 birthmonthdum8 |   .0103873   .0432339     0.24   0.810    -.0743495    .0951241
 birthmonthdum9 |  -.0064436    .043067    -0.15   0.881    -.0908533    .0779662
birthmonthdum10 |  -.0097847   .0408878    -0.24   0.811    -.0899232    .0703539
birthmonthdum11 |   .0165903    .043159     0.38   0.701    -.0679998    .1011804
birthmonthdum12 |  -.0111975   .0437506    -0.26   0.798    -.0969472    .0745521
          _cons |   7.950532   .0664249   119.69   0.000     7.820341    8.080722
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  72.5817  (p = 0.0000)
  Wu-Hausman F(1,5658)            =  73.3149  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  8.16448  (p = 0.0169)
  Basmann chi2(2)        =  8.15175  (p = 0.0170)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  24.146  Chi-sq(16) P-value = 0.0864

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
birthmont~m2 |      5,674    .0771942    .2669229          0          1
birthmonth~3 |      5,674    .0793091    .2702444          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,674    .0636235    .2441026          0          1
birthmonth~5 |      5,674    .0754318    .2641101          0          1
birthmonth~6 |      5,674    .0810716     .272969          0          1
birthmonth~7 |      5,674    .0780754    .2683139          0          1
birthmonth~8 |      5,674    .0882975    .2837521          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,674    .0897074    .2857873          0          1
birthmont~10 |      5,674    .1129714    .3165858          0          1
birthmont~11 |      5,674    .0888262    .2845178          0          1
birthmont~12 |      5,674    .0840677    .2775137          0          1
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearni
> ng, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,674
                                                        F(30, 5643)   = 404.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6825
                                                        Adj R-squared = 0.6809
                                                        Root MSE      = 0.2801

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |    -.15658   .0036371   -43.05   0.000    -.1637101   -.1494499
         expsqr |   .0005879   .0000937     6.27   0.000     .0004041    .0007716
 birthmonthdum2 |  -.0007476   .0187329    -0.04   0.968    -.0374714    .0359762
 birthmonthdum3 |   .0112486   .0186089     0.60   0.546    -.0252319    .0477292
 birthmonthdum4 |   .0274025   .0197292     1.39   0.165    -.0112743    .0660793
 birthmonthdum5 |   .0332636   .0188315     1.77   0.077    -.0036534    .0701807
 birthmonthdum6 |   .0376232    .018535     2.03   0.042     .0012875    .0739588
 birthmonthdum7 |    .066083   .0187091     3.53   0.000     .0294061      .10276
 birthmonthdum8 |   .0671403   .0181408     3.70   0.000     .0315774    .1027032
 birthmonthdum9 |   .0907939   .0181005     5.02   0.000     .0553099    .1262779
birthmonthdum10 |   .0963943   .0171677     5.61   0.000      .062739    .1300497
birthmonthdum11 |   .0910264   .0181225     5.02   0.000     .0554993    .1265534
birthmonthdum12 |   .1122373   .0183888     6.10   0.000     .0761881    .1482864
   provincedum2 |   .0947908   .0203783     4.65   0.000     .0548415    .1347401
   provincedum3 |   .0957169   .0213527     4.48   0.000     .0538573    .1375765
   provincedum4 |  -.0077534    .020761    -0.37   0.709     -.048453    .0329461
   provincedum5 |   .0044562   .0190032     0.23   0.815    -.0327974    .0417098
   provincedum6 |   .0784215   .0207347     3.78   0.000     .0377736    .1190694
   provincedum7 |   .0379272   .0201068     1.89   0.059    -.0014898    .0773441
   provincedum8 |   .0593221   .0194247     3.05   0.002     .0212422    .0974021
   provincedum9 |  -.0033429    .019761    -0.17   0.866    -.0420821    .0353963
  provincedum10 |  -.0065069     .02061    -0.32   0.752    -.0469105    .0338968
  provincedum11 |  -.0168907   .0173524    -0.97   0.330    -.0509082    .0171267
  provincedum12 |   -.012102   .0215267    -0.56   0.574    -.0543026    .0300987
  provincedum13 |   .0141441   .0198995     0.71   0.477    -.0248667    .0531548
  provincedum14 |   .0282061   .0257076     1.10   0.273    -.0221907    .0786028
  provincedum15 |   .1088844      .0256     4.25   0.000     .0586986    .1590703
              t |  -.0108497   .0002671   -40.62   0.000    -.0113733   -.0103261
              d |   .0256568   .0157379     1.63   0.103    -.0051956    .0565091
             td |  -.0009388   .0003066    -3.06   0.002    -.0015397   -.0003378
          _cons |   3.293322   .0448418    73.44   0.000     3.205414    3.381229
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(28)   =     598.96
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0847
                                                  Root MSE        =     .65213

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .4293925   .0265132    16.20   0.000     .3774275    .4813575
            exp |   .0350055   .0059552     5.88   0.000     .0233336    .0466774
         expsqr |  -.0007097   .0001546    -4.59   0.000    -.0010128   -.0004067
 birthmonthdum2 |  -.0493429   .0436022    -1.13   0.258    -.1348017    .0361159
 birthmonthdum3 |    .003548   .0432903     0.08   0.935    -.0812996    .0883955
 birthmonthdum4 |  -.0198681   .0459067    -0.43   0.665    -.1098435    .0701073
 birthmonthdum5 |   .0170025    .043786     0.39   0.698    -.0688166    .1028216
 birthmonthdum6 |   .0364141   .0430846     0.85   0.398    -.0480303    .1208584
 birthmonthdum7 |   .0355662   .0434454     0.82   0.413    -.0495853    .1207176
 birthmonthdum8 |  -.0062956   .0421253    -0.15   0.881    -.0888597    .0762685
 birthmonthdum9 |  -.0203794   .0420004    -0.49   0.628    -.1026986    .0619398
birthmonthdum10 |  -.0183031   .0398637    -0.46   0.646    -.0964346    .0598283
birthmonthdum11 |   .0036186   .0420818     0.09   0.931    -.0788601    .0860973
birthmonthdum12 |  -.0193563   .0426485    -0.45   0.650    -.1029459    .0642332
   provincedum2 |  -.4425623   .0471762    -9.38   0.000     -.535026   -.3500986
   provincedum3 |   -.158646   .0495453    -3.20   0.001     -.255753   -.0615391
   provincedum4 |  -.3585264   .0483154    -7.42   0.000    -.4532228     -.26383
   provincedum5 |   .0226484   .0441882     0.51   0.608    -.0639589    .1092557
   provincedum6 |  -.1199754    .047982    -2.50   0.012    -.2140183   -.0259324
   provincedum7 |  -.2004928    .046707    -4.29   0.000    -.2920369   -.1089488
   provincedum8 |  -.4255435   .0450159    -9.45   0.000    -.5137731    -.337314
   provincedum9 |   -.079969   .0459769    -1.74   0.082    -.1700819     .010144
  provincedum10 |  -.1541113   .0479236    -3.22   0.001    -.2480398   -.0601828
  provincedum11 |  -.0282189   .0404394    -0.70   0.485    -.1074788    .0510409
  provincedum12 |  -.1907328    .050108    -3.81   0.000    -.2889428   -.0925229
  provincedum13 |   -.141074   .0462516    -3.05   0.002    -.2317255   -.0504226
  provincedum14 |  -.3169099   .0597715    -5.30   0.000    -.4340599   -.1997599
  provincedum15 |   -.360905   .0594334    -6.07   0.000    -.4773923   -.2444177
          _cons |   8.116617    .072808   111.48   0.000     7.973916    8.259318
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  53.4377  (p = 0.0000)
  Wu-Hausman F(1,5644)            =  53.6606  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  6.80087  (p = 0.0334)
  Basmann chi2(2)        =  6.77183  (p = 0.0338)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  41.965  Chi-sq(30) P-value = 0.0721

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
birthmont~m2 |      5,674    .0771942    .2669229          0          1
birthmonth~3 |      5,674    .0793091    .2702444          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,674    .0636235    .2441026          0          1
birthmonth~5 |      5,674    .0754318    .2641101          0          1
birthmonth~6 |      5,674    .0810716     .272969          0          1
birthmonth~7 |      5,674    .0780754    .2683139          0          1
birthmonth~8 |      5,674    .0882975    .2837521          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,674    .0897074    .2857873          0          1
birthmont~10 |      5,674    .1129714    .3165858          0          1
birthmont~11 |      5,674    .0888262    .2845178          0          1
birthmont~12 |      5,674    .0840677    .2775137          0          1
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu  = t
>  d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 0
>  & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,947
                                                        F(16, 4930)   = 622.76
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6690
                                                        Adj R-squared = 0.6679
                                                        Root MSE      = 0.2871

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1455756   .0039225   -37.11   0.000    -.1532653   -.1378858
         expsqr |   .0003181   .0001033     3.08   0.002     .0001156    .0005206
 birthmonthdum2 |  -.0067153   .0203034    -0.33   0.741    -.0465191    .0330885
 birthmonthdum3 |   .0386438   .0202535     1.91   0.056    -.0010621    .0783497
 birthmonthdum4 |   .0238333   .0207295     1.15   0.250    -.0168057    .0644724
 birthmonthdum5 |   .0487991   .0208668     2.34   0.019      .007891    .0897072
 birthmonthdum6 |   .0563386    .020217     2.79   0.005     .0167043    .0959729
 birthmonthdum7 |   .0251415   .0205165     1.23   0.220      -.01508    .0653629
 birthmonthdum8 |   .0627876   .0203801     3.08   0.002     .0228336    .1027417
 birthmonthdum9 |    .076447   .0198391     3.85   0.000     .0375536    .1153404
birthmonthdum10 |   .1050902   .0190076     5.53   0.000     .0678267    .1423536
birthmonthdum11 |   .1187524   .0200168     5.93   0.000     .0795106    .1579942
birthmonthdum12 |   .1360326   .0199886     6.81   0.000     .0968459    .1752192
              t |  -.0114827    .000301   -38.15   0.000    -.0120728   -.0108926
              d |   .0189049   .0172818     1.09   0.274    -.0149752     .052785
             td |    .000175   .0003452     0.51   0.612    -.0005018    .0008517
          _cons |   3.197692   .0472726    67.64   0.000     3.105017    3.290368
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(14)   =     676.54
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1111
                                                  Root MSE        =     .64312

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .5753095   .0288991    19.91   0.000     .5186684    .6319507
            exp |   .0309767   .0061595     5.03   0.000     .0189042    .0430491
         expsqr |  -.0008415   .0001602    -5.25   0.000    -.0011554   -.0005275
 birthmonthdum2 |  -.0547048   .0454544    -1.20   0.229    -.1437939    .0343842
 birthmonthdum3 |  -.0912811   .0453075    -2.01   0.044    -.1800822   -.0024799
 birthmonthdum4 |  -.0168319   .0463885    -0.36   0.717    -.1077517    .0740878
 birthmonthdum5 |  -.0748489   .0466597    -1.60   0.109    -.1663002    .0166025
 birthmonthdum6 |  -.0539411   .0451297    -1.20   0.232    -.1423937    .0345115
 birthmonthdum7 |  -.0585724   .0458791    -1.28   0.202    -.1484938    .0313489
 birthmonthdum8 |  -.0354246   .0455219    -0.78   0.436    -.1246459    .0537968
 birthmonthdum9 |  -.0283028   .0442746    -0.64   0.523    -.1150794    .0584738
birthmonthdum10 |   .0088667   .0424422     0.21   0.835    -.0743185    .0920519
birthmonthdum11 |  -.0340081   .0446746    -0.76   0.447    -.1215688    .0535525
birthmonthdum12 |  -.0093104   .0446439    -0.21   0.835    -.0968107      .07819
          _cons |   7.739369   .0683232   113.28   0.000     7.605458     7.87328
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  62.7044  (p = 0.0000)
  Wu-Hausman F(1,4931)            =   63.304  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .285954  (p = 0.8668)
  Basmann chi2(2)        =  .284988  (p = 0.8672)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  13.930  Chi-sq(16) P-value = 0.6039

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
birthmont~m2 |      4,947    .0802507    .2717083          0          1
birthmonth~3 |      4,947    .0812614    .2732637          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,947    .0743885    .2624286          0          1
birthmonth~5 |      4,947    .0725692    .2594543          0          1
birthmonth~6 |      4,947    .0826764    .2754203          0          1
birthmonth~7 |      4,947    .0780271    .2682413          0          1
birthmonth~8 |      4,947    .0798464    .2710826          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,947    .0893471    .2852729          0          1
birthmont~10 |      4,947    .1075399    .3098298          0          1
birthmont~11 |      4,947    .0861128    .2805589          0          1
birthmont~12 |      4,947    .0863149    .2808569          0          1
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearnin
> g, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,947
                                                        F(30, 4916)   = 338.27
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6737
                                                        Adj R-squared = 0.6717
                                                        Root MSE      = 0.2855

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1460993   .0039122   -37.35   0.000    -.1537689   -.1384298
         expsqr |   .0003221    .000103     3.13   0.002     .0001203     .000524
 birthmonthdum2 |  -.0110598   .0202125    -0.55   0.584    -.0506854    .0285657
 birthmonthdum3 |    .033982   .0202012     1.68   0.093    -.0056215    .0735854
 birthmonthdum4 |   .0193113   .0206534     0.94   0.350    -.0211785    .0598012
 birthmonthdum5 |   .0458499   .0207782     2.21   0.027     .0051153    .0865845
 birthmonthdum6 |   .0545827   .0201288     2.71   0.007     .0151213    .0940441
 birthmonthdum7 |   .0231081    .020426     1.13   0.258    -.0169359    .0631522
 birthmonthdum8 |   .0637318   .0202801     3.14   0.002     .0239738    .1034898
 birthmonthdum9 |   .0777839   .0197599     3.94   0.000     .0390457    .1165222
birthmonthdum10 |   .1053514    .018936     5.56   0.000     .0682285    .1424744
birthmonthdum11 |   .1165228   .0199393     5.84   0.000     .0774328    .1556128
birthmonthdum12 |   .1360178   .0199129     6.83   0.000     .0969796     .175056
   provincedum2 |   .0737246   .0223866     3.29   0.001     .0298369    .1176123
   provincedum3 |   .0720407   .0229158     3.14   0.002     .0271154    .1169659
   provincedum4 |  -.0113977   .0219584    -0.52   0.604     -.054446    .0316506
   provincedum5 |   .0067019   .0203285     0.33   0.742    -.0331512    .0465549
   provincedum6 |   .0710983   .0229201     3.10   0.002     .0261647    .1160319
   provincedum7 |   .0453119   .0209914     2.16   0.031     .0041594    .0864644
   provincedum8 |   .0334917   .0208874     1.60   0.109    -.0074569    .0744404
   provincedum9 |  -.0291989    .021638    -1.35   0.177     -.071619    .0132212
  provincedum10 |  -.0130337   .0216908    -0.60   0.548    -.0555573      .02949
  provincedum11 |  -.0095309   .0184895    -0.52   0.606    -.0457785    .0267167
  provincedum12 |  -.0001182   .0225719    -0.01   0.996    -.0443693    .0441329
  provincedum13 |   .0136751   .0209061     0.65   0.513    -.0273103    .0546604
  provincedum14 |    .038056    .026292     1.45   0.148     -.013488       .0896
  provincedum15 |   .0913037   .0268851     3.40   0.001     .0385969    .1440104
              t |  -.0114887   .0003024   -37.99   0.000    -.0120815   -.0108958
              d |   .0198388   .0172233     1.15   0.249    -.0139265    .0536041
             td |   .0001422   .0003441     0.41   0.679    -.0005324    .0008169
          _cons |   3.189303   .0480589    66.36   0.000     3.095087     3.28352
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(28)   =    1003.83
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1659
                                                  Root MSE        =     .62299

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .5699066     .02854    19.97   0.000     .5139693    .6258438
            exp |   .0329426   .0059841     5.51   0.000      .021214    .0446712
         expsqr |   -.000859   .0001555    -5.53   0.000    -.0011637   -.0005543
 birthmonthdum2 |  -.0232611   .0440857    -0.53   0.598    -.1096675    .0631452
 birthmonthdum3 |  -.0582763   .0440212    -1.32   0.186    -.1445562    .0280035
 birthmonthdum4 |   .0130323   .0450308     0.29   0.772    -.0752264     .101291
 birthmonthdum5 |  -.0531137   .0452624    -1.17   0.241    -.1418263    .0355989
 birthmonthdum6 |  -.0403831   .0437667    -0.92   0.356    -.1261643     .045398
 birthmonthdum7 |  -.0388874    .044499    -0.87   0.382    -.1261039    .0483291
 birthmonthdum8 |  -.0280649   .0441229    -0.64   0.525    -.1145443    .0584144
 birthmonthdum9 |  -.0186024   .0429502    -0.43   0.665    -.1027833    .0655786
birthmonthdum10 |   .0173119   .0411875     0.42   0.674    -.0634141     .098038
birthmonthdum11 |  -.0198682   .0433426    -0.46   0.647    -.1048182    .0650817
birthmonthdum12 |   .0044529   .0433187     0.10   0.918    -.0804502     .089356
   provincedum2 |  -.5998855   .0486912   -12.32   0.000    -.6953184   -.5044526
   provincedum3 |  -.3242032   .0498486    -6.50   0.000    -.4219047   -.2265017
   provincedum4 |  -.4568957   .0479124    -9.54   0.000    -.5508023    -.362989
   provincedum5 |  -.0690849   .0442927    -1.56   0.119    -.1558969    .0177271
   provincedum6 |   -.244809   .0497344    -4.92   0.000    -.3422867   -.1473313
   provincedum7 |  -.2984687   .0456289    -6.54   0.000    -.3878997   -.2090377
   provincedum8 |  -.4449004   .0454299    -9.79   0.000    -.5339413   -.3558594
   provincedum9 |   -.165163   .0473107    -3.49   0.000    -.2578903   -.0724356
  provincedum10 |  -.1961715   .0473186    -4.15   0.000    -.2889143   -.1034287
  provincedum11 |  -.0844552   .0403754    -2.09   0.036    -.1635895   -.0053208
  provincedum12 |  -.2546263   .0492291    -5.17   0.000    -.3511136    -.158139
  provincedum13 |  -.1725737   .0455486    -3.79   0.000    -.2618473   -.0833001
  provincedum14 |  -.2375156   .0572681    -4.15   0.000    -.3497589   -.1252722
  provincedum15 |  -.3328172   .0584999    -5.69   0.000    -.4474749   -.2181595
          _cons |   7.932154   .0746532   106.25   0.000     7.785837    8.078472
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  51.5794  (p = 0.0000)
  Wu-Hausman F(1,4917)            =  51.8068  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .129126  (p = 0.9375)
  Basmann chi2(2)        =  .128321  (p = 0.9379)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  29.905  Chi-sq(30) P-value = 0.4705

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
birthmont~m2 |      4,947    .0802507    .2717083          0          1
birthmonth~3 |      4,947    .0812614    .2732637          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      4,947    .0743885    .2624286          0          1
birthmonth~5 |      4,947    .0725692    .2594543          0          1
birthmonth~6 |      4,947    .0826764    .2754203          0          1
birthmonth~7 |      4,947    .0780271    .2682413          0          1
birthmonth~8 |      4,947    .0798464    .2710826          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      4,947    .0893471    .2852729          0          1
birthmont~10 |      4,947    .1075399    .3098298          0          1
birthmont~11 |      4,947    .0861128    .2805589          0          1
birthmont~12 |      4,947    .0863149    .2808569          0          1
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Exp/IV Urban ATF&Birth Exp 1979 1971-1992.log
  log type:  text
 closed on:   6 Aug 2024, 17:34:40
---------------------------------------------------------------------------------------------
