---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Exp/IV Urban ATF&Birth Exp 1979 3years.log
  log type:  text
 opened on:   6 Aug 2024, 17:34:03

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,362 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. **
. tab birthmonth, gen(birthmonthdum)

 birthmonth |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,940        8.11        8.11
          2 |      2,993        8.26       16.37
          3 |      2,883        7.95       24.32
          4 |      2,595        7.16       31.48
          5 |      2,755        7.60       39.08
          6 |      2,889        7.97       47.05
          7 |      2,830        7.81       54.86
          8 |      3,239        8.94       63.80
          9 |      3,187        8.79       72.59
         10 |      3,723       10.27       82.86
         11 |      3,121        8.61       91.47
         12 |      3,091        8.53      100.00
------------+-----------------------------------
      Total |     36,246      100.00

. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. local months = 36

. 
. 
. *1)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  secgenhighedu secgenedu = t d td) if inrange(t, -`months', `months'-1) & inrange(monthlyea
> rning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,714
                                                        F(17, 2696)   = 312.10
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6631
                                                        Adj R-squared = 0.6609
                                                        Root MSE      = 0.2868

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1947782   .0152862   -12.74   0.000    -.2247521   -.1648044
         expsqr |   .0015415   .0003768     4.09   0.000     .0008027    .0022803
 birthmonthdum2 |  -.0183293   .0273519    -0.67   0.503    -.0719621    .0353034
 birthmonthdum3 |   .0531707   .0276257     1.92   0.054    -.0009989    .1073403
 birthmonthdum4 |   .0573464   .0301709     1.90   0.057     -.001814    .1165069
 birthmonthdum5 |  -.0004476   .0282474    -0.02   0.987    -.0558363    .0549411
 birthmonthdum6 |   .0622526   .0283384     2.20   0.028     .0066855    .1178197
 birthmonthdum7 |   .0608162   .0280155     2.17   0.030     .0058822    .1157502
 birthmonthdum8 |   .0839064   .0283331     2.96   0.003     .0283496    .1394631
 birthmonthdum9 |   .1038505   .0272261     3.81   0.000     .0504645    .1572366
birthmonthdum10 |   .1281558   .0260718     4.92   0.000      .077033    .1792787
birthmonthdum11 |   .1072815   .0274005     3.92   0.000     .0535533    .1610096
birthmonthdum12 |    .152749   .0279978     5.46   0.000     .0978496    .2076484
           male |   .0064329   .0110534     0.58   0.561     -.015241    .0281068
              t |  -.0121179   .0007603   -15.94   0.000    -.0136087    -.010627
              d |   .0387472   .0228379     1.70   0.090    -.0060345    .0835288
             td |   .0003084   .0010728     0.29   0.774    -.0017953     .002412
          _cons |   3.652068   .1560488    23.40   0.000     3.346081    3.958055
---------------------------------------------------------------------------------

                                                        Number of obs =  2,714
                                                        F(17, 2696)   = 200.13
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5579
                                                        Adj R-squared = 0.5551
                                                        Root MSE      = 0.3149

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2529063   .0167888   -15.06   0.000    -.2858266    -.219986
         expsqr |    .003407   .0004138     8.23   0.000     .0025956    .0042184
 birthmonthdum2 |   .0151172   .0300406     0.50   0.615    -.0437876    .0740221
 birthmonthdum3 |   .0168195   .0303413     0.55   0.579     -.042675     .076314
 birthmonthdum4 |   .0319899   .0331367     0.97   0.334     -.032986    .0969658
 birthmonthdum5 |   .0427768   .0310241     1.38   0.168    -.0180566    .1036102
 birthmonthdum6 |   .0684139    .031124     2.20   0.028     .0073846    .1294433
 birthmonthdum7 |   .0436308   .0307694     1.42   0.156    -.0167032    .1039647
 birthmonthdum8 |   .1131062   .0311182     3.63   0.000     .0520882    .1741242
 birthmonthdum9 |   .1160885   .0299024     3.88   0.000     .0574546    .1747225
birthmonthdum10 |   .1166348   .0286347     4.07   0.000     .0604866     .172783
birthmonthdum11 |   .1159114    .030094     3.85   0.000     .0569018     .174921
birthmonthdum12 |   .1440267     .03075     4.68   0.000     .0837308    .2043227
           male |   .0192587   .0121399     1.59   0.113    -.0045458    .0430632
              t |  -.0080644    .000835    -9.66   0.000    -.0097018   -.0064271
              d |   .0138637   .0250829     0.55   0.581    -.0353199    .0630474
             td |  -.0030713   .0011783    -2.61   0.009    -.0053817   -.0007609
          _cons |   3.988184   .1713884    23.27   0.000     3.652118     4.32425
---------------------------------------------------------------------------------

                                                        Number of obs =  2,714
                                                        F(17, 2696)   = 128.05
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4467
                                                        Adj R-squared = 0.4432
                                                        Root MSE      = 0.3708

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.0705783   .0197665    -3.57   0.000    -.1093373   -.0318193
         expsqr |  -.0009795   .0004872    -2.01   0.044    -.0019348   -.0000241
 birthmonthdum2 |   .0175363   .0353685     0.50   0.620    -.0518158    .0868885
 birthmonthdum3 |  -.0052422   .0357226    -0.15   0.883    -.0752886    .0648042
 birthmonthdum4 |   .0467504   .0390138     1.20   0.231    -.0297495    .1232504
 birthmonthdum5 |   .0565659   .0365265     1.55   0.122    -.0150569    .1281886
 birthmonthdum6 |   .0888644   .0366442     2.43   0.015     .0170109    .1607179
 birthmonthdum7 |   .0442966   .0362266     1.22   0.222    -.0267382    .1153313
 birthmonthdum8 |   .1055375   .0366373     2.88   0.004     .0336974    .1773776
 birthmonthdum9 |   .0859637   .0352059     2.44   0.015     .0169305    .1549969
birthmonthdum10 |   .1091034   .0337133     3.24   0.001     .0429968      .17521
birthmonthdum11 |   .1518115   .0354314     4.28   0.000      .082336    .2212871
birthmonthdum12 |   .1371079   .0362038     3.79   0.000     .0661179    .2080979
           male |   .0336019    .014293     2.35   0.019     .0055755    .0616283
              t |  -.0085194   .0009831    -8.67   0.000    -.0104472   -.0065917
              d |   -.020098   .0295316    -0.68   0.496    -.0780048    .0378088
             td |  -.0004327   .0013873    -0.31   0.755    -.0031529    .0022875
          _cons |   2.245823   .2017857    11.13   0.000     1.850153    2.641493
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,714
                                                  Wald chi2(17)   =     293.05
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      .8098

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.2626222   .9716284    -0.27   0.787    -2.166979    1.641734
  secgenhighedu |   2.125256   1.048639     2.03   0.043     .0699606    4.180551
      secgenedu |  -1.242838   1.423771    -0.87   0.383    -4.033377    1.547702
            exp |   .1907099   .1957752     0.97   0.330    -.1930024    .5744222
         expsqr |  -.0045627   .0047912    -0.95   0.341    -.0139533     .004828
 birthmonthdum2 |  -.0062572   .0867644    -0.07   0.943    -.1763124    .1637979
 birthmonthdum3 |  -.1033733    .094502    -1.09   0.274    -.2885938    .0818473
 birthmonthdum4 |   .0146686   .0870981     0.17   0.866    -.1560405    .1853778
 birthmonthdum5 |  -.0039123   .1067005    -0.04   0.971    -.2130414    .2052169
 birthmonthdum6 |   .0377686   .0967549     0.39   0.696    -.1518675    .2274047
 birthmonthdum7 |   .0215534   .0785981     0.27   0.784     -.132496    .1756028
 birthmonthdum8 |    .002969   .0956998     0.03   0.975    -.1845991    .1905372
 birthmonthdum9 |   .0545105   .0827667     0.66   0.510    -.1077092    .2167302
birthmonthdum10 |  -.0000649   .0747473    -0.00   0.999    -.1465669    .1464371
birthmonthdum11 |   .0149161   .1098006     0.14   0.892    -.2002891    .2301212
birthmonthdum12 |  -.0737236   .0815242    -0.90   0.366    -.2335082     .086061
           male |   .3080239   .0459855     6.70   0.000     .2178939    .3981538
          _cons |   6.223932   1.825116     3.41   0.001     2.646771    9.801092
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  24.3329  (p = 0.0000)
  Wu-Hausman F(3,2693)            =  8.12102  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  15.795  Chi-sq(17) P-value = 0.5384

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,714    8.368166    .7121184   5.521461   10.12663
         exp |      2,714    20.46684    3.658754          9         30
      expsqr |      2,714     432.273     148.897         81        900
birthmont~m2 |      2,714     .087325    .2823627          0          1
birthmonth~3 |      2,714    .0840088    .2774522          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,714    .0604274    .2383209          0          1
birthmonth~5 |      2,714    .0773766    .2672372          0          1
birthmonth~6 |      2,714    .0784819     .268978          0          1
birthmonth~7 |      2,714    .0817981    .2741074          0          1
birthmonth~8 |      2,714    .0795873    .2707031          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,714    .0932203    .2907945          0          1
birthmont~10 |      2,714    .1127487    .3163437          0          1
birthmont~11 |      2,714    .0887988    .2845056          0          1
birthmont~12 |      2,714    .0803242    .2718446          0          1
        male |      2,714    .5331614     .498991          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `mo
> nths'-1) & inrange(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,714
                                                        F(31, 2682)   = 176.19
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6707
                                                        Adj R-squared = 0.6669
                                                        Root MSE      = 0.2842

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1910561   .0152445   -12.53   0.000    -.2209483   -.1611639
         expsqr |   .0014356   .0003754     3.82   0.000     .0006995    .0021716
 birthmonthdum2 |  -.0172671   .0271517    -0.64   0.525    -.0705074    .0359732
 birthmonthdum3 |   .0509364    .027475     1.85   0.064    -.0029379    .1048107
 birthmonthdum4 |   .0557044   .0299638     1.86   0.063      -.00305    .1144588
 birthmonthdum5 |   -.000195   .0280438    -0.01   0.994    -.0551846    .0547947
 birthmonthdum6 |   .0619452   .0281569     2.20   0.028     .0067338    .1171566
 birthmonthdum7 |   .0542109   .0278644     1.95   0.052    -.0004269    .1088487
 birthmonthdum8 |   .0838342   .0281518     2.98   0.003     .0286328    .1390356
 birthmonthdum9 |   .1083478   .0270504     4.01   0.000      .055306    .1613897
birthmonthdum10 |    .129342   .0259116     4.99   0.000     .0785333    .1801507
birthmonthdum11 |   .1108554   .0272041     4.07   0.000     .0575123    .1641985
birthmonthdum12 |    .152533   .0278276     5.48   0.000     .0979673    .2070986
           male |   .0072021   .0109812     0.66   0.512    -.0143304    .0287346
   provincedum2 |   .0641419   .0301411     2.13   0.033     .0050398    .1232439
   provincedum3 |   .0676165   .0328006     2.06   0.039     .0032996    .1319335
   provincedum4 |  -.0467718   .0294159    -1.59   0.112    -.1044518    .0109083
   provincedum5 |   .0074255   .0276386     0.27   0.788    -.0467697    .0616208
   provincedum6 |   .0404626   .0320238     1.26   0.207    -.0223313    .1032564
   provincedum7 |   .0262109   .0286137     0.92   0.360    -.0298962    .0823179
   provincedum8 |   .0785819   .0290475     2.71   0.007     .0216242    .1355397
   provincedum9 |  -.0306405   .0293389    -1.04   0.296    -.0881697    .0268887
  provincedum10 |  -.0264148    .028958    -0.91   0.362    -.0831971    .0303674
  provincedum11 |   -.056787   .0258566    -2.20   0.028    -.1074878   -.0060861
  provincedum12 |  -.0313072   .0325257    -0.96   0.336    -.0950851    .0324707
  provincedum13 |   .0130289   .0302059     0.43   0.666    -.0462003     .072258
  provincedum14 |  -.0076883   .0354822    -0.22   0.828    -.0772636     .061887
  provincedum15 |   .0397053   .0356045     1.12   0.265    -.0301097    .1095203
              t |  -.0119947   .0007551   -15.89   0.000    -.0134752   -.0105141
              d |   .0352843   .0227251     1.55   0.121    -.0092763    .0798449
             td |   .0002794   .0010657     0.26   0.793    -.0018102    .0023691
          _cons |   3.619354   .1552184    23.32   0.000     3.314994    3.923714
---------------------------------------------------------------------------------

                                                        Number of obs =  2,714
                                                        F(31, 2682)   = 111.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5632
                                                        Adj R-squared = 0.5581
                                                        Root MSE      = 0.3139

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2496546   .0168343   -14.83   0.000    -.2826641   -.2166452
         expsqr |   .0033122   .0004145     7.99   0.000     .0024994    .0041251
 birthmonthdum2 |    .012679   .0299831     0.42   0.672    -.0461134    .0714714
 birthmonthdum3 |   .0119881   .0303402     0.40   0.693    -.0475044    .0714806
 birthmonthdum4 |   .0337179   .0330885     1.02   0.308    -.0311636    .0985994
 birthmonthdum5 |    .041071   .0309683     1.33   0.185    -.0196531    .1017952
 birthmonthdum6 |   .0660797   .0310932     2.13   0.034     .0051107    .1270488
 birthmonthdum7 |   .0348014   .0307702     1.13   0.258    -.0255343     .095137
 birthmonthdum8 |   .1112268   .0310876     3.58   0.000     .0502688    .1721848
 birthmonthdum9 |   .1175432   .0298714     3.93   0.000     .0589699    .1761164
birthmonthdum10 |    .114092   .0286137     3.99   0.000     .0579848    .1701991
birthmonthdum11 |    .117206    .030041     3.90   0.000        .0583    .1761119
birthmonthdum12 |   .1404228   .0307295     4.57   0.000     .0801668    .2006787
           male |   .0190413   .0121264     1.57   0.116    -.0047366    .0428193
   provincedum2 |    .004081   .0332843     0.12   0.902    -.0611845    .0693464
   provincedum3 |   .0389951   .0362211     1.08   0.282     -.032029    .1100193
   provincedum4 |   .0003654   .0324835     0.01   0.991    -.0633297    .0640606
   provincedum5 |   .0388896   .0305209     1.27   0.203    -.0209573    .0987364
   provincedum6 |   .0372613   .0353634     1.05   0.292    -.0320809    .1066035
   provincedum7 |    .057405   .0315976     1.82   0.069    -.0045531    .1193631
   provincedum8 |   .0866968   .0320767     2.70   0.007     .0237993    .1495943
   provincedum9 |   .0314614   .0323985     0.97   0.332    -.0320671    .0949899
  provincedum10 |  -.0411863   .0319778    -1.29   0.198      -.10389    .0215174
  provincedum11 |  -.0130554    .028553    -0.46   0.648    -.0690436    .0429327
  provincedum12 |  -.0083883   .0359175    -0.23   0.815    -.0788172    .0620406
  provincedum13 |   .0149346   .0333558     0.45   0.654    -.0504712    .0803404
  provincedum14 |  -.0477273   .0391824    -1.22   0.223    -.1245581    .0291036
  provincedum15 |   .0174102   .0393174     0.44   0.658    -.0596854    .0945057
              t |  -.0079556   .0008338    -9.54   0.000    -.0095906   -.0063206
              d |   .0076181    .025095     0.30   0.761    -.0415894    .0568257
             td |  -.0030356   .0011768    -2.58   0.010    -.0053432    -.000728
          _cons |   3.952112   .1714051    23.06   0.000     3.616013    4.288212
---------------------------------------------------------------------------------

                                                        Number of obs =  2,714
                                                        F(31, 2682)   =  72.10
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4545
                                                        Adj R-squared = 0.4482
                                                        Root MSE      = 0.3691

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.0671087   .0197975    -3.39   0.001    -.1059285   -.0282888
         expsqr |  -.0010946   .0004875    -2.25   0.025    -.0020505   -.0001387
 birthmonthdum2 |   .0151703   .0352608     0.43   0.667    -.0539708    .0843114
 birthmonthdum3 |  -.0069301   .0356807    -0.19   0.846    -.0768946    .0630343
 birthmonthdum4 |   .0544072   .0389128     1.40   0.162    -.0218948    .1307093
 birthmonthdum5 |   .0548553   .0364194     1.51   0.132    -.0165576    .1262683
 birthmonthdum6 |   .0878769   .0365663     2.40   0.016      .016176    .1595778
 birthmonthdum7 |   .0352979   .0361864     0.98   0.329    -.0356581     .106254
 birthmonthdum8 |   .1083086   .0365596     2.96   0.003     .0366207    .1799965
 birthmonthdum9 |   .0865621   .0351294     2.46   0.014     .0176788    .1554455
birthmonthdum10 |   .1090715   .0336504     3.24   0.001     .0430882    .1750548
birthmonthdum11 |    .154238   .0353289     4.37   0.000     .0849634    .2235126
birthmonthdum12 |   .1373135   .0361386     3.80   0.000     .0664512    .2081758
           male |   .0328655   .0142609     2.30   0.021     .0049021    .0608289
   provincedum2 |   -.001467    .039143    -0.04   0.970    -.0782205    .0752865
   provincedum3 |   .0361028   .0425968     0.85   0.397    -.0474231    .1196287
   provincedum4 |  -.0147229   .0382012    -0.39   0.700    -.0896297     .060184
   provincedum5 |    .060818   .0358932     1.69   0.090    -.0095632    .1311992
   provincedum6 |   .0620591   .0415881     1.49   0.136    -.0194888     .143607
   provincedum7 |   .0548125   .0371594     1.48   0.140    -.0180515    .1276766
   provincedum8 |   .1013065   .0377229     2.69   0.007     .0273377    .1752753
   provincedum9 |   .0264163   .0381013     0.69   0.488    -.0482946    .1011272
  provincedum10 |  -.0582463   .0376066    -1.55   0.122    -.1319872    .0154945
  provincedum11 |   .0387827    .033579     1.15   0.248    -.0270605     .104626
  provincedum12 |    .013534   .0422398     0.32   0.749    -.0692919    .0963598
  provincedum13 |   .0594755   .0392272     1.52   0.130    -.0174431    .1363941
  provincedum14 |  -.0863281   .0460794    -1.87   0.061    -.1766828    .0040266
  provincedum15 |   .0184077   .0462382     0.40   0.691    -.0722583    .1090738
              t |  -.0083929   .0009806    -8.56   0.000    -.0103156   -.0064701
              d |  -.0311362   .0295123    -1.06   0.292    -.0890053    .0267328
             td |  -.0003934    .001384    -0.28   0.776    -.0031071    .0023204
          _cons |   2.204889   .2015761    10.94   0.000     1.809629     2.60015
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,714
                                                  Wald chi2(31)   =     426.10
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .75331

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.2854184   .8302963    -0.34   0.731    -1.912769    1.341932
  secgenhighedu |   1.838936   .9719185     1.89   0.058     -.065989    3.743861
      secgenedu |  -.9093654   1.157822    -0.79   0.432    -3.178656    1.359925
            exp |   .1442951   .1695251     0.85   0.395    -.1879681    .4765583
         expsqr |  -.0033553   .0041272    -0.81   0.416    -.0114445     .004734
 birthmonthdum2 |  -.0095565   .0779674    -0.12   0.902    -.1623697    .1432568
 birthmonthdum3 |  -.0752501   .0843558    -0.89   0.372    -.2405844    .0900841
 birthmonthdum4 |   .0322622   .0825504     0.39   0.696    -.1295337    .1940581
 birthmonthdum5 |  -.0186544   .0934212    -0.20   0.842    -.2017566    .1644479
 birthmonthdum6 |   .0301902   .0864538     0.35   0.727    -.1392561    .1996365
 birthmonthdum7 |   .0207685   .0733366     0.28   0.777    -.1229686    .1645056
 birthmonthdum8 |   .0025885   .0876674     0.03   0.976    -.1692365    .1744135
 birthmonthdum9 |   .0387749    .077062     0.50   0.615    -.1122638    .1898136
birthmonthdum10 |   .0102689   .0694927     0.15   0.883    -.1259342    .1464721
birthmonthdum11 |  -.0141412   .0946694    -0.15   0.881    -.1996899    .1714075
birthmonthdum12 |  -.0639525    .075471    -0.85   0.397    -.2118729    .0839678
           male |   .2967113   .0388988     7.63   0.000     .2204711    .3729516
   provincedum2 |  -.3590305   .0957293    -3.75   0.000    -.5466564   -.1714046
   provincedum3 |  -.2197647   .0887394    -2.48   0.013    -.3936907   -.0458386
   provincedum4 |  -.2994319   .0848268    -3.53   0.000    -.4656894   -.1331745
   provincedum5 |   .0820732   .0907531     0.90   0.366    -.0957997    .2599461
   provincedum6 |  -.0712528   .0907454    -0.79   0.432    -.2491105     .106605
   provincedum7 |  -.2219611   .0829719    -2.68   0.007    -.3845831    -.059339
   provincedum8 |  -.3524257   .0847293    -4.16   0.000     -.518492   -.1863594
   provincedum9 |  -.1117881   .0946451    -1.18   0.238    -.2972891    .0737129
  provincedum10 |  -.0920639   .0828561    -1.11   0.267    -.2544589    .0703311
  provincedum11 |   .0854782    .109862     0.78   0.437    -.1298473    .3008038
  provincedum12 |  -.1473144   .0952887    -1.55   0.122    -.3340768     .039448
  provincedum13 |  -.0355368   .0973848    -0.36   0.715    -.2264075    .1553339
  provincedum14 |  -.1645631   .1179314    -1.40   0.163    -.3957044    .0665782
  provincedum15 |  -.2414758   .0953539    -2.53   0.011     -.428366   -.0545857
          _cons |   6.736986   1.613618     4.18   0.000     3.574352     9.89962
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  20.5573  (p = 0.0001)
  Wu-Hausman F(3,2679)            =  6.81571  (p = 0.0001)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  30.242  Chi-sq(31) P-value = 0.5048

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,714    8.368166    .7121184   5.521461   10.12663
         exp |      2,714    20.46684    3.658754          9         30
      expsqr |      2,714     432.273     148.897         81        900
birthmont~m2 |      2,714     .087325    .2823627          0          1
birthmonth~3 |      2,714    .0840088    .2774522          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,714    .0604274    .2383209          0          1
birthmonth~5 |      2,714    .0773766    .2672372          0          1
birthmonth~6 |      2,714    .0784819     .268978          0          1
birthmonth~7 |      2,714    .0817981    .2741074          0          1
birthmonth~8 |      2,714    .0795873    .2707031          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,714    .0932203    .2907945          0          1
birthmont~10 |      2,714    .1127487    .3163437          0          1
birthmont~11 |      2,714    .0887988    .2845056          0          1
birthmont~12 |      2,714    .0803242    .2718446          0          1
        male |      2,714    .5331614     .498991          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearnin
> g, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,447
                                                        F(16, 1430)   = 193.73
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6843
                                                        Adj R-squared = 0.6808
                                                        Root MSE      = 0.2793

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2108305   .0209691   -10.05   0.000    -.2519639   -.1696971
         expsqr |    .001898   .0005154     3.68   0.000      .000887     .002909
 birthmonthdum2 |  -.0117198    .036671    -0.32   0.749    -.0836545     .060215
 birthmonthdum3 |   .0314612   .0370439     0.85   0.396    -.0412051    .1041275
 birthmonthdum4 |   .0000145   .0401961     0.00   1.000    -.0788351     .078864
 birthmonthdum5 |  -.0301392   .0371385    -0.81   0.417     -.102991    .0427126
 birthmonthdum6 |   .0677312   .0377289     1.80   0.073    -.0062787    .1417411
 birthmonthdum7 |   .0675278   .0367897     1.84   0.067    -.0046398    .1396953
 birthmonthdum8 |   .1081839   .0383814     2.82   0.005      .032894    .1834737
 birthmonthdum9 |   .0885863   .0359399     2.46   0.014     .0180858    .1590869
birthmonthdum10 |   .1126181   .0338447     3.33   0.001     .0462275    .1790086
birthmonthdum11 |   .1066319   .0359412     2.97   0.003     .0361288     .177135
birthmonthdum12 |   .1395532   .0376357     3.71   0.000     .0657261    .2133802
              t |  -.0121633   .0009993   -12.17   0.000    -.0141236    -.010203
              d |      .0251   .0302994     0.83   0.408    -.0343361    .0845362
             td |   .0010808   .0014052     0.77   0.442    -.0016756    .0038372
          _cons |   3.841153   .2139573    17.95   0.000     3.421449    4.260857
---------------------------------------------------------------------------------

                                                        Number of obs =  1,447
                                                        F(16, 1430)   = 129.83
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5923
                                                        Adj R-squared = 0.5877
                                                        Root MSE      = 0.3066

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2851537   .0230134   -12.39   0.000    -.3302974   -.2400099
         expsqr |   .0041146   .0005656     7.27   0.000      .003005    .0052242
 birthmonthdum2 |   .0340885   .0402463     0.85   0.397    -.0448596    .1130365
 birthmonthdum3 |   .0337214   .0406555     0.83   0.407    -.0460295    .1134723
 birthmonthdum4 |   .0142948    .044115     0.32   0.746    -.0722422    .1008319
 birthmonthdum5 |   .0312209   .0407593     0.77   0.444    -.0487336    .1111755
 birthmonthdum6 |    .049189   .0414073     1.19   0.235    -.0320364    .1304145
 birthmonthdum7 |   .0684071   .0403765     1.69   0.090    -.0107965    .1476106
 birthmonthdum8 |   .1481068   .0421234     3.52   0.000     .0654765    .2307371
 birthmonthdum9 |    .145411   .0394438     3.69   0.000      .068037    .2227849
birthmonthdum10 |   .1171672   .0371444     3.15   0.002     .0443039    .1900305
birthmonthdum11 |   .1333703   .0394453     3.38   0.001     .0559936    .2107471
birthmonthdum12 |   .1738866    .041305     4.21   0.000     .0928618    .2549114
              t |  -.0081899   .0010968    -7.47   0.000    -.0103414   -.0060385
              d |   .0202558   .0332535     0.61   0.543    -.0449751    .0854866
             td |  -.0027744   .0015422    -1.80   0.072    -.0057995    .0002508
          _cons |   4.344689    .234817    18.50   0.000     3.884066    4.805311
---------------------------------------------------------------------------------

                                                        Number of obs =  1,447
                                                        F(16, 1430)   =  77.89
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4657
                                                        Adj R-squared = 0.4597
                                                        Root MSE      = 0.3668

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.0842768   .0275361    -3.06   0.002    -.1382923   -.0302613
         expsqr |  -.0006745   .0006768    -1.00   0.319    -.0020021    .0006531
 birthmonthdum2 |   .0759159   .0481556     1.58   0.115    -.0185472    .1703791
 birthmonthdum3 |   .0214972   .0486453     0.44   0.659    -.0739266    .1169209
 birthmonthdum4 |   .0814511   .0527846     1.54   0.123    -.0220924    .1849947
 birthmonthdum5 |   .0716538   .0487695     1.47   0.142    -.0240136    .1673212
 birthmonthdum6 |    .072684   .0495447     1.47   0.143    -.0245042    .1698721
 birthmonthdum7 |   .1237745   .0483114     2.56   0.011     .0290057    .2185434
 birthmonthdum8 |   .1291989   .0504016     2.56   0.010     .0303299    .2280679
 birthmonthdum9 |   .1349198   .0471954     2.86   0.004       .04234    .2274995
birthmonthdum10 |   .1270595   .0444441     2.86   0.004     .0398769    .2142422
birthmonthdum11 |   .2025121   .0471971     4.29   0.000     .1099291    .2950952
birthmonthdum12 |   .2069937   .0494223     4.19   0.000     .1100457    .3039418
              t |  -.0080821   .0013123    -6.16   0.000    -.0106563   -.0055078
              d |  -.0115151   .0397886    -0.29   0.772    -.0895653    .0665351
             td |  -.0007821   .0018452    -0.42   0.672    -.0044018    .0028376
          _cons |   2.392196   .2809639     8.51   0.000      1.84105    2.943341
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,447
                                                  Wald chi2(16)   =      81.38
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .79822

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.5620814   1.407277    -0.40   0.690    -3.320294    2.196131
  secgenhighedu |   2.160782   1.732891     1.25   0.212    -1.235621    5.557186
      secgenedu |  -1.042348   2.794839    -0.37   0.709    -6.520132    4.435436
            exp |   .2151137   .3965981     0.54   0.588    -.5622043    .9924317
         expsqr |  -.0050987   .0099007    -0.51   0.607    -.0245037    .0143062
 birthmonthdum2 |   .0479806   .2137344     0.22   0.822    -.3709311    .4668922
 birthmonthdum3 |  -.0479621    .107395    -0.45   0.655    -.2584525    .1625282
 birthmonthdum4 |   .0364833   .2458809     0.15   0.882    -.4454344    .5184011
 birthmonthdum5 |   .0509636    .231905     0.22   0.826    -.4035618    .5054891
 birthmonthdum6 |   .0824244   .1302674     0.63   0.527     -.172895    .3377438
 birthmonthdum7 |   .1208381   .2221786     0.54   0.587    -.3146239    .5563001
 birthmonthdum8 |  -.0369078   .1395795    -0.26   0.791    -.3104786    .2366631
 birthmonthdum9 |   .0979851   .1644664     0.60   0.551    -.2243631    .4203333
birthmonthdum10 |   .0193752   .1235536     0.16   0.875    -.2227854    .2615358
birthmonthdum11 |  -.0088585   .2912661    -0.03   0.976    -.5797296    .5620126
birthmonthdum12 |  -.0063242   .2307885    -0.03   0.978    -.4586613    .4460129
          _cons |   6.252419   3.608963     1.73   0.083    -.8210184    13.32586
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  9.32033  (p = 0.0253)
  Wu-Hausman F(3,1427)            =   3.0837  (p = 0.0265)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  11.399  Chi-sq(16) P-value = 0.7842

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,447    8.515411    .6982608   5.521461   10.12663
         exp |      1,447    20.43538    3.654674         11         30
      expsqr |      1,447    430.9523    149.0933        121        900
birthmont~m2 |      1,447    .0829302     .275872          0          1
birthmonth~3 |      1,447    .0801659    .2716437          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,447    .0594333    .2365156          0          1
birthmonth~5 |      1,447    .0794748    .2705719          0          1
birthmonth~6 |      1,447    .0760194    .2651207          0          1
birthmonth~7 |      1,447    .0850035    .2789833          0          1
birthmonth~8 |      1,447     .073255    .2606447          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,447    .0946786    .2928718          0          1
birthmont~10 |      1,447     .122322    .3277707          0          1
birthmont~11 |      1,447    .0926054    .2899789          0          1
birthmont~12 |      1,447    .0760194    .2651207          0          1
        male |      1,447           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'
> -1) & inrange(monthlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,447
                                                        F(30, 1416)   = 106.73
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6934
                                                        Adj R-squared = 0.6869
                                                        Root MSE      = 0.2767

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2035781   .0209347    -9.72   0.000    -.2446445   -.1625117
         expsqr |   .0017085   .0005144     3.32   0.001     .0006995    .0027175
 birthmonthdum2 |  -.0044907   .0364855    -0.12   0.902    -.0760622    .0670808
 birthmonthdum3 |   .0296572   .0368754     0.80   0.421    -.0426791    .1019935
 birthmonthdum4 |   .0026297    .040033     0.07   0.948    -.0759007    .0811601
 birthmonthdum5 |  -.0307568   .0369316    -0.83   0.405    -.1032032    .0416897
 birthmonthdum6 |   .0722288   .0375095     1.93   0.054    -.0013513    .1458088
 birthmonthdum7 |    .061007   .0366514     1.66   0.096    -.0108899    .1329039
 birthmonthdum8 |   .1110771   .0382223     2.91   0.004     .0360987    .1860554
 birthmonthdum9 |    .093931   .0357854     2.62   0.009     .0237328    .1641291
birthmonthdum10 |   .1167501   .0336686     3.47   0.001     .0507044    .1827959
birthmonthdum11 |    .107447   .0358523     3.00   0.003     .0371176    .1777764
birthmonthdum12 |   .1400592   .0374481     3.74   0.000     .0665995    .2135189
   provincedum2 |   .0505877   .0396088     1.28   0.202    -.0271105    .1282859
   provincedum3 |   .0440495   .0429415     1.03   0.305    -.0401862    .1282853
   provincedum4 |  -.0529746   .0388097    -1.36   0.172    -.1291052     .023156
   provincedum5 |   .0023261   .0363172     0.06   0.949    -.0689153    .0735674
   provincedum6 |  -.0014582   .0422482    -0.03   0.972    -.0843339    .0814175
   provincedum7 |  -.0002286    .038752    -0.01   0.995    -.0762461     .075789
   provincedum8 |   .0870215   .0388781     2.24   0.025     .0107566    .1632864
   provincedum9 |  -.0587576   .0381859    -1.54   0.124    -.1336647    .0161495
  provincedum10 |  -.0325748   .0389181    -0.84   0.403    -.1089181    .0437686
  provincedum11 |  -.0721757   .0339765    -2.12   0.034    -.1388255    -.005526
  provincedum12 |  -.0549344   .0453278    -1.21   0.226    -.1438512    .0339824
  provincedum13 |   .0174749   .0401644     0.44   0.664    -.0613133    .0962631
  provincedum14 |  -.0120968   .0484525    -0.25   0.803    -.1071432    .0829497
  provincedum15 |   .0607499   .0491555     1.24   0.217    -.0356756    .1571754
              t |  -.0120416   .0009946   -12.11   0.000    -.0139927   -.0100905
              d |    .023973   .0301975     0.79   0.427    -.0352636    .0832096
             td |   .0008985   .0013977     0.64   0.520    -.0018433    .0036402
          _cons |    3.78308   .2133851    17.73   0.000     3.364495    4.201665
---------------------------------------------------------------------------------

                                                        Number of obs =  1,447
                                                        F(30, 1416)   =  71.05
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6008
                                                        Adj R-squared = 0.5924
                                                        Root MSE      = 0.3048

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |   -.281234   .0230667   -12.19   0.000    -.3264826   -.2359855
         expsqr |   .0040045   .0005667     7.07   0.000     .0028928    .0051163
 birthmonthdum2 |   .0372206   .0402012     0.93   0.355    -.0416396    .1160808
 birthmonthdum3 |   .0298319   .0406308     0.73   0.463     -.049871    .1095349
 birthmonthdum4 |   .0187741   .0441099     0.43   0.670    -.0677537    .1053019
 birthmonthdum5 |   .0301182   .0406926     0.74   0.459    -.0497061    .1099425
 birthmonthdum6 |   .0479567   .0413294     1.16   0.246    -.0331167      .12903
 birthmonthdum7 |   .0568725   .0403839     1.41   0.159    -.0223462    .1360913
 birthmonthdum8 |   .1443297   .0421147     3.43   0.001     .0617157    .2269437
 birthmonthdum9 |   .1446022   .0394298     3.67   0.000     .0672552    .2219493
birthmonthdum10 |   .1178269   .0370974     3.18   0.002     .0450552    .1905987
birthmonthdum11 |   .1334297   .0395035     3.38   0.001     .0559381    .2109213
birthmonthdum12 |   .1718078   .0412618     4.16   0.000     .0908671    .2527485
   provincedum2 |  -.0198629   .0436425    -0.46   0.649    -.1054738    .0657479
   provincedum3 |   .0327345   .0473145     0.69   0.489    -.0600797    .1255486
   provincedum4 |  -.0067847    .042762    -0.16   0.874    -.0906683    .0770989
   provincedum5 |   .0634175   .0400157     1.58   0.113     -.015079    .1419139
   provincedum6 |  -.0056778   .0465506    -0.12   0.903    -.0969934    .0856379
   provincedum7 |   .0505179   .0426985     1.18   0.237    -.0332411    .1342769
   provincedum8 |   .1299371   .0428374     3.03   0.002     .0459055    .2139687
   provincedum9 |   .0031968   .0420747     0.08   0.939    -.0793387    .0857323
  provincedum10 |  -.0288841   .0428814    -0.67   0.501    -.1130021    .0552339
  provincedum11 |  -.0092206   .0374366    -0.25   0.805    -.0826578    .0642167
  provincedum12 |  -.0191488   .0499439    -0.38   0.701    -.1171207    .0788232
  provincedum13 |   .0243187   .0442547     0.55   0.583    -.0624931    .1111305
  provincedum14 |   -.074091   .0533869    -1.39   0.165    -.1788168    .0306349
  provincedum15 |    .029846   .0541615     0.55   0.582    -.0763993    .1360914
              t |   -.008055   .0010959    -7.35   0.000    -.0102048   -.0059052
              d |   .0121462   .0332727     0.37   0.715    -.0531229    .0774154
             td |  -.0027678     .00154    -1.80   0.073    -.0057887    .0002531
          _cons |   4.302789   .2351159    18.30   0.000     3.841576    4.764001
---------------------------------------------------------------------------------

                                                        Number of obs =  1,447
                                                        F(30, 1416)   =  43.01
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4768
                                                        Adj R-squared = 0.4657
                                                        Root MSE      = 0.3648

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.0799422   .0276025    -2.90   0.004    -.1340883    -.025796
         expsqr |  -.0008054   .0006782    -1.19   0.235    -.0021357     .000525
 birthmonthdum2 |   .0806761   .0481063     1.68   0.094    -.0136911    .1750432
 birthmonthdum3 |   .0204426   .0486203     0.42   0.674     -.074933    .1158182
 birthmonthdum4 |   .0909826   .0527836     1.72   0.085    -.0125599    .1945251
 birthmonthdum5 |   .0723597   .0486944     1.49   0.138    -.0231612    .1678805
 birthmonthdum6 |   .0711278   .0494563     1.44   0.151    -.0258877    .1681433
 birthmonthdum7 |      .1137    .048325     2.35   0.019     .0189038    .2084963
 birthmonthdum8 |   .1298098   .0503961     2.58   0.010     .0309507    .2286689
 birthmonthdum9 |   .1304899   .0471832     2.77   0.006     .0379334    .2230463
birthmonthdum10 |   .1299796   .0443922     2.93   0.003     .0428982    .2170611
birthmonthdum11 |   .2016812   .0472714     4.27   0.000     .1089517    .2944106
birthmonthdum12 |   .2119287   .0493754     4.29   0.000     .1150719    .3087855
   provincedum2 |   -.047606   .0522242    -0.91   0.362    -.1500512    .0548392
   provincedum3 |   .0224724   .0566184     0.40   0.691    -.0885926    .1335374
   provincedum4 |  -.0358127   .0511706    -0.70   0.484    -.1361911    .0645656
   provincedum5 |   .0731446   .0478843     1.53   0.127    -.0207872    .1670765
   provincedum6 |   .0199651   .0557043     0.36   0.720    -.0893068    .1292369
   provincedum7 |   .0409032   .0510946     0.80   0.424    -.0593261    .1411325
   provincedum8 |   .1150039   .0512609     2.24   0.025     .0144484    .2155593
   provincedum9 |   .0113901   .0503482     0.23   0.821     -.087375    .1101552
  provincedum10 |  -.0101783   .0513136    -0.20   0.843    -.1108371    .0904806
  provincedum11 |   .0337668   .0447981     0.75   0.451     -.054111    .1216446
  provincedum12 |  -.0183737   .0597648    -0.31   0.759    -.1356107    .0988633
  provincedum13 |   .0878162   .0529569     1.66   0.097    -.0160662    .1916986
  provincedum14 |   -.140178   .0638848    -2.19   0.028     -.265497    -.014859
  provincedum15 |   .0103798   .0648117     0.16   0.873    -.1167574    .1375171
              t |  -.0078235   .0013114    -5.97   0.000     -.010396    -.005251
              d |  -.0244373   .0398154    -0.61   0.539    -.1025409    .0536663
             td |  -.0009173   .0018428    -0.50   0.619    -.0045323    .0026977
          _cons |   2.347855   .2813487     8.34   0.000      1.79595     2.89976
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,447
                                                  Wald chi2(30)   =     134.97
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .76428

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   -.618716   1.134976    -0.55   0.586    -2.843228    1.605795
  secgenhighedu |   2.019377   1.607304     1.26   0.209    -1.130882    5.169635
      secgenedu |  -.8174455   2.123381    -0.38   0.700    -4.979195    3.344304
            exp |    .178213   .3296607     0.54   0.589      -.46791     .824336
         expsqr |  -.0041421    .008151    -0.51   0.611    -.0201177    .0118335
 birthmonthdum2 |   .0220061   .1710037     0.13   0.898    -.3131551    .3571672
 birthmonthdum3 |  -.0360944   .1025698    -0.35   0.725    -.2371274    .1649387
 birthmonthdum4 |   .0224981   .2096645     0.11   0.915    -.3884367    .4334329
 birthmonthdum5 |   .0433177   .1871282     0.23   0.817    -.3234469    .4100824
 birthmonthdum6 |   .0627488     .11631     0.54   0.590    -.1652147    .2907122
 birthmonthdum7 |   .1089178   .1766889     0.62   0.538    -.2373861    .4552216
 birthmonthdum8 |   -.037099   .1258736    -0.29   0.768    -.2838067    .2096086
 birthmonthdum9 |   .0649182   .1352568     0.48   0.631    -.2001804    .3300167
birthmonthdum10 |    .010348   .1084711     0.10   0.924    -.2022514    .2229474
birthmonthdum11 |   -.055407   .2210013    -0.25   0.802    -.4885616    .3777476
birthmonthdum12 |  -.0106128   .1906016    -0.06   0.956     -.384185    .3629594
   provincedum2 |  -.2456116    .166888    -1.47   0.141    -.5727061    .0814829
   provincedum3 |  -.1065232   .1200112    -0.89   0.375    -.3417409    .1286945
   provincedum4 |  -.2850428    .117886    -2.42   0.016    -.5160952   -.0539905
   provincedum5 |   .0823151   .1469007     0.56   0.575    -.2056049    .3702351
   provincedum6 |   .0332935   .1287351     0.26   0.796    -.2190226    .2856096
   provincedum7 |  -.1599566   .1230379    -1.30   0.194    -.4011064    .0811932
   provincedum8 |  -.3847688   .1279863    -3.01   0.003    -.6356174   -.1339202
   provincedum9 |  -.0315204   .1373582    -0.23   0.818    -.3007375    .2376966
  provincedum10 |   .0183375   .1153818     0.16   0.874    -.2078067    .2444816
  provincedum11 |   .0892081   .1738523     0.51   0.608    -.2515361    .4299524
  provincedum12 |  -.1616086   .1308021    -1.24   0.217    -.4179759    .0947587
  provincedum13 |  -.0001766   .1860859    -0.00   0.999    -.3648983    .3645451
  provincedum14 |  -.1437364   .2412235    -0.60   0.551    -.6165258     .329053
  provincedum15 |  -.2832402   .1470344    -1.93   0.054    -.5714223    .0049419
          _cons |   6.657727   3.078199     2.16   0.031     .6245683    12.69089
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  7.78479  (p = 0.0507)
  Wu-Hausman F(3,1413)            =  2.54766  (p = 0.0544)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  25.700  Chi-sq(30) P-value = 0.6903

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,447    8.515411    .6982608   5.521461   10.12663
         exp |      1,447    20.43538    3.654674         11         30
      expsqr |      1,447    430.9523    149.0933        121        900
birthmont~m2 |      1,447    .0829302     .275872          0          1
birthmonth~3 |      1,447    .0801659    .2716437          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,447    .0594333    .2365156          0          1
birthmonth~5 |      1,447    .0794748    .2705719          0          1
birthmonth~6 |      1,447    .0760194    .2651207          0          1
birthmonth~7 |      1,447    .0850035    .2789833          0          1
birthmonth~8 |      1,447     .073255    .2606447          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,447    .0946786    .2928718          0          1
birthmont~10 |      1,447     .122322    .3277707          0          1
birthmont~11 |      1,447    .0926054    .2899789          0          1
birthmont~12 |      1,447    .0760194    .2651207          0          1
        male |      1,447           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearnin
> g, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,267
                                                        F(16, 1250)   = 140.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6425
                                                        Adj R-squared = 0.6379
                                                        Root MSE      = 0.2949

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1792106   .0224554    -7.98   0.000     -.223265   -.1351562
         expsqr |   .0011939   .0005553     2.15   0.032     .0001045    .0022834
 birthmonthdum2 |   -.022761    .041032    -0.55   0.579    -.1032602    .0577383
 birthmonthdum3 |   .0802912   .0414636     1.94   0.053    -.0010548    .1616372
 birthmonthdum4 |   .1185403   .0455684     2.60   0.009     .0291414    .2079392
 birthmonthdum5 |   .0373087   .0433161     0.86   0.389    -.0476716    .1222889
 birthmonthdum6 |   .0571799   .0428324     1.33   0.182    -.0268514    .1412112
 birthmonthdum7 |    .050473   .0431091     1.17   0.242    -.0341011    .1350471
 birthmonthdum8 |   .0636195   .0420838     1.51   0.131    -.0189431    .1461821
 birthmonthdum9 |   .1219967   .0415305     2.94   0.003     .0405195    .2034739
birthmonthdum10 |   .1467296   .0406338     3.61   0.000     .0670116    .2264476
birthmonthdum11 |   .1088835   .0421324     2.58   0.010     .0262255    .1915415
birthmonthdum12 |   .1672617    .041887     3.99   0.000     .0850851    .2494383
              t |  -.0121222   .0011677   -10.38   0.000    -.0144132   -.0098313
              d |   .0549212   .0348018     1.58   0.115    -.0133553    .1231977
             td |  -.0005242   .0016585    -0.32   0.752    -.0037779    .0027295
          _cons |   3.473011   .2289266    15.17   0.000     3.023889    3.922134
---------------------------------------------------------------------------------

                                                        Number of obs =  1,267
                                                        F(16, 1250)   =  85.32
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5220
                                                        Adj R-squared = 0.5159
                                                        Root MSE      = 0.3240

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2229147    .024667    -9.04   0.000     -.271308   -.1745214
         expsqr |     .00276     .00061     4.52   0.000     .0015632    .0039568
 birthmonthdum2 |  -.0043544   .0450732    -0.10   0.923     -.092782    .0840731
 birthmonthdum3 |   .0026197   .0455474     0.06   0.954     -.086738    .0919774
 birthmonthdum4 |   .0468365   .0500564     0.94   0.350    -.0513672    .1450403
 birthmonthdum5 |   .0588036   .0475823     1.24   0.217    -.0345463    .1521535
 birthmonthdum6 |   .0843619   .0470509     1.79   0.073    -.0079456    .1766694
 birthmonthdum7 |   .0116781   .0473548     0.25   0.805    -.0812257    .1045818
 birthmonthdum8 |   .0794958   .0462286     1.72   0.086    -.0111984    .1701899
 birthmonthdum9 |   .0815732   .0456208     1.79   0.074    -.0079286    .1710751
birthmonthdum10 |   .1138922   .0446358     2.55   0.011     .0263229    .2014616
birthmonthdum11 |   .0933459    .046282     2.02   0.044      .002547    .1841448
birthmonthdum12 |   .1119304   .0460124     2.43   0.015     .0216603    .2022005
              t |  -.0080379   .0012827    -6.27   0.000    -.0105545   -.0055213
              d |   .0113177   .0382295     0.30   0.767    -.0636833    .0863187
             td |  -.0033228   .0018218    -1.82   0.068     -.006897    .0002513
          _cons |   3.670775   .2514735    14.60   0.000     3.177419    4.164132
---------------------------------------------------------------------------------

                                                        Number of obs =  1,267
                                                        F(16, 1250)   =  58.99
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4302
                                                        Adj R-squared = 0.4229
                                                        Root MSE      = 0.3749

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.0552926   .0285438    -1.94   0.053    -.1112917    .0007064
         expsqr |  -.0013183   .0007059    -1.87   0.062    -.0027032    .0000666
 birthmonthdum2 |  -.0466741   .0521572    -0.89   0.371    -.1489994    .0556511
 birthmonthdum3 |  -.0358242   .0527058    -0.68   0.497    -.1392258    .0675774
 birthmonthdum4 |   .0033231   .0579235     0.06   0.954    -.1103148    .1169611
 birthmonthdum5 |   .0408451   .0550605     0.74   0.458    -.0671762    .1488663
 birthmonthdum6 |   .0992112   .0544457     1.82   0.069    -.0076038    .2060262
 birthmonthdum7 |  -.0515295   .0547974    -0.94   0.347    -.1590344    .0559755
 birthmonthdum8 |   .0759469   .0534941     1.42   0.156    -.0290012    .1808949
 birthmonthdum9 |   .0283744   .0527908     0.54   0.591     -.075194    .1319428
birthmonthdum10 |   .0876088    .051651     1.70   0.090    -.0137234    .1889409
birthmonthdum11 |   .0886815   .0535559     1.66   0.098    -.0163878    .1937508
birthmonthdum12 |   .0603411    .053244     1.13   0.257    -.0441164    .1647985
              t |   -.009064   .0014843    -6.11   0.000    -.0119761   -.0061519
              d |  -.0234115   .0442378    -0.53   0.597       -.1102     .063377
             td |  -.0000449   .0021081    -0.02   0.983    -.0041808     .004091
          _cons |   2.119156   .2909963     7.28   0.000     1.548261    2.690051
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,267
                                                  Wald chi2(16)   =     127.96
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .78722

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .0373964   1.271619     0.03   0.977    -2.454931    2.529724
  secgenhighedu |   1.895051    1.42502     1.33   0.184    -.8979364    4.688039
      secgenedu |  -1.228634   1.513391    -0.81   0.417    -4.194826    1.737558
            exp |   .1390314   .2100567     0.66   0.508    -.2726721     .550735
         expsqr |  -.0033597   .0050725    -0.66   0.508    -.0133016    .0065822
 birthmonthdum2 |  -.0868858   .1214482    -0.72   0.474    -.3249199    .1511484
 birthmonthdum3 |  -.1919356     .17284    -1.11   0.267    -.5306957    .1468245
 birthmonthdum4 |  -.0458843   .1722613    -0.27   0.790    -.3835102    .2917416
 birthmonthdum5 |  -.0914144   .1209468    -0.76   0.450    -.3284659     .145637
 birthmonthdum6 |  -.0008105   .1410466    -0.01   0.995    -.2772568    .2756358
 birthmonthdum7 |     -.1008   .1642853    -0.61   0.540    -.4227934    .2211933
 birthmonthdum8 |   .0248982   .1212376     0.21   0.837    -.2127232    .2625196
 birthmonthdum9 |  -.0132675   .1440882    -0.09   0.927    -.2956751    .2691402
birthmonthdum10 |  -.0215315   .1236258    -0.17   0.862    -.2638337    .2207707
birthmonthdum11 |   .0197818   .1132341     0.17   0.861    -.2021529    .2417165
birthmonthdum12 |  -.1829632   .1582896    -1.16   0.248    -.4932051    .1272787
          _cons |   6.762339   1.959074     3.45   0.001     2.922625    10.60205
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  15.5125  (p = 0.0014)
  Wu-Hausman F(3,1247)            =  5.15229  (p = 0.0015)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.973  Chi-sq(16) P-value = 0.8680

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,267    8.200001    .6904736   5.521461   10.12663
         exp |      1,267    20.50276     3.66452          9         28
      expsqr |      1,267    433.7814     148.717         81        784
birthmont~m2 |      1,267    .0923441    .2896254          0          1
birthmonth~3 |      1,267    .0883978    .2839846          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,267    .0615627    .2404546          0          1
birthmonth~5 |      1,267    .0749803    .2634635          0          1
birthmonth~6 |      1,267    .0812944    .2733946          0          1
birthmonth~7 |      1,267    .0781373    .2684936          0          1
birthmonth~8 |      1,267    .0868193    .2816812          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,267    .0915549    .2885104          0          1
birthmont~10 |      1,267    .1018153    .3025247          0          1
birthmont~11 |      1,267    .0844515    .2781735          0          1
birthmont~12 |      1,267    .0852407    .2793498          0          1
        male |      1,267           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'
> -1) & inrange(monthlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,267
                                                        F(30, 1236)   =  76.56
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6501
                                                        Adj R-squared = 0.6416
                                                        Root MSE      = 0.2934

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1781117   .0225221    -7.91   0.000    -.2222975   -.1339259
         expsqr |    .001156   .0005561     2.08   0.038      .000065     .002247
 birthmonthdum2 |  -.0271372   .0410947    -0.66   0.509    -.1077602    .0534859
 birthmonthdum3 |   .0766309   .0415213     1.85   0.065    -.0048291    .1580909
 birthmonthdum4 |   .1102933   .0457321     2.41   0.016     .0205723    .2000144
 birthmonthdum5 |   .0351565   .0434516     0.81   0.419    -.0500906    .1204035
 birthmonthdum6 |   .0506825   .0427899     1.18   0.236    -.0332664    .1346314
 birthmonthdum7 |   .0400214   .0431378     0.93   0.354    -.0446099    .1246528
 birthmonthdum8 |   .0620446   .0419365     1.48   0.139      -.02023    .1443192
 birthmonthdum9 |    .124242   .0414949     2.99   0.003     .0428339    .2056502
birthmonthdum10 |   .1429751   .0407597     3.51   0.000     .0630093     .222941
birthmonthdum11 |    .113442   .0420884     2.70   0.007     .0308693    .1960146
birthmonthdum12 |   .1643464   .0419019     3.92   0.000     .0821398    .2465531
   provincedum2 |     .07875   .0466492     1.69   0.092    -.0127704    .1702704
   provincedum3 |   .0992265   .0508838     1.95   0.051    -.0006016    .1990546
   provincedum4 |  -.0401565   .0453023    -0.89   0.376    -.1290344    .0487213
   provincedum5 |   .0122178   .0426352     0.29   0.774    -.0714274    .0958631
   provincedum6 |   .0850003   .0492304     1.73   0.084     -.011584    .1815846
   provincedum7 |   .0405109   .0431193     0.94   0.348    -.0440843    .1251061
   provincedum8 |    .068936   .0440073     1.57   0.117    -.0174013    .1552733
   provincedum9 |   .0055916   .0461071     0.12   0.903    -.0848653    .0960486
  provincedum10 |  -.0255983   .0437203    -0.59   0.558    -.1113726     .060176
  provincedum11 |  -.0390243   .0399384    -0.98   0.329    -.1173788    .0393302
  provincedum12 |  -.0104804   .0474678    -0.22   0.825    -.1036068    .0826461
  provincedum13 |   .0057276   .0460964     0.12   0.901    -.0847083    .0961634
  provincedum14 |  -.0058802   .0527757    -0.11   0.911    -.1094201    .0976597
  provincedum15 |   .0256296   .0523634     0.49   0.625    -.0771013    .1283605
              t |  -.0119445   .0011661   -10.24   0.000    -.0142321   -.0096568
              d |   .0484921   .0348677     1.39   0.165    -.0199144    .1168986
             td |  -.0004433   .0016586    -0.27   0.789    -.0036973    .0028106
          _cons |   3.457486   .2287917    15.11   0.000     3.008623    3.906349
---------------------------------------------------------------------------------

                                                        Number of obs =  1,267
                                                        F(30, 1236)   =  46.10
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5280
                                                        Adj R-squared = 0.5166
                                                        Root MSE      = 0.3237

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2203054   .0248496    -8.87   0.000    -.2690575   -.1715533
         expsqr |   .0026915   .0006136     4.39   0.000     .0014877    .0038953
 birthmonthdum2 |  -.0081833   .0453416    -0.18   0.857    -.0971382    .0807717
 birthmonthdum3 |  -.0048148   .0458122    -0.11   0.916    -.0946932    .0850635
 birthmonthdum4 |    .042972   .0504582     0.85   0.395    -.0560212    .1419651
 birthmonthdum5 |     .05656    .047942     1.18   0.238    -.0374968    .1506168
 birthmonthdum6 |   .0789522    .047212     1.67   0.095    -.0136723    .1715766
 birthmonthdum7 |   .0027006   .0475958     0.06   0.955    -.0906769     .096078
 birthmonthdum8 |   .0800311   .0462703     1.73   0.084     -.010746    .1708082
 birthmonthdum9 |   .0853341   .0457831     1.86   0.063    -.0044871    .1751552
birthmonthdum10 |   .1066253   .0449719     2.37   0.018     .0183956    .1948551
birthmonthdum11 |   .0944554    .046438     2.03   0.042     .0033494    .1855614
birthmonthdum12 |   .1049714   .0462321     2.27   0.023     .0142692    .1956735
   provincedum2 |   .0344251   .0514701     0.67   0.504    -.0665534    .1354035
   provincedum3 |   .0464315   .0561423     0.83   0.408    -.0637131    .1565762
   provincedum4 |   .0118516    .049984     0.24   0.813    -.0862112    .1099144
   provincedum5 |    .006872   .0470412     0.15   0.884    -.0854175    .0991614
   provincedum6 |   .0838771    .054318     1.54   0.123    -.0226886    .1904427
   provincedum7 |   .0549284   .0475754     1.15   0.248    -.0384091    .1482659
   provincedum8 |   .0357851   .0485552     0.74   0.461    -.0594746    .1310448
   provincedum9 |   .0679652    .050872     1.34   0.182    -.0318399    .1677702
  provincedum10 |  -.0596729   .0482386    -1.24   0.216    -.1543114    .0349656
  provincedum11 |  -.0157499   .0440657    -0.36   0.721    -.1022018     .070702
  provincedum12 |  -.0049477   .0523733    -0.09   0.925    -.1076981    .0978028
  provincedum13 |  -.0017267   .0508602    -0.03   0.973    -.1015085    .0980552
  provincedum14 |  -.0263738   .0582297    -0.45   0.651    -.1406138    .0878663
  provincedum15 |   .0030605   .0577748     0.05   0.958     -.110287    .1164079
              t |  -.0078001   .0012866    -6.06   0.000    -.0103242    -.005276
              d |   .0042469   .0384711     0.11   0.912    -.0712289    .0797227
             td |  -.0033965     .00183    -1.86   0.064    -.0069867    .0001937
          _cons |   3.640963   .2524359    14.42   0.000     3.145713    4.136213
---------------------------------------------------------------------------------

                                                        Number of obs =  1,267
                                                        F(30, 1236)   =  32.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4403
                                                        Adj R-squared = 0.4268
                                                        Root MSE      = 0.3736

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.0513787   .0286801    -1.79   0.073    -.1076457    .0048884
         expsqr |  -.0014413   .0007081    -2.04   0.042    -.0028306    -.000052
 birthmonthdum2 |  -.0517972   .0523308    -0.99   0.322    -.1544641    .0508698
 birthmonthdum3 |  -.0407749    .052874    -0.77   0.441    -.1445076    .0629578
 birthmonthdum4 |   .0103566   .0582361     0.18   0.859    -.1038959    .1246091
 birthmonthdum5 |   .0402383   .0553321     0.73   0.467    -.0683169    .1487935
 birthmonthdum6 |   .0968678   .0544895     1.78   0.076    -.0100343    .2037699
 birthmonthdum7 |  -.0566908   .0549325    -1.03   0.302     -.164462    .0510804
 birthmonthdum8 |   .0814764   .0534027     1.53   0.127    -.0232936    .1862464
 birthmonthdum9 |   .0315931   .0528403     0.60   0.550    -.0720736    .1352598
birthmonthdum10 |   .0809918   .0519042     1.56   0.119    -.0208382    .1828218
birthmonthdum11 |   .0927769   .0535962     1.73   0.084    -.0123727    .1979264
birthmonthdum12 |   .0580801   .0533586     1.09   0.277    -.0466034    .1627636
   provincedum2 |    .056483    .059404     0.95   0.342    -.0600609    .1730268
   provincedum3 |   .0570134   .0647963     0.88   0.379    -.0701095    .1841364
   provincedum4 |   .0164877   .0576888     0.29   0.775    -.0966911    .1296664
   provincedum5 |   .0450387   .0542924     0.83   0.407    -.0614767    .1515542
   provincedum6 |   .1197788   .0626909     1.91   0.056    -.0032135    .2427711
   provincedum7 |   .0786712    .054909     1.43   0.152    -.0290539    .1863963
   provincedum8 |   .0898308   .0560397     1.60   0.109    -.0201127    .1997744
   provincedum9 |   .0499505   .0587137     0.85   0.395    -.0652391      .16514
  provincedum10 |  -.0972559   .0556743    -1.75   0.081    -.2064825    .0119707
  provincedum11 |   .0491357   .0508583     0.97   0.334    -.0506424    .1489137
  provincedum12 |   .0424653   .0604465     0.70   0.482    -.0761237    .1610543
  provincedum13 |   .0338306   .0587001     0.58   0.564    -.0813321    .1489934
  provincedum14 |  -.0333527   .0672056    -0.50   0.620    -.1652023     .098497
  provincedum15 |   .0298305   .0666805     0.45   0.655     -.100989    .1606499
              t |  -.0088864   .0014849    -5.98   0.000    -.0117995   -.0059732
              d |  -.0367411   .0444012    -0.83   0.408    -.1238512     .050369
             td |   .0000912   .0021121     0.04   0.966    -.0040524    .0042348
          _cons |    2.06192   .2913477     7.08   0.000      1.49033    2.633511
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,267
                                                  Wald chi2(30)   =     205.92
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      .7202

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .1383338    1.08732     0.13   0.899    -1.992774    2.269441
  secgenhighedu |    1.47623   1.244223     1.19   0.235    -.9624029    3.914863
      secgenedu |  -.8961772   1.242947    -0.72   0.471    -3.332309    1.539954
            exp |   .1063001   .1799522     0.59   0.555    -.2463997    .4589999
         expsqr |   -.002449   .0043396    -0.56   0.573    -.0109544    .0060564
 birthmonthdum2 |  -.0606842   .1103131    -0.55   0.582    -.2768939    .1555255
 birthmonthdum3 |  -.1573116   .1524573    -1.03   0.302    -.4561224    .1414992
 birthmonthdum4 |   .0263549   .1415831     0.19   0.852    -.2511429    .3038527
 birthmonthdum5 |  -.1006647   .1108006    -0.91   0.364    -.3178298    .1165004
 birthmonthdum6 |   .0165829    .127349     0.13   0.896    -.2330165    .2661823
 birthmonthdum7 |  -.0662982   .1395776    -0.47   0.635    -.3398653     .207269
 birthmonthdum8 |   .0233688   .1123657     0.21   0.835     -.196864    .2436016
 birthmonthdum9 |  -.0157233   .1263771    -0.12   0.901    -.2634179    .2319713
birthmonthdum10 |   .0047814   .1137312     0.04   0.966    -.2181276    .2276905
birthmonthdum11 |    .021675   .1040714     0.21   0.835    -.1823012    .2256511
birthmonthdum12 |   -.154913   .1389401    -1.11   0.265    -.4272305    .1174046
   provincedum2 |  -.5127419   .1209151    -4.24   0.000    -.7497311   -.2757526
   provincedum3 |  -.3987715    .131704    -3.03   0.002    -.6569067   -.1406364
   provincedum4 |   -.335614   .1283819    -2.61   0.009    -.5872378   -.0839902
   provincedum5 |   .0502629   .1132512     0.44   0.657    -.1717053    .2722311
   provincedum6 |  -.2102624   .1311506    -1.60   0.109    -.4673128     .046788
   provincedum7 |  -.3013188    .115455    -2.61   0.009    -.5276065   -.0750311
   provincedum8 |  -.3550186   .1224344    -2.90   0.004    -.5949856   -.1150516
   provincedum9 |  -.2366129   .1310969    -1.80   0.071    -.4935581    .0203323
  provincedum10 |  -.2184937   .1335329    -1.64   0.102    -.4802133    .0432259
  provincedum11 |   .0481343   .1354816     0.36   0.722    -.2174047    .3136734
  provincedum12 |  -.1566957   .1335045    -1.17   0.241    -.4183597    .1049683
  provincedum13 |  -.0931076   .1196766    -0.78   0.437    -.3276695    .1414542
  provincedum14 |  -.2005962   .1329396    -1.51   0.131    -.4611531    .0599607
  provincedum15 |  -.2186276   .1324171    -1.65   0.099    -.4781603    .0409051
          _cons |     7.1606   1.719833     4.16   0.000      3.78979    10.53141
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  13.5764  (p = 0.0035)
  Wu-Hausman F(3,1233)            =  4.45173  (p = 0.0041)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  20.890  Chi-sq(30) P-value = 0.8913

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,267    8.200001    .6904736   5.521461   10.12663
         exp |      1,267    20.50276     3.66452          9         28
      expsqr |      1,267    433.7814     148.717         81        784
birthmont~m2 |      1,267    .0923441    .2896254          0          1
birthmonth~3 |      1,267    .0883978    .2839846          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,267    .0615627    .2404546          0          1
birthmonth~5 |      1,267    .0749803    .2634635          0          1
birthmonth~6 |      1,267    .0812944    .2733946          0          1
birthmonth~7 |      1,267    .0781373    .2684936          0          1
birthmonth~8 |      1,267    .0868193    .2816812          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,267    .0915549    .2885104          0          1
birthmont~10 |      1,267    .1018153    .3025247          0          1
birthmont~11 |      1,267    .0844515    .2781735          0          1
birthmont~12 |      1,267    .0852407    .2793498          0          1
        male |      1,267           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 25
> 0, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,714
                                                        F(17, 2696)   = 312.10
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6631
                                                        Adj R-squared = 0.6609
                                                        Root MSE      = 0.2868

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1947782   .0152862   -12.74   0.000    -.2247521   -.1648044
         expsqr |   .0015415   .0003768     4.09   0.000     .0008027    .0022803
 birthmonthdum2 |  -.0183293   .0273519    -0.67   0.503    -.0719621    .0353034
 birthmonthdum3 |   .0531707   .0276257     1.92   0.054    -.0009989    .1073403
 birthmonthdum4 |   .0573464   .0301709     1.90   0.057     -.001814    .1165069
 birthmonthdum5 |  -.0004476   .0282474    -0.02   0.987    -.0558363    .0549411
 birthmonthdum6 |   .0622526   .0283384     2.20   0.028     .0066855    .1178197
 birthmonthdum7 |   .0608162   .0280155     2.17   0.030     .0058822    .1157502
 birthmonthdum8 |   .0839064   .0283331     2.96   0.003     .0283496    .1394631
 birthmonthdum9 |   .1038505   .0272261     3.81   0.000     .0504645    .1572366
birthmonthdum10 |   .1281558   .0260718     4.92   0.000      .077033    .1792787
birthmonthdum11 |   .1072815   .0274005     3.92   0.000     .0535533    .1610096
birthmonthdum12 |    .152749   .0279978     5.46   0.000     .0978496    .2076484
           male |   .0064329   .0110534     0.58   0.561     -.015241    .0281068
              t |  -.0121179   .0007603   -15.94   0.000    -.0136087    -.010627
              d |   .0387472   .0228379     1.70   0.090    -.0060345    .0835288
             td |   .0003084   .0010728     0.29   0.774    -.0017953     .002412
          _cons |   3.652068   .1560488    23.40   0.000     3.346081    3.958055
---------------------------------------------------------------------------------

                                                        Number of obs =  2,714
                                                        F(17, 2696)   = 200.13
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5579
                                                        Adj R-squared = 0.5551
                                                        Root MSE      = 0.3149

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2529063   .0167888   -15.06   0.000    -.2858266    -.219986
         expsqr |    .003407   .0004138     8.23   0.000     .0025956    .0042184
 birthmonthdum2 |   .0151172   .0300406     0.50   0.615    -.0437876    .0740221
 birthmonthdum3 |   .0168195   .0303413     0.55   0.579     -.042675     .076314
 birthmonthdum4 |   .0319899   .0331367     0.97   0.334     -.032986    .0969658
 birthmonthdum5 |   .0427768   .0310241     1.38   0.168    -.0180566    .1036102
 birthmonthdum6 |   .0684139    .031124     2.20   0.028     .0073846    .1294433
 birthmonthdum7 |   .0436308   .0307694     1.42   0.156    -.0167032    .1039647
 birthmonthdum8 |   .1131062   .0311182     3.63   0.000     .0520882    .1741242
 birthmonthdum9 |   .1160885   .0299024     3.88   0.000     .0574546    .1747225
birthmonthdum10 |   .1166348   .0286347     4.07   0.000     .0604866     .172783
birthmonthdum11 |   .1159114    .030094     3.85   0.000     .0569018     .174921
birthmonthdum12 |   .1440267     .03075     4.68   0.000     .0837308    .2043227
           male |   .0192587   .0121399     1.59   0.113    -.0045458    .0430632
              t |  -.0080644    .000835    -9.66   0.000    -.0097018   -.0064271
              d |   .0138637   .0250829     0.55   0.581    -.0353199    .0630474
             td |  -.0030713   .0011783    -2.61   0.009    -.0053817   -.0007609
          _cons |   3.988184   .1713884    23.27   0.000     3.652118     4.32425
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,714
                                                  Wald chi2(16)   =     320.89
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .77287

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.8343633    .684955    -1.22   0.223     -2.17685    .5081239
  secgenhighedu |   1.592905   .8141669     1.96   0.050     -.002833    3.188643
            exp |   .0349795   .0769505     0.45   0.649    -.1158408    .1857998
         expsqr |  -.0007172    .001798    -0.40   0.690    -.0042412    .0028068
 birthmonthdum2 |  -.0325834   .0776443    -0.42   0.675    -.1847635    .1195967
 birthmonthdum3 |   -.060347   .0769527    -0.78   0.433    -.2111715    .0904774
 birthmonthdum4 |   .0015426   .0818781     0.02   0.985    -.1589355    .1620206
 birthmonthdum5 |  -.0566992   .0839012    -0.68   0.499    -.2211424    .1077441
 birthmonthdum6 |  -.0077543   .0777812    -0.10   0.921    -.1602026     .144694
 birthmonthdum7 |   .0172712   .0748676     0.23   0.818    -.1294666     .164009
 birthmonthdum8 |  -.0289971   .0843843    -0.34   0.731    -.1943874    .1363932
 birthmonthdum9 |   .0617243   .0785976     0.79   0.432    -.0923242    .2157727
birthmonthdum10 |   .0036177   .0712249     0.05   0.959    -.1359807     .143216
birthmonthdum11 |  -.0498782   .0772208    -0.65   0.518    -.2012281    .1014717
birthmonthdum12 |  -.0799576   .0775074    -1.03   0.302    -.2318694    .0719542
           male |   .2803891   .0318324     8.81   0.000     .2179987    .3427795
          _cons |   7.641703   .7945687     9.62   0.000     6.084377    9.199029
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  24.3903  (p = 0.0000)
  Wu-Hausman F(2,2695)            =  12.2196  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .836546  (p = 0.3604)
  Basmann chi2(1)        =  .831254  (p = 0.3619)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  13.748  Chi-sq(17) P-value = 0.6848

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,714    8.368166    .7121184   5.521461   10.12663
         exp |      2,714    20.46684    3.658754          9         30
      expsqr |      2,714     432.273     148.897         81        900
birthmont~m2 |      2,714     .087325    .2823627          0          1
birthmonth~3 |      2,714    .0840088    .2774522          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,714    .0604274    .2383209          0          1
birthmonth~5 |      2,714    .0773766    .2672372          0          1
birthmonth~6 |      2,714    .0784819     .268978          0          1
birthmonth~7 |      2,714    .0817981    .2741074          0          1
birthmonth~8 |      2,714    .0795873    .2707031          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,714    .0932203    .2907945          0          1
birthmont~10 |      2,714    .1127487    .3163437          0          1
birthmont~11 |      2,714    .0887988    .2845056          0          1
birthmont~12 |      2,714    .0803242    .2718446          0          1
        male |      2,714    .5331614     .498991          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) &
>  inrange(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,714
                                                        F(31, 2682)   = 176.19
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6707
                                                        Adj R-squared = 0.6669
                                                        Root MSE      = 0.2842

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1910561   .0152445   -12.53   0.000    -.2209483   -.1611639
         expsqr |   .0014356   .0003754     3.82   0.000     .0006995    .0021716
 birthmonthdum2 |  -.0172671   .0271517    -0.64   0.525    -.0705074    .0359732
 birthmonthdum3 |   .0509364    .027475     1.85   0.064    -.0029379    .1048107
 birthmonthdum4 |   .0557044   .0299638     1.86   0.063      -.00305    .1144588
 birthmonthdum5 |   -.000195   .0280438    -0.01   0.994    -.0551846    .0547947
 birthmonthdum6 |   .0619452   .0281569     2.20   0.028     .0067338    .1171566
 birthmonthdum7 |   .0542109   .0278644     1.95   0.052    -.0004269    .1088487
 birthmonthdum8 |   .0838342   .0281518     2.98   0.003     .0286328    .1390356
 birthmonthdum9 |   .1083478   .0270504     4.01   0.000      .055306    .1613897
birthmonthdum10 |    .129342   .0259116     4.99   0.000     .0785333    .1801507
birthmonthdum11 |   .1108554   .0272041     4.07   0.000     .0575123    .1641985
birthmonthdum12 |    .152533   .0278276     5.48   0.000     .0979673    .2070986
           male |   .0072021   .0109812     0.66   0.512    -.0143304    .0287346
   provincedum2 |   .0641419   .0301411     2.13   0.033     .0050398    .1232439
   provincedum3 |   .0676165   .0328006     2.06   0.039     .0032996    .1319335
   provincedum4 |  -.0467718   .0294159    -1.59   0.112    -.1044518    .0109083
   provincedum5 |   .0074255   .0276386     0.27   0.788    -.0467697    .0616208
   provincedum6 |   .0404626   .0320238     1.26   0.207    -.0223313    .1032564
   provincedum7 |   .0262109   .0286137     0.92   0.360    -.0298962    .0823179
   provincedum8 |   .0785819   .0290475     2.71   0.007     .0216242    .1355397
   provincedum9 |  -.0306405   .0293389    -1.04   0.296    -.0881697    .0268887
  provincedum10 |  -.0264148    .028958    -0.91   0.362    -.0831971    .0303674
  provincedum11 |   -.056787   .0258566    -2.20   0.028    -.1074878   -.0060861
  provincedum12 |  -.0313072   .0325257    -0.96   0.336    -.0950851    .0324707
  provincedum13 |   .0130289   .0302059     0.43   0.666    -.0462003     .072258
  provincedum14 |  -.0076883   .0354822    -0.22   0.828    -.0772636     .061887
  provincedum15 |   .0397053   .0356045     1.12   0.265    -.0301097    .1095203
              t |  -.0119947   .0007551   -15.89   0.000    -.0134752   -.0105141
              d |   .0352843   .0227251     1.55   0.121    -.0092763    .0798449
             td |   .0002794   .0010657     0.26   0.793    -.0018102    .0023691
          _cons |   3.619354   .1552184    23.32   0.000     3.314994    3.923714
---------------------------------------------------------------------------------

                                                        Number of obs =  2,714
                                                        F(31, 2682)   = 111.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5632
                                                        Adj R-squared = 0.5581
                                                        Root MSE      = 0.3139

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2496546   .0168343   -14.83   0.000    -.2826641   -.2166452
         expsqr |   .0033122   .0004145     7.99   0.000     .0024994    .0041251
 birthmonthdum2 |    .012679   .0299831     0.42   0.672    -.0461134    .0714714
 birthmonthdum3 |   .0119881   .0303402     0.40   0.693    -.0475044    .0714806
 birthmonthdum4 |   .0337179   .0330885     1.02   0.308    -.0311636    .0985994
 birthmonthdum5 |    .041071   .0309683     1.33   0.185    -.0196531    .1017952
 birthmonthdum6 |   .0660797   .0310932     2.13   0.034     .0051107    .1270488
 birthmonthdum7 |   .0348014   .0307702     1.13   0.258    -.0255343     .095137
 birthmonthdum8 |   .1112268   .0310876     3.58   0.000     .0502688    .1721848
 birthmonthdum9 |   .1175432   .0298714     3.93   0.000     .0589699    .1761164
birthmonthdum10 |    .114092   .0286137     3.99   0.000     .0579848    .1701991
birthmonthdum11 |    .117206    .030041     3.90   0.000        .0583    .1761119
birthmonthdum12 |   .1404228   .0307295     4.57   0.000     .0801668    .2006787
           male |   .0190413   .0121264     1.57   0.116    -.0047366    .0428193
   provincedum2 |    .004081   .0332843     0.12   0.902    -.0611845    .0693464
   provincedum3 |   .0389951   .0362211     1.08   0.282     -.032029    .1100193
   provincedum4 |   .0003654   .0324835     0.01   0.991    -.0633297    .0640606
   provincedum5 |   .0388896   .0305209     1.27   0.203    -.0209573    .0987364
   provincedum6 |   .0372613   .0353634     1.05   0.292    -.0320809    .1066035
   provincedum7 |    .057405   .0315976     1.82   0.069    -.0045531    .1193631
   provincedum8 |   .0866968   .0320767     2.70   0.007     .0237993    .1495943
   provincedum9 |   .0314614   .0323985     0.97   0.332    -.0320671    .0949899
  provincedum10 |  -.0411863   .0319778    -1.29   0.198      -.10389    .0215174
  provincedum11 |  -.0130554    .028553    -0.46   0.648    -.0690436    .0429327
  provincedum12 |  -.0083883   .0359175    -0.23   0.815    -.0788172    .0620406
  provincedum13 |   .0149346   .0333558     0.45   0.654    -.0504712    .0803404
  provincedum14 |  -.0477273   .0391824    -1.22   0.223    -.1245581    .0291036
  provincedum15 |   .0174102   .0393174     0.44   0.658    -.0596854    .0945057
              t |  -.0079556   .0008338    -9.54   0.000    -.0095906   -.0063206
              d |   .0076181    .025095     0.30   0.761    -.0415894    .0568257
             td |  -.0030356   .0011768    -2.58   0.010    -.0053432    -.000728
          _cons |   3.952112   .1714051    23.06   0.000     3.616013    4.288212
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,714
                                                  Wald chi2(30)   =     443.91
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .73751

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   -.669711   .6567412    -1.02   0.308      -1.9569     .617478
  secgenhighedu |   1.399432   .7779947     1.80   0.072    -.1254099    2.924273
            exp |   .0247938   .0731896     0.34   0.735    -.1186551    .1682428
         expsqr |  -.0004199   .0017144    -0.24   0.807    -.0037801    .0029402
 birthmonthdum2 |  -.0261901    .073462    -0.36   0.721     -.170173    .1177929
 birthmonthdum3 |  -.0462771   .0742711    -0.62   0.533    -.1918459    .0992916
 birthmonthdum4 |   .0151275   .0779455     0.19   0.846    -.1376429     .167898
 birthmonthdum5 |  -.0547505   .0796289    -0.69   0.492    -.2108202    .1013192
 birthmonthdum6 |  -.0026391   .0740903    -0.04   0.972    -.1478534    .1425751
 birthmonthdum7 |    .018856   .0717588     0.26   0.793    -.1217886    .1595007
 birthmonthdum8 |  -.0221113   .0801162    -0.28   0.783    -.1791362    .1349135
 birthmonthdum9 |    .047567   .0746454     0.64   0.524    -.0987353    .1938692
birthmonthdum10 |    .014283   .0678508     0.21   0.833    -.1187022    .1472682
birthmonthdum11 |  -.0595454   .0733966    -0.81   0.417       -.2034    .0843092
birthmonthdum12 |  -.0682917   .0736897    -0.93   0.354    -.2127209    .0761376
           male |   .2781161   .0302165     9.20   0.000      .218893    .3373393
   provincedum2 |  -.3326824   .0877782    -3.79   0.000    -.5047246   -.1606403
   provincedum3 |  -.2125642   .0864132    -2.46   0.014     -.381931   -.0431974
   provincedum4 |  -.3065343   .0825743    -3.71   0.000     -.468377   -.1446916
   provincedum5 |   .0458141   .0764947     0.60   0.549    -.1041127     .195741
   provincedum6 |  -.0964609   .0830996    -1.16   0.246    -.2593332    .0664113
   provincedum7 |  -.2368252   .0790903    -2.99   0.003    -.3918393    -.081811
   provincedum8 |  -.3771817   .0769986    -4.90   0.000    -.5280961   -.2262673
   provincedum9 |  -.1355242   .0878092    -1.54   0.123     -.307627    .0365786
  provincedum10 |  -.0701904   .0763986    -0.92   0.358     -.219929    .0795481
  provincedum11 |   .0216251   .0723427     0.30   0.765    -.1201639    .1634141
  provincedum12 |  -.1770896    .085589    -2.07   0.039     -.344841   -.0093382
  provincedum13 |  -.0791234   .0783469    -1.01   0.313    -.2326805    .0744337
  provincedum14 |  -.1140435   .0967722    -1.18   0.239    -.3037135    .0756265
  provincedum15 |  -.2366584   .0931605    -2.54   0.011    -.4192495   -.0540672
          _cons |   7.853304   .7479252    10.50   0.000     6.387398     9.31921
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  20.6979  (p = 0.0000)
  Wu-Hausman F(2,2681)            =  10.3017  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .643584  (p = 0.4224)
  Basmann chi2(1)        =  .636147  (p = 0.4251)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  28.424  Chi-sq(31) P-value = 0.5992

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,714    8.368166    .7121184   5.521461   10.12663
         exp |      2,714    20.46684    3.658754          9         30
      expsqr |      2,714     432.273     148.897         81        900
birthmont~m2 |      2,714     .087325    .2823627          0          1
birthmonth~3 |      2,714    .0840088    .2774522          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,714    .0604274    .2383209          0          1
birthmonth~5 |      2,714    .0773766    .2672372          0          1
birthmonth~6 |      2,714    .0784819     .268978          0          1
birthmonth~7 |      2,714    .0817981    .2741074          0          1
birthmonth~8 |      2,714    .0795873    .2707031          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,714    .0932203    .2907945          0          1
birthmont~10 |      2,714    .1127487    .3163437          0          1
birthmont~11 |      2,714    .0887988    .2845056          0          1
birthmont~12 |      2,714    .0803242    .2718446          0          1
        male |      2,714    .5331614     .498991          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25
> 000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,447
                                                        F(16, 1430)   = 193.73
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6843
                                                        Adj R-squared = 0.6808
                                                        Root MSE      = 0.2793

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2108305   .0209691   -10.05   0.000    -.2519639   -.1696971
         expsqr |    .001898   .0005154     3.68   0.000      .000887     .002909
 birthmonthdum2 |  -.0117198    .036671    -0.32   0.749    -.0836545     .060215
 birthmonthdum3 |   .0314612   .0370439     0.85   0.396    -.0412051    .1041275
 birthmonthdum4 |   .0000145   .0401961     0.00   1.000    -.0788351     .078864
 birthmonthdum5 |  -.0301392   .0371385    -0.81   0.417     -.102991    .0427126
 birthmonthdum6 |   .0677312   .0377289     1.80   0.073    -.0062787    .1417411
 birthmonthdum7 |   .0675278   .0367897     1.84   0.067    -.0046398    .1396953
 birthmonthdum8 |   .1081839   .0383814     2.82   0.005      .032894    .1834737
 birthmonthdum9 |   .0885863   .0359399     2.46   0.014     .0180858    .1590869
birthmonthdum10 |   .1126181   .0338447     3.33   0.001     .0462275    .1790086
birthmonthdum11 |   .1066319   .0359412     2.97   0.003     .0361288     .177135
birthmonthdum12 |   .1395532   .0376357     3.71   0.000     .0657261    .2133802
              t |  -.0121633   .0009993   -12.17   0.000    -.0141236    -.010203
              d |      .0251   .0302994     0.83   0.408    -.0343361    .0845362
             td |   .0010808   .0014052     0.77   0.442    -.0016756    .0038372
          _cons |   3.841153   .2139573    17.95   0.000     3.421449    4.260857
---------------------------------------------------------------------------------

                                                        Number of obs =  1,447
                                                        F(16, 1430)   = 129.83
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5923
                                                        Adj R-squared = 0.5877
                                                        Root MSE      = 0.3066

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2851537   .0230134   -12.39   0.000    -.3302974   -.2400099
         expsqr |   .0041146   .0005656     7.27   0.000      .003005    .0052242
 birthmonthdum2 |   .0340885   .0402463     0.85   0.397    -.0448596    .1130365
 birthmonthdum3 |   .0337214   .0406555     0.83   0.407    -.0460295    .1134723
 birthmonthdum4 |   .0142948    .044115     0.32   0.746    -.0722422    .1008319
 birthmonthdum5 |   .0312209   .0407593     0.77   0.444    -.0487336    .1111755
 birthmonthdum6 |    .049189   .0414073     1.19   0.235    -.0320364    .1304145
 birthmonthdum7 |   .0684071   .0403765     1.69   0.090    -.0107965    .1476106
 birthmonthdum8 |   .1481068   .0421234     3.52   0.000     .0654765    .2307371
 birthmonthdum9 |    .145411   .0394438     3.69   0.000      .068037    .2227849
birthmonthdum10 |   .1171672   .0371444     3.15   0.002     .0443039    .1900305
birthmonthdum11 |   .1333703   .0394453     3.38   0.001     .0559936    .2107471
birthmonthdum12 |   .1738866    .041305     4.21   0.000     .0928618    .2549114
              t |  -.0081899   .0010968    -7.47   0.000    -.0103414   -.0060385
              d |   .0202558   .0332535     0.61   0.543    -.0449751    .0854866
             td |  -.0027744   .0015422    -1.80   0.072    -.0057995    .0002508
          _cons |   4.344689    .234817    18.50   0.000     3.884066    4.805311
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,447
                                                  Wald chi2(15)   =      85.10
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .77993

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.9643043    .883338    -1.09   0.275    -2.695615    .7670064
  secgenhighedu |   1.658463   1.065365     1.56   0.120    -.4296132    3.746539
            exp |   .0748567   .1230558     0.61   0.543    -.1663282    .3160415
         expsqr |  -.0015656   .0028115    -0.56   0.578    -.0070761    .0039448
 birthmonthdum2 |  -.0194611   .1113303    -0.17   0.861    -.2376644    .1987423
 birthmonthdum3 |  -.0426652   .1040123    -0.41   0.682    -.2465257    .1611952
 birthmonthdum4 |  -.0445448   .1124938    -0.40   0.692    -.2650286     .175939
 birthmonthdum5 |  -.0225636   .1193189    -0.19   0.850    -.2564244    .2112973
 birthmonthdum6 |   .0548351   .1047683     0.52   0.601     -.150507    .2601773
 birthmonthdum7 |   .0479503    .103262     0.46   0.642    -.1544395    .2503401
 birthmonthdum8 |  -.0595064   .1228598    -0.48   0.628    -.3003073    .1812944
 birthmonthdum9 |   .0611855   .1285649     0.48   0.634     -.190797     .313168
birthmonthdum10 |   -.007007   .0989781    -0.07   0.944    -.2010005    .1869866
birthmonthdum11 |  -.1086592   .1123814    -0.97   0.334    -.3289227    .1116043
birthmonthdum12 |  -.0786226   .1223673    -0.64   0.521     -.318458    .1612129
          _cons |   7.504032   1.297089     5.79   0.000     4.961785    10.04628
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  9.21337  (p = 0.0100)
  Wu-Hausman F(2,1429)            =  4.57853  (p = 0.0104)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .145696  (p = 0.7027)
  Basmann chi2(1)        =  .143999  (p = 0.7043)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.854  Chi-sq(16) P-value = 0.8742

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,447    8.515411    .6982608   5.521461   10.12663
         exp |      1,447    20.43538    3.654674         11         30
      expsqr |      1,447    430.9523    149.0933        121        900
birthmont~m2 |      1,447    .0829302     .275872          0          1
birthmonth~3 |      1,447    .0801659    .2716437          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,447    .0594333    .2365156          0          1
birthmonth~5 |      1,447    .0794748    .2705719          0          1
birthmonth~6 |      1,447    .0760194    .2651207          0          1
birthmonth~7 |      1,447    .0850035    .2789833          0          1
birthmonth~8 |      1,447     .073255    .2606447          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,447    .0946786    .2928718          0          1
birthmont~10 |      1,447     .122322    .3277707          0          1
birthmont~11 |      1,447    .0926054    .2899789          0          1
birthmont~12 |      1,447    .0760194    .2651207          0          1
        male |      1,447           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inra
> nge(monthlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,447
                                                        F(30, 1416)   = 106.73
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6934
                                                        Adj R-squared = 0.6869
                                                        Root MSE      = 0.2767

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2035781   .0209347    -9.72   0.000    -.2446445   -.1625117
         expsqr |   .0017085   .0005144     3.32   0.001     .0006995    .0027175
 birthmonthdum2 |  -.0044907   .0364855    -0.12   0.902    -.0760622    .0670808
 birthmonthdum3 |   .0296572   .0368754     0.80   0.421    -.0426791    .1019935
 birthmonthdum4 |   .0026297    .040033     0.07   0.948    -.0759007    .0811601
 birthmonthdum5 |  -.0307568   .0369316    -0.83   0.405    -.1032032    .0416897
 birthmonthdum6 |   .0722288   .0375095     1.93   0.054    -.0013513    .1458088
 birthmonthdum7 |    .061007   .0366514     1.66   0.096    -.0108899    .1329039
 birthmonthdum8 |   .1110771   .0382223     2.91   0.004     .0360987    .1860554
 birthmonthdum9 |    .093931   .0357854     2.62   0.009     .0237328    .1641291
birthmonthdum10 |   .1167501   .0336686     3.47   0.001     .0507044    .1827959
birthmonthdum11 |    .107447   .0358523     3.00   0.003     .0371176    .1777764
birthmonthdum12 |   .1400592   .0374481     3.74   0.000     .0665995    .2135189
   provincedum2 |   .0505877   .0396088     1.28   0.202    -.0271105    .1282859
   provincedum3 |   .0440495   .0429415     1.03   0.305    -.0401862    .1282853
   provincedum4 |  -.0529746   .0388097    -1.36   0.172    -.1291052     .023156
   provincedum5 |   .0023261   .0363172     0.06   0.949    -.0689153    .0735674
   provincedum6 |  -.0014582   .0422482    -0.03   0.972    -.0843339    .0814175
   provincedum7 |  -.0002286    .038752    -0.01   0.995    -.0762461     .075789
   provincedum8 |   .0870215   .0388781     2.24   0.025     .0107566    .1632864
   provincedum9 |  -.0587576   .0381859    -1.54   0.124    -.1336647    .0161495
  provincedum10 |  -.0325748   .0389181    -0.84   0.403    -.1089181    .0437686
  provincedum11 |  -.0721757   .0339765    -2.12   0.034    -.1388255    -.005526
  provincedum12 |  -.0549344   .0453278    -1.21   0.226    -.1438512    .0339824
  provincedum13 |   .0174749   .0401644     0.44   0.664    -.0613133    .0962631
  provincedum14 |  -.0120968   .0484525    -0.25   0.803    -.1071432    .0829497
  provincedum15 |   .0607499   .0491555     1.24   0.217    -.0356756    .1571754
              t |  -.0120416   .0009946   -12.11   0.000    -.0139927   -.0100905
              d |    .023973   .0301975     0.79   0.427    -.0352636    .0832096
             td |   .0008985   .0013977     0.64   0.520    -.0018433    .0036402
          _cons |    3.78308   .2133851    17.73   0.000     3.364495    4.201665
---------------------------------------------------------------------------------

                                                        Number of obs =  1,447
                                                        F(30, 1416)   =  71.05
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6008
                                                        Adj R-squared = 0.5924
                                                        Root MSE      = 0.3048

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |   -.281234   .0230667   -12.19   0.000    -.3264826   -.2359855
         expsqr |   .0040045   .0005667     7.07   0.000     .0028928    .0051163
 birthmonthdum2 |   .0372206   .0402012     0.93   0.355    -.0416396    .1160808
 birthmonthdum3 |   .0298319   .0406308     0.73   0.463     -.049871    .1095349
 birthmonthdum4 |   .0187741   .0441099     0.43   0.670    -.0677537    .1053019
 birthmonthdum5 |   .0301182   .0406926     0.74   0.459    -.0497061    .1099425
 birthmonthdum6 |   .0479567   .0413294     1.16   0.246    -.0331167      .12903
 birthmonthdum7 |   .0568725   .0403839     1.41   0.159    -.0223462    .1360913
 birthmonthdum8 |   .1443297   .0421147     3.43   0.001     .0617157    .2269437
 birthmonthdum9 |   .1446022   .0394298     3.67   0.000     .0672552    .2219493
birthmonthdum10 |   .1178269   .0370974     3.18   0.002     .0450552    .1905987
birthmonthdum11 |   .1334297   .0395035     3.38   0.001     .0559381    .2109213
birthmonthdum12 |   .1718078   .0412618     4.16   0.000     .0908671    .2527485
   provincedum2 |  -.0198629   .0436425    -0.46   0.649    -.1054738    .0657479
   provincedum3 |   .0327345   .0473145     0.69   0.489    -.0600797    .1255486
   provincedum4 |  -.0067847    .042762    -0.16   0.874    -.0906683    .0770989
   provincedum5 |   .0634175   .0400157     1.58   0.113     -.015079    .1419139
   provincedum6 |  -.0056778   .0465506    -0.12   0.903    -.0969934    .0856379
   provincedum7 |   .0505179   .0426985     1.18   0.237    -.0332411    .1342769
   provincedum8 |   .1299371   .0428374     3.03   0.002     .0459055    .2139687
   provincedum9 |   .0031968   .0420747     0.08   0.939    -.0793387    .0857323
  provincedum10 |  -.0288841   .0428814    -0.67   0.501    -.1130021    .0552339
  provincedum11 |  -.0092206   .0374366    -0.25   0.805    -.0826578    .0642167
  provincedum12 |  -.0191488   .0499439    -0.38   0.701    -.1171207    .0788232
  provincedum13 |   .0243187   .0442547     0.55   0.583    -.0624931    .1111305
  provincedum14 |   -.074091   .0533869    -1.39   0.165    -.1788168    .0306349
  provincedum15 |    .029846   .0541615     0.55   0.582    -.0763993    .1360914
              t |   -.008055   .0010959    -7.35   0.000    -.0102048   -.0059052
              d |   .0121462   .0332727     0.37   0.715    -.0531229    .0774154
             td |  -.0027678     .00154    -1.80   0.073    -.0057887    .0002531
          _cons |   4.302789   .2351159    18.30   0.000     3.841576    4.764001
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,447
                                                  Wald chi2(29)   =     137.43
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .75701

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.8856761   .8899496    -1.00   0.320    -2.629945     .858593
  secgenhighedu |   1.561177   1.069921     1.46   0.145    -.5358291    3.658182
            exp |   .0608715   .1243871     0.49   0.625    -.1829227    .3046657
         expsqr |  -.0012065   .0028516    -0.42   0.672    -.0067955    .0043826
 birthmonthdum2 |  -.0287592   .1078378    -0.27   0.790    -.2401173     .182599
 birthmonthdum3 |  -.0328852    .101258    -0.32   0.745    -.2313472    .1655768
 birthmonthdum4 |  -.0459035   .1102488    -0.42   0.677    -.2619873    .1701802
 birthmonthdum5 |  -.0125231   .1171003    -0.11   0.915    -.2420355    .2169893
 birthmonthdum6 |   .0422134   .1023736     0.41   0.680    -.1584352     .242862
 birthmonthdum7 |    .053113   .1000654     0.53   0.596    -.1430115    .2492375
 birthmonthdum8 |  -.0530073   .1177663    -0.45   0.653     -.283825    .1778104
 birthmonthdum9 |   .0449821    .123762     0.36   0.716     -.197587    .2875512
birthmonthdum10 |  -.0086356   .0956955    -0.09   0.928    -.1961953    .1789241
birthmonthdum11 |  -.1290193   .1097559    -1.18   0.240     -.344137    .0860984
birthmonthdum12 |  -.0677014   .1186038    -0.57   0.568    -.3001605    .1647576
   provincedum2 |  -.2050166   .1281222    -1.60   0.110    -.4561314    .0460983
   provincedum3 |  -.0997487   .1175848    -0.85   0.396    -.3302106    .1307132
   provincedum4 |  -.2751072    .113932    -2.41   0.016    -.4984099   -.0518046
   provincedum5 |   .0504125   .1201411     0.42   0.675    -.1850597    .2858848
   provincedum6 |   .0123804   .1156016     0.11   0.915    -.2141947    .2389554
   provincedum7 |    -.17113   .1184282    -1.45   0.148     -.403245    .0609851
   provincedum8 |  -.3973508   .1225659    -3.24   0.001    -.6375756    -.157126
   provincedum9 |  -.0571199   .1190459    -0.48   0.631    -.2904455    .1762057
  provincedum10 |    .002106   .1063808     0.02   0.984    -.2063964    .2106085
  provincedum11 |     .03678   .1070364     0.34   0.731    -.1730075    .2465675
  provincedum12 |  -.1708488   .1273579    -1.34   0.180    -.4204656     .078768
  provincedum13 |   -.057689   .1098934    -0.52   0.600    -.2730762    .1576981
  provincedum14 |  -.0707443   .1477107    -0.48   0.632     -.360252    .2187634
  provincedum15 |  -.2629571   .1359648    -1.93   0.053    -.5294432    .0035289
          _cons |   7.731696   1.288689     6.00   0.000     5.205911    10.25748
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  7.41263  (p = 0.0246)
  Wu-Hausman F(2,1415)            =  3.64301  (p = 0.0264)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .151065  (p = 0.6975)
  Basmann chi2(1)        =  .147844  (p = 0.7006)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  24.024  Chi-sq(30) P-value = 0.7709

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,447    8.515411    .6982608   5.521461   10.12663
         exp |      1,447    20.43538    3.654674         11         30
      expsqr |      1,447    430.9523    149.0933        121        900
birthmont~m2 |      1,447    .0829302     .275872          0          1
birthmonth~3 |      1,447    .0801659    .2716437          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,447    .0594333    .2365156          0          1
birthmonth~5 |      1,447    .0794748    .2705719          0          1
birthmonth~6 |      1,447    .0760194    .2651207          0          1
birthmonth~7 |      1,447    .0850035    .2789833          0          1
birthmonth~8 |      1,447     .073255    .2606447          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,447    .0946786    .2928718          0          1
birthmont~10 |      1,447     .122322    .3277707          0          1
birthmont~11 |      1,447    .0926054    .2899789          0          1
birthmont~12 |      1,447    .0760194    .2651207          0          1
        male |      1,447           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25
> 000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,267
                                                        F(16, 1250)   = 140.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6425
                                                        Adj R-squared = 0.6379
                                                        Root MSE      = 0.2949

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1792106   .0224554    -7.98   0.000     -.223265   -.1351562
         expsqr |   .0011939   .0005553     2.15   0.032     .0001045    .0022834
 birthmonthdum2 |   -.022761    .041032    -0.55   0.579    -.1032602    .0577383
 birthmonthdum3 |   .0802912   .0414636     1.94   0.053    -.0010548    .1616372
 birthmonthdum4 |   .1185403   .0455684     2.60   0.009     .0291414    .2079392
 birthmonthdum5 |   .0373087   .0433161     0.86   0.389    -.0476716    .1222889
 birthmonthdum6 |   .0571799   .0428324     1.33   0.182    -.0268514    .1412112
 birthmonthdum7 |    .050473   .0431091     1.17   0.242    -.0341011    .1350471
 birthmonthdum8 |   .0636195   .0420838     1.51   0.131    -.0189431    .1461821
 birthmonthdum9 |   .1219967   .0415305     2.94   0.003     .0405195    .2034739
birthmonthdum10 |   .1467296   .0406338     3.61   0.000     .0670116    .2264476
birthmonthdum11 |   .1088835   .0421324     2.58   0.010     .0262255    .1915415
birthmonthdum12 |   .1672617    .041887     3.99   0.000     .0850851    .2494383
              t |  -.0121222   .0011677   -10.38   0.000    -.0144132   -.0098313
              d |   .0549212   .0348018     1.58   0.115    -.0133553    .1231977
             td |  -.0005242   .0016585    -0.32   0.752    -.0037779    .0027295
          _cons |   3.473011   .2289266    15.17   0.000     3.023889    3.922134
---------------------------------------------------------------------------------

                                                        Number of obs =  1,267
                                                        F(16, 1250)   =  85.32
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5220
                                                        Adj R-squared = 0.5159
                                                        Root MSE      = 0.3240

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2229147    .024667    -9.04   0.000     -.271308   -.1745214
         expsqr |     .00276     .00061     4.52   0.000     .0015632    .0039568
 birthmonthdum2 |  -.0043544   .0450732    -0.10   0.923     -.092782    .0840731
 birthmonthdum3 |   .0026197   .0455474     0.06   0.954     -.086738    .0919774
 birthmonthdum4 |   .0468365   .0500564     0.94   0.350    -.0513672    .1450403
 birthmonthdum5 |   .0588036   .0475823     1.24   0.217    -.0345463    .1521535
 birthmonthdum6 |   .0843619   .0470509     1.79   0.073    -.0079456    .1766694
 birthmonthdum7 |   .0116781   .0473548     0.25   0.805    -.0812257    .1045818
 birthmonthdum8 |   .0794958   .0462286     1.72   0.086    -.0111984    .1701899
 birthmonthdum9 |   .0815732   .0456208     1.79   0.074    -.0079286    .1710751
birthmonthdum10 |   .1138922   .0446358     2.55   0.011     .0263229    .2014616
birthmonthdum11 |   .0933459    .046282     2.02   0.044      .002547    .1841448
birthmonthdum12 |   .1119304   .0460124     2.43   0.015     .0216603    .2022005
              t |  -.0080379   .0012827    -6.27   0.000    -.0105545   -.0055213
              d |   .0113177   .0382295     0.30   0.767    -.0636833    .0863187
             td |  -.0033228   .0018218    -1.82   0.068     -.006897    .0002513
          _cons |   3.670775   .2514735    14.60   0.000     3.177419    4.164132
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,267
                                                  Wald chi2(15)   =     145.45
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .73648

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.5310308   .9930776    -0.53   0.593    -2.477427    1.415365
  secgenhighedu |   1.337126   1.167891     1.14   0.252    -.9518992    3.626151
            exp |  -.0119339   .0914005    -0.13   0.896    -.1910756    .1672077
         expsqr |   .0002888   .0022006     0.13   0.896    -.0040242    .0046019
 birthmonthdum2 |  -.0478539    .104338    -0.46   0.646    -.2523526    .1566447
 birthmonthdum3 |  -.1041695   .1261648    -0.83   0.409    -.3514479    .1431089
 birthmonthdum4 |   .0400943    .127103     0.32   0.752     -.209023    .2892117
 birthmonthdum5 |  -.0952301   .1130656    -0.84   0.400    -.3168346    .1263745
 birthmonthdum6 |  -.0526167    .117678    -0.45   0.655    -.2832614     .178028
 birthmonthdum7 |  -.0081528   .1105619    -0.07   0.941    -.2248502    .2085446
 birthmonthdum8 |   .0026593     .11049     0.02   0.981    -.2138971    .2192158
 birthmonthdum9 |   .0595458   .1055022     0.56   0.572    -.1472347    .2663263
birthmonthdum10 |   .0238623   .1031515     0.23   0.817     -.178311    .2260356
birthmonthdum11 |   .0228348    .105877     0.22   0.829    -.1846804    .2303499
birthmonthdum12 |   -.098527   .1116335    -0.88   0.377    -.3173247    .1202707
          _cons |   8.129203   .9370702     8.68   0.000     6.292579    9.965827
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  15.6161  (p = 0.0004)
  Wu-Hausman F(2,1249)            =   7.7932  (p = 0.0004)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .753033  (p = 0.3855)
  Basmann chi2(1)        =  .743371  (p = 0.3886)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.876  Chi-sq(16) P-value = 0.8730

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,267    8.200001    .6904736   5.521461   10.12663
         exp |      1,267    20.50276     3.66452          9         28
      expsqr |      1,267    433.7814     148.717         81        784
birthmont~m2 |      1,267    .0923441    .2896254          0          1
birthmonth~3 |      1,267    .0883978    .2839846          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,267    .0615627    .2404546          0          1
birthmonth~5 |      1,267    .0749803    .2634635          0          1
birthmonth~6 |      1,267    .0812944    .2733946          0          1
birthmonth~7 |      1,267    .0781373    .2684936          0          1
birthmonth~8 |      1,267    .0868193    .2816812          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,267    .0915549    .2885104          0          1
birthmont~10 |      1,267    .1018153    .3025247          0          1
birthmont~11 |      1,267    .0844515    .2781735          0          1
birthmont~12 |      1,267    .0852407    .2793498          0          1
        male |      1,267           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inra
> nge(monthlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,267
                                                        F(30, 1236)   =  76.56
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6501
                                                        Adj R-squared = 0.6416
                                                        Root MSE      = 0.2934

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1781117   .0225221    -7.91   0.000    -.2222975   -.1339259
         expsqr |    .001156   .0005561     2.08   0.038      .000065     .002247
 birthmonthdum2 |  -.0271372   .0410947    -0.66   0.509    -.1077602    .0534859
 birthmonthdum3 |   .0766309   .0415213     1.85   0.065    -.0048291    .1580909
 birthmonthdum4 |   .1102933   .0457321     2.41   0.016     .0205723    .2000144
 birthmonthdum5 |   .0351565   .0434516     0.81   0.419    -.0500906    .1204035
 birthmonthdum6 |   .0506825   .0427899     1.18   0.236    -.0332664    .1346314
 birthmonthdum7 |   .0400214   .0431378     0.93   0.354    -.0446099    .1246528
 birthmonthdum8 |   .0620446   .0419365     1.48   0.139      -.02023    .1443192
 birthmonthdum9 |    .124242   .0414949     2.99   0.003     .0428339    .2056502
birthmonthdum10 |   .1429751   .0407597     3.51   0.000     .0630093     .222941
birthmonthdum11 |    .113442   .0420884     2.70   0.007     .0308693    .1960146
birthmonthdum12 |   .1643464   .0419019     3.92   0.000     .0821398    .2465531
   provincedum2 |     .07875   .0466492     1.69   0.092    -.0127704    .1702704
   provincedum3 |   .0992265   .0508838     1.95   0.051    -.0006016    .1990546
   provincedum4 |  -.0401565   .0453023    -0.89   0.376    -.1290344    .0487213
   provincedum5 |   .0122178   .0426352     0.29   0.774    -.0714274    .0958631
   provincedum6 |   .0850003   .0492304     1.73   0.084     -.011584    .1815846
   provincedum7 |   .0405109   .0431193     0.94   0.348    -.0440843    .1251061
   provincedum8 |    .068936   .0440073     1.57   0.117    -.0174013    .1552733
   provincedum9 |   .0055916   .0461071     0.12   0.903    -.0848653    .0960486
  provincedum10 |  -.0255983   .0437203    -0.59   0.558    -.1113726     .060176
  provincedum11 |  -.0390243   .0399384    -0.98   0.329    -.1173788    .0393302
  provincedum12 |  -.0104804   .0474678    -0.22   0.825    -.1036068    .0826461
  provincedum13 |   .0057276   .0460964     0.12   0.901    -.0847083    .0961634
  provincedum14 |  -.0058802   .0527757    -0.11   0.911    -.1094201    .0976597
  provincedum15 |   .0256296   .0523634     0.49   0.625    -.0771013    .1283605
              t |  -.0119445   .0011661   -10.24   0.000    -.0142321   -.0096568
              d |   .0484921   .0348677     1.39   0.165    -.0199144    .1168986
             td |  -.0004433   .0016586    -0.27   0.789    -.0036973    .0028106
          _cons |   3.457486   .2287917    15.11   0.000     3.008623    3.906349
---------------------------------------------------------------------------------

                                                        Number of obs =  1,267
                                                        F(30, 1236)   =  46.10
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5280
                                                        Adj R-squared = 0.5166
                                                        Root MSE      = 0.3237

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2203054   .0248496    -8.87   0.000    -.2690575   -.1715533
         expsqr |   .0026915   .0006136     4.39   0.000     .0014877    .0038953
 birthmonthdum2 |  -.0081833   .0453416    -0.18   0.857    -.0971382    .0807717
 birthmonthdum3 |  -.0048148   .0458122    -0.11   0.916    -.0946932    .0850635
 birthmonthdum4 |    .042972   .0504582     0.85   0.395    -.0560212    .1419651
 birthmonthdum5 |     .05656    .047942     1.18   0.238    -.0374968    .1506168
 birthmonthdum6 |   .0789522    .047212     1.67   0.095    -.0136723    .1715766
 birthmonthdum7 |   .0027006   .0475958     0.06   0.955    -.0906769     .096078
 birthmonthdum8 |   .0800311   .0462703     1.73   0.084     -.010746    .1708082
 birthmonthdum9 |   .0853341   .0457831     1.86   0.063    -.0044871    .1751552
birthmonthdum10 |   .1066253   .0449719     2.37   0.018     .0183956    .1948551
birthmonthdum11 |   .0944554    .046438     2.03   0.042     .0033494    .1855614
birthmonthdum12 |   .1049714   .0462321     2.27   0.023     .0142692    .1956735
   provincedum2 |   .0344251   .0514701     0.67   0.504    -.0665534    .1354035
   provincedum3 |   .0464315   .0561423     0.83   0.408    -.0637131    .1565762
   provincedum4 |   .0118516    .049984     0.24   0.813    -.0862112    .1099144
   provincedum5 |    .006872   .0470412     0.15   0.884    -.0854175    .0991614
   provincedum6 |   .0838771    .054318     1.54   0.123    -.0226886    .1904427
   provincedum7 |   .0549284   .0475754     1.15   0.248    -.0384091    .1482659
   provincedum8 |   .0357851   .0485552     0.74   0.461    -.0594746    .1310448
   provincedum9 |   .0679652    .050872     1.34   0.182    -.0318399    .1677702
  provincedum10 |  -.0596729   .0482386    -1.24   0.216    -.1543114    .0349656
  provincedum11 |  -.0157499   .0440657    -0.36   0.721    -.1022018     .070702
  provincedum12 |  -.0049477   .0523733    -0.09   0.925    -.1076981    .0978028
  provincedum13 |  -.0017267   .0508602    -0.03   0.973    -.1015085    .0980552
  provincedum14 |  -.0263738   .0582297    -0.45   0.651    -.1406138    .0878663
  provincedum15 |   .0030605   .0577748     0.05   0.958     -.110287    .1164079
              t |  -.0078001   .0012866    -6.06   0.000    -.0103242    -.005276
              d |   .0042469   .0384711     0.11   0.912    -.0712289    .0797227
             td |  -.0033965     .00183    -1.86   0.064    -.0069867    .0001937
          _cons |   3.640963   .2524359    14.42   0.000     3.145713    4.136213
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,267
                                                  Wald chi2(29)   =     224.95
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0058
                                                  Root MSE        =     .68819

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   -.265488   .8905547    -0.30   0.766    -2.010943    1.479967
  secgenhighedu |   1.047511   1.044372     1.00   0.316    -.9994211    3.094443
            exp |  -.0079982   .0813768    -0.10   0.922    -.1674939    .1514974
         expsqr |   .0003073   .0019626     0.16   0.876    -.0035394    .0041539
 birthmonthdum2 |  -.0313387   .0979734    -0.32   0.749    -.2233631    .1606857
 birthmonthdum3 |  -.0944016   .1194645    -0.79   0.429    -.3285478    .1397446
 birthmonthdum4 |   .0773102    .117231     0.66   0.510    -.1524582    .3070787
 birthmonthdum5 |  -.1046713    .105743    -0.99   0.322    -.3119238    .1025811
 birthmonthdum6 |  -.0234432   .1095185    -0.21   0.831    -.2380955     .191209
 birthmonthdum7 |   -.002983   .1036703    -0.03   0.977    -.2061729     .200207
 birthmonthdum8 |   .0020033   .1035709     0.02   0.985    -.2009919    .2049986
 birthmonthdum9 |   .0367951   .0986841     0.37   0.709    -.1566221    .2302124
birthmonthdum10 |   .0406455   .0977314     0.42   0.677    -.1509045    .2321956
birthmonthdum11 |   .0235005   .0994167     0.24   0.813    -.1713525    .2183536
birthmonthdum12 |  -.0945613   .1059675    -0.89   0.372    -.3022538    .1131311
   provincedum2 |  -.5147326   .1155111    -4.46   0.000    -.7411302   -.2883349
   provincedum3 |  -.3945229   .1257246    -3.14   0.002    -.6409387   -.1481072
   provincedum4 |   -.364703   .1164612    -3.13   0.002    -.5929627   -.1364433
   provincedum5 |    .019057   .1000035     0.19   0.849    -.1769462    .2150602
   provincedum6 |  -.2455322   .1162783    -2.11   0.035    -.4734334    -.017631
   provincedum7 |   -.330506   .1033202    -3.20   0.001    -.5330098   -.1280021
   provincedum8 |  -.3918535   .1063213    -3.69   0.000    -.6002394   -.1834677
   provincedum9 |  -.2514826   .1237107    -2.03   0.042    -.4939512   -.0090141
  provincedum10 |  -.1693403   .1097164    -1.54   0.123    -.3843804    .0456998
  provincedum11 |  -.0177446   .0955877    -0.19   0.853    -.2050932    .1696039
  provincedum12 |  -.2035551   .1114343    -1.83   0.068    -.4219624    .0148521
  provincedum13 |  -.1208301   .1082951    -1.12   0.265    -.3330846    .0914244
  provincedum14 |  -.1861881    .125588    -1.48   0.138    -.4323361    .0599598
  provincedum15 |  -.2351007   .1246344    -1.89   0.059    -.4793796    .0091781
          _cons |   8.227744   .8369819     9.83   0.000      6.58729    9.868199
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  14.2281  (p = 0.0008)
  Wu-Hausman F(2,1235)            =  7.01315  (p = 0.0009)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .569337  (p = 0.4505)
  Basmann chi2(1)        =  .555657  (p = 0.4560)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  21.334  Chi-sq(30) P-value = 0.8772

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,267    8.200001    .6904736   5.521461   10.12663
         exp |      1,267    20.50276     3.66452          9         28
      expsqr |      1,267    433.7814     148.717         81        784
birthmont~m2 |      1,267    .0923441    .2896254          0          1
birthmonth~3 |      1,267    .0883978    .2839846          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,267    .0615627    .2404546          0          1
birthmonth~5 |      1,267    .0749803    .2634635          0          1
birthmonth~6 |      1,267    .0812944    .2733946          0          1
birthmonth~7 |      1,267    .0781373    .2684936          0          1
birthmonth~8 |      1,267    .0868193    .2816812          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,267    .0915549    .2885104          0          1
birthmont~10 |      1,267    .1018153    .3025247          0          1
birthmont~11 |      1,267    .0844515    .2781735          0          1
birthmont~12 |      1,267    .0852407    .2793498          0          1
        male |      1,267           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & ed
> ucat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,714
                                                        F(17, 2696)   = 312.10
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6631
                                                        Adj R-squared = 0.6609
                                                        Root MSE      = 0.2868

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1947782   .0152862   -12.74   0.000    -.2247521   -.1648044
         expsqr |   .0015415   .0003768     4.09   0.000     .0008027    .0022803
 birthmonthdum2 |  -.0183293   .0273519    -0.67   0.503    -.0719621    .0353034
 birthmonthdum3 |   .0531707   .0276257     1.92   0.054    -.0009989    .1073403
 birthmonthdum4 |   .0573464   .0301709     1.90   0.057     -.001814    .1165069
 birthmonthdum5 |  -.0004476   .0282474    -0.02   0.987    -.0558363    .0549411
 birthmonthdum6 |   .0622526   .0283384     2.20   0.028     .0066855    .1178197
 birthmonthdum7 |   .0608162   .0280155     2.17   0.030     .0058822    .1157502
 birthmonthdum8 |   .0839064   .0283331     2.96   0.003     .0283496    .1394631
 birthmonthdum9 |   .1038505   .0272261     3.81   0.000     .0504645    .1572366
birthmonthdum10 |   .1281558   .0260718     4.92   0.000      .077033    .1792787
birthmonthdum11 |   .1072815   .0274005     3.92   0.000     .0535533    .1610096
birthmonthdum12 |    .152749   .0279978     5.46   0.000     .0978496    .2076484
           male |   .0064329   .0110534     0.58   0.561     -.015241    .0281068
              t |  -.0121179   .0007603   -15.94   0.000    -.0136087    -.010627
              d |   .0387472   .0228379     1.70   0.090    -.0060345    .0835288
             td |   .0003084   .0010728     0.29   0.774    -.0017953     .002412
          _cons |   3.652068   .1560488    23.40   0.000     3.346081    3.958055
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,714
                                                  Wald chi2(15)   =     425.72
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1224
                                                  Root MSE        =     .66698

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .4969885   .0674469     7.37   0.000     .3647951    .6291819
            exp |  -.0900229   .0370111    -2.43   0.015    -.1625634   -.0174824
         expsqr |   .0022034   .0008649     2.55   0.011     .0005081    .0038986
 birthmonthdum2 |    .015153   .0636123     0.24   0.812    -.1095249    .1398309
 birthmonthdum3 |  -.0989057   .0641949    -1.54   0.123    -.2247255     .026914
 birthmonthdum4 |  -.0219034   .0698995    -0.31   0.754    -.1589038    .1150971
 birthmonthdum5 |   .0131161   .0655311     0.20   0.841    -.1153226    .1415548
 birthmonthdum6 |   .0266089   .0653911     0.41   0.684    -.1015552    .1547731
 birthmonthdum7 |   .0143997    .064598     0.22   0.824      -.11221    .1410094
 birthmonthdum8 |   .0453134   .0650295     0.70   0.486    -.0821421    .1727689
 birthmonthdum9 |   .1163725   .0634017     1.84   0.066    -.0078924    .2406375
birthmonthdum10 |   .0192509   .0610788     0.32   0.753    -.1004613    .1389631
birthmonthdum11 |  -.0089899   .0641542    -0.14   0.889    -.1347298      .11675
birthmonthdum12 |  -.0550903   .0659831    -0.83   0.404    -.1844147    .0742341
           male |   .3022526   .0257228    11.75   0.000     .2518367    .3526684
          _cons |   8.884394   .4119885    21.56   0.000     8.076911    9.691876
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  18.2846  (p = 0.0000)
  Wu-Hausman F(1,2697)            =  18.2933  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  6.26292  (p = 0.0437)
  Basmann chi2(2)        =  6.23577  (p = 0.0443)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  23.609  Chi-sq(17) P-value = 0.1304

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,714    8.368166    .7121184   5.521461   10.12663
         exp |      2,714    20.46684    3.658754          9         30
      expsqr |      2,714     432.273     148.897         81        900
birthmont~m2 |      2,714     .087325    .2823627          0          1
birthmonth~3 |      2,714    .0840088    .2774522          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,714    .0604274    .2383209          0          1
birthmonth~5 |      2,714    .0773766    .2672372          0          1
birthmonth~6 |      2,714    .0784819     .268978          0          1
birthmonth~7 |      2,714    .0817981    .2741074          0          1
birthmonth~8 |      2,714    .0795873    .2707031          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,714    .0932203    .2907945          0          1
birthmont~10 |      2,714    .1127487    .3163437          0          1
birthmont~11 |      2,714    .0887988    .2845056          0          1
birthmont~12 |      2,714    .0803242    .2718446          0          1
        male |      2,714    .5331614     .498991          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu  = t d td ) if inrange(t, -`months', `months'-1) & inrange(mont
> hlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,714
                                                        F(31, 2682)   = 176.19
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6707
                                                        Adj R-squared = 0.6669
                                                        Root MSE      = 0.2842

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1910561   .0152445   -12.53   0.000    -.2209483   -.1611639
         expsqr |   .0014356   .0003754     3.82   0.000     .0006995    .0021716
 birthmonthdum2 |  -.0172671   .0271517    -0.64   0.525    -.0705074    .0359732
 birthmonthdum3 |   .0509364    .027475     1.85   0.064    -.0029379    .1048107
 birthmonthdum4 |   .0557044   .0299638     1.86   0.063      -.00305    .1144588
 birthmonthdum5 |   -.000195   .0280438    -0.01   0.994    -.0551846    .0547947
 birthmonthdum6 |   .0619452   .0281569     2.20   0.028     .0067338    .1171566
 birthmonthdum7 |   .0542109   .0278644     1.95   0.052    -.0004269    .1088487
 birthmonthdum8 |   .0838342   .0281518     2.98   0.003     .0286328    .1390356
 birthmonthdum9 |   .1083478   .0270504     4.01   0.000      .055306    .1613897
birthmonthdum10 |    .129342   .0259116     4.99   0.000     .0785333    .1801507
birthmonthdum11 |   .1108554   .0272041     4.07   0.000     .0575123    .1641985
birthmonthdum12 |    .152533   .0278276     5.48   0.000     .0979673    .2070986
           male |   .0072021   .0109812     0.66   0.512    -.0143304    .0287346
   provincedum2 |   .0641419   .0301411     2.13   0.033     .0050398    .1232439
   provincedum3 |   .0676165   .0328006     2.06   0.039     .0032996    .1319335
   provincedum4 |  -.0467718   .0294159    -1.59   0.112    -.1044518    .0109083
   provincedum5 |   .0074255   .0276386     0.27   0.788    -.0467697    .0616208
   provincedum6 |   .0404626   .0320238     1.26   0.207    -.0223313    .1032564
   provincedum7 |   .0262109   .0286137     0.92   0.360    -.0298962    .0823179
   provincedum8 |   .0785819   .0290475     2.71   0.007     .0216242    .1355397
   provincedum9 |  -.0306405   .0293389    -1.04   0.296    -.0881697    .0268887
  provincedum10 |  -.0264148    .028958    -0.91   0.362    -.0831971    .0303674
  provincedum11 |   -.056787   .0258566    -2.20   0.028    -.1074878   -.0060861
  provincedum12 |  -.0313072   .0325257    -0.96   0.336    -.0950851    .0324707
  provincedum13 |   .0130289   .0302059     0.43   0.666    -.0462003     .072258
  provincedum14 |  -.0076883   .0354822    -0.22   0.828    -.0772636     .061887
  provincedum15 |   .0397053   .0356045     1.12   0.265    -.0301097    .1095203
              t |  -.0119947   .0007551   -15.89   0.000    -.0134752   -.0105141
              d |   .0352843   .0227251     1.55   0.121    -.0092763    .0798449
             td |   .0002794   .0010657     0.26   0.793    -.0018102    .0023691
          _cons |   3.619354   .1552184    23.32   0.000     3.314994    3.923714
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,714
                                                  Wald chi2(29)   =     566.43
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1652
                                                  Root MSE        =     .65051

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .5038584   .0662663     7.60   0.000      .373979    .6337379
            exp |  -.0842454   .0361748    -2.33   0.020    -.1551466   -.0133442
         expsqr |   .0021361    .000846     2.52   0.012     .0004779    .0037942
 birthmonthdum2 |   .0113158   .0621309     0.18   0.855    -.1104586    .1330902
 birthmonthdum3 |  -.0842181    .062812    -1.34   0.180    -.2073275    .0388912
 birthmonthdum4 |  -.0007974   .0683054    -0.01   0.991    -.1346736    .1330787
 birthmonthdum5 |   .0041932   .0640122     0.07   0.948    -.1212685    .1296549
 birthmonthdum6 |   .0250733   .0639214     0.39   0.695    -.1002103     .150357
 birthmonthdum7 |   .0121131    .063207     0.19   0.848    -.1117703    .1359965
 birthmonthdum8 |   .0407474   .0635883     0.64   0.522    -.0838834    .1653782
 birthmonthdum9 |   .0925626   .0620325     1.49   0.136    -.0290188     .214144
birthmonthdum10 |   .0220415   .0597254     0.37   0.712    -.0950182    .1391011
birthmonthdum11 |   -.026609    .062691    -0.42   0.671    -.1494812    .0962632
birthmonthdum12 |  -.0520087   .0645043    -0.81   0.420    -.1784347    .0744174
           male |   .2961218   .0251469    11.78   0.000     .2468347    .3454088
   provincedum2 |  -.4049439   .0688388    -5.88   0.000    -.5398655   -.2700222
   provincedum3 |  -.2401584   .0750084    -3.20   0.001    -.3871722   -.0931446
   provincedum4 |  -.2502938   .0674101    -3.71   0.000    -.3824152   -.1181724
   provincedum5 |   .0939055   .0632154     1.49   0.137    -.0299944    .2178054
   provincedum6 |  -.0894838   .0732165    -1.22   0.222    -.2329854    .0540178
   provincedum7 |  -.1875876   .0654487    -2.87   0.004    -.3158647   -.0593104
   provincedum8 |  -.3490253   .0664969    -5.25   0.000    -.4793567   -.2186938
   provincedum9 |   -.057149   .0672426    -0.85   0.395    -.1889421    .0746442
  provincedum10 |  -.0951341   .0662665    -1.44   0.151    -.2250142    .0347459
  provincedum11 |   .0684816   .0595282     1.15   0.250    -.0481915    .1851547
  provincedum12 |  -.1528426     .07455    -2.05   0.040    -.2989579   -.0067274
  provincedum13 |   -.075019    .069075    -1.09   0.277    -.2104035    .0603655
  provincedum14 |  -.1684913    .081073    -2.08   0.038    -.3273915   -.0095912
  provincedum15 |  -.2590509   .0814334    -3.18   0.001    -.4186575   -.0994444
          _cons |   8.918474   .4029735    22.13   0.000     8.128661    9.708288
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  15.1864  (p = 0.0001)
  Wu-Hausman F(1,2683)            =  15.0974  (p = 0.0001)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =   4.9862  (p = 0.0827)
  Basmann chi2(2)        =  4.93648  (p = 0.0847)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  40.122  Chi-sq(31) P-value = 0.1263

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,714    8.368166    .7121184   5.521461   10.12663
         exp |      2,714    20.46684    3.658754          9         30
      expsqr |      2,714     432.273     148.897         81        900
birthmont~m2 |      2,714     .087325    .2823627          0          1
birthmonth~3 |      2,714    .0840088    .2774522          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,714    .0604274    .2383209          0          1
birthmonth~5 |      2,714    .0773766    .2672372          0          1
birthmonth~6 |      2,714    .0784819     .268978          0          1
birthmonth~7 |      2,714    .0817981    .2741074          0          1
birthmonth~8 |      2,714    .0795873    .2707031          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,714    .0932203    .2907945          0          1
birthmont~10 |      2,714    .1127487    .3163437          0          1
birthmont~11 |      2,714    .0887988    .2845056          0          1
birthmont~12 |      2,714    .0803242    .2718446          0          1
        male |      2,714    .5331614     .498991          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu  = t
>  d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & male =
> = 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,447
                                                        F(16, 1430)   = 193.73
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6843
                                                        Adj R-squared = 0.6808
                                                        Root MSE      = 0.2793

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2108305   .0209691   -10.05   0.000    -.2519639   -.1696971
         expsqr |    .001898   .0005154     3.68   0.000      .000887     .002909
 birthmonthdum2 |  -.0117198    .036671    -0.32   0.749    -.0836545     .060215
 birthmonthdum3 |   .0314612   .0370439     0.85   0.396    -.0412051    .1041275
 birthmonthdum4 |   .0000145   .0401961     0.00   1.000    -.0788351     .078864
 birthmonthdum5 |  -.0301392   .0371385    -0.81   0.417     -.102991    .0427126
 birthmonthdum6 |   .0677312   .0377289     1.80   0.073    -.0062787    .1417411
 birthmonthdum7 |   .0675278   .0367897     1.84   0.067    -.0046398    .1396953
 birthmonthdum8 |   .1081839   .0383814     2.82   0.005      .032894    .1834737
 birthmonthdum9 |   .0885863   .0359399     2.46   0.014     .0180858    .1590869
birthmonthdum10 |   .1126181   .0338447     3.33   0.001     .0462275    .1790086
birthmonthdum11 |   .1066319   .0359412     2.97   0.003     .0361288     .177135
birthmonthdum12 |   .1395532   .0376357     3.71   0.000     .0657261    .2133802
              t |  -.0121633   .0009993   -12.17   0.000    -.0141236    -.010203
              d |      .0251   .0302994     0.83   0.408    -.0343361    .0845362
             td |   .0010808   .0014052     0.77   0.442    -.0016756    .0038372
          _cons |   3.841153   .2139573    17.95   0.000     3.421449    4.260857
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,447
                                                  Wald chi2(14)   =     110.03
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0620
                                                  Root MSE        =     .67604

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .4006508    .092838     4.32   0.000     .2186916      .58261
            exp |   -.090972   .0533987    -1.70   0.088    -.1956316    .0136876
         expsqr |   .0021976   .0012443     1.77   0.077    -.0002413    .0046364
 birthmonthdum2 |   .0487696   .0887077     0.55   0.582    -.1250942    .2226335
 birthmonthdum3 |  -.0235585   .0895279    -0.26   0.792    -.1990299    .1519128
 birthmonthdum4 |  -.0257684   .0969474    -0.27   0.790    -.2157818     .164245
 birthmonthdum5 |   .0698195   .0897259     0.78   0.436      -.10604     .245679
 birthmonthdum6 |   .0487027   .0907488     0.54   0.591    -.1291618    .2265671
 birthmonthdum7 |   .0746682   .0882624     0.85   0.398    -.0983228    .2476593
 birthmonthdum8 |   .0382436    .091535     0.42   0.676    -.1411616    .2176489
 birthmonthdum9 |   .1864415    .086917     2.15   0.032     .0160872    .3567957
birthmonthdum10 |   .0358282   .0824121     0.43   0.664    -.1256965    .1973528
birthmonthdum11 |  -.0318351   .0875171    -0.36   0.716    -.2033655    .1396954
birthmonthdum12 |    .015965   .0920678     0.17   0.862    -.1644847    .1964146
          _cons |   9.218079   .5942994    15.51   0.000     8.053273    10.38288
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  5.95417  (p = 0.0147)
  Wu-Hausman F(1,1431)            =  5.91266  (p = 0.0152)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  3.41928  (p = 0.1809)
  Basmann chi2(2)        =  3.38711  (p = 0.1839)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  18.229  Chi-sq(16) P-value = 0.3107

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,447    8.515411    .6982608   5.521461   10.12663
         exp |      1,447    20.43538    3.654674         11         30
      expsqr |      1,447    430.9523    149.0933        121        900
birthmont~m2 |      1,447    .0829302     .275872          0          1
birthmonth~3 |      1,447    .0801659    .2716437          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,447    .0594333    .2365156          0          1
birthmonth~5 |      1,447    .0794748    .2705719          0          1
birthmonth~6 |      1,447    .0760194    .2651207          0          1
birthmonth~7 |      1,447    .0850035    .2789833          0          1
birthmonth~8 |      1,447     .073255    .2606447          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,447    .0946786    .2928718          0          1
birthmont~10 |      1,447     .122322    .3277707          0          1
birthmont~11 |      1,447    .0926054    .2899789          0          1
birthmont~12 |      1,447    .0760194    .2651207          0          1
        male |      1,447           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu  = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyea
> rning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,447
                                                        F(30, 1416)   = 106.73
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6934
                                                        Adj R-squared = 0.6869
                                                        Root MSE      = 0.2767

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2035781   .0209347    -9.72   0.000    -.2446445   -.1625117
         expsqr |   .0017085   .0005144     3.32   0.001     .0006995    .0027175
 birthmonthdum2 |  -.0044907   .0364855    -0.12   0.902    -.0760622    .0670808
 birthmonthdum3 |   .0296572   .0368754     0.80   0.421    -.0426791    .1019935
 birthmonthdum4 |   .0026297    .040033     0.07   0.948    -.0759007    .0811601
 birthmonthdum5 |  -.0307568   .0369316    -0.83   0.405    -.1032032    .0416897
 birthmonthdum6 |   .0722288   .0375095     1.93   0.054    -.0013513    .1458088
 birthmonthdum7 |    .061007   .0366514     1.66   0.096    -.0108899    .1329039
 birthmonthdum8 |   .1110771   .0382223     2.91   0.004     .0360987    .1860554
 birthmonthdum9 |    .093931   .0357854     2.62   0.009     .0237328    .1641291
birthmonthdum10 |   .1167501   .0336686     3.47   0.001     .0507044    .1827959
birthmonthdum11 |    .107447   .0358523     3.00   0.003     .0371176    .1777764
birthmonthdum12 |   .1400592   .0374481     3.74   0.000     .0665995    .2135189
   provincedum2 |   .0505877   .0396088     1.28   0.202    -.0271105    .1282859
   provincedum3 |   .0440495   .0429415     1.03   0.305    -.0401862    .1282853
   provincedum4 |  -.0529746   .0388097    -1.36   0.172    -.1291052     .023156
   provincedum5 |   .0023261   .0363172     0.06   0.949    -.0689153    .0735674
   provincedum6 |  -.0014582   .0422482    -0.03   0.972    -.0843339    .0814175
   provincedum7 |  -.0002286    .038752    -0.01   0.995    -.0762461     .075789
   provincedum8 |   .0870215   .0388781     2.24   0.025     .0107566    .1632864
   provincedum9 |  -.0587576   .0381859    -1.54   0.124    -.1336647    .0161495
  provincedum10 |  -.0325748   .0389181    -0.84   0.403    -.1089181    .0437686
  provincedum11 |  -.0721757   .0339765    -2.12   0.034    -.1388255    -.005526
  provincedum12 |  -.0549344   .0453278    -1.21   0.226    -.1438512    .0339824
  provincedum13 |   .0174749   .0401644     0.44   0.664    -.0613133    .0962631
  provincedum14 |  -.0120968   .0484525    -0.25   0.803    -.1071432    .0829497
  provincedum15 |   .0607499   .0491555     1.24   0.217    -.0356756    .1571754
              t |  -.0120416   .0009946   -12.11   0.000    -.0139927   -.0100905
              d |    .023973   .0301975     0.79   0.427    -.0352636    .0832096
             td |   .0008985   .0013977     0.64   0.520    -.0018433    .0036402
          _cons |    3.78308   .2133851    17.73   0.000     3.364495    4.201665
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,447
                                                  Wald chi2(28)   =     178.11
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1066
                                                  Root MSE        =     .65977

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .4038897     .09119     4.43   0.000     .2251605    .5826189
            exp |  -.0981776    .052227    -1.88   0.060    -.2005407    .0041855
         expsqr |   .0024184   .0012203     1.98   0.047     .0000267    .0048101
 birthmonthdum2 |   .0309342   .0869606     0.36   0.722    -.1395053    .2013738
 birthmonthdum3 |   -.018372   .0878248    -0.21   0.834    -.1905055    .1537615
 birthmonthdum4 |  -.0233739   .0951406    -0.25   0.806    -.2098461    .1630983
 birthmonthdum5 |   .0742065   .0879342     0.84   0.399    -.0981414    .2465544
 birthmonthdum6 |   .0296163   .0889061     0.33   0.739    -.1446364    .2038691
 birthmonthdum7 |   .0698819   .0866351     0.81   0.420    -.0999198    .2396836
 birthmonthdum8 |    .029947   .0898877     0.33   0.739    -.1462296    .2061236
 birthmonthdum9 |   .1553485   .0853766     1.82   0.069    -.0119865    .3226836
birthmonthdum10 |   .0257731   .0808317     0.32   0.750    -.1326542    .1842003
birthmonthdum11 |  -.0590141   .0860351    -0.69   0.493    -.2276397    .1096116
birthmonthdum12 |   .0166017   .0902755     0.18   0.854     -.160335    .1935384
   provincedum2 |  -.3060147   .0939673    -3.26   0.001    -.4901872   -.1218422
   provincedum3 |  -.1110175     .10226    -1.09   0.278    -.3114433    .0894084
   provincedum4 |  -.2156023   .0927188    -2.33   0.020    -.3973277   -.0338768
   provincedum5 |   .1492308    .086488     1.73   0.084    -.0202824    .3187441
   provincedum6 |   .0064562   .1006907     0.06   0.949    -.1908939    .2038063
   provincedum7 |  -.0940773   .0923875    -1.02   0.309    -.2751534    .0869988
   provincedum8 |  -.3083648   .0926606    -3.33   0.001    -.4899763   -.1267533
   provincedum9 |   .0251572   .0913777     0.28   0.783    -.1539398    .2042542
  provincedum10 |   .0000141   .0927079     0.00   1.000    -.1816902    .1817183
  provincedum11 |   .1123151    .081652     1.38   0.169    -.0477199    .2723502
  provincedum12 |   -.130093   .1082967    -1.20   0.230    -.3423506    .0821646
  provincedum13 |  -.0477882   .0955951    -0.50   0.617    -.2351512    .1395747
  provincedum14 |  -.1672104   .1151234    -1.45   0.146     -.392848    .0584273
  provincedum15 |  -.2914172   .1172747    -2.48   0.013    -.5212714   -.0615629
          _cons |   9.340081   .5818627    16.05   0.000     8.199651    10.48051
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  4.28476  (p = 0.0385)
  Wu-Hausman F(1,1417)            =  4.20838  (p = 0.0404)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  3.00182  (p = 0.2229)
  Basmann chi2(2)        =  2.94361  (p = 0.2295)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  36.623  Chi-sq(30) P-value = 0.1884

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,447    8.515411    .6982608   5.521461   10.12663
         exp |      1,447    20.43538    3.654674         11         30
      expsqr |      1,447    430.9523    149.0933        121        900
birthmont~m2 |      1,447    .0829302     .275872          0          1
birthmonth~3 |      1,447    .0801659    .2716437          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,447    .0594333    .2365156          0          1
birthmonth~5 |      1,447    .0794748    .2705719          0          1
birthmonth~6 |      1,447    .0760194    .2651207          0          1
birthmonth~7 |      1,447    .0850035    .2789833          0          1
birthmonth~8 |      1,447     .073255    .2606447          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,447    .0946786    .2928718          0          1
birthmont~10 |      1,447     .122322    .3277707          0          1
birthmont~11 |      1,447    .0926054    .2899789          0          1
birthmont~12 |      1,447    .0760194    .2651207          0          1
        male |      1,447           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu  = t
>  d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 250, 25000) & male =
> = 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,267
                                                        F(16, 1250)   = 140.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6425
                                                        Adj R-squared = 0.6379
                                                        Root MSE      = 0.2949

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1792106   .0224554    -7.98   0.000     -.223265   -.1351562
         expsqr |   .0011939   .0005553     2.15   0.032     .0001045    .0022834
 birthmonthdum2 |   -.022761    .041032    -0.55   0.579    -.1032602    .0577383
 birthmonthdum3 |   .0802912   .0414636     1.94   0.053    -.0010548    .1616372
 birthmonthdum4 |   .1185403   .0455684     2.60   0.009     .0291414    .2079392
 birthmonthdum5 |   .0373087   .0433161     0.86   0.389    -.0476716    .1222889
 birthmonthdum6 |   .0571799   .0428324     1.33   0.182    -.0268514    .1412112
 birthmonthdum7 |    .050473   .0431091     1.17   0.242    -.0341011    .1350471
 birthmonthdum8 |   .0636195   .0420838     1.51   0.131    -.0189431    .1461821
 birthmonthdum9 |   .1219967   .0415305     2.94   0.003     .0405195    .2034739
birthmonthdum10 |   .1467296   .0406338     3.61   0.000     .0670116    .2264476
birthmonthdum11 |   .1088835   .0421324     2.58   0.010     .0262255    .1915415
birthmonthdum12 |   .1672617    .041887     3.99   0.000     .0850851    .2494383
              t |  -.0121222   .0011677   -10.38   0.000    -.0144132   -.0098313
              d |   .0549212   .0348018     1.58   0.115    -.0133553    .1231977
             td |  -.0005242   .0016585    -0.32   0.752    -.0037779    .0027295
          _cons |   3.473011   .2289266    15.17   0.000     3.023889    3.922134
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,267
                                                  Wald chi2(14)   =     183.39
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1051
                                                  Root MSE        =     .65293

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .5989023   .0978749     6.12   0.000     .4070711    .7907336
            exp |  -.0931166   .0511303    -1.82   0.069      -.19333    .0070969
         expsqr |    .002277   .0011984     1.90   0.057    -.0000718    .0046258
 birthmonthdum2 |  -.0253597   .0908469    -0.28   0.780    -.2034163     .152697
 birthmonthdum3 |  -.1868551   .0917138    -2.04   0.042    -.3666109   -.0070993
 birthmonthdum4 |  -.0252972   .1006665    -0.25   0.802    -.2225998    .1720055
 birthmonthdum5 |  -.0555974   .0954257    -0.58   0.560    -.2426283    .1314334
 birthmonthdum6 |   .0062432   .0938459     0.07   0.947    -.1776913    .1901778
 birthmonthdum7 |  -.0410875   .0946437    -0.43   0.664    -.2265857    .1444108
 birthmonthdum8 |   .0458735   .0920629     0.50   0.618    -.1345665    .2263135
 birthmonthdum9 |   .0393218   .0922135     0.43   0.670    -.1414133    .2200569
birthmonthdum10 |   .0089206    .090715     0.10   0.922    -.1688775    .1867186
birthmonthdum11 |   .0236412   .0938641     0.25   0.801     -.160329    .2076114
birthmonthdum12 |  -.1376812   .0942111    -1.46   0.144    -.3223316    .0469692
          _cons |    8.91031   .5694996    15.65   0.000     7.794112    10.02651
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =   12.933  (p = 0.0003)
  Wu-Hausman F(1,1251)            =  12.9014  (p = 0.0003)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =   2.6258  (p = 0.2690)
  Basmann chi2(2)        =  2.59595  (p = 0.2731)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  12.726  Chi-sq(16) P-value = 0.6927

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,267    8.200001    .6904736   5.521461   10.12663
         exp |      1,267    20.50276     3.66452          9         28
      expsqr |      1,267    433.7814     148.717         81        784
birthmont~m2 |      1,267    .0923441    .2896254          0          1
birthmonth~3 |      1,267    .0883978    .2839846          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,267    .0615627    .2404546          0          1
birthmonth~5 |      1,267    .0749803    .2634635          0          1
birthmonth~6 |      1,267    .0812944    .2733946          0          1
birthmonth~7 |      1,267    .0781373    .2684936          0          1
birthmonth~8 |      1,267    .0868193    .2816812          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,267    .0915549    .2885104          0          1
birthmont~10 |      1,267    .1018153    .3025247          0          1
birthmont~11 |      1,267    .0844515    .2781735          0          1
birthmont~12 |      1,267    .0852407    .2793498          0          1
        male |      1,267           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyear
> ning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,267
                                                        F(30, 1236)   =  76.56
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6501
                                                        Adj R-squared = 0.6416
                                                        Root MSE      = 0.2934

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1781117   .0225221    -7.91   0.000    -.2222975   -.1339259
         expsqr |    .001156   .0005561     2.08   0.038      .000065     .002247
 birthmonthdum2 |  -.0271372   .0410947    -0.66   0.509    -.1077602    .0534859
 birthmonthdum3 |   .0766309   .0415213     1.85   0.065    -.0048291    .1580909
 birthmonthdum4 |   .1102933   .0457321     2.41   0.016     .0205723    .2000144
 birthmonthdum5 |   .0351565   .0434516     0.81   0.419    -.0500906    .1204035
 birthmonthdum6 |   .0506825   .0427899     1.18   0.236    -.0332664    .1346314
 birthmonthdum7 |   .0400214   .0431378     0.93   0.354    -.0446099    .1246528
 birthmonthdum8 |   .0620446   .0419365     1.48   0.139      -.02023    .1443192
 birthmonthdum9 |    .124242   .0414949     2.99   0.003     .0428339    .2056502
birthmonthdum10 |   .1429751   .0407597     3.51   0.000     .0630093     .222941
birthmonthdum11 |    .113442   .0420884     2.70   0.007     .0308693    .1960146
birthmonthdum12 |   .1643464   .0419019     3.92   0.000     .0821398    .2465531
   provincedum2 |     .07875   .0466492     1.69   0.092    -.0127704    .1702704
   provincedum3 |   .0992265   .0508838     1.95   0.051    -.0006016    .1990546
   provincedum4 |  -.0401565   .0453023    -0.89   0.376    -.1290344    .0487213
   provincedum5 |   .0122178   .0426352     0.29   0.774    -.0714274    .0958631
   provincedum6 |   .0850003   .0492304     1.73   0.084     -.011584    .1815846
   provincedum7 |   .0405109   .0431193     0.94   0.348    -.0440843    .1251061
   provincedum8 |    .068936   .0440073     1.57   0.117    -.0174013    .1552733
   provincedum9 |   .0055916   .0461071     0.12   0.903    -.0848653    .0960486
  provincedum10 |  -.0255983   .0437203    -0.59   0.558    -.1113726     .060176
  provincedum11 |  -.0390243   .0399384    -0.98   0.329    -.1173788    .0393302
  provincedum12 |  -.0104804   .0474678    -0.22   0.825    -.1036068    .0826461
  provincedum13 |   .0057276   .0460964     0.12   0.901    -.0847083    .0961634
  provincedum14 |  -.0058802   .0527757    -0.11   0.911    -.1094201    .0976597
  provincedum15 |   .0256296   .0523634     0.49   0.625    -.0771013    .1283605
              t |  -.0119445   .0011661   -10.24   0.000    -.0142321   -.0096568
              d |   .0484921   .0348677     1.39   0.165    -.0199144    .1168986
             td |  -.0004433   .0016586    -0.27   0.789    -.0036973    .0028106
          _cons |   3.457486   .2287917    15.11   0.000     3.008623    3.906349
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,267
                                                  Wald chi2(28)   =     264.52
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1583
                                                  Root MSE        =     .63321

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |    .621546   .0963554     6.45   0.000     .4326929     .810399
            exp |  -.0688464   .0499055    -1.38   0.168    -.1666594    .0289667
         expsqr |   .0018083   .0011683     1.55   0.122    -.0004816    .0040982
 birthmonthdum2 |  -.0138823   .0887124    -0.16   0.876    -.1877554    .1599908
 birthmonthdum3 |  -.1639808   .0894896    -1.83   0.067    -.3393771    .0114156
 birthmonthdum4 |   .0291848   .0984167     0.30   0.767    -.1637084    .2220781
 birthmonthdum5 |  -.0746103   .0933051    -0.80   0.424    -.2574849    .1082644
 birthmonthdum6 |   .0227551   .0914236     0.25   0.803    -.1564319    .2019422
 birthmonthdum7 |  -.0289232   .0923719    -0.31   0.754    -.2099689    .1521224
 birthmonthdum8 |    .037897   .0894272     0.42   0.672     -.137377     .213171
 birthmonthdum9 |   .0226644     .08987     0.25   0.801    -.1534775    .1988063
birthmonthdum10 |   .0239344   .0886071     0.27   0.787    -.1497323    .1976012
birthmonthdum11 |   .0207299   .0914388     0.23   0.821    -.1584868    .1999465
birthmonthdum12 |  -.1304227    .091784    -1.42   0.155    -.3103161    .0494706
   provincedum2 |  -.5519633   .1006456    -5.48   0.000    -.7492251   -.3547015
   provincedum3 |  -.4338501   .1099108    -3.95   0.000    -.6492713   -.2184288
   provincedum4 |  -.3170761   .0978454    -3.24   0.001    -.5088496   -.1253027
   provincedum5 |   .0157315   .0919634     0.17   0.864    -.1645135    .1959765
   provincedum6 |  -.2316682   .1062299    -2.18   0.029     -.439875   -.0234613
   provincedum7 |  -.3092833   .0930509    -3.32   0.001    -.4916597    -.126907
   provincedum8 |  -.4172255   .0950179    -4.39   0.000    -.6034573   -.2309938
   provincedum9 |  -.1908862   .0993307    -1.92   0.055    -.3855709    .0037984
  provincedum10 |  -.2081814   .0944538    -2.20   0.028    -.3933075   -.0230554
  provincedum11 |  -.0005051   .0865175    -0.01   0.995    -.1700764    .1690661
  provincedum12 |  -.2003075   .1024883    -1.95   0.051    -.4011809    .0005659
  provincedum13 |  -.1276307   .0994477    -1.28   0.199    -.3225447    .0672832
  provincedum14 |  -.2075488    .113881    -1.82   0.068    -.4307514    .0156538
  provincedum15 |   -.257305   .1128536    -2.28   0.023    -.4784939    -.036116
          _cons |   8.807987   .5565491    15.83   0.000      7.71717    9.898803
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  11.9342  (p = 0.0006)
  Wu-Hausman F(1,1237)            =  11.7625  (p = 0.0006)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  1.86081  (p = 0.3944)
  Basmann chi2(2)        =  1.81795  (p = 0.4029)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  25.310  Chi-sq(30) P-value = 0.7098

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,267    8.200001    .6904736   5.521461   10.12663
         exp |      1,267    20.50276     3.66452          9         28
      expsqr |      1,267    433.7814     148.717         81        784
birthmont~m2 |      1,267    .0923441    .2896254          0          1
birthmonth~3 |      1,267    .0883978    .2839846          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,267    .0615627    .2404546          0          1
birthmonth~5 |      1,267    .0749803    .2634635          0          1
birthmonth~6 |      1,267    .0812944    .2733946          0          1
birthmonth~7 |      1,267    .0781373    .2684936          0          1
birthmonth~8 |      1,267    .0868193    .2816812          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,267    .0915549    .2885104          0          1
birthmont~10 |      1,267    .1018153    .3025247          0          1
birthmont~11 |      1,267    .0844515    .2781735          0          1
birthmont~12 |      1,267    .0852407    .2793498          0          1
        male |      1,267           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/I
> V Urban ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Exp/IV Urban ATF&Birth Exp 1979 3years.log
  log type:  text
 closed on:   6 Aug 2024, 17:34:20
---------------------------------------------------------------------------------------------
