---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Mal
> e Tenure controlled/Rural/Rural 1979 Higheredu ManualD MaleTenure controlled.log
  log type:  text
 opened on:   8 Aug 2024, 12:49:07

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(27,895 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,455 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(34,426 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(2,298 real changes made)

. 
. *Step Two: Regressions (Three parts Ideally: Firstly rdrobust from birthmonth to earning; S
> econdly rdrobust from birthmonth to higheredu; Thirdly rdrobust*2 or rdrobust+OLS or ivregr
> ess from higheredu to earning. Each part has 6 sheets)
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        396
-------------------+----------------------            BW type       =     Manual
     Number of obs |       188         208            Kernel        =    Uniform
Eff. Number of obs |       188         208            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13354     .12705   -1.0511  0.293   -.382551      .115462
    Bias-corrected | -.36893     .12705   -2.9039  0.004   -.617933      -.11992
            Robust | -.36893     .20624   -1.7888  0.074   -.773153        .0353
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1189
-------------------+----------------------            BW type       =     Manual
     Number of obs |       550         639            Kernel        =    Uniform
Eff. Number of obs |       550         639            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0432     .07573   -0.5704  0.568   -.191629      .105237
    Bias-corrected | -.06602     .07573   -0.8717  0.383   -.214453      .082413
            Robust | -.06602     .11302   -0.5842  0.559   -.287527      .155487
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs(ma
> le tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10316
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4688        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1071        1192            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.601      66.601
       BW bias (b) |   103.967     103.967
         rho (h/b) |     0.641       0.641
        Unique obs |       388         283

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02392     .05892   -0.4059  0.685   -.139387      .091556
    Bias-corrected | -.01858     .05892   -0.3154  0.752   -.134053       .09689
            Robust | -.01858     .07042   -0.2639  0.792   -.156608      .119444
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         94
-------------------+----------------------            BW type       =     Manual
     Number of obs |        47          47            Kernel        =    Uniform
Eff. Number of obs |        47          47            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17501     .19381   0.9030   0.367   -.204844      .554864
    Bias-corrected | -.06574     .19381   -0.3392  0.734   -.445593      .314115
            Robust | -.06574     .35047   -0.1876  0.851    -.75264      .621161
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        274
-------------------+----------------------            BW type       =     Manual
     Number of obs |       131         143            Kernel        =    Uniform
Eff. Number of obs |       131         143            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03628     .15377   -0.2359  0.813   -.337654      .265102
    Bias-corrected |   .2636     .15377   1.7143   0.086   -.037781      .564974
            Robust |   .2636     .19687   1.3389   0.181   -.122262      .649455
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3369
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1006        2363            Kernel        = Epanechnikov
Eff. Number of obs |       275         493            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    90.296      90.296
       BW bias (b) |   161.300     161.300
         rho (h/b) |     0.560       0.560
        Unique obs |       306         261

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00388     .10119   -0.0383  0.969   -.202204       .19445
    Bias-corrected | -.04225     .10119   -0.4175  0.676   -.240575      .156079
            Robust | -.04225     .11557   -0.3656  0.715   -.268756      .184261
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.08432     .32813   -0.2570  0.797   -.727443      .558795
    Bias-corrected |  .37322     .32813   1.1374   0.255   -.269896      1.01634
            Robust |  .37322     .76948   0.4850   0.628   -1.13493      1.88138
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        122
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          70            Kernel        =    Uniform
Eff. Number of obs |        52          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05743     .19779   0.2904   0.772   -.330236      .445094
    Bias-corrected |  .05585     .19779   0.2824   0.778   -.331817      .443512
            Robust |  .05585     .27494   0.2031   0.839    -.48303      .594725
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1016
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         818            Kernel        = Epanechnikov
Eff. Number of obs |        90         128            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.990      71.990
       BW bias (b) |   114.457     114.457
         rho (h/b) |     0.629       0.629
        Unique obs |       132         235

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0274     .16715   0.1639   0.870   -.300199      .355006
    Bias-corrected |  .01647     .16715   0.0985   0.922   -.311136      .344069
            Robust |  .01647     .20014   0.0823   0.934   -.375804      .408737
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         42
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          19            Kernel        =    Uniform
Eff. Number of obs |        23          19            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .44328     .23978   1.8487   0.065   -.026685      .913241
    Bias-corrected | -.30648     .23978   -1.2782  0.201   -.776444      .163482
            Robust | -.30648     .30251   -1.0131  0.311   -.899391      .286428
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        152
-------------------+----------------------            BW type       =     Manual
     Number of obs |        79          73            Kernel        =    Uniform
Eff. Number of obs |        79          73            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.16254     .24052   -0.6758  0.499   -.633959      .308879
    Bias-corrected |  .36853     .24052   1.5322   0.125   -.102893      .839945
            Robust |  .36853     .29592   1.2454   0.213   -.211464      .948516
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2353
-------------------+----------------------            BW type       =      mserd
     Number of obs |       808        1545            Kernel        = Epanechnikov
Eff. Number of obs |       164         277            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    84.550      84.550
       BW bias (b) |   133.696     133.696
         rho (h/b) |     0.632       0.632
        Unique obs |       286         247

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05268     .14749   -0.3571  0.721   -.341756      .236405
    Bias-corrected | -.08848     .14749   -0.5999  0.549   -.377564      .200597
            Robust | -.08848     .17635   -0.5017  0.616   -.434124      .257157
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         161            Kernel        =    Uniform
Eff. Number of obs |       141         161            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.21487     .15279   -1.4063  0.160   -.514321      .084586
    Bias-corrected |  -.4494     .15279   -2.9414  0.003    -.74885     -.149943
            Robust |  -.4494     .25329   -1.7743  0.076   -.945829      .047035
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        915
-------------------+----------------------            BW type       =     Manual
     Number of obs |       419         496            Kernel        =    Uniform
Eff. Number of obs |       419         496            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04346     .08764   -0.4958  0.620   -.215236      .128325
    Bias-corrected | -.15633     .08764   -1.7837  0.074   -.328111       .01545
            Robust | -.15633      .1333   -1.1728  0.241   -.417587      .104926
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6947
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3682        3265            Kernel        = Epanechnikov
Eff. Number of obs |       828         861            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.330      63.330
       BW bias (b) |    99.498      99.498
         rho (h/b) |     0.636       0.636
        Unique obs |       381         281

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02091     .07077   -0.2954  0.768   -.159611      .117796
    Bias-corrected | -.01061     .07077   -0.1500  0.881   -.149317      .128089
            Robust | -.01061     .08425   -0.1260  0.900   -.175743      .154515
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        396
-------------------+----------------------            BW type       =     Manual
     Number of obs |       188         208            Kernel        =    Uniform
Eff. Number of obs |       188         208            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13354     .15273   -0.8744  0.382   -.432891      .165802
    Bias-corrected | -.36893     .15273   -2.4155  0.016   -.668273      -.06958
            Robust | -.36893     .24212   -1.5238  0.128   -.843464      .105611
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1189
-------------------+----------------------            BW type       =     Manual
     Number of obs |       550         639            Kernel        =    Uniform
Eff. Number of obs |       550         639            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0432     .10597   -0.4076  0.684   -.250885      .164493
    Bias-corrected | -.06602     .10597   -0.6230  0.533   -.273709      .141669
            Robust | -.06602     .13925   -0.4741  0.635    -.33894      .206901
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs(ma
> le tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10316
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4688        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1187        1291            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.387      71.387
       BW bias (b) |   104.005     104.005
         rho (h/b) |     0.686       0.686
        Unique obs |       388         283
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03049     .07744   -0.3937  0.694   -.182269      .121294
    Bias-corrected | -.02448     .07744   -0.3161  0.752   -.176258      .127305
            Robust | -.02448     .09369   -0.2613  0.794   -.208105      .159152
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         94
-------------------+----------------------            BW type       =     Manual
     Number of obs |        47          47            Kernel        =    Uniform
Eff. Number of obs |        47          47            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        13          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17501     .20814   0.8408   0.400   -.232939       .58296
    Bias-corrected | -.06574     .20814   -0.3158  0.752   -.473689       .34221
            Robust | -.06574     .34365   -0.1913  0.848   -.739287      .607809
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        274
-------------------+----------------------            BW type       =     Manual
     Number of obs |       131         143            Kernel        =    Uniform
Eff. Number of obs |       131         143            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03628     .15236   -0.2381  0.812   -.334899      .262347
    Bias-corrected |   .2636     .15236   1.7301   0.084   -.035027       .56222
            Robust |   .2636     .20861   1.2636   0.206   -.145269      .672462
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provinc
> e_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3369
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1006        2363            Kernel        = Epanechnikov
Eff. Number of obs |       308         631            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   100.866     100.866
       BW bias (b) |   175.070     175.070
         rho (h/b) |     0.576       0.576
        Unique obs |       306         261
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00675     .09048   -0.0746  0.941   -.184087      .170589
    Bias-corrected | -.04389     .09048   -0.4851  0.628   -.221232      .133445
            Robust | -.04389     .10285   -0.4268  0.670   -.245484      .157696
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.08432      .4294   -0.1964  0.844   -.925936      .757287
    Bias-corrected |  .37322      .4294   0.8692   0.385   -.468388      1.21483
            Robust |  .37322     .65174   0.5727   0.567   -.904173      1.65062
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        122
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          70            Kernel        =    Uniform
Eff. Number of obs |        52          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05743     .17926   0.3204   0.749   -.293915      .408773
    Bias-corrected |  .05585     .17926   0.3115   0.755   -.295496      .407191
            Robust |  .05585     .33098   0.1687   0.866   -.592859      .704554
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1016
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         818            Kernel        = Epanechnikov
Eff. Number of obs |        97         158            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    82.578      82.578
       BW bias (b) |   133.074     133.074
         rho (h/b) |     0.621       0.621
        Unique obs |       132         235
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03782     .12744   0.2968   0.767   -.211952      .287596
    Bias-corrected |  .01508     .12744   0.1183   0.906   -.234695      .264852
            Robust |  .01508     .14626   0.1031   0.918   -.271585      .301742
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         42
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          19            Kernel        =    Uniform
Eff. Number of obs |        23          19            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |         9          10

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .44328     .26194   1.6923   0.091   -.070111      .956668
    Bias-corrected | -.30648     .26194   -1.1701  0.242   -.819871      .206908
            Robust | -.30648     .37071   -0.8267  0.408   -1.03306      .420096
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        152
-------------------+----------------------            BW type       =     Manual
     Number of obs |        79          73            Kernel        =    Uniform
Eff. Number of obs |        79          73            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.16254     .22938   -0.7086  0.479   -.612111      .287032
    Bias-corrected |  .36853     .22938   1.6066   0.108   -.081045      .818097
            Robust |  .36853     .20327   1.8130   0.070   -.029869      .766921
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2353
-------------------+----------------------            BW type       =      mserd
     Number of obs |       808        1545            Kernel        = Epanechnikov
Eff. Number of obs |       172         299            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    88.081      88.081
       BW bias (b) |   141.741     141.741
         rho (h/b) |     0.621       0.621
        Unique obs |       286         247
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05793     .16974   -0.3413  0.733   -.390618      .274754
    Bias-corrected | -.10556     .16974   -0.6219  0.534   -.438248      .227124
            Robust | -.10556     .20635   -0.5116  0.609   -.510006      .298883
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         161            Kernel        =    Uniform
Eff. Number of obs |       141         161            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.21487     .16698   -1.2868  0.198   -.542147      .112412
    Bias-corrected |  -.4494     .16698   -2.6913  0.007   -.776677     -.122117
            Robust |  -.4494     .25858   -1.7379  0.082   -.956206      .057412
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        915
-------------------+----------------------            BW type       =     Manual
     Number of obs |       419         496            Kernel        =    Uniform
Eff. Number of obs |       419         496            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04346     .12249   -0.3548  0.723   -.283535      .196624
    Bias-corrected | -.15633     .12249   -1.2763  0.202    -.39641      .083749
            Robust | -.15633     .15081   -1.0366  0.300    -.45191       .13925
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6947
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3682        3265            Kernel        = Epanechnikov
Eff. Number of obs |       816         850            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.489      62.489
       BW bias (b) |    95.692      95.692
         rho (h/b) |     0.653       0.653
        Unique obs |       381         281
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02004     .09913   -0.2021  0.840   -.214332      .174261
    Bias-corrected | -.00052     .09913   -0.0053  0.996    -.19482      .193772
            Robust | -.00052     .11862   -0.0044  0.996   -.233022      .231974
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        361
-------------------+----------------------            BW type       =     Manual
     Number of obs |       176         185            Kernel        =    Uniform
Eff. Number of obs |       176         185            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12741     .15351   -0.8300  0.407   -.428286      .173467
    Bias-corrected | -.58629     .15351   -3.8192  0.000   -.887165     -.285412
            Robust | -.58629     .28681   -2.0442  0.041   -1.14843     -.024149
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       538         616            Kernel        =    Uniform
Eff. Number of obs |       538         616            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0296     .08075   -0.3665  0.714   -.187868      .128673
    Bias-corrected | -.03308     .08075   -0.4097  0.682   -.191354      .125187
            Robust | -.03308     .13122   -0.2521  0.801   -.290263      .224096
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10281
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4676        5605            Kernel        = Epanechnikov
Eff. Number of obs |      1040        1153            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.726      65.726
       BW bias (b) |   104.971     104.971
         rho (h/b) |     0.626       0.626
        Unique obs |       387         282

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01121     .06176   -0.1816  0.856   -.132256       .10983
    Bias-corrected | -.00534     .06176   -0.0865  0.931   -.126385        .1157
            Robust | -.00534     .07432   -0.0719  0.943   -.151011      .140326
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         82
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          40            Kernel        =    Uniform
Eff. Number of obs |        42          40            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .23611      .2658   0.8883   0.374   -.284846      .757072
    Bias-corrected | -.44893      .2658   -1.6890  0.091   -.969892      .072027
            Robust | -.44893     .74403   -0.6034  0.546   -1.90721      1.00935
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       126         136            Kernel        =    Uniform
Eff. Number of obs |       126         136            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06443     .17515   -0.3678  0.713    -.40772      .278869
    Bias-corrected |  .35907     .17515   2.0500   0.040    .015774      .702363
            Robust |  .35907      .2565   1.3999   0.162   -.143658      .861795
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3357
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1001        2356            Kernel        = Epanechnikov
Eff. Number of obs |       257         432            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    84.807      84.807
       BW bias (b) |   149.704     149.704
         rho (h/b) |     0.566       0.566
        Unique obs |       305         260

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00936      .1108   -0.0845  0.933   -.226525      .207796
    Bias-corrected | -.04786      .1108   -0.4319  0.666   -.265017      .169305
            Robust | -.04786     .12934   -0.3700  0.711   -.301358      .205646
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.19329     .35142   -0.5500  0.582   -.882068      .495489
    Bias-corrected | -.05858     .35142   -0.1667  0.868   -.747355      .630202
            Robust | -.05858     .93006   -0.0630  0.950   -1.88145       1.7643
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        117
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          66            Kernel        =    Uniform
Eff. Number of obs |        51          66            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03657     .20336   0.1798   0.857   -.362015      .435159
    Bias-corrected |  .03811     .20336   0.1874   0.851   -.360481      .436693
            Robust |  .03811     .28122   0.1355   0.892   -.513068      .589279
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1011
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         814            Kernel        = Epanechnikov
Eff. Number of obs |        78         110            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.402      65.402
       BW bias (b) |   105.690     105.690
         rho (h/b) |     0.619       0.619
        Unique obs |       131         234

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01088     .17883   0.0608   0.951   -.339631       .36139
    Bias-corrected |  .00223     .17883   0.0125   0.990   -.348278      .352742
            Robust |  .00223     .21433   0.0104   0.992   -.417852      .422317
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         35
-------------------+----------------------            BW type       =     Manual
     Number of obs |        19          16            Kernel        =    Uniform
Eff. Number of obs |        19          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2945     .59058   2.1919   0.028    .136976      2.45201
    Bias-corrected | -1.0154     .59058   -1.7193  0.086   -2.17291       .14212
            Robust | -1.0154     1.6151   -0.6287  0.530   -4.18086      2.15007
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        75          70            Kernel        =    Uniform
Eff. Number of obs |        75          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.21135     .30002   -0.7045  0.481   -.799391      .376684
    Bias-corrected |  .61176     .30002   2.0390   0.041    .023723       1.1998
            Robust |  .61176     .49974   1.2242   0.221   -.367713      1.59123
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2346
-------------------+----------------------            BW type       =      mserd
     Number of obs |       804        1542            Kernel        = Epanechnikov
Eff. Number of obs |       146         227            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.678      77.678
       BW bias (b) |   127.465     127.465
         rho (h/b) |     0.609       0.609
        Unique obs |       285         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05051     .17219   -0.2933  0.769   -.388005      .286983
    Bias-corrected | -.08225     .17219   -0.4776  0.633    -.41974      .255247
            Robust | -.08225     .20965   -0.3923  0.695   -.493143       .32865
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        279
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         145            Kernel        =    Uniform
Eff. Number of obs |       134         145            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.20824     .17616   -1.1821  0.237   -.553503      .137028
    Bias-corrected | -.57199     .17616   -3.2470  0.001   -.917254     -.226723
            Robust | -.57199      .3116   -1.8357  0.066    -1.1827      .038726
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        892
-------------------+----------------------            BW type       =     Manual
     Number of obs |       412         480            Kernel        =    Uniform
Eff. Number of obs |       412         480            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01821     .09201   -0.1979  0.843   -.198542      .162123
    Bias-corrected | -.11885     .09201   -1.2917  0.196   -.299183      .061482
            Robust | -.11885     .14931   -0.7960  0.426   -.411496      .173796
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6924
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3675        3249            Kernel        = Epanechnikov
Eff. Number of obs |       831         863            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.112      64.112
       BW bias (b) |   102.739     102.739
         rho (h/b) |     0.624       0.624
        Unique obs |       380         280

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00084     .07248   -0.0116  0.991     -.1429      .141212
    Bias-corrected |  .00879     .07248   0.1213   0.903   -.133262      .150849
            Robust |  .00879     .08685   0.1012   0.919   -.161432      .179019
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        361
-------------------+----------------------            BW type       =     Manual
     Number of obs |       176         185            Kernel        =    Uniform
Eff. Number of obs |       176         185            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12741     .14048   -0.9070  0.364   -.402739       .14792
    Bias-corrected | -.58629     .14048   -4.1736  0.000   -.861617     -.310959
            Robust | -.58629     .28409   -2.0638  0.039   -1.14309     -.029489
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       538         616            Kernel        =    Uniform
Eff. Number of obs |       538         616            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0296     .10946   -0.2704  0.787   -.244131      .184937
    Bias-corrected | -.03308     .10946   -0.3022  0.762   -.247618      .181451
            Robust | -.03308     .14084   -0.2349  0.814   -.309116       .24295
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pr
> ovince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10281
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4676        5605            Kernel        = Epanechnikov
Eff. Number of obs |      1153        1249            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.186      70.186
       BW bias (b) |   106.646     106.646
         rho (h/b) |     0.658       0.658
        Unique obs |       387         282
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01821     .07898   -0.2306  0.818   -.173012      .136592
    Bias-corrected | -.01459     .07898   -0.1848  0.853   -.169393       .14021
            Robust | -.01459     .09573   -0.1524  0.879   -.202215      .173031
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         82
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          40            Kernel        =    Uniform
Eff. Number of obs |        42          40            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        13          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .23611     .26285   0.8983   0.369   -.279058      .751285
    Bias-corrected | -.44893     .26285   -1.7080  0.088   -.964104      .066239
            Robust | -.44893     .75067   -0.5980  0.550   -1.92022      1.02236
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       126         136            Kernel        =    Uniform
Eff. Number of obs |       126         136            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06443     .18249   -0.3530  0.724   -.422094      .293243
    Bias-corrected |  .35907     .18249   1.9676   0.049      .0014      .716737
            Robust |  .35907     .23126   1.5527   0.120   -.094186      .812324
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(
> nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3357
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1001        2356            Kernel        = Epanechnikov
Eff. Number of obs |       272         498            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    91.125      91.125
       BW bias (b) |   163.891     163.891
         rho (h/b) |     0.556       0.556
        Unique obs |       305         260
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01382     .11746   -0.1177  0.906    -.24403      .216386
    Bias-corrected | -.05776     .11746   -0.4918  0.623   -.287972      .172444
            Robust | -.05776     .13592   -0.4250  0.671   -.324153      .208626
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.19329     .47642   -0.4057  0.685   -1.12706      .740477
    Bias-corrected | -.05858     .47642   -0.1230  0.902   -.992343      .875189
            Robust | -.05858     .82982   -0.0706  0.944     -1.685      1.56785
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        117
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          66            Kernel        =    Uniform
Eff. Number of obs |        51          66            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03657     .17961   0.2036   0.839   -.315449      .388592
    Bias-corrected |  .03811     .17961   0.2122   0.832   -.313915      .390126
            Robust |  .03811     .32096   0.1187   0.905   -.590967      .667179
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1011
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         814            Kernel        = Epanechnikov
Eff. Number of obs |        90         137            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    75.988      75.988
       BW bias (b) |   118.530     118.530
         rho (h/b) |     0.641       0.641
        Unique obs |       131         234
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00825     .13184   0.0626   0.950   -.250151      .266644
    Bias-corrected | -.02137     .13184   -0.1621  0.871   -.279766      .237029
            Robust | -.02137     .15887   -0.1345  0.893   -.332744      .290007
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         35
-------------------+----------------------            BW type       =     Manual
     Number of obs |        19          16            Kernel        =    Uniform
Eff. Number of obs |        19          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |         9           9

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2945     .52692   2.4567   0.014     .26174      2.32724
    Bias-corrected | -1.0154     .52692   -1.9270  0.054   -2.04815      .017356
            Robust | -1.0154     1.5882   -0.6393  0.523   -4.12823      2.09744
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        75          70            Kernel        =    Uniform
Eff. Number of obs |        75          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.21135     .31121   -0.6791  0.497   -.821323      .398615
    Bias-corrected |  .61176     .31121   1.9657   0.049    .001791      1.22173
            Robust |  .61176       .272   2.2491   0.025    .078644      1.14488
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2346
-------------------+----------------------            BW type       =      mserd
     Number of obs |       804        1542            Kernel        = Epanechnikov
Eff. Number of obs |       155         253            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.593      80.593
       BW bias (b) |   130.724     130.724
         rho (h/b) |     0.617       0.617
        Unique obs |       285         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05424     .20926   -0.2592  0.795   -.464381      .355909
    Bias-corrected | -.08987     .20926   -0.4295  0.668   -.500013      .320276
            Robust | -.08987     .26226   -0.3427  0.732   -.603887       .42415
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        279
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         145            Kernel        =    Uniform
Eff. Number of obs |       134         145            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.20824     .16181   -1.2869  0.198   -.525376      .108902
    Bias-corrected | -.57199     .16181   -3.5350  0.000   -.889128      -.25485
            Robust | -.57199     .29879   -1.9144  0.056    -1.1576      .013625
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        892
-------------------+----------------------            BW type       =     Manual
     Number of obs |       412         480            Kernel        =    Uniform
Eff. Number of obs |       412         480            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01821     .12574   -0.1448  0.885   -.264647      .228229
    Bias-corrected | -.11885     .12574   -0.9452  0.345   -.365288      .127588
            Robust | -.11885     .15139   -0.7851  0.432   -.415565      .177865
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6924
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3675        3249            Kernel        = Epanechnikov
Eff. Number of obs |       809         834            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.359      62.359
       BW bias (b) |    99.187      99.187
         rho (h/b) |     0.629       0.629
        Unique obs |       380         280
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00194     .09933   0.0195   0.984   -.192755      .196628
    Bias-corrected |  .01744     .09933   0.1756   0.861    -.17725      .212133
            Robust |  .01744     .11933   0.1462   0.884   -.216445      .251329
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        329
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         169            Kernel        =    Uniform
Eff. Number of obs |       160         169            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.20601     .19874   -1.0366  0.300   -.595533       .18351
    Bias-corrected | -1.2436     .19874   -6.2577  0.000   -1.63317     -.854127
            Robust | -1.2436     .46857   -2.6541  0.008   -2.16203     -.325266
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1122
-------------------+----------------------            BW type       =     Manual
     Number of obs |       522         600            Kernel        =    Uniform
Eff. Number of obs |       522         600            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03944     .08736   -0.4515  0.652   -.210671      .131785
    Bias-corrected | -.06069     .08736   -0.6947  0.487   -.231916       .11054
            Robust | -.06069     .15702   -0.3865  0.699   -.368445      .247069
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10249
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4660        5589            Kernel        = Epanechnikov
Eff. Number of obs |       998        1095            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.559      63.559
       BW bias (b) |   103.741     103.741
         rho (h/b) |     0.613       0.613
        Unique obs |       386         281

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0134     .06634   -0.2019  0.840   -.143425      .116634
    Bias-corrected | -.00698     .06634   -0.1052  0.916   -.137011      .123049
            Robust | -.00698     .08039   -0.0868  0.931   -.164546      .150583
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         79
-------------------+----------------------            BW type       =     Manual
     Number of obs |        41          38            Kernel        =    Uniform
Eff. Number of obs |        41          38            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .31785     .30342   1.0476   0.295   -.276839       .91253
    Bias-corrected | -.41886     .30342   -1.3805  0.167   -1.01354      .175828
            Robust | -.41886     .99409   -0.4213  0.674   -2.36724      1.52953
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        259
-------------------+----------------------            BW type       =     Manual
     Number of obs |       125         134            Kernel        =    Uniform
Eff. Number of obs |       125         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05922     .18117   -0.3269  0.744   -.414312      .295871
    Bias-corrected |  .42669     .18117   2.3551   0.019    .071595      .781778
            Robust |  .42669     .27759   1.5371   0.124   -.117382      .970756
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3354
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1000        2354            Kernel        = Epanechnikov
Eff. Number of obs |       254         422            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    83.115      83.115
       BW bias (b) |   143.998     143.998
         rho (h/b) |     0.577       0.577
        Unique obs |       304         259

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00595     .11391   -0.0522  0.958   -.229213      .217314
    Bias-corrected | -.04189     .11391   -0.3677  0.713   -.265151      .181376
            Robust | -.04189     .13445   -0.3116  0.755   -.305404      .221629
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17139     .41697   -0.4110  0.681   -.988633      .645863
    Bias-corrected |  .23352     .41697   0.5600   0.575   -.583729      1.05077
            Robust |  .23352     1.2991   0.1798   0.857   -2.31264      2.77968
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        114
-------------------+----------------------            BW type       =     Manual
     Number of obs |        50          64            Kernel        =    Uniform
Eff. Number of obs |        50          64            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05687      .2157   0.2637   0.792   -.365896      .479636
    Bias-corrected |   .1109      .2157   0.5141   0.607   -.311869      .533663
            Robust |   .1109     .32418   0.3421   0.732   -.524485      .746278
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1008
-------------------+----------------------            BW type       =      mserd
     Number of obs |       196         812            Kernel        = Epanechnikov
Eff. Number of obs |        77         108            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.997      65.997
       BW bias (b) |   107.993     107.993
         rho (h/b) |     0.611       0.611
        Unique obs |       130         233

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01857     .18668   0.0995   0.921   -.347323      .384463
    Bias-corrected |  .00901     .18668   0.0483   0.962   -.356883      .374904
            Robust |  .00901     .22463   0.0401   0.968    -.43125      .449272
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         35
-------------------+----------------------            BW type       =     Manual
     Number of obs |        19          16            Kernel        =    Uniform
Eff. Number of obs |        19          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2945     .59058   2.1919   0.028    .136976      2.45201
    Bias-corrected | -1.0154     .59058   -1.7193  0.086   -2.17291       .14212
            Robust | -1.0154     1.6151   -0.6287  0.530   -4.18086      2.15007
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        75          70            Kernel        =    Uniform
Eff. Number of obs |        75          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.21135     .30002   -0.7045  0.481   -.799391      .376684
    Bias-corrected |  .61176     .30002   2.0390   0.041    .023723       1.1998
            Robust |  .61176     .49974   1.2242   0.221   -.367713      1.59123
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2346
-------------------+----------------------            BW type       =      mserd
     Number of obs |       804        1542            Kernel        = Epanechnikov
Eff. Number of obs |       146         227            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.678      77.678
       BW bias (b) |   127.465     127.465
         rho (h/b) |     0.609       0.609
        Unique obs |       285         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05051     .17219   -0.2933  0.769   -.388005      .286983
    Bias-corrected | -.08225     .17219   -0.4776  0.633    -.41974      .255247
            Robust | -.08225     .20965   -0.3923  0.695   -.493143       .32865
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        250
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         131            Kernel        =    Uniform
Eff. Number of obs |       119         131            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.33463     .23547   -1.4211  0.155   -.796141      .126887
    Bias-corrected | -1.3233     .23547   -5.6200  0.000   -1.78485     -.861825
            Robust | -1.3233     .51369   -2.5761  0.010   -2.33016     -.316519
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        863
-------------------+----------------------            BW type       =     Manual
     Number of obs |       397         466            Kernel        =    Uniform
Eff. Number of obs |       397         466            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02886      .1007   -0.2866  0.774   -.226216      .168501
    Bias-corrected | -.18017      .1007   -1.7893  0.074   -.377531      .017186
            Robust | -.18017     .18269   -0.9862  0.324   -.538244      .177899
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6895
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3660        3235            Kernel        = Epanechnikov
Eff. Number of obs |       780         799            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.678      61.678
       BW bias (b) |   101.213     101.213
         rho (h/b) |     0.609       0.609
        Unique obs |       379         279

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0033     .07905   -0.0417  0.967   -.158234      .151635
    Bias-corrected |  .00701     .07905   0.0887   0.929   -.147921      .161948
            Robust |  .00701      .0954   0.0735   0.941    -.17997      .193998
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        329
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         169            Kernel        =    Uniform
Eff. Number of obs |       160         169            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.20601     .19925   -1.0340  0.301   -.596527      .184504
    Bias-corrected | -1.2436     .19925   -6.2418  0.000   -1.63416     -.853133
            Robust | -1.2436     .51056   -2.4358  0.015   -2.24433     -.242963
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1122
-------------------+----------------------            BW type       =     Manual
     Number of obs |       522         600            Kernel        =    Uniform
Eff. Number of obs |       522         600            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03944     .12207   -0.3231  0.747   -.278704      .199818
    Bias-corrected | -.06069     .12207   -0.4971  0.619   -.299949      .178573
            Robust | -.06069     .17601   -0.3448  0.730   -.405666      .284291
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pr
> ovince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10249
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4660        5589            Kernel        = Epanechnikov
Eff. Number of obs |      1064        1175            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.978      67.978
       BW bias (b) |   106.801     106.801
         rho (h/b) |     0.636       0.636
        Unique obs |       386         281
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01948     .08626   -0.2259  0.821   -.188557      .149591
    Bias-corrected | -.01795     .08626   -0.2081  0.835   -.187023      .151125
            Robust | -.01795     .10525   -0.1705  0.865   -.224233      .188335
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         79
-------------------+----------------------            BW type       =     Manual
     Number of obs |        41          38            Kernel        =    Uniform
Eff. Number of obs |        41          38            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        13          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .31785     .24705   1.2865   0.198   -.166371      .802062
    Bias-corrected | -.41886     .24705   -1.6954  0.090   -.903073       .06536
            Robust | -.41886     .87161   -0.4806  0.631   -2.12718      1.28947
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        259
-------------------+----------------------            BW type       =     Manual
     Number of obs |       125         134            Kernel        =    Uniform
Eff. Number of obs |       125         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05922     .18447   -0.3210  0.748   -.420774      .302333
    Bias-corrected |  .42669     .18447   2.3130   0.021    .065133       .78824
            Robust |  .42669     .23622   1.8063   0.071   -.036297      .889671
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(
> nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3354
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1000        2354            Kernel        = Epanechnikov
Eff. Number of obs |       265         470            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    88.041      88.041
       BW bias (b) |   155.603     155.603
         rho (h/b) |     0.566       0.566
        Unique obs |       304         259
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00764     .12118   -0.0631  0.950   -.245158      .229872
    Bias-corrected | -.04961     .12118   -0.4094  0.682   -.287125      .187906
            Robust | -.04961     .14254   -0.3480  0.728   -.328989       .22977
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17139     .50338   -0.3405  0.734   -1.15799      .815219
    Bias-corrected |  .23352     .50338   0.4639   0.643   -.753085      1.22012
            Robust |  .23352     1.0197   0.2290   0.819   -1.76504      2.23208
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        114
-------------------+----------------------            BW type       =     Manual
     Number of obs |        50          64            Kernel        =    Uniform
Eff. Number of obs |        50          64            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05687     .17856   0.3185   0.750   -.293108      .406848
    Bias-corrected |   .1109     .17856   0.6210   0.535   -.239082      .460875
            Robust |   .1109     .32503   0.3412   0.733   -.526147      .747941
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1008
-------------------+----------------------            BW type       =      mserd
     Number of obs |       196         812            Kernel        = Epanechnikov
Eff. Number of obs |        90         136            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    76.656      76.656
       BW bias (b) |   119.875     119.875
         rho (h/b) |     0.639       0.639
        Unique obs |       130         233
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01699      .1316   0.1291   0.897   -.240948      .274919
    Bias-corrected |  -.0128      .1316   -0.0972  0.923    -.27073      .245138
            Robust |  -.0128     .15767   -0.0812  0.935   -.321821      .296229
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         35
-------------------+----------------------            BW type       =     Manual
     Number of obs |        19          16            Kernel        =    Uniform
Eff. Number of obs |        19          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |         9           9

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2945     .52692   2.4567   0.014     .26174      2.32724
    Bias-corrected | -1.0154     .52692   -1.9270  0.054   -2.04815      .017356
            Robust | -1.0154     1.5882   -0.6393  0.523   -4.12823      2.09744
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        75          70            Kernel        =    Uniform
Eff. Number of obs |        75          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.21135     .31121   -0.6791  0.497   -.821323      .398615
    Bias-corrected |  .61176     .31121   1.9657   0.049    .001791      1.22173
            Robust |  .61176       .272   2.2491   0.025    .078644      1.14488
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2346
-------------------+----------------------            BW type       =      mserd
     Number of obs |       804        1542            Kernel        = Epanechnikov
Eff. Number of obs |       155         253            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.593      80.593
       BW bias (b) |   130.724     130.724
         rho (h/b) |     0.617       0.617
        Unique obs |       285         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05424     .20926   -0.2592  0.795   -.464381      .355909
    Bias-corrected | -.08987     .20926   -0.4295  0.668   -.500013      .320276
            Robust | -.08987     .26226   -0.3427  0.732   -.603887       .42415
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        250
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         131            Kernel        =    Uniform
Eff. Number of obs |       119         131            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.33463      .2304   -1.4524  0.146   -.786197      .116943
    Bias-corrected | -1.3233      .2304   -5.7437  0.000   -1.77491     -.871769
            Robust | -1.3233     .51381   -2.5755  0.010    -2.3304     -.316282
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        863
-------------------+----------------------            BW type       =     Manual
     Number of obs |       397         466            Kernel        =    Uniform
Eff. Number of obs |       397         466            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02886     .14158   -0.2038  0.838   -.306345      .248629
    Bias-corrected | -.18017     .14158   -1.2726  0.203    -.45766      .097314
            Robust | -.18017     .20067   -0.8978  0.369   -.573484      .213139
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6895
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3660        3235            Kernel        = Epanechnikov
Eff. Number of obs |       759         770            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.978      60.978
       BW bias (b) |    99.755      99.755
         rho (h/b) |     0.611       0.611
        Unique obs |       379         279
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00261     .10886   -0.0239  0.981   -.215967      .210756
    Bias-corrected |   .0104     .10886   0.0956   0.924    -.20296      .223763
            Robust |   .0104     .13216   0.0787   0.937    -.24862      .269423
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Earning Sheet 6 results.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *2_2) RDD Higheredu t
. 
. *2_2_1) rdrobust on higheredu, sheet 1, no province no omitting local variables
. 
. **2_2_1_1 Pooled 
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        396
-------------------+----------------------            BW type       =     Manual
     Number of obs |       188         208            Kernel        =    Uniform
Eff. Number of obs |       188         208            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0329     .03555   0.9254   0.355   -.036782      .102587
    Bias-corrected | -.02967     .03555   -0.8345  0.404   -.099353      .040015
            Robust | -.02967     .05104   -0.5813  0.561   -.129696      .070358
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", replace ctitle(no province no l
> ocal adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1189
-------------------+----------------------            BW type       =     Manual
     Number of obs |       550         639            Kernel        =    Uniform
Eff. Number of obs |       550         639            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00893     .02487   -0.3590  0.720   -.057663      .039811
    Bias-corrected |  .03169     .02487   1.2745   0.202   -.017045      .080428
            Robust |  .03169      .0336   0.9431   0.346   -.034169      .097553
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat != ., covs(male tenure
>  tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10316
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4688        5628            Kernel        = Epanechnikov
Eff. Number of obs |       828         931            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.790      52.790
       BW bias (b) |    86.146      86.146
         rho (h/b) |     0.613       0.613
        Unique obs |       388         283

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01434     .02154   -0.6658  0.506   -.056548      .027872
    Bias-corrected | -.00934     .02154   -0.4335  0.665   -.051546      .032874
            Robust | -.00934     .02496   -0.3740  0.708   -.058263      .039591
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & (educat
> ==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         94
-------------------+----------------------            BW type       =     Manual
     Number of obs |        47          47            Kernel        =    Uniform
Eff. Number of obs |        47          47            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13956     .13591   1.0269   0.304   -.126821      .405945
    Bias-corrected | -.01637     .13591   -0.1205  0.904   -.282756       .25001
            Robust | -.01637     .16124   -0.1015  0.919   -.332397      .299651
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & (educat
> ==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        274
-------------------+----------------------            BW type       =     Manual
     Number of obs |       131         143            Kernel        =    Uniform
Eff. Number of obs |       131         143            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00142     .09747   0.0146   0.988   -.189616      .192454
    Bias-corrected |  .10819     .09747   1.1100   0.267   -.082849      .299221
            Robust |  .10819     .13323   0.8120   0.417   -.152943      .369315
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat==2), covs
> (male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3369
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1006        2363            Kernel        = Epanechnikov
Eff. Number of obs |       169         224            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.320      53.320
       BW bias (b) |    91.847      91.847
         rho (h/b) |     0.581       0.581
        Unique obs |       306         261

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01126     .08415   0.1338   0.894   -.153671      .176183
    Bias-corrected |  .03446     .08415   0.4095   0.682   -.130466      .199388
            Robust |  .03446     .09743   0.3537   0.724   -.156489      .225411
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_3 SecVoc
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11807     .17149   0.6885   0.491   -.218041      .454188
    Bias-corrected | -.29681     .17149   -1.7308  0.083   -.632921      .039308
            Robust | -.29681     .22432   -1.3231  0.186   -.736468      .142854
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        122
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          70            Kernel        =    Uniform
Eff. Number of obs |        52          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03473     .11345   0.3061   0.760   -.187633      .257093
    Bias-corrected |  .08876     .11345   0.7823   0.434   -.133607      .311119
            Robust |  .08876     .16112   0.5509   0.582    -.22704      .404552
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1016
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         818            Kernel        = Epanechnikov
Eff. Number of obs |        84         122            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.973      69.973
       BW bias (b) |   109.645     109.645
         rho (h/b) |     0.638       0.638
        Unique obs |       132         235

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01985     .09038   0.2197   0.826   -.157283      .196992
    Bias-corrected |  .03679     .09038   0.4070   0.684   -.140351      .213924
            Robust |  .03679     .10376   0.3545   0.723   -.166587      .240161
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_4 SecGen
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         42
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          19            Kernel        =    Uniform
Eff. Number of obs |        23          19            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .26378     .21988   1.1996   0.230   -.167182      .694746
    Bias-corrected |  .20589     .21988   0.9364   0.349   -.225072      .636856
            Robust |  .20589     .23308   0.8834   0.377   -.250934      .662717
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        152
-------------------+----------------------            BW type       =     Manual
     Number of obs |        79          73            Kernel        =    Uniform
Eff. Number of obs |        79          73            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04405     .15985   0.2755   0.783   -.269261      .357351
    Bias-corrected |  .18027     .15985   1.1278   0.259   -.133032       .49358
            Robust |  .18027     .22441   0.8033   0.422   -.259563      .620112
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2353
-------------------+----------------------            BW type       =      mserd
     Number of obs |       808        1545            Kernel        = Epanechnikov
Eff. Number of obs |        93         109            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.298      49.298
       BW bias (b) |    93.327      93.327
         rho (h/b) |     0.528       0.528
        Unique obs |       286         247

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05981      .1439   0.4156   0.678   -.222238      .341853
    Bias-corrected |  .09698      .1439   0.6739   0.500    -.18507      .379021
            Robust |  .09698     .16254   0.5966   0.551   -.221596      .415547
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_5 SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         161            Kernel        =    Uniform
Eff. Number of obs |       141         161            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        915
-------------------+----------------------            BW type       =     Manual
     Number of obs |       419         496            Kernel        =    Uniform
Eff. Number of obs |       419         496            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6947
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3682        3265            Kernel        = Epanechnikov
Eff. Number of obs |      3681        3265            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       381         281

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *2_2_2) rdrobust on higheredu, sheet 2, province-clustered no omitting local variables
. 
. **2_2_2_1 Pooled 
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        396
-------------------+----------------------            BW type       =     Manual
     Number of obs |       188         208            Kernel        =    Uniform
Eff. Number of obs |       188         208            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0329     .04436   0.7417   0.458   -.054039      .119843
    Bias-corrected | -.02967     .04436   -0.6688  0.504    -.11661      .057272
            Robust | -.02967     .05592   -0.5306  0.596   -.139269      .079932
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", replace ctitle(province-cluster
> ed no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1189
-------------------+----------------------            BW type       =     Manual
     Number of obs |       550         639            Kernel        =    Uniform
Eff. Number of obs |       550         639            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00893     .02317   -0.3852  0.700   -.054345      .036492
    Bias-corrected |  .03169     .02317   1.3676   0.171   -.013727       .07711
            Robust |  .03169     .02995   1.0582   0.290   -.027007       .09039
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat != ., covs(male tenure
>  tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10316
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4688        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1092        1214            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.105      67.105
       BW bias (b) |    92.663      92.663
         rho (h/b) |     0.724       0.724
        Unique obs |       388         283
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01776      .0288   -0.6168  0.537   -.074208      .038682
    Bias-corrected | -.00966      .0288   -0.3355  0.737   -.066109      .046782
            Robust | -.00966      .0301   -0.3210  0.748   -.068664      .049336
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & (educat
> ==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster prov
> ince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         94
-------------------+----------------------            BW type       =     Manual
     Number of obs |        47          47            Kernel        =    Uniform
Eff. Number of obs |        47          47            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        13          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13956     .16141   0.8646   0.387   -.176802      .455926
    Bias-corrected | -.01637     .16141   -0.1014  0.919   -.332737      .299991
            Robust | -.01637     .17244   -0.0949  0.924   -.354348      .321602
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & (educat
> ==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster prov
> ince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        274
-------------------+----------------------            BW type       =     Manual
     Number of obs |       131         143            Kernel        =    Uniform
Eff. Number of obs |       131         143            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00142     .08509   0.0167   0.987    -.16535      .168188
    Bias-corrected |  .10819     .08509   1.2715   0.204   -.058583      .274955
            Robust |  .10819     .13352   0.8102   0.418   -.153518       .36989
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat==2), covs
> (male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3369
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1006        2363            Kernel        = Epanechnikov
Eff. Number of obs |       198         269            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.467      62.467
       BW bias (b) |    91.918      91.918
         rho (h/b) |     0.680       0.680
        Unique obs |       306         261
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00548      .0885   -0.0619  0.951   -.178941      .167989
    Bias-corrected |  .02941      .0885   0.3323   0.740   -.144051      .202879
            Robust |  .02941     .09802   0.3001   0.764   -.162702      .221529
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_3 SecVoc
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11807     .16234   0.7273   0.467   -.200102      .436249
    Bias-corrected | -.29681     .16234   -1.8283  0.067   -.614982      .021369
            Robust | -.29681     .20937   -1.4176  0.156   -.707165      .113551
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        122
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          70            Kernel        =    Uniform
Eff. Number of obs |        52          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03473     .11166   0.3110   0.756   -.184117      .253578
    Bias-corrected |  .08876     .11166   0.7949   0.427   -.130091      .307603
            Robust |  .08876     .20236   0.4386   0.661   -.307863      .485375
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1016
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         818            Kernel        = Epanechnikov
Eff. Number of obs |        90         128            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.947      71.947
       BW bias (b) |   109.745     109.745
         rho (h/b) |     0.656       0.656
        Unique obs |       132         235
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02233     .09469   0.2358   0.814   -.163251      .207914
    Bias-corrected |  .04054     .09469   0.4282   0.669   -.145041      .226125
            Robust |  .04054     .11038   0.3673   0.713   -.175798      .256882
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_4 SecGen
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         42
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          19            Kernel        =    Uniform
Eff. Number of obs |        23          19            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |         9          10

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .26378     .20322   1.2980   0.194   -.134517       .66208
    Bias-corrected |  .20589     .20322   1.0132   0.311   -.192407      .604191
            Robust |  .20589     .25313   0.8134   0.416   -.290225      .702008
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        152
-------------------+----------------------            BW type       =     Manual
     Number of obs |        79          73            Kernel        =    Uniform
Eff. Number of obs |        79          73            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04405     .13816   0.3188   0.750   -.226745      .314835
    Bias-corrected |  .18027     .13816   1.3048   0.192   -.090516      .451064
            Robust |  .18027      .1759   1.0249   0.305   -.164478      .525027
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2353
-------------------+----------------------            BW type       =      mserd
     Number of obs |       808        1545            Kernel        = Epanechnikov
Eff. Number of obs |        92         105            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    48.736      48.736
       BW bias (b) |    89.246      89.246
         rho (h/b) |     0.546       0.546
        Unique obs |       286         247
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06025     .13098   0.4600   0.646    -.19647      .316973
    Bias-corrected |  .09506     .13098   0.7257   0.468   -.161664      .351779
            Robust |  .09506     .14931   0.6366   0.524   -.197591      .387707
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_5 SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat 
> ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         161            Kernel        =    Uniform
Eff. Number of obs |       141         161            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat 
> ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        915
-------------------+----------------------            BW type       =     Manual
     Number of obs |       419         496            Kernel        =    Uniform
Eff. Number of obs |       419         496            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6947
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3682        3265            Kernel        = Epanechnikov
Eff. Number of obs |      3681        3265            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       381         281
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *2_2_3) rdrobust on higheredu, sheet 3, no province no Aug-Sep
. 
. **2_2_3_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        361
-------------------+----------------------            BW type       =     Manual
     Number of obs |       176         185            Kernel        =    Uniform
Eff. Number of obs |       176         185            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03732     .04419   0.8445   0.398    -.04929      .123921
    Bias-corrected | -.09138     .04419   -2.0681  0.039   -.177988     -.004777
            Robust | -.09138     .07787   -1.1736  0.241   -.243999      .061234
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", replace ctitle(no province no A
> ug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       538         616            Kernel        =    Uniform
Eff. Number of obs |       538         616            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01106     .02718   -0.4070  0.684   -.064333      .042211
    Bias-corrected |  .03478     .02718   1.2795   0.201   -.018496      .088047
            Robust |  .03478     .04031   0.8627   0.388   -.044231      .113783
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat != .,
>  covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10281
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4676        5605            Kernel        = Epanechnikov
Eff. Number of obs |       816         908            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.688      52.688
       BW bias (b) |    87.735      87.735
         rho (h/b) |     0.601       0.601
        Unique obs |       387         282

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01628     .02317   -0.7026  0.482   -.061698      .029135
    Bias-corrected | -.01087     .02317   -0.4691  0.639   -.056288      .034545
            Robust | -.01087     .02725   -0.3990  0.690   -.064279      .042536
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         82
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          40            Kernel        =    Uniform
Eff. Number of obs |        42          40            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21056     .20375   1.0334   0.301   -.188779      .609907
    Bias-corrected | -.34395     .20375   -1.6881  0.091   -.743293      .055393
            Robust | -.34395     .38225   -0.8998  0.368   -1.09314      .405241
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       126         136            Kernel        =    Uniform
Eff. Number of obs |       126         136            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00727     .11345   -0.0641  0.949   -.229624      .215086
    Bias-corrected |  .12853     .11345   1.1329   0.257   -.093829      .350881
            Robust |  .12853     .19041   0.6750   0.500   -.244677      .501728
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (educat==1 |
>  educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3357
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1001        2356            Kernel        = Epanechnikov
Eff. Number of obs |       168         229            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.197      55.197
       BW bias (b) |    97.629      97.629
         rho (h/b) |     0.565       0.565
        Unique obs |       305         260

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00135     .09344   0.0145   0.988   -.181779       .18448
    Bias-corrected |  .02661     .09344   0.2848   0.776   -.156522      .209738
            Robust |  .02661     .10997   0.2420   0.809   -.188933       .24215
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09994     .16149   0.6188   0.536   -.216579      .416456
    Bias-corrected | -.61122     .16149   -3.7848  0.000   -.927737     -.294702
            Robust | -.61122     .26729   -2.2867  0.022    -1.1351      -.08734
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        117
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          66            Kernel        =    Uniform
Eff. Number of obs |        51          66            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01611      .1188   0.1356   0.892   -.216728      .248945
    Bias-corrected |  .05999      .1188   0.5050   0.614   -.172848      .292825
            Robust |  .05999     .16824   0.3566   0.721   -.269746      .389723
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==1, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1011
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         814            Kernel        = Epanechnikov
Eff. Number of obs |        78         110            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.690      65.690
       BW bias (b) |   107.197     107.197
         rho (h/b) |     0.613       0.613
        Unique obs |       131         234

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00553     .09524   0.0581   0.954   -.181143      .192202
    Bias-corrected |  .02118     .09524   0.2224   0.824   -.165489      .207856
            Robust |  .02118     .10973   0.1931   0.847   -.193878      .236246
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         35
-------------------+----------------------            BW type       =     Manual
     Number of obs |        19          16            Kernel        =    Uniform
Eff. Number of obs |        19          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .53778     .45781   1.1747   0.240   -.359513      1.43507
    Bias-corrected |  1.4436     .45781   3.1533   0.002    .546321      2.34091
            Robust |  1.4436      1.527   0.9454   0.344   -1.54921      4.43644
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        75          70            Kernel        =    Uniform
Eff. Number of obs |        75          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03314     .19398   0.1708   0.864   -.347059      .413329
    Bias-corrected |  .27388     .19398   1.4119   0.158   -.106312      .654077
            Robust |  .27388     .37035   0.7395   0.460   -.451983      .999748
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==2, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2346
-------------------+----------------------            BW type       =      mserd
     Number of obs |       804        1542            Kernel        = Epanechnikov
Eff. Number of obs |       105         140            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.797      58.797
       BW bias (b) |   108.165     108.165
         rho (h/b) |     0.544       0.544
        Unique obs |       285         246

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05668     .14717   0.3851   0.700    -.23178      .345131
    Bias-corrected |  .09121     .14717   0.6197   0.535   -.197249      .379663
            Robust |  .09121     .17192   0.5305   0.596   -.245754      .428167
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        279
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         145            Kernel        =    Uniform
Eff. Number of obs |       134         145            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        892
-------------------+----------------------            BW type       =     Manual
     Number of obs |       412         480            Kernel        =    Uniform
Eff. Number of obs |       412         480            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==3, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6924
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3675        3249            Kernel        = Epanechnikov
Eff. Number of obs |      3674        3249            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       380         280

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *2_2_4) rdrobust on higheredu, sheet 4, province-clustered no Aug-Sep
. 
. **2_2_4_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster
>  province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        361
-------------------+----------------------            BW type       =     Manual
     Number of obs |       176         185            Kernel        =    Uniform
Eff. Number of obs |       176         185            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03732     .04946   0.7545   0.451   -.059621      .134252
    Bias-corrected | -.09138     .04946   -1.8477  0.065    -.18832      .005554
            Robust | -.09138     .09077   -1.0067  0.314   -.269294      .086529
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", replace ctitle(province-cluster
> ed no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster
>  province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       538         616            Kernel        =    Uniform
Eff. Number of obs |       538         616            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01106       .024   -0.4609  0.645     -.0581      .035978
    Bias-corrected |  .03478       .024   1.4490   0.147   -.012264      .081815
            Robust |  .03478     .03145   1.1057   0.269   -.026867      .096418
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat != .,
>  covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_co
> de)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10281
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4676        5605            Kernel        = Epanechnikov
Eff. Number of obs |      1040        1153            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.792      65.792
       BW bias (b) |    96.422      96.422
         rho (h/b) |     0.682       0.682
        Unique obs |       387         282
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02018     .02858   -0.7061  0.480   -.076198      .035838
    Bias-corrected | -.01215     .02858   -0.4252  0.671   -.068169      .043866
            Robust | -.01215      .0309   -0.3932  0.694   -.072717      .048415
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all v
> ce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         82
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          40            Kernel        =    Uniform
Eff. Number of obs |        42          40            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        13          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21056     .21646   0.9728   0.331   -.213694      .634822
    Bias-corrected | -.34395     .21646   -1.5890  0.112   -.768208      .080308
            Robust | -.34395     .46225   -0.7441  0.457   -1.24994      .562035
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all v
> ce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       126         136            Kernel        =    Uniform
Eff. Number of obs |       126         136            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00727     .09658   -0.0753  0.940   -.196566      .182027
    Bias-corrected |  .12853     .09658   1.3307   0.183   -.060771      .317822
            Robust |  .12853      .1819   0.7066   0.480   -.227999       .48505
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (educat==1 |
>  educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster
>  province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3357
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1001        2356            Kernel        = Epanechnikov
Eff. Number of obs |       193         266            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.140      63.140
       BW bias (b) |    98.114      98.114
         rho (h/b) |     0.644       0.644
        Unique obs |       305         260
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01232     .09494   -0.1298  0.897   -.198404      .173758
    Bias-corrected |  .02178     .09494   0.2294   0.819   -.164297      .207865
            Robust |  .02178     .10952   0.1989   0.842   -.192876      .236444
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09994      .1535   0.6511   0.515    -.20092      .400797
    Bias-corrected | -.61122      .1535   -3.9818  0.000   -.912078      -.31036
            Robust | -.61122      .3123   -1.9571  0.050   -1.22332      .000879
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        117
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          66            Kernel        =    Uniform
Eff. Number of obs |        51          66            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01611     .13049   0.1234   0.902   -.239653      .271869
    Bias-corrected |  .05999     .13049   0.4597   0.646   -.195772       .31575
            Robust |  .05999     .22222   0.2699   0.787   -.375561      .495539
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==1, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1011
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         814            Kernel        = Epanechnikov
Eff. Number of obs |        83         118            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.845      69.845
       BW bias (b) |   114.046     114.046
         rho (h/b) |     0.612       0.612
        Unique obs |       131         234
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01403     .09488   0.1479   0.882   -.171924       .19998
    Bias-corrected |  .02801     .09488   0.2953   0.768    -.15794      .213964
            Robust |  .02801     .11241   0.2492   0.803   -.192309      .248332
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         35
-------------------+----------------------            BW type       =     Manual
     Number of obs |        19          16            Kernel        =    Uniform
Eff. Number of obs |        19          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |         9           9

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .53778     .49881   1.0781   0.281   -.439863      1.51542
    Bias-corrected |  1.4436     .49881   2.8941   0.004    .465971      2.42126
            Robust |  1.4436     1.3506   1.0689   0.285   -1.20344      4.09067
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        75          70            Kernel        =    Uniform
Eff. Number of obs |        75          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03314     .18145   0.1826   0.855   -.322493      .388763
    Bias-corrected |  .27388     .18145   1.5094   0.131   -.081746      .629511
            Robust |  .27388     .32186   0.8509   0.395   -.356951      .904716
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==2, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2346
-------------------+----------------------            BW type       =      mserd
     Number of obs |       804        1542            Kernel        = Epanechnikov
Eff. Number of obs |        96         121            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.942      53.942
       BW bias (b) |   103.591     103.591
         rho (h/b) |     0.521       0.521
        Unique obs |       285         246
Number of clusters |        15          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05389     .15624   0.3449   0.730    -.25234      .360128
    Bias-corrected |   .0915     .15624   0.5856   0.558   -.214732      .397735
            Robust |   .0915     .17916   0.5107   0.610   -.259641      .442645
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        279
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         145            Kernel        =    Uniform
Eff. Number of obs |       134         145            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        892
-------------------+----------------------            BW type       =     Manual
     Number of obs |       412         480            Kernel        =    Uniform
Eff. Number of obs |       412         480            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==3, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6924
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3675        3249            Kernel        = Epanechnikov
Eff. Number of obs |      3674        3249            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       380         280
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *2_2_5) rdrobust on higheredu, sheet 5, no province no July-Oct
. 
. **2_2_5_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        329
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         169            Kernel        =    Uniform
Eff. Number of obs |       160         169            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04509     .06248   0.7217   0.470   -.077366      .167547
    Bias-corrected |  -.1846     .06248   -2.9545  0.003   -.307053     -.062141
            Robust |  -.1846     .14205   -1.2995  0.194   -.463005      .093811
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", replace ctitle(no province no J
> uly-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1122
-------------------+----------------------            BW type       =     Manual
     Number of obs |       522         600            Kernel        =    Uniform
Eff. Number of obs |       522         600            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01402     .03041   -0.4611  0.645   -.073613      .045574
    Bias-corrected |  .03878     .03041   1.2754   0.202   -.020813      .098373
            Robust |  .03878     .05152   0.7527   0.452   -.062203      .139763
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat != .,
>  covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10249
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4660        5589            Kernel        = Epanechnikov
Eff. Number of obs |       816         912            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.821      53.821
       BW bias (b) |    91.291      91.291
         rho (h/b) |     0.590       0.590
        Unique obs |       386         281

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01999     .02525   -0.7917  0.429   -.069485        .0295
    Bias-corrected | -.01452     .02525   -0.5750  0.565   -.064013      .034972
            Robust | -.01452     .03008   -0.4827  0.629   -.073485      .044443
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         79
-------------------+----------------------            BW type       =     Manual
     Number of obs |        41          38            Kernel        =    Uniform
Eff. Number of obs |        41          38            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2732     .24686   1.1067   0.268    -.21063       .75704
    Bias-corrected |  -.4317     .24686   -1.7488  0.080   -.915538      .052133
            Robust |  -.4317     .66829   -0.6460  0.518   -1.74154      .878131
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        259
-------------------+----------------------            BW type       =     Manual
     Number of obs |       125         134            Kernel        =    Uniform
Eff. Number of obs |       125         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00852     .11879   -0.0717  0.943   -.241344      .224308
    Bias-corrected |  .13708     .11879   1.1539   0.249   -.095748      .369905
            Robust |  .13708     .21564   0.6357   0.525   -.285575      .559732
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (educat==1 |
>  educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3354
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1000        2354            Kernel        = Epanechnikov
Eff. Number of obs |       170         231            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.104      56.104
       BW bias (b) |    99.714      99.714
         rho (h/b) |     0.563       0.563
        Unique obs |       304         259

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00026     .09598   -0.0027  0.998   -.188364      .187852
    Bias-corrected |  .02502     .09598   0.2607   0.794   -.163083      .213133
            Robust |  .02502     .11326   0.2210   0.825   -.196952      .247001
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08145     .19806   0.4112   0.681   -.306747      .469645
    Bias-corrected | -1.3093     .19806   -6.6103  0.000   -1.69745      -.92106
            Robust | -1.3093     .55094   -2.3764  0.017   -2.38908     -.229431
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        114
-------------------+----------------------            BW type       =     Manual
     Number of obs |        50          64            Kernel        =    Uniform
Eff. Number of obs |        50          64            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00233     .12988   0.0179   0.986   -.252241      .256895
    Bias-corrected |  .03387     .12988   0.2607   0.794   -.220702      .288433
            Robust |  .03387     .20205   0.1676   0.867   -.362154      .429885
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==1, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1008
-------------------+----------------------            BW type       =      mserd
     Number of obs |       196         812            Kernel        = Epanechnikov
Eff. Number of obs |        78         114            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.317      67.317
       BW bias (b) |   109.756     109.756
         rho (h/b) |     0.613       0.613
        Unique obs |       130         233

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00185     .10087   0.0183   0.985   -.195846      .199544
    Bias-corrected |  .01628     .10087   0.1614   0.872   -.181417      .213973
            Robust |  .01628     .11748   0.1386   0.890   -.213973      .246528
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         35
-------------------+----------------------            BW type       =     Manual
     Number of obs |        19          16            Kernel        =    Uniform
Eff. Number of obs |        19          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .53778     .45781   1.1747   0.240   -.359513      1.43507
    Bias-corrected |  1.4436     .45781   3.1533   0.002    .546321      2.34091
            Robust |  1.4436      1.527   0.9454   0.344   -1.54921      4.43644
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        75          70            Kernel        =    Uniform
Eff. Number of obs |        75          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03314     .19398   0.1708   0.864   -.347059      .413329
    Bias-corrected |  .27388     .19398   1.4119   0.158   -.106312      .654077
            Robust |  .27388     .37035   0.7395   0.460   -.451983      .999748
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==2, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2346
-------------------+----------------------            BW type       =      mserd
     Number of obs |       804        1542            Kernel        = Epanechnikov
Eff. Number of obs |       105         140            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.797      58.797
       BW bias (b) |   108.165     108.165
         rho (h/b) |     0.544       0.544
        Unique obs |       285         246

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05668     .14717   0.3851   0.700    -.23178      .345131
    Bias-corrected |  .09121     .14717   0.6197   0.535   -.197249      .379663
            Robust |  .09121     .17192   0.5305   0.596   -.245754      .428167
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        250
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         131            Kernel        =    Uniform
Eff. Number of obs |       119         131            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        863
-------------------+----------------------            BW type       =     Manual
     Number of obs |       397         466            Kernel        =    Uniform
Eff. Number of obs |       397         466            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==3, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6895
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3660        3235            Kernel        = Epanechnikov
Eff. Number of obs |      3659        3235            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       379         279

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *2_2_6) rdrobust on higheredu, sheet 6, province-clustered no July-Oct
. 
. **2_2_6_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster
>  province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        329
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         169            Kernel        =    Uniform
Eff. Number of obs |       160         169            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04509      .0675   0.6680   0.504   -.087207      .177389
    Bias-corrected |  -.1846      .0675   -2.7348  0.006   -.316895     -.052299
            Robust |  -.1846      .1711   -1.0789  0.281   -.519945      .150751
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", replace ctitle(province-cluster
> ed no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster
>  province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1122
-------------------+----------------------            BW type       =     Manual
     Number of obs |       522         600            Kernel        =    Uniform
Eff. Number of obs |       522         600            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01402     .02624   -0.5343  0.593   -.065449       .03741
    Bias-corrected |  .03878     .02624   1.4779   0.139   -.012649      .090209
            Robust |  .03878     .03983   0.9737   0.330   -.039283      .116842
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat != .,
>  covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_co
> de)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10249
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4660        5589            Kernel        = Epanechnikov
Eff. Number of obs |      1043        1153            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.218      66.218
       BW bias (b) |    98.714      98.714
         rho (h/b) |     0.671       0.671
        Unique obs |       386         281
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02253     .03087   -0.7299  0.465   -.083041      .037975
    Bias-corrected | -.01421     .03087   -0.4604  0.645    -.07472      .046296
            Robust | -.01421     .03443   -0.4128  0.680   -.081694       .05327
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all v
> ce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         79
-------------------+----------------------            BW type       =     Manual
     Number of obs |        41          38            Kernel        =    Uniform
Eff. Number of obs |        41          38            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        13          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2732     .25072   1.0897   0.276   -.218195      .764605
    Bias-corrected |  -.4317     .25072   -1.7219  0.085   -.923102      .059698
            Robust |  -.4317     .69208   -0.6238  0.533   -1.78816      .924751
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all v
> ce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        259
-------------------+----------------------            BW type       =     Manual
     Number of obs |       125         134            Kernel        =    Uniform
Eff. Number of obs |       125         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00852     .09877   -0.0862  0.931   -.202097      .185061
    Bias-corrected |  .13708     .09877   1.3879   0.165     -.0565      .330658
            Robust |  .13708     .19781   0.6930   0.488   -.250626      .524783
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (educat==1 |
>  educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster
>  province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3354
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1000        2354            Kernel        = Epanechnikov
Eff. Number of obs |       192         264            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.115      63.115
       BW bias (b) |    98.550      98.550
         rho (h/b) |     0.640       0.640
        Unique obs |       304         259
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01255     .09634   -0.1302  0.896   -.201365      .176273
    Bias-corrected |  .02168     .09634   0.2251   0.822   -.167137      .210501
            Robust |  .02168      .1117   0.1941   0.846   -.197252      .240615
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08145     .18086   0.4504   0.652   -.273024      .435922
    Bias-corrected | -1.3093     .18086   -7.2392  0.000   -1.66373     -.954783
            Robust | -1.3093     .68667   -1.9067  0.057   -2.65511      .036596
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        114
-------------------+----------------------            BW type       =     Manual
     Number of obs |        50          64            Kernel        =    Uniform
Eff. Number of obs |        50          64            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00233     .14033   0.0166   0.987   -.272705       .27736
    Bias-corrected |  .03387     .14033   0.2413   0.809   -.241167      .308898
            Robust |  .03387     .25998   0.1303   0.896   -.475689      .543419
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==1, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1008
-------------------+----------------------            BW type       =      mserd
     Number of obs |       196         812            Kernel        = Epanechnikov
Eff. Number of obs |        89         132            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    73.402      73.402
       BW bias (b) |   119.336     119.336
         rho (h/b) |     0.615       0.615
        Unique obs |       130         233
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01287     .09754   0.1319   0.895   -.178315      .204052
    Bias-corrected |  .02495     .09754   0.2558   0.798   -.166233      .216134
            Robust |  .02495     .11689   0.2135   0.831   -.204148      .254048
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         35
-------------------+----------------------            BW type       =     Manual
     Number of obs |        19          16            Kernel        =    Uniform
Eff. Number of obs |        19          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |         9           9

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .53778     .49881   1.0781   0.281   -.439863      1.51542
    Bias-corrected |  1.4436     .49881   2.8941   0.004    .465971      2.42126
            Robust |  1.4436     1.3506   1.0689   0.285   -1.20344      4.09067
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        145
-------------------+----------------------            BW type       =     Manual
     Number of obs |        75          70            Kernel        =    Uniform
Eff. Number of obs |        75          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03314     .18145   0.1826   0.855   -.322493      .388763
    Bias-corrected |  .27388     .18145   1.5094   0.131   -.081746      .629511
            Robust |  .27388     .32186   0.8509   0.395   -.356951      .904716
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==2, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2346
-------------------+----------------------            BW type       =      mserd
     Number of obs |       804        1542            Kernel        = Epanechnikov
Eff. Number of obs |        96         121            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.942      53.942
       BW bias (b) |   103.591     103.591
         rho (h/b) |     0.521       0.521
        Unique obs |       285         246
Number of clusters |        15          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05389     .15624   0.3449   0.730    -.25234      .360128
    Bias-corrected |   .0915     .15624   0.5856   0.558   -.214732      .397735
            Robust |   .0915     .17916   0.5107   0.610   -.259641      .442645
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        250
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         131            Kernel        =    Uniform
Eff. Number of obs |       119         131            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200,
>  16667) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        863
-------------------+----------------------            BW type       =     Manual
     Number of obs |       397         466            Kernel        =    Uniform
Eff. Number of obs |       397         466            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==3, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6895
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3660        3235            Kernel        = Epanechnikov
Eff. Number of obs |      3659        3235            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       379         279
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Rural/Higheredu Sheet 6 results.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Mal
> e Tenure controlled/Rural/Rural 1979 Higheredu ManualD MaleTenure controlled.log
  log type:  text
 closed on:   8 Aug 2024, 12:50:20
---------------------------------------------------------------------------------------------
