---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Mal
> e Tenure controlled/Urban 1979 Higheredu ManualD MaleTenure controlled.log
  log type:  text
 opened on:   6 Aug 2024, 17:20:01

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,431 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(33,372 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(5,190 real changes made)

. 
. *Step Two: Regressions (Three parts Ideally: Firstly rdrobust from birthmonth to earning; S
> econdly rdrobust from birthmonth to higheredu; Thirdly rdrobust*2 or rdrobust+OLS or ivregr
> ess from higheredu to earning. Each part has 6 sheets)
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11533      .0818   1.4099   0.159   -.044993       .27566
    Bias-corrected |   .1327      .0818   1.6223   0.105   -.027624       .29303
            Robust |   .1327     .12966   1.0235   0.306   -.121425      .386832
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07706     .05091   1.5137   0.130   -.022719      .176841
    Bias-corrected |   .1086     .05091   2.1333   0.033    .008822      .208382
            Robust |   .1086     .07283   1.4911   0.136   -.034149      .251353
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      2379        2604            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.560      62.560
       BW bias (b) |    95.495      95.495
         rho (h/b) |     0.655       0.655
        Unique obs |       370         261

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03911     .04136   0.9457   0.344    -.04195      .120176
    Bias-corrected |  .04138     .04136   1.0004   0.317   -.039688      .122438
            Robust |  .04138     .04937   0.8381   0.402   -.055385      .138135
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07426      .1075   0.6908   0.490   -.136435      .284965
    Bias-corrected |  .11574      .1075   1.0767   0.282   -.094958      .326442
            Robust |  .11574     .16312   0.7096   0.478   -.203962      .435447
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11779      .0652   1.8067   0.071   -.009996      .245575
    Bias-corrected |  .07335      .0652   1.1250   0.261   -.054436      .201134
            Robust |  .07335     .09449   0.7763   0.438   -.111846      .258544
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      1509        1903            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.755      63.755
       BW bias (b) |    96.647      96.647
         rho (h/b) |     0.660       0.660
        Unique obs |       320         248

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06477     .05285   1.2256   0.220   -.038807      .168342
    Bias-corrected |  .06602     .05285   1.2494   0.212   -.037551      .169598
            Robust |  .06602     .06326   1.0436   0.297   -.057974       .19002
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10655     .18331   -0.5813  0.561   -.465828      .252719
    Bias-corrected | -.11588     .18331   -0.6322  0.527   -.475155      .243392
            Robust | -.11588     .27284   -0.4247  0.671   -.650631      .418868
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13436     .10565   1.2717   0.203   -.072714      .341433
    Bias-corrected |  .03763     .10565   0.3561   0.722   -.169446        .2447
            Robust |  .03763      .1575   0.2389   0.811   -.271068      .346321
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       576         600            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.040      70.040
       BW bias (b) |   110.780     110.780
         rho (h/b) |     0.632       0.632
        Unique obs |       236         243

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09651     .07975   1.2101   0.226   -.059798      .252815
    Bias-corrected |  .10794     .07975   1.3535   0.176   -.048363      .264251
            Robust |  .10794     .09583   1.1264   0.260   -.079887      .295775
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16452     .13104   1.2555   0.209   -.092313      .421353
    Bias-corrected |  .23262     .13104   1.7752   0.076   -.024217      .489448
            Robust |  .23262     .20126   1.1558   0.248   -.161846      .627077
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10718     .08109   1.3216   0.186   -.051766      .266119
    Bias-corrected |  .09361     .08109   1.1543   0.248   -.065337      .252548
            Robust |  .09361     .11729   0.7981   0.425   -.136276      .323487
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |       975        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.329      62.329
       BW bias (b) |    95.581      95.581
         rho (h/b) |     0.652       0.652
        Unique obs |       315         237

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04209     .06722   0.6263   0.531   -.089648      .173838
    Bias-corrected |  .03131     .06722   0.4658   0.641   -.100436      .163049
            Robust |  .03131     .07954   0.3936   0.694   -.124581      .187194
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        305
-------------------+----------------------            BW type       =     Manual
     Number of obs |       171         134            Kernel        =    Uniform
Eff. Number of obs |       171         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17615     .10957   1.6077   0.108   -.038595      .390903
    Bias-corrected |  .26168     .10957   2.3883   0.017    .046931      .476429
            Robust |  .26168     .16956   1.5433   0.123   -.070655      .594015
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        879
-------------------+----------------------            BW type       =     Manual
     Number of obs |       452         427            Kernel        =    Uniform
Eff. Number of obs |       452         427            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01767     .07801   -0.2265  0.821   -.170561      .135225
    Bias-corrected |  .13831     .07801   1.7730   0.076   -.014586        .2912
            Robust |  .13831     .10578   1.3075   0.191    -.06901      .345624
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5468
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3700        1768            Kernel        = Epanechnikov
Eff. Number of obs |       869         715            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.153      61.153
       BW bias (b) |    94.183      94.183
         rho (h/b) |     0.649       0.649
        Unique obs |       356         245

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03231     .06313   -0.5118  0.609   -.156049      .091424
    Bias-corrected | -.03506     .06313   -0.5554  0.579     -.1588      .088673
            Robust | -.03506     .07521   -0.4662  0.641   -.182479      .112352
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11533     .10521   1.0963   0.273   -.090868      .321535
    Bias-corrected |   .1327     .10521   1.2614   0.207   -.073499      .338905
            Robust |   .1327     .17482   0.7591   0.448   -.209939      .475346
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07706     .06538   1.1787   0.239    -.05108      .205202
    Bias-corrected |   .1086     .06538   1.6611   0.097   -.019539      .236743
            Robust |   .1086     .09355   1.1609   0.246   -.074749      .291953
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      2798        2981            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    72.357      72.357
       BW bias (b) |    92.382      92.382
         rho (h/b) |     0.783       0.783
        Unique obs |       370         261
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0337     .06073   0.5548   0.579   -.085337      .152727
    Bias-corrected |  .03772     .06073   0.6211   0.535    -.08131      .156754
            Robust |  .03772     .06499   0.5805   0.562   -.089651      .165094
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07426     .14624   0.5078   0.612   -.212364      .360894
    Bias-corrected |  .11574     .14624   0.7914   0.429   -.170887      .402371
            Robust |  .11574      .2192   0.5280   0.597   -.313884      .545369
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11779     .08727   1.3497   0.177   -.053255      .288834
    Bias-corrected |  .07335     .08727   0.8405   0.401   -.097695      .244394
            Robust |  .07335      .1191   0.6159   0.538   -.160074      .306772
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provinc
> e_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      1952        2452            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    81.584      81.584
       BW bias (b) |    96.051      96.051
         rho (h/b) |     0.849       0.849
        Unique obs |       320         248
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05513     .08304   0.6639   0.507   -.107622      .217882
    Bias-corrected |  .05802     .08304   0.6987   0.485   -.104733      .220771
            Robust |  .05802      .0894   0.6490   0.516   -.117205      .233243
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10655     .19959   -0.5339  0.593   -.497745      .284636
    Bias-corrected | -.11588     .19959   -0.5806  0.562   -.507072      .275309
            Robust | -.11588     .29328   -0.3951  0.693   -.690694       .45893
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13436     .11503   1.1680   0.243   -.091105      .359824
    Bias-corrected |  .03763     .11503   0.3271   0.744   -.187838      .263091
            Robust |  .03763     .19353   0.1944   0.846   -.341694      .416948
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       555         584            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.593      67.593
       BW bias (b) |   104.549     104.549
         rho (h/b) |     0.647       0.647
        Unique obs |       236         243
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10168     .10279   0.9893   0.323   -.099776      .303145
    Bias-corrected |  .11973     .10279   1.1649   0.244   -.081727      .321193
            Robust |  .11973     .11806   1.0141   0.311   -.111668      .351134
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16452     .14033   1.1723   0.241   -.110531      .439571
    Bias-corrected |  .23262     .14033   1.6576   0.097   -.042436      .507667
            Robust |  .23262     .25191   0.9234   0.356   -.261122      .726353
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10718     .09624   1.1136   0.265    -.08145      .295802
    Bias-corrected |  .09361     .09624   0.9726   0.331   -.095021      .282232
            Robust |  .09361     .11917   0.7855   0.432   -.139967      .327178
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |      1275        1746            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.978      80.978
       BW bias (b) |    94.272      94.272
         rho (h/b) |     0.859       0.859
        Unique obs |       315         237
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04618     .08858   0.5213   0.602   -.127432      .219791
    Bias-corrected |  .02815     .08858   0.3178   0.751    -.14546      .201763
            Robust |  .02815     .09203   0.3059   0.760   -.152224      .208527
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        305
-------------------+----------------------            BW type       =     Manual
     Number of obs |       171         134            Kernel        =    Uniform
Eff. Number of obs |       171         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17615     .09694   1.8171   0.069   -.013852      .366159
    Bias-corrected |  .26168     .09694   2.6993   0.007    .071675      .451686
            Robust |  .26168     .12362   2.1167   0.034    .019381       .50398
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        879
-------------------+----------------------            BW type       =     Manual
     Number of obs |       452         427            Kernel        =    Uniform
Eff. Number of obs |       452         427            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01767     .06028   -0.2931  0.769   -.135819      .100483
    Bias-corrected |  .13831     .06028   2.2943   0.022    .020156      .256458
            Robust |  .13831     .10237   1.3510   0.177   -.062339      .338953
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(mal
> e tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5468
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3700        1768            Kernel        = Epanechnikov
Eff. Number of obs |       909         734            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.541      63.541
       BW bias (b) |    96.148      96.148
         rho (h/b) |     0.661       0.661
        Unique obs |       356         245
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03152     .06101   -0.5166  0.605   -.151094       .08806
    Bias-corrected | -.03334     .06101   -0.5464  0.585   -.152912      .086242
            Robust | -.03334     .07026   -0.4745  0.635   -.171033      .104363
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04482     .09615   0.4662   0.641   -.143623      .233268
    Bias-corrected |  -.0529     .09615   -0.5502  0.582   -.241345      .135545
            Robust |  -.0529     .17585   -0.3008  0.764   -.397552      .291752
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04767     .05442   0.8760   0.381    -.05899      .154328
    Bias-corrected |  .05185     .05442   0.9529   0.341   -.054805      .158513
            Robust |  .05185     .08252   0.6284   0.530   -.109882      .213591
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      2399        2614            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.163      64.163
       BW bias (b) |   102.759     102.759
         rho (h/b) |     0.624       0.624
        Unique obs |       369         260

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01156     .04255   0.2718   0.786   -.071829      .094954
    Bias-corrected |  .00458     .04255   0.1077   0.914    -.07881      .087973
            Robust |  .00458     .05099   0.0898   0.928   -.095353      .104516
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03432     .13032   -0.2634  0.792   -.289749      .221102
    Bias-corrected | -.12556     .13032   -0.9635  0.335   -.380986      .129865
            Robust | -.12556     .23309   -0.5387  0.590     -.5824      .331279
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09325     .06988   1.3344   0.182   -.043711      .230212
    Bias-corrected | -.00624     .06988   -0.0892  0.929   -.143198      .130725
            Robust | -.00624     .10855   -0.0575  0.954   -.218995      .206521
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1473        1858            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.224      63.224
       BW bias (b) |   102.564     102.564
         rho (h/b) |     0.616       0.616
        Unique obs |       319         247

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04091     .05532   0.7395   0.460   -.067521      .149344
    Bias-corrected |   .0301     .05532   0.5440   0.586   -.078335      .138531
            Robust |   .0301     .06615   0.4550   0.649   -.099553      .159749
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13188     .22229   -0.5933  0.553    -.56757      .303811
    Bias-corrected | -.22581     .22229   -1.0158  0.310     -.6615       .20988
            Robust | -.22581     .41795   -0.5403  0.589   -1.04498      .593356
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17838     .11093   1.6080   0.108   -.039039      .395807
    Bias-corrected |  .09723     .11093   0.8765   0.381   -.120193      .314653
            Robust |  .09723     .17713   0.5489   0.583    -.24993       .44439
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       485         525            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.228      60.228
       BW bias (b) |   104.094     104.094
         rho (h/b) |     0.579       0.579
        Unique obs |       235         242

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15393     .08761   1.7570   0.079   -.017785      .325646
    Bias-corrected |  .17821     .08761   2.0341   0.042    .006494      .349925
            Robust |  .17821     .10379   1.7170   0.086   -.025219      .381638
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00658     .16092   -0.0409  0.967   -.321971      .308808
    Bias-corrected | -.13848     .16092   -0.8606  0.389   -.453873      .176906
            Robust | -.13848     .28553   -0.4850  0.628    -.69812      .421154
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04529     .08784   0.5156   0.606   -.126873      .217459
    Bias-corrected | -.05473     .08784   -0.6230  0.533   -.226892      .117441
            Robust | -.05473     .13688   -0.3998  0.689   -.323012      .213561
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |       872        1169            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.448      58.448
       BW bias (b) |   103.688     103.688
         rho (h/b) |     0.564       0.564
        Unique obs |       314         236

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00847     .07319   -0.1158  0.908    -.15192      .134972
    Bias-corrected | -.03287     .07319   -0.4491  0.653   -.176315      .110576
            Robust | -.03287      .0845   -0.3890  0.697   -.198485      .132745
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        283
-------------------+----------------------            BW type       =     Manual
     Number of obs |       163         120            Kernel        =    Uniform
Eff. Number of obs |       163         120            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1377     .13365   1.0303   0.303   -.124253      .399645
    Bias-corrected |  .16174     .13365   1.2102   0.226   -.100211      .423686
            Robust |  .16174     .25027   0.6463   0.518   -.328775       .65225
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        857
-------------------+----------------------            BW type       =     Manual
     Number of obs |       444         413            Kernel        =    Uniform
Eff. Number of obs |       444         413            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05323     .08468   -0.6287  0.530   -.219202      .112733
    Bias-corrected |  .09667     .08468   1.1416   0.254   -.069302      .262633
            Robust |  .09667     .12356   0.7823   0.434   -.145508       .33884
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5446
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3692        1754            Kernel        = Epanechnikov
Eff. Number of obs |       861         701            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.366      61.366
       BW bias (b) |    98.329      98.329
         rho (h/b) |     0.624       0.624
        Unique obs |       355         244

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06013     .06685   -0.8994  0.368   -.191165        .0709
    Bias-corrected | -.06851     .06685   -1.0248  0.305   -.199545       .06252
            Robust | -.06851     .08003   -0.8561  0.392   -.225373      .088349
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04482     .08922   0.5024   0.615   -.130037      .219682
    Bias-corrected |  -.0529     .08922   -0.5929  0.553   -.227759      .121959
            Robust |  -.0529     .19484   -0.2715  0.786    -.43477       .32897
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04767     .06757   0.7055   0.481   -.084768      .180105
    Bias-corrected |  .05185     .06757   0.7674   0.443   -.080582      .184291
            Robust |  .05185     .09663   0.5366   0.592   -.137536      .241245
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pr
> ovince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      2723        2871            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.059      71.059
       BW bias (b) |    98.283      98.283
         rho (h/b) |     0.723       0.723
        Unique obs |       369         260
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00987     .06126   0.1612   0.872   -.110193      .129938
    Bias-corrected |  .00182     .06126   0.0298   0.976   -.118241      .121889
            Robust |  .00182     .06738   0.0271   0.978   -.130236      .133883
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03432     .12732   -0.2696  0.787   -.283864      .215217
    Bias-corrected | -.12556     .12732   -0.9862  0.324   -.375101       .12398
            Robust | -.12556      .2652   -0.4735  0.636   -.645334      .394213
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09325     .08754   1.0653   0.287   -.078316      .264817
    Bias-corrected | -.00624     .08754   -0.0712  0.943   -.177803       .16533
            Robust | -.00624     .11382   -0.0548  0.956   -.229318      .216845
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(
> nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1819        2293            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.625      77.625
       BW bias (b) |    93.866      93.866
         rho (h/b) |     0.827       0.827
        Unique obs |       319         247
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03331     .08501   0.3919   0.695   -.133304      .199933
    Bias-corrected |  .02597     .08501   0.3055   0.760   -.140645      .192592
            Robust |  .02597      .0926   0.2805   0.779    -.15551      .207457
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13188     .17337   -0.7607  0.447   -.471679       .20792
    Bias-corrected | -.22581     .17337   -1.3025  0.193    -.56561      .113989
            Robust | -.22581     .39478   -0.5720  0.567   -.999567      .547946
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17838     .09843   1.8123   0.070   -.014532        .3713
    Bias-corrected |  .09723     .09843   0.9878   0.323   -.095686      .290146
            Robust |  .09723     .17022   0.5712   0.568   -.236394      .430854
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       429         470            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.146      53.146
       BW bias (b) |    97.131      97.131
         rho (h/b) |     0.547       0.547
        Unique obs |       235         242
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17097     .09467   1.8060   0.071   -.014574      .356519
    Bias-corrected |  .20033     .09467   2.1161   0.034    .014785      .385878
            Robust |  .20033     .10842   1.8477   0.065   -.012167       .41283
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00658     .14303   -0.0460  0.963   -.286921      .273758
    Bias-corrected | -.13848     .14303   -0.9682  0.333   -.418822      .141856
            Robust | -.13848     .31249   -0.4432  0.658   -.750956      .473989
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04529     .10505   0.4311   0.666   -.160606      .251192
    Bias-corrected | -.05473     .10505   -0.5209  0.602   -.260624      .151174
            Robust | -.05473     .13198   -0.4146  0.678   -.313401       .20395
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |      1085        1463            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.176      70.176
       BW bias (b) |    97.322      97.322
         rho (h/b) |     0.721       0.721
        Unique obs |       314         236
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00978     .09712   -0.1007  0.920   -.200124      .180565
    Bias-corrected | -.04633     .09712   -0.4771  0.633   -.236675      .144014
            Robust | -.04633     .10579   -0.4380  0.661   -.253668      .161006
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        283
-------------------+----------------------            BW type       =     Manual
     Number of obs |       163         120            Kernel        =    Uniform
Eff. Number of obs |       163         120            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1377     .12536   1.0984   0.272      -.108      .383392
    Bias-corrected |  .16174     .12536   1.2902   0.197   -.083959      .407434
            Robust |  .16174     .17642   0.9168   0.359   -.184038      .507514
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        857
-------------------+----------------------            BW type       =     Manual
     Number of obs |       444         413            Kernel        =    Uniform
Eff. Number of obs |       444         413            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05323     .06236   -0.8537  0.393   -.175459       .06899
    Bias-corrected |  .09667     .06236   1.5501   0.121   -.025558       .21889
            Robust |  .09667     .11236   0.8603   0.390   -.123561      .316893
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5446
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3692        1754            Kernel        = Epanechnikov
Eff. Number of obs |       911         727            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.209      64.209
       BW bias (b) |   102.406     102.406
         rho (h/b) |     0.627       0.627
        Unique obs |       355         244
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05798     .06077   -0.9540  0.340   -.177082      .061132
    Bias-corrected | -.06371     .06077   -1.0483  0.295   -.182812      .055402
            Robust | -.06371     .07134   -0.8930  0.372   -.203521      .076111
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03373     .13163   0.2562   0.798   -.224269      .291727
    Bias-corrected | -.25144     .13163   -1.9102  0.056   -.509439      .006557
            Robust | -.25144     .31407   -0.8006  0.423   -.867012       .36413
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0449     .06051   0.7420   0.458   -.073704       .16351
    Bias-corrected |   .0447     .06051   0.7386   0.460    -.07391      .163303
            Robust |   .0447     .10264   0.4355   0.663   -.156482      .245875
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      2287        2489            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.579      62.579
       BW bias (b) |   105.116     105.116
         rho (h/b) |     0.595       0.595
        Unique obs |       368         259

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00659     .04625   0.1426   0.887   -.084045      .097235
    Bias-corrected | -.00308     .04625   -0.0665  0.947   -.093717      .087563
            Robust | -.00308     .05565   -0.0553  0.956    -.11215      .105997
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.08509     .17842   -0.4769  0.633   -.434794      .264613
    Bias-corrected | -.49676     .17842   -2.7842  0.005   -.846464     -.147057
            Robust | -.49676     .43763   -1.1351  0.256    -1.3545      .360975
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10189     .07715   1.3206   0.187   -.049328      .253099
    Bias-corrected | -.02472     .07715   -0.3204  0.749   -.175933      .126494
            Robust | -.02472     .13434   -0.1840  0.854   -.288031      .238592
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |      1370        1702            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.904      60.904
       BW bias (b) |   101.953     101.953
         rho (h/b) |     0.597       0.597
        Unique obs |       318         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04658     .06042   0.7710   0.441   -.071834      .164999
    Bias-corrected |  .03511     .06042   0.5812   0.561   -.083304      .153529
            Robust |  .03511     .07287   0.4818   0.630   -.107712      .177937
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.19921     .27438   -0.7260  0.468   -.736998      .338568
    Bias-corrected | -.71608     .27438   -2.6098  0.009   -1.25386     -.178298
            Robust | -.71608     .70854   -1.0106  0.312   -2.10479       .67263
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19001     .11861   1.6020   0.109   -.042455      .422477
    Bias-corrected |  .11797     .11861   0.9947   0.320   -.114493      .350438
            Robust |  .11797      .2017   0.5849   0.559   -.277345       .51329
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       455         501            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.559      58.559
       BW bias (b) |   103.723     103.723
         rho (h/b) |     0.565       0.565
        Unique obs |       234         241

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16571     .09293   1.7832   0.075   -.016431       .34785
    Bias-corrected |   .1922     .09293   2.0683   0.039    .010064      .374345
            Robust |   .1922     .11063   1.7373   0.082   -.024629      .409038
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00228      .2286   0.0100   0.992   -.445764      .450325
    Bias-corrected | -.38587      .2286   -1.6880  0.091   -.833918       .06217
            Robust | -.38587     .54268   -0.7111  0.477   -1.44951      .677757
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0543     .09826   0.5527   0.580   -.138282      .246892
    Bias-corrected | -.08211     .09826   -0.8357  0.403     -.2747      .110475
            Robust | -.08211     .17501   -0.4692  0.639   -.425133      .260908
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       799        1068            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.536      55.536
       BW bias (b) |   101.052     101.052
         rho (h/b) |     0.550       0.550
        Unique obs |       313         235

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01235     .08154   -0.1515  0.880   -.172163      .147461
    Bias-corrected | -.03974     .08154   -0.4874  0.626   -.199554       .12007
            Robust | -.03974     .09529   -0.4171  0.677     -.2265      .147017
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        249
-------------------+----------------------            BW type       =     Manual
     Number of obs |       151          98            Kernel        =    Uniform
Eff. Number of obs |       151          98            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12284     .20098   0.6112   0.541    -.27108      .516756
    Bias-corrected |  .12302     .20098   0.6121   0.540     -.2709      .516935
            Robust |  .12302     .48731   0.2524   0.801   -.832085      1.07812
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       432         391            Kernel        =    Uniform
Eff. Number of obs |       432         391            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10053     .09811   -1.0246  0.306   -.292833      .091768
    Bias-corrected |  .05247     .09811   0.5348   0.593    -.13983      .244772
            Robust |  .05247     .16502   0.3180   0.751   -.270957      .375899
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5412
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3680        1732            Kernel        = Epanechnikov
Eff. Number of obs |       870         691            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.749      62.749
       BW bias (b) |   106.622     106.622
         rho (h/b) |     0.589       0.589
        Unique obs |       354         243

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09277     .07298   -1.2711  0.204   -.235819      .050272
    Bias-corrected | -.10686     .07298   -1.4641  0.143   -.249903      .036189
            Robust | -.10686     .08799   -1.2144  0.225   -.279313      .065599
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03373     .11127   0.3031   0.762   -.184349      .251806
    Bias-corrected | -.25144     .11127   -2.2598  0.024   -.469519     -.033364
            Robust | -.25144      .3349   -0.7508  0.453   -.907829      .404946
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(
> nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0449     .07081   0.6341   0.526   -.093885      .183691
    Bias-corrected |   .0447     .07081   0.6312   0.528   -.094091      .183484
            Robust |   .0447     .11051   0.4045   0.686   -.171897      .261289
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pr
> ovince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      2439        2632            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.886      66.886
       BW bias (b) |   100.764     100.764
         rho (h/b) |     0.664       0.664
        Unique obs |       368         259
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00313     .06309   0.0496   0.960   -.120525      .126785
    Bias-corrected |  -.0078     .06309   -0.1236  0.902   -.131452      .115858
            Robust |  -.0078     .07101   -0.1098  0.913   -.146976      .131383
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.08509     .15704   -0.5418  0.588   -.392889      .222708
    Bias-corrected | -.49676     .15704   -3.1632  0.002   -.804559     -.188962
            Robust | -.49676      .4539   -1.0944  0.274   -1.38638      .392862
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(
> 36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10189     .09186   1.1091   0.267   -.078164      .281936
    Bias-corrected | -.02472     .09186   -0.2691  0.788   -.204769      .155331
            Robust | -.02472     .14298   -0.1729  0.863   -.304956      .255517
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(
> nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |      1613        2013            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.018      70.018
       BW bias (b) |    96.619      96.619
         rho (h/b) |     0.725       0.725
        Unique obs |       318         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0315     .08801   0.3579   0.720   -.141001      .204008
    Bias-corrected |  .02225     .08801   0.2528   0.800    -.15025      .194759
            Robust |  .02225     .10034   0.2218   0.824     -.1744      .218909
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.19921     .20408   -0.9761  0.329   -.599213      .200783
    Bias-corrected | -.71608     .20408   -3.5087  0.000   -1.11608     -.316083
            Robust | -.71608     .68163   -1.0505  0.293   -2.05204      .619882
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19001     .11421   1.6637   0.096   -.033843      .413865
    Bias-corrected |  .11797     .11421   1.0329   0.302   -.105881      .341826
            Robust |  .11797     .21834   0.5403   0.589   -.309958      .545903
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       437         483            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.095      55.095
       BW bias (b) |   101.974     101.974
         rho (h/b) |     0.540       0.540
        Unique obs |       234         241
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17985     .10122   1.7768   0.076   -.018539      .378232
    Bias-corrected |  .20628     .10122   2.0380   0.042    .007896      .404668
            Robust |  .20628     .11662   1.7688   0.077   -.022294      .434858
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00228     .16479   0.0138   0.989   -.320709       .32527
    Bias-corrected | -.38587     .16479   -2.3416  0.019   -.708864     -.062885
            Robust | -.38587     .51514   -0.7491  0.454   -1.39554      .623791
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0543     .11104   0.4890   0.625   -.163334      .271943
    Bias-corrected | -.08211     .11104   -0.7395  0.460   -.299751      .135526
            Robust | -.08211     .15897   -0.5165  0.605   -.393681      .229456
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       951        1302            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.796      64.796
       BW bias (b) |    97.199      97.199
         rho (h/b) |     0.667       0.667
        Unique obs |       313         235
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01428     .10406   -0.1372  0.891   -.218227      .189672
    Bias-corrected | -.05134     .10406   -0.4934  0.622   -.255289       .15261
            Robust | -.05134     .11693   -0.4391  0.661   -.280521      .177841
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        249
-------------------+----------------------            BW type       =     Manual
     Number of obs |       151          98            Kernel        =    Uniform
Eff. Number of obs |       151          98            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12284     .20627   0.5955   0.551   -.281439      .527116
    Bias-corrected |  .12302     .20627   0.5964   0.551    -.28126      .527295
            Robust |  .12302     .49495   0.2485   0.804   -.847064       1.0931
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       432         391            Kernel        =    Uniform
Eff. Number of obs |       432         391            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10053     .07487   -1.3428  0.179   -.247272      .046207
    Bias-corrected |  .05247     .07487   0.7008   0.483   -.094268       .19921
            Robust |  .05247      .1299   0.4039   0.686    -.20212      .307061
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5412
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3680        1732            Kernel        = Epanechnikov
Eff. Number of obs |       889         698            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.163      63.163
       BW bias (b) |   109.712     109.712
         rho (h/b) |     0.576       0.576
        Unique obs |       354         243
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09227     .06717   -1.3736  0.170   -.223921       .03939
    Bias-corrected | -.10672     .06717   -1.5887  0.112   -.238372      .024939
            Robust | -.10672     .08071   -1.3222  0.186   -.264912      .051479
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Earning Sheet 6 results.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *2_2) RDD Higheredu t
. 
. *2_2_1) rdrobust on higheredu, sheet 1, no province no omitting local variables
. 
. **2_2_1_1 Pooled 
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02619     .05855   0.4473   0.655    -.08857      .140944
    Bias-corrected | -.02056     .05855   -0.3511  0.726   -.135314      .094201
            Robust | -.02056     .08972   -0.2291  0.819   -.196397      .155285
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", replace ctitle(no province no l
> ocal adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05015     .03592   1.3963   0.163   -.020248      .120552
    Bias-corrected |  .03698     .03592   1.0295   0.303   -.033423      .107377
            Robust |  .03698     .05206   0.7103   0.478   -.065057      .139011
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat != ., covs(male tenure
>  tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      2077        2275            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.158      55.158
       BW bias (b) |    84.786      84.786
         rho (h/b) |     0.651       0.651
        Unique obs |       370         261

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02792     .03095   0.9021   0.367    -.03274      .088574
    Bias-corrected |  .02598     .03095   0.8394   0.401    -.03468      .086634
            Robust |  .02598     .03693   0.7034   0.482   -.046409      .098363
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & (educat
> ==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00738     .07215   0.1023   0.918   -.134027      .148792
    Bias-corrected |  .08531     .07215   1.1824   0.237   -.056101      .226718
            Robust |  .08531      .1051   0.8117   0.417   -.120685      .291302
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & (educat
> ==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06401     .04429   1.4454   0.148    -.02279      .150816
    Bias-corrected |  .00223     .04429   0.0504   0.960   -.084571      .089035
            Robust |  .00223     .06422   0.0348   0.972   -.123645      .128109
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat==2), covs
> (male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      1374        1721            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.713      58.713
       BW bias (b) |    90.681      90.681
         rho (h/b) |     0.647       0.647
        Unique obs |       320         248

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03653     .03728   0.9801   0.327   -.036529      .109597
    Bias-corrected |  .03147     .03728   0.8442   0.399   -.041595      .104531
            Robust |  .03147     .04439   0.7089   0.478   -.055537      .118474
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_3 SecVoc
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02458     .09965   -0.2467  0.805   -.219887      .170724
    Bias-corrected |  .10465     .09965   1.0502   0.294   -.090652      .299959
            Robust |  .10465     .12005   0.8718   0.383   -.130636      .339943
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08632     .06829   1.2640   0.206    -.04753      .220172
    Bias-corrected |  .02569     .06829   0.3762   0.707   -.108161       .15954
            Robust |  .02569     .09299   0.2763   0.782   -.156568      .207947
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       505         552            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.746      61.746
       BW bias (b) |    96.173      96.173
         rho (h/b) |     0.642       0.642
        Unique obs |       236         243

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04547     .05651   0.8047   0.421    -.06528      .156227
    Bias-corrected |  .05045     .05651   0.8929   0.372   -.060298      .161208
            Robust |  .05045     .06732   0.7494   0.454   -.081497      .182407
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_4 SecGen
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00893     .07687   0.1162   0.907   -.141723      .159591
    Bias-corrected |   .0447     .07687   0.5815   0.561   -.105955      .195359
            Robust |   .0447     .10917   0.4095   0.682   -.169275      .258678
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04372     .04764   0.9178   0.359   -.049649      .137096
    Bias-corrected |  .00403     .04764   0.0846   0.933   -.089343      .097402
            Robust |  .00403     .06875   0.0586   0.953   -.130709      .138768
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |       862        1148            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.621      56.621
       BW bias (b) |    90.920      90.920
         rho (h/b) |     0.623       0.623
        Unique obs |       315         237

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01721     .04076   0.4222   0.673    -.06268      .097096
    Bias-corrected |  .00703     .04076   0.1725   0.863   -.072858      .086918
            Robust |  .00703     .04776   0.1472   0.883   -.086577      .100637
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_5 SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        305
-------------------+----------------------            BW type       =     Manual
     Number of obs |       171         134            Kernel        =    Uniform
Eff. Number of obs |       171         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        879
-------------------+----------------------            BW type       =     Manual
     Number of obs |       452         427            Kernel        =    Uniform
Eff. Number of obs |       452         427            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5468
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3700        1768            Kernel        = Epanechnikov
Eff. Number of obs |      3699        1768            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       356         245

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 1 results.xls", append ctitle(no province no lo
> cal adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 1 results.xls
dir : seeout

. 
. *2_2_2) rdrobust on higheredu, sheet 2, province-clustered no omitting local variables
. 
. **2_2_2_1 Pooled 
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02619     .07019   0.3731   0.709   -.111378      .163752
    Bias-corrected | -.02056     .07019   -0.2929  0.770   -.158121      .117009
            Robust | -.02056     .08639   -0.2379  0.812   -.189884      .148771
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", replace ctitle(province-cluster
> ed no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05015     .05578   0.8991   0.369   -.059173      .159477
    Bias-corrected |  .03698     .05578   0.6629   0.507   -.072348      .146302
            Robust |  .03698     .06595   0.5607   0.575   -.092281      .166235
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat != ., covs(male tenure
>  tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      2489        2710            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.673      65.673
       BW bias (b) |    81.217      81.217
         rho (h/b) |     0.809       0.809
        Unique obs |       370         261
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02996     .04639   0.6460   0.518   -.060951      .120881
    Bias-corrected |  .02747     .04639   0.5923   0.554   -.063443      .118389
            Robust |  .02747      .0538   0.5106   0.610   -.077973      .132919
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & (educat
> ==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster prov
> ince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00738     .07842   0.0941   0.925    -.14632      .161086
    Bias-corrected |  .08531     .07842   1.0878   0.277   -.068394      .239011
            Robust |  .08531     .09873   0.8641   0.388   -.108193      .278811
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & (educat
> ==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster prov
> ince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06401     .05873   1.0899   0.276   -.051104       .17913
    Bias-corrected |  .00223     .05873   0.0380   0.970   -.112885      .117349
            Robust |  .00223     .07378   0.0303   0.976   -.142366       .14683
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat==2), covs
> (male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      1442        1781            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.774      60.774
       BW bias (b) |    88.025      88.025
         rho (h/b) |     0.690       0.690
        Unique obs |       320         248
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03734     .04991   0.7482   0.454   -.060485      .135175
    Bias-corrected |  .03227     .04991   0.6465   0.518    -.06556      .130099
            Robust |  .03227     .05991   0.5386   0.590   -.085157      .149696
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_3 SecVoc
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02458       .091   -0.2701  0.787   -.202937      .153773
    Bias-corrected |  .10465       .091   1.1500   0.250   -.073701      .283008
            Robust |  .10465     .10503   0.9964   0.319   -.101208      .310514
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08632     .07746   1.1145   0.265   -.065488      .238131
    Bias-corrected |  .02569     .07746   0.3317   0.740    -.12612      .177499
            Robust |  .02569      .0822   0.3125   0.755   -.135422      .186801
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       522         568            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.731      63.731
       BW bias (b) |    95.749      95.749
         rho (h/b) |     0.666       0.666
        Unique obs |       236         243
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04443     .06736   0.6596   0.509   -.087588      .176452
    Bias-corrected |  .04974     .06736   0.7385   0.460   -.082276      .181764
            Robust |  .04974     .07981   0.6233   0.533   -.106682       .20617
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_4 SecGen
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00893     .08936   0.1000   0.920   -.166213      .184081
    Bias-corrected |   .0447     .08936   0.5002   0.617   -.130445      .219849
            Robust |   .0447     .12006   0.3723   0.710   -.190604      .280008
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04372     .06666   0.6559   0.512    -.08693      .174377
    Bias-corrected |  .00403     .06666   0.0604   0.952   -.126624      .134683
            Robust |  .00403     .08974   0.0449   0.964   -.171865      .179924
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |       975        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.535      62.535
       BW bias (b) |    92.522      92.522
         rho (h/b) |     0.676       0.676
        Unique obs |       315         237
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02193     .05414   0.4050   0.685   -.084189      .128043
    Bias-corrected |  .00934     .05414   0.1725   0.863   -.096779      .115453
            Robust |  .00934      .0644   0.1450   0.885   -.116879      .135553
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_5 SecJun
. *One year each
. rdrobust higheredu t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat 
> ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        305
-------------------+----------------------            BW type       =     Manual
     Number of obs |       171         134            Kernel        =    Uniform
Eff. Number of obs |       171         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat 
> ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        879
-------------------+----------------------            BW type       =     Manual
     Number of obs |       452         427            Kernel        =    Uniform
Eff. Number of obs |       452         427            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(male tenure 
> tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5468
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3700        1768            Kernel        = Epanechnikov
Eff. Number of obs |      3699        1768            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       356         245
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 2 results.xls", append ctitle(province-clustere
> d no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 2 results.xls
dir : seeout

. 
. *2_2_3) rdrobust on higheredu, sheet 3, no province no Aug-Sep
. 
. **2_2_3_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06549     .07025   0.9322   0.351   -.072194      .203165
    Bias-corrected |  .04608     .07025   0.6560   0.512   -.091596      .183764
            Robust |  .04608     .12988   0.3548   0.723   -.208474      .300642
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", replace ctitle(no province no A
> ug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06645     .03846   1.7276   0.084   -.008937      .141838
    Bias-corrected |  .07453     .03846   1.9378   0.053   -.000853      .149923
            Robust |  .07453     .05989   1.2445   0.213   -.042846      .191916
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat != .,
>  covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      1946        2126            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.650      53.650
       BW bias (b) |    85.771      85.771
         rho (h/b) |     0.626       0.626
        Unique obs |       369         260

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0392     .03294   1.1900   0.234   -.025363      .103763
    Bias-corrected |  .03959     .03294   1.2019   0.229   -.024971      .104154
            Robust |  .03959     .03964   0.9988   0.318   -.038101      .117284
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03531     .09018   0.3916   0.695   -.141432      .212054
    Bias-corrected |  .23425     .09018   2.5977   0.009    .057505      .410991
            Robust |  .23425     .16208   1.4453   0.148   -.083416      .551912
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08399       .048   1.7496   0.080   -.010097      .178068
    Bias-corrected |  .02387       .048   0.4972   0.619   -.070218      .117948
            Robust |  .02387     .07622   0.3131   0.754   -.125514      .173244
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (educat==1 |
>  educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1338        1676            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.743      58.743
       BW bias (b) |    93.586      93.586
         rho (h/b) |     0.628       0.628
        Unique obs |       319         247

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04768     .03933   1.2125   0.225   -.029396      .124759
    Bias-corrected |  .04427     .03933   1.1257   0.260    -.03281      .121345
            Robust |  .04427     .04748   0.9323   0.351   -.048792      .137327
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04027     .15305   -0.2631  0.792   -.340228      .259697
    Bias-corrected |  .05521     .15305   0.3607   0.718   -.244754      .355172
            Robust |  .05521      .2765   0.1997   0.842   -.486727      .597144
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09894     .07936   1.2467   0.213   -.056609      .254484
    Bias-corrected |  .02995     .07936   0.3774   0.706   -.125593      .185501
            Robust |  .02995      .1286   0.2329   0.816   -.222094      .282002
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==1, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       552         575            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.318      68.318
       BW bias (b) |   111.390     111.390
         rho (h/b) |     0.613       0.613
        Unique obs |       235         242

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04644     .05982   0.7764   0.438   -.070808      .163696
    Bias-corrected |  .05107     .05982   0.8537   0.393   -.066181      .168323
            Robust |  .05107     .07253   0.7041   0.481   -.091087      .193229
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04756     .09792   0.4857   0.627   -.144352      .239476
    Bias-corrected |  .19756     .09792   2.0177   0.044     .00565      .389478
            Robust |  .19756     .17448   1.1323   0.257   -.144404      .539533
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06338     .05202   1.2185   0.223   -.038571      .165333
    Bias-corrected |  .03481     .05202   0.6693   0.503   -.067137      .136766
            Robust |  .03481     .08293   0.4198   0.675   -.127727      .197356
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==2, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |       838        1119            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.437      56.437
       BW bias (b) |    91.939      91.939
         rho (h/b) |     0.614       0.614
        Unique obs |       314         236

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02864     .04351   0.6582   0.510   -.056635      .113912
    Bias-corrected |  .01995     .04351   0.4586   0.647   -.065321      .105225
            Robust |  .01995     .05194   0.3841   0.701   -.081854      .121758
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        283
-------------------+----------------------            BW type       =     Manual
     Number of obs |       163         120            Kernel        =    Uniform
Eff. Number of obs |       163         120            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        857
-------------------+----------------------            BW type       =     Manual
     Number of obs |       444         413            Kernel        =    Uniform
Eff. Number of obs |       444         413            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==3, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5446
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3692        1754            Kernel        = Epanechnikov
Eff. Number of obs |      3691        1754            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       355         244

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 3 results.xls", append ctitle(no province no Au
> g-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 3 results.xls
dir : seeout

. 
. *2_2_4) rdrobust on higheredu, sheet 4, province-clustered no Aug-Sep
. 
. **2_2_4_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster
>  province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06549     .08155   0.8031   0.422   -.094341      .225312
    Bias-corrected |  .04608     .08155   0.5651   0.572   -.113742       .20591
            Robust |  .04608      .1394   0.3306   0.741   -.227132        .3193
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", replace ctitle(province-cluster
> ed no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster
>  province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06645     .05665   1.1729   0.241    -.04459      .177491
    Bias-corrected |  .07453     .05665   1.3156   0.188   -.036505      .185575
            Robust |  .07453     .07308   1.0199   0.308     -.0687       .21777
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat != .,
>  covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_co
> de)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      2335        2545            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.758      62.758
       BW bias (b) |    80.892      80.892
         rho (h/b) |     0.776       0.776
        Unique obs |       369         260
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03889     .04796   0.8110   0.417   -.055102      .132883
    Bias-corrected |  .04126     .04796   0.8604   0.390    -.05273      .135256
            Robust |  .04126     .05601   0.7367   0.461   -.068511      .151037
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all v
> ce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03531      .0892   0.3959   0.692   -.139511      .210133
    Bias-corrected |  .23425      .0892   2.6262   0.009    .059426       .40907
            Robust |  .23425     .17059   1.3732   0.170   -.100103      .568599
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all v
> ce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08399     .05775   1.4544   0.146   -.029194      .197165
    Bias-corrected |  .02387     .05775   0.4133   0.679   -.089314      .137044
            Robust |  .02387     .07804   0.3058   0.760   -.129085      .176815
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (educat==1 |
>  educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster
>  province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1406        1736            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.171      60.171
       BW bias (b) |    92.071      92.071
         rho (h/b) |     0.654       0.654
        Unique obs |       319         247
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04784     .04858   0.9848   0.325   -.047369      .143047
    Bias-corrected |  .04433     .04858   0.9125   0.362   -.050882      .139534
            Robust |  .04433     .05879   0.7539   0.451   -.070909      .159561
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04027     .15354   -0.2622  0.793   -.341206      .260675
    Bias-corrected |  .05521     .15354   0.3596   0.719   -.245732       .35615
            Robust |  .05521     .27547   0.2004   0.841   -.484701      .595119
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09894     .08735   1.1326   0.257    -.07227      .270145
    Bias-corrected |  .02995     .08735   0.3429   0.732   -.141253      .201161
            Robust |  .02995     .10717   0.2795   0.780   -.180088      .239996
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==1, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       535         564            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.973      66.973
       BW bias (b) |   105.798     105.798
         rho (h/b) |     0.633       0.633
        Unique obs |       235         242
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04708     .07185   0.6552   0.512   -.093747      .187901
    Bias-corrected |  .05173     .07185   0.7199   0.472   -.089098       .19255
            Robust |  .05173     .08765   0.5901   0.555   -.120069      .223521
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04756      .1013   0.4695   0.639   -.150987       .24611
    Bias-corrected |  .19756      .1013   1.9503   0.051   -.000984      .396113
            Robust |  .19756      .2087   0.9466   0.344   -.211489      .606618
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06338     .06408   0.9892   0.323   -.062206      .188968
    Bias-corrected |  .03481     .06408   0.5433   0.587   -.090772      .160401
            Robust |  .03481     .09783   0.3559   0.722   -.156932      .226561
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==2, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |       872        1169            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.932      58.932
       BW bias (b) |    90.387      90.387
         rho (h/b) |     0.652       0.652
        Unique obs |       314         236
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02998     .05536   0.5415   0.588   -.078528      .138483
    Bias-corrected |     .02     .05536   0.3613   0.718   -.088506      .128505
            Robust |     .02     .06644   0.3010   0.763   -.110218      .150217
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        283
-------------------+----------------------            BW type       =     Manual
     Number of obs |       163         120            Kernel        =    Uniform
Eff. Number of obs |       163         120            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        857
-------------------+----------------------            BW type       =     Manual
     Number of obs |       444         413            Kernel        =    Uniform
Eff. Number of obs |       444         413            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==3, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5446
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3692        1754            Kernel        = Epanechnikov
Eff. Number of obs |      3691        1754            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       355         244
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 4 results.xls", append ctitle(province-clustere
> d no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 4 results.xls
dir : seeout

. 
. *2_2_5) rdrobust on higheredu, sheet 5, no province no July-Oct
. 
. **2_2_5_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09459     .09025   1.0481   0.295   -.082291      .271475
    Bias-corrected |  .11706     .09025   1.2971   0.195   -.059824      .293942
            Robust |  .11706      .2055   0.5696   0.569   -.285711      .519829
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", replace ctitle(no province no J
> uly-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07366     .04188   1.7586   0.079   -.008433      .155745
    Bias-corrected |  .10072     .04188   2.4049   0.016    .018635      .182813
            Robust |  .10072     .07165   1.4058   0.160   -.039702      .241149
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat != .,
>  covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      1814        1988            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    51.352      51.352
       BW bias (b) |    85.287      85.287
         rho (h/b) |     0.602       0.602
        Unique obs |       368         259

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04377       .036   1.2157   0.224   -.026797      .114336
    Bias-corrected |  .04508       .036   1.2521   0.211   -.025488      .115646
            Robust |  .04508     .04376   1.0302   0.303   -.040685      .130843
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05749      .1213   -0.4740  0.636   -.295248      .180259
    Bias-corrected |  .17259      .1213   1.4228   0.155   -.065164      .410343
            Robust |  .17259     .29165   0.5918   0.554   -.399043      .744222
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07044     .05256   1.3402   0.180   -.032572      .173444
    Bias-corrected | -.03923     .05256   -0.7465  0.455   -.142242      .063774
            Robust | -.03923     .09335   -0.4203  0.674   -.222203      .143735
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (educat==1 |
>  educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |      1236        1551            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.126      55.126
       BW bias (b) |    92.335      92.335
         rho (h/b) |     0.597       0.597
        Unique obs |       318         246

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03203     .04346   0.7371   0.461   -.053147      .117216
    Bias-corrected |  .02469     .04346   0.5681   0.570   -.060492      .109871
            Robust |  .02469     .05274   0.4682   0.640   -.078672      .128051
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0497     .19041   -0.2610  0.794    -.42289      .323499
    Bias-corrected |  .18785     .19041   0.9865   0.324   -.185347      .561041
            Robust |  .18785     .46416   0.4047   0.686    -.72189      1.09758
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11816     .08459   1.3969   0.162   -.047633      .283954
    Bias-corrected |  .04368     .08459   0.5164   0.606    -.12211      .209477
            Robust |  .04368     .14921   0.2928   0.770   -.248764      .336131
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==1, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       541         569            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.165      68.165
       BW bias (b) |   114.770     114.770
         rho (h/b) |     0.594       0.594
        Unique obs |       234         241

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05381     .06209   0.8666   0.386   -.067885      .175499
    Bias-corrected |  .06107     .06209   0.9837   0.325   -.060617      .182766
            Robust |  .06107     .07548   0.8092   0.418   -.086861       .20901
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0398     .13385   -0.2973  0.766   -.302139      .222542
    Bias-corrected |  .08962     .13385   0.6696   0.503   -.172718      .351962
            Robust |  .08962     .31888   0.2811   0.779   -.535376       .71462
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04424     .05731   0.7720   0.440    -.06809      .156577
    Bias-corrected | -.03229     .05731   -0.5633  0.573   -.144619      .080047
            Robust | -.03229     .10274   -0.3143  0.753    -.23365      .169078
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==2, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       733         978            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    51.992      51.992
       BW bias (b) |    91.160      91.160
         rho (h/b) |     0.570       0.570
        Unique obs |       313         235

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00735     .04885   0.1506   0.880   -.088382      .103091
    Bias-corrected | -.00623     .04885   -0.1275  0.899   -.101964      .089509
            Robust | -.00623     .05821   -0.1070  0.915   -.120307      .107852
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        249
-------------------+----------------------            BW type       =     Manual
     Number of obs |       151          98            Kernel        =    Uniform
Eff. Number of obs |       151          98            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       432         391            Kernel        =    Uniform
Eff. Number of obs |       432         391            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==3, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5412
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3680        1732            Kernel        = Epanechnikov
Eff. Number of obs |      3679        1732            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       354         243

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 5 results.xls", append ctitle(no province no Ju
> ly-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 5 results.xls
dir : seeout

. 
. *2_2_6) rdrobust on higheredu, sheet 6, province-clustered no July-Oct
. 
. **2_2_6_1 Pooled 
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster
>  province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09459      .0873   1.0836   0.279   -.076506      .265689
    Bias-corrected |  .11706      .0873   1.3409   0.180   -.054038      .288156
            Robust |  .11706     .20734   0.5646   0.572   -.289326      .523444
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", replace ctitle(province-cluster
> ed no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat != ., covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster
>  province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07366      .0564   1.3059   0.192   -.036887        .1842
    Bias-corrected |  .10072      .0564   1.7859   0.074    -.00982      .211267
            Robust |  .10072     .07355   1.3694   0.171   -.043434      .244881
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat != .,
>  covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_co
> de)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      2103        2281            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.583      58.583
       BW bias (b) |    78.605      78.605
         rho (h/b) |     0.745       0.745
        Unique obs |       368         259
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0403     .04704   0.8569   0.392   -.051886      .132495
    Bias-corrected |  .04601     .04704   0.9781   0.328   -.046185      .138196
            Robust |  .04601     .05492   0.8376   0.402    -.06164      .153651
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_2 Pooled without SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all v
> ce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05749     .09628   -0.5971  0.550   -.246206      .131217
    Bias-corrected |  .17259     .09628   1.7925   0.073   -.016122      .361301
            Robust |  .17259     .27196   0.6346   0.526   -.360436      .705614
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all v
> ce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07044     .06006   1.1727   0.241   -.047283      .188154
    Bias-corrected | -.03923     .06006   -0.6532  0.514   -.156952      .078484
            Robust | -.03923     .08612   -0.4556  0.649   -.208024      .129556
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (educat==1 |
>  educat==2), covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster
>  province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |      1212        1508            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.762      54.762
       BW bias (b) |    87.884      87.884
         rho (h/b) |     0.623       0.623
        Unique obs |       318         246
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03206     .04918   0.6519   0.514   -.064329      .128445
    Bias-corrected |  .02524     .04918   0.5131   0.608   -.071152      .121623
            Robust |  .02524     .06062   0.4163   0.677   -.093577      .144048
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_3 SecVoc
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0497     .21389   -0.2323  0.816   -.468908      .369517
    Bias-corrected |  .18785     .21389   0.8783   0.380   -.231365      .607059
            Robust |  .18785     .48488   0.3874   0.698   -.762509       1.1382
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==1, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11816     .09209   1.2831   0.199   -.062332      .298653
    Bias-corrected |  .04368     .09209   0.4744   0.635   -.136809      .224176
            Robust |  .04368     .13388   0.3263   0.744   -.218712      .306078
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==1, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       546         574            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.107      69.107
       BW bias (b) |   115.649     115.649
         rho (h/b) |     0.598       0.598
        Unique obs |       234         241
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05345       .072   0.7424   0.458    -.08766      .194564
    Bias-corrected |  .06092       .072   0.8462   0.397   -.080189      .202036
            Robust |  .06092     .08819   0.6909   0.490   -.111916      .233764
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_4 SecGen
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0398     .13274   -0.2998  0.764   -.299969      .220372
    Bias-corrected |  .08962     .13274   0.6752   0.500   -.170549      .349792
            Robust |  .08962     .26031   0.3443   0.731    -.42057      .599814
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==2, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04424     .07044   0.6281   0.530   -.093818      .182305
    Bias-corrected | -.03229     .07044   -0.4583  0.647   -.170347      .105775
            Robust | -.03229     .12019   -0.2686  0.788   -.267852       .20328
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==2, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       733         978            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    51.047      51.047
       BW bias (b) |    87.960      87.960
         rho (h/b) |     0.580       0.580
        Unique obs |       313         235
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00776     .06191   0.1254   0.900   -.113579      .129107
    Bias-corrected | -.00632     .06191   -0.1020  0.919   -.127661      .115026
            Robust | -.00632     .07442   -0.0849  0.932    -.15218      .139545
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_5 SecJun
. *One year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(12) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        249
-------------------+----------------------            BW type       =     Manual
     Number of obs |       151          98            Kernel        =    Uniform
Eff. Number of obs |       151          98            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250,
>  25000) & educat ==3, covs(male tenure tenuresqr) kernel(uni) p(1) h(36) all vce(nncluster 
> province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       432         391            Kernel        =    Uniform
Eff. Number of obs |       432         391            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust higheredu t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==3, 
> covs(male tenure tenuresqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_cod
> e)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5412
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3680        1732            Kernel        = Epanechnikov
Eff. Number of obs |      3679        1732            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       354         243
Number of clusters |        15          15

Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Higheredu Sheet 6 results.xls", append ctitle(province-clustere
> d no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Male Tenure cont
> rolled/Higheredu Sheet 6 results.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/ManualDivision Mal
> e Tenure controlled/Urban 1979 Higheredu ManualD MaleTenure controlled.log
  log type:  text
 closed on:   6 Aug 2024, 17:21:12
---------------------------------------------------------------------------------------------
