---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No contr
> ol/Rural/Rural 1979 Highgen FuzzyOption No Control.log
  log type:  text
 opened on:   8 Aug 2024, 12:53:32

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(27,895 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,455 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(34,426 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(2,298 real changes made)

. 
. *Step Two: Regressions
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01703     .01691   -1.0074  0.314   -.050172      .016106
    Bias-corrected | -5.2e-05    .01691   -0.0031  0.998   -.033191      .033087
            Robust | -5.2e-05    .00762   -0.0068  0.995   -.014987      .014883
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  9.3989     12.165   0.7726   0.440   -14.4431       33.241
    Bias-corrected |  27.708     12.165   2.2777   0.023    3.86556      51.5496
            Robust |  27.708     14.191   1.9524   0.051   -.106704      55.5219
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    .013     .01184   1.0984   0.272   -.010199      .036207
    Bias-corrected | -.00368     .01184   -0.3106  0.756    -.02688      .019526
            Robust | -.00368     .01557   -0.2361  0.813   -.034194       .02684
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.6201     6.9427   -0.5214  0.602   -17.2276      9.98737
    Bias-corrected | -10.918     6.9427   -1.5726  0.116   -24.5255      2.68951
            Robust | -10.918     10.034   -1.0881  0.277   -30.5847      8.74878
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs() 
> fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |      1925        2413            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   108.250     108.250
       BW bias (b) |   201.414     201.414
         rho (h/b) |     0.537       0.537
        Unique obs |       388         283

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00228      .0073   0.3122   0.755   -.012025      .016581
    Bias-corrected |  .00722      .0073   0.9889   0.323   -.007087       .02152
            Robust |  .00722     .00855   0.8442   0.399   -.009538      .023971
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -25.51     84.946   -0.3003  0.764   -192.001      140.982
    Bias-corrected |  28.332     84.946   0.3335   0.739   -138.159      194.823
            Robust |  28.332     99.401   0.2850   0.776   -166.491      223.154
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06187     .07028   -0.8803  0.379   -.199629      .075883
    Bias-corrected |   -.018     .07028   -0.2562  0.798    -.15576      .119752
            Robust |   -.018     .03213   -0.5604  0.575   -.080971      .044963
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.8124     5.4203   -0.7034  0.482    -14.436      6.81115
    Bias-corrected | -1.3163     5.4203   -0.2428  0.808   -11.9398      9.30729
            Robust | -1.3163     6.0421   -0.2179  0.828   -13.1586       10.526
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06258        .05   1.2515   0.211   -.035421      .160575
    Bias-corrected | -.01445        .05   -0.2891  0.773   -.112452      .083544
            Robust | -.01445     .06497   -0.2225  0.824   -.141783      .112875
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .51979     2.5812   0.2014   0.840   -4.53929      5.57887
    Bias-corrected |  5.2791     2.5812   2.0452   0.041    .220025      10.3382
            Robust |  5.2791     3.2279   1.6355   0.102   -1.04747      11.6057
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       351         776            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   110.100     110.100
       BW bias (b) |   191.087     191.087
         rho (h/b) |     0.576       0.576
        Unique obs |       306         261

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04264     .02971   1.4352   0.151    -.01559      .100862
    Bias-corrected |  .04898     .02971   1.6488   0.099   -.009244      .107208
            Robust |  .04898     .03456   1.4174   0.156   -.018748      .116712
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .31737     2.2721   0.1397   0.889   -4.13581      4.77056
    Bias-corrected | -.29223     2.2721   -0.1286  0.898   -4.74541      4.16096
            Robust | -.29223     2.6112   -0.1119  0.911      -5.41      4.82554
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13741     .11954   -1.1495  0.250    -.37171      .096884
    Bias-corrected | -.07062     .11954   -0.5908  0.555   -.304916      .163677
            Robust | -.07062     .08295   -0.8513  0.395   -.233205      .091966
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.78474      2.233   -0.3514  0.725   -5.16143      3.59195
    Bias-corrected | -4.0268      2.233   -1.8033  0.071   -8.40348      .349898
            Robust | -4.0268     5.3674   -0.7502  0.453   -14.5467      6.49312
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0274     .06155   -0.4451  0.656   -.148028      .093233
    Bias-corrected | -.08538     .06155   -1.3873  0.165   -.206013      .035248
            Robust | -.08538     .10032   -0.8511  0.395   -.282007      .111242
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -6.3311     16.629   -0.3807  0.703   -38.9241      26.2619
    Bias-corrected |  2.2925     16.629   0.1379   0.890   -30.3005      34.8855
            Robust |  2.2925     25.629   0.0894   0.929   -47.9398      52.5248
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs() f
> uzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |       114         242            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   104.458     104.458
       BW bias (b) |   146.773     146.773
         rho (h/b) |     0.712       0.712
        Unique obs |       132         235

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00283     .03693   -0.0766  0.939   -.075214      .069559
    Bias-corrected | -.01187     .03693   -0.3214  0.748   -.084255      .060518
            Robust | -.01187     .04706   -0.2522  0.801   -.104102      .080365
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -24.61     328.53   -0.0749  0.940   -668.511      619.292
    Bias-corrected |  61.486     328.53   0.1872   0.852   -582.416      705.387
            Robust |  61.486     418.16   0.1470   0.883   -758.096      881.068
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01554       .127   0.1224   0.903   -.233379      .264467
    Bias-corrected |   .0462       .127   0.3638   0.716   -.202721      .295125
            Robust |   .0462     .05802   0.7963   0.426   -.067523      .159927
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  28.977     237.94   0.1218   0.903   -437.381      495.334
    Bias-corrected | -78.032     237.94   -0.3279  0.743   -544.389      388.326
            Robust | -78.032     111.04   -0.7027  0.482   -295.675      139.612
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18026      .0931   1.9363   0.053   -.002199      .362728
    Bias-corrected |   .0787      .0931   0.8454   0.398   -.103761      .261166
            Robust |   .0787     .11689   0.6733   0.501    -.15039      .307795
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.69459     1.3537   -0.5131  0.608   -3.34777      1.95859
    Bias-corrected |  1.0372     1.3537   0.7662   0.444   -1.61602      3.69035
            Robust |  1.0372     1.7449   0.5944   0.552   -2.38282      4.45715
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs() f
> uzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |       135         193            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.089      71.089
       BW bias (b) |   140.869     140.869
         rho (h/b) |     0.505       0.505
        Unique obs |       286         247

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13144     .06304   2.0850   0.037    .007885      .254985
    Bias-corrected |  .13939     .06304   2.2113   0.027    .015844      .262944
            Robust |  .13939     .07002   1.9908   0.047    .002156      .276632
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.49497     1.2998   -0.3808  0.703   -3.04248      2.05253
    Bias-corrected | -.68905     1.2998   -0.5301  0.596   -3.23655      1.85846
            Robust | -.68905       1.45   -0.4752  0.635   -3.53091      2.15281
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_code
> )

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01703     .01588   -1.0728  0.283   -.048152      .014087
    Bias-corrected | -5.2e-05    .01588   -0.0033  0.997   -.031171      .031068
            Robust | -5.2e-05    .00794   -0.0065  0.995   -.015617      .015514
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  9.3989     11.049   0.8507   0.395   -12.2568      31.0546
    Bias-corrected |  27.708     11.049   2.5077   0.012    6.05192      49.3633
            Robust |  27.708     15.815   1.7520   0.080   -3.28829      58.7035
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_code
> )

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    .013     .01142   1.1382   0.255   -.009388      .035396
    Bias-corrected | -.00368     .01142   -0.3218  0.748   -.026069      .018715
            Robust | -.00368     .01286   -0.2859  0.775   -.028885      .021531
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.6201     9.3043   -0.3891  0.697   -21.8561      14.6159
    Bias-corrected | -10.918     9.3043   -1.1734  0.241    -29.154      7.31807
            Robust | -10.918     13.138   -0.8310  0.406    -36.668      14.8321
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs() 
> fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |      2645        3615            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   144.001     144.001
       BW bias (b) |   243.077     243.077
         rho (h/b) |     0.592       0.592
        Unique obs |       388         283
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0012     .00993   -0.1210  0.904   -.020658      .018256
    Bias-corrected | -.00665     .00993   -0.6704  0.503   -.026112      .012802
            Robust | -.00665     .01088   -0.6116  0.541   -.027982      .014672
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  22.046        184   0.1198   0.905   -338.586      382.679
    Bias-corrected | -73.851        184   -0.4014  0.688   -434.483      286.781
            Robust | -73.851     200.64   -0.3681  0.713   -467.093      319.391
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster p
> rovince_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06187     .06752   -0.9164  0.359   -.194205       .07046
    Bias-corrected |   -.018     .06752   -0.2667  0.790   -.150337      .114328
            Robust |   -.018     .03158   -0.5702  0.569   -.079892      .043883
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.8124     6.7143   -0.5678  0.570   -16.9722      9.34737
    Bias-corrected | -1.3163     6.7143   -0.1960  0.845   -14.4761      11.8435
            Robust | -1.3163     6.8593   -0.1919  0.848   -14.7603      12.1278
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster p
> rovince_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06258     .05019   1.2468   0.212   -.035793      .160947
    Bias-corrected | -.01445     .05019   -0.2880  0.773   -.112824      .083916
            Robust | -.01445      .0556   -0.2600  0.795   -.123433      .094525
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .51979     2.2521   0.2308   0.817    -3.8942      4.93377
    Bias-corrected |  5.2791     2.2521   2.3441   0.019    .865122      9.69309
            Robust |  5.2791     3.1759   1.6622   0.096   -.945563      11.5038
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code
> )
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       495        1473            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   155.657     155.657
       BW bias (b) |   215.988     215.988
         rho (h/b) |     0.721       0.721
        Unique obs |       306         261
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04308     .03562   1.2092   0.227   -.026744      .112896
    Bias-corrected |  .03347     .03562   0.9396   0.347    -.03635       .10329
            Robust |  .03347     .03935   0.8505   0.395   -.043659      .110599
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.7153     2.0265   0.8464   0.397   -2.25661      5.68713
    Bias-corrected |  1.3645     2.0265   0.6733   0.501   -2.60742      5.33632
            Robust |  1.3645     2.3142   0.5896   0.555   -3.17133      5.90024
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13741     .12038   -1.1415  0.254   -.373346       .09852
    Bias-corrected | -.07062     .12038   -0.5867  0.557   -.306552      .165313
            Robust | -.07062     .09739   -0.7251  0.468   -.261499       .12026
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.78474     2.6498   -0.2962  0.767   -5.97823      4.40874
    Bias-corrected | -4.0268     2.6498   -1.5197  0.129   -9.22028      1.16669
            Robust | -4.0268     4.0966   -0.9830  0.326   -12.0559      4.00235
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0274      .0605   -0.4529  0.651   -.145967      .091172
    Bias-corrected | -.08538      .0605   -1.4114  0.158   -.203952      .033187
            Robust | -.08538     .09816   -0.8698  0.384   -.277773      .107008
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -6.3311     15.204   -0.4164  0.677   -36.1298      23.4676
    Bias-corrected |  2.2925     15.204   0.1508   0.880   -27.5062      32.0912
            Robust |  2.2925     25.578   0.0896   0.929   -47.8398      52.4248
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs() f
> uzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |       115         252            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   106.070     106.070
       BW bias (b) |   146.557     146.557
         rho (h/b) |     0.724       0.724
        Unique obs |       132         235
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00114     .03065   -0.0372  0.970   -.061211      .058934
    Bias-corrected | -.01063     .03065   -0.3468  0.729   -.070703      .049442
            Robust | -.01063     .03867   -0.2749  0.783   -.086415      .065154
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -62.995     1675.7   -0.0376  0.970   -3347.24      3221.25
    Bias-corrected |  481.01     1675.7   0.2871   0.774   -2803.23      3765.25
            Robust |  481.01     2112.7   0.2277   0.820   -3659.72      4621.74
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10          10

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01554     .11553   0.1345   0.893   -.210896      .241984
    Bias-corrected |   .0462     .11553   0.3999   0.689   -.180238      .272642
            Robust |   .0462     .07164   0.6449   0.519   -.094209      .186613
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  28.977     215.38   0.1345   0.893   -393.166      451.119
    Bias-corrected | -78.032     215.38   -0.3623  0.717   -500.174      344.111
            Robust | -78.032     134.62   -0.5797  0.562   -341.873      185.809
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18026     .07787   2.3149   0.021    .027642      .332887
    Bias-corrected |   .0787     .07787   1.0107   0.312    -.07392      .231325
            Robust |   .0787     .07367   1.0683   0.285   -.065686      .223091
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.69459     1.2012   -0.5783  0.563   -3.04886      1.65968
    Bias-corrected |  1.0372     1.2012   0.8635   0.388    -1.3171      3.39143
            Robust |  1.0372     1.2035   0.8618   0.389   -1.32173      3.39606
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs() f
> uzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |       168         290            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    86.106      86.106
       BW bias (b) |   148.437     148.437
         rho (h/b) |     0.580       0.580
        Unique obs |       286         247
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13287     .05132   2.5888   0.010    .032274      .233459
    Bias-corrected |  .14594     .05132   2.8434   0.004    .045343      .246528
            Robust |  .14594     .05299   2.7542   0.006    .042084      .249787
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.50914     1.2213   -0.4169  0.677   -2.90293      1.88466
    Bias-corrected |  -.8115     1.2213   -0.6644  0.506   -3.20529       1.5823
            Robust |  -.8115     1.4258   -0.5692  0.569   -3.60602      1.98303
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02334     .02404   -0.9707  0.332   -.070456      .023783
    Bias-corrected | -.00066     .02404   -0.0275  0.978   -.047779      .046459
            Robust | -.00066     .02088   -0.0316  0.975   -.041582      .040262
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  9.7173     12.015   0.8088   0.419   -13.8316      33.2662
    Bias-corrected |   38.23     12.015   3.1819   0.001    14.6813      61.7791
            Robust |   38.23     15.846   2.4126   0.016    7.17283      69.2875
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01522     .01344   1.1327   0.257   -.011117      .041562
    Bias-corrected | -.00244     .01344   -0.1814  0.856   -.028777      .023902
            Robust | -.00244     .01999   -0.1220  0.903   -.041609      .036733
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.3379     6.2695   -0.5324  0.594    -15.626      8.95015
    Bias-corrected | -10.293     6.2695   -1.6417  0.101    -22.581       1.9951
            Robust | -10.293     9.8322   -1.0469  0.295   -29.5637      8.97776
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |      1497        1748            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    88.385      88.385
       BW bias (b) |   147.543     147.543
         rho (h/b) |     0.599       0.599
        Unique obs |       387         282

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00674     .00831   0.8102   0.418   -.009557      .023027
    Bias-corrected |  .01097     .00831   1.3193   0.187   -.005325      .027259
            Robust |  .01097     .01008   1.0875   0.277   -.008798      .030732
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -12.693     17.836   -0.7117  0.477   -47.6504       22.264
    Bias-corrected | -7.9611     17.836   -0.4464  0.655   -42.9183      26.9961
            Robust | -7.9611     21.558   -0.3693  0.712   -50.2147      34.2924
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) al
> l

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10649     .13082   -0.8140  0.416   -.362894      .149917
    Bias-corrected | -.08296     .13082   -0.6341  0.526   -.339364      .173447
            Robust | -.08296     .15849   -0.5234  0.601   -.393603      .227686
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.1132     4.6762   -0.6658  0.506   -12.2785      6.05202
    Bias-corrected |  4.5235     4.6762   0.9673   0.333    -4.6418      13.6887
            Robust |  4.5235     8.1107   0.5577   0.577   -11.3732      20.4201
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) al
> l

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07738     .06047   1.2796   0.201   -.041138      .195896
    Bias-corrected | -.00806     .06047   -0.1334  0.894   -.126581      .110453
            Robust | -.00806     .10042   -0.0803  0.936   -.204874      .188746
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19844     2.3442   0.0847   0.933   -4.39604      4.79292
    Bias-corrected |  5.0963     2.3442   2.1740   0.030     .50182      9.69078
            Robust |  5.0963     3.4007   1.4986   0.134   -1.56904      11.7616
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       262         455            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    86.577      86.577
       BW bias (b) |   145.000     145.000
         rho (h/b) |     0.597       0.597
        Unique obs |       305         260

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05175     .03574   1.4480   0.148   -.018295      .121796
    Bias-corrected |  .05232     .03574   1.4640   0.143   -.017725      .122366
            Robust |  .05232     .04265   1.2268   0.220   -.031268      .135908
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.15195     2.2402   -0.0678  0.946   -4.54263      4.23873
    Bias-corrected |  -.8169     2.2402   -0.3647  0.715   -5.20758      3.57378
            Robust |  -.8169     2.6595   -0.3072  0.759   -6.02936      4.39555
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.18079     .14746   -1.2260  0.220   -.469807       .10823
    Bias-corrected | -.15383     .14746   -1.0432  0.297   -.442843      .135193
            Robust | -.15383     .16196   -0.9498  0.342   -.471252      .163601
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .60159     1.8409   0.3268   0.744   -3.00646      4.20964
    Bias-corrected |   1.115     1.8409   0.6057   0.545   -2.49303      4.72308
            Robust |   1.115      5.284   0.2110   0.833   -9.24137      11.4714
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02444     .06756   -0.3618  0.717    -.15685      .107964
    Bias-corrected | -.09297     .06756   -1.3763  0.169   -.225381      .039433
            Robust | -.09297     .11667   -0.7969  0.426   -.321645      .135697
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -5.1685     17.542   -0.2946  0.768   -39.5493      29.2123
    Bias-corrected |  5.2161     17.542   0.2974   0.766   -29.1647      39.5969
            Robust |  5.2161     28.131   0.1854   0.853   -49.9199      60.3521
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |       121         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   117.275     117.275
       BW bias (b) |   163.335     163.335
         rho (h/b) |     0.718       0.718
        Unique obs |       131         234

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00761     .03631   0.2095   0.834   -.063566      .078779
    Bias-corrected |  .00421     .03631   0.1158   0.908   -.066966      .075378
            Robust |  .00421     .04721   0.0891   0.929   -.088331      .096743
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.8673     42.127   0.1868   0.852   -74.7003      90.4349
    Bias-corrected |  3.6039     42.127   0.0855   0.932   -78.9637      86.1715
            Robust |  3.6039     54.181   0.0665   0.947   -102.589      109.796
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04054     .33124   0.1224   0.903   -.608677      .689758
    Bias-corrected |  .76925     .33124   2.3223   0.020    .120032      1.41847
            Robust |  .76925     .96609   0.7963   0.426   -1.12424      2.66274
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  31.573      258.9   0.1219   0.903   -475.868      539.014
    Bias-corrected |  -587.2      258.9   -2.2680  0.023   -1094.64     -79.7586
            Robust |  -587.2     756.49   -0.7762  0.438   -2069.89      895.493
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .22333     .11507   1.9408   0.052   -.002207       .44886
    Bias-corrected |  .14808     .11507   1.2868   0.198   -.077456      .373612
            Robust |  .14808     .21244   0.6970   0.486   -.268289      .564445
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.57751     1.3389   -0.4313  0.666   -3.20175      2.04673
    Bias-corrected |  2.1845     1.3389   1.6316   0.103   -.439701      4.80878
            Robust |  2.1845     2.3511   0.9292   0.353   -2.42352      6.79259
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       126         181            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.585      69.585
       BW bias (b) |   138.587     138.587
         rho (h/b) |     0.502       0.502
        Unique obs |       285         246

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14499     .07189   2.0168   0.044    .004087      .285898
    Bias-corrected |  .15576     .07189   2.1665   0.030     .01485      .296661
            Robust |  .15576     .08075   1.9289   0.054   -.002507      .314018
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.4012     1.3394   -0.2995  0.765   -3.02644      2.22403
    Bias-corrected | -.56981     1.3394   -0.4254  0.671   -3.19504      2.05542
            Robust | -.56981     1.5168   -0.3757  0.707   -3.54263      2.40301
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 3 results.xls
dir : seeout

. 
. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclus
> ter province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02334     .02286   -1.0209  0.307   -.068139      .021467
    Bias-corrected | -.00066     .02286   -0.0289  0.977   -.045463      .044143
            Robust | -.00066     .02169   -0.0304  0.976   -.043165      .041845
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  9.7173     10.152   0.9572   0.338   -10.1793      29.6138
    Bias-corrected |   38.23     10.152   3.7660   0.000    18.3336      58.1268
            Robust |   38.23     17.055   2.2416   0.025    4.80267      71.6577
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclus
> ter province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01522     .01289   1.1805   0.238   -.010051      .040495
    Bias-corrected | -.00244     .01289   -0.1891  0.850   -.027711      .022835
            Robust | -.00244     .01639   -0.1488  0.882   -.034553      .029677
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.3379     7.9589   -0.4194  0.675    -18.937      12.2611
    Bias-corrected | -10.293     7.9589   -1.2933  0.196    -25.892      5.30609
            Robust | -10.293     11.205   -0.9186  0.358   -32.2537      11.6678
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province
> _code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |      1637        1975            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    95.863      95.863
       BW bias (b) |   184.845     184.845
         rho (h/b) |     0.519       0.519
        Unique obs |       387         282
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0058     .00852   0.6805   0.496   -.010897      .022489
    Bias-corrected |  .01193     .00852   1.4011   0.161    -.00476      .028626
            Robust |  .01193     .00909   1.3128   0.189   -.005882      .029749
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -14.081     25.131   -0.5603  0.575    -63.338       35.175
    Bias-corrected | -.68756     25.131   -0.0274  0.978   -49.9441       48.569
            Robust | -.68756     26.562   -0.0259  0.979   -52.7477      51.3726
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) al
> l vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10649      .1262   -0.8438  0.399    -.35383      .140853
    Bias-corrected | -.08296      .1262   -0.6574  0.511     -.3303      .164383
            Robust | -.08296     .15653   -0.5300  0.596   -.389749      .223832
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.1132     4.9873   -0.6242  0.532   -12.8883      6.66179
    Bias-corrected |  4.5235     4.9873   0.9070   0.364   -5.25157      14.2985
            Robust |  4.5235      8.651   0.5229   0.601   -12.4323      21.4792
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) al
> l vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07738     .06053   1.2784   0.201   -.041258      .196016
    Bias-corrected | -.00806     .06053   -0.1332  0.894     -.1267      .110573
            Robust | -.00806     .08534   -0.0945  0.925   -.175336      .159209
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19844     2.2099   0.0898   0.928   -4.13283      4.52971
    Bias-corrected |  5.0963     2.2099   2.3062   0.021     .76503      9.42757
            Robust |  5.0963     2.6024   1.9583   0.050    -.00431      10.1969
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nnclus
> ter province_code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       275         510            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    92.421      92.421
       BW bias (b) |   150.697     150.697
         rho (h/b) |     0.613       0.613
        Unique obs |       305         260
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05188     .03216   1.6132   0.107    -.01115      .114902
    Bias-corrected |  .05429     .03216   1.6883   0.091   -.008735      .117318
            Robust |  .05429     .03274   1.6583   0.097   -.009876      .118459
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.25788     2.2141   -0.1165  0.907   -4.59736       4.0816
    Bias-corrected | -1.0255     2.2141   -0.4632  0.643   -5.36495      3.31402
            Robust | -1.0255       2.63   -0.3899  0.697   -6.18021      4.12928
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.18079     .14906   -1.2129  0.225   -.472942      .111365
    Bias-corrected | -.15383     .14906   -1.0320  0.302   -.445979      .138329
            Robust | -.15383     .18513   -0.8309  0.406   -.516673      .209023
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .60159     1.7967   0.3348   0.738   -2.91982        4.123
    Bias-corrected |   1.115     1.7967   0.6206   0.535   -2.40638      4.63643
            Robust |   1.115      2.826   0.3946   0.693   -4.42392      6.65397
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02444     .06669   -0.3665  0.714   -.155157      .106271
    Bias-corrected | -.09297     .06669   -1.3941  0.163   -.223688       .03774
            Robust | -.09297     .11428   -0.8136  0.416    -.31696      .131012
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -5.1685     15.994   -0.3231  0.747   -36.5169      26.1799
    Bias-corrected |  5.2161     15.994   0.3261   0.744   -26.1323      36.5645
            Robust |  5.2161     27.725   0.1881   0.851   -49.1242      59.5564
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |       134         391            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   132.791     132.791
       BW bias (b) |   171.135     171.135
         rho (h/b) |     0.776       0.776
        Unique obs |       131         234
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00627     .02948   0.2128   0.832   -.051513      .064059
    Bias-corrected |  .00459     .02948   0.1557   0.876   -.053194      .062377
            Robust |  .00459     .03603   0.1274   0.899   -.066031      .075214
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  12.036     61.895   0.1945   0.846   -109.276      133.347
    Bias-corrected |  1.6445     61.895   0.0266   0.979   -119.667      122.956
            Robust |  1.6445     77.014   0.0214   0.983     -149.3      152.589
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04054       .305   0.1329   0.894   -.557246      .638327
    Bias-corrected |  .76925       .305   2.5221   0.012    .171463      1.36704
            Robust |  .76925     1.2073   0.6371   0.524   -1.59709      3.13559
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  31.573     237.35   0.1330   0.894   -433.632      496.777
    Bias-corrected |  -587.2     237.35   -2.4739  0.013    -1052.4     -121.995
            Robust |  -587.2     934.06   -0.6287  0.530   -2417.92      1243.52
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .22333     .09666   2.3105   0.021    .033881      .412771
    Bias-corrected |  .14808     .09666   1.5320   0.126   -.041367      .337523
            Robust |  .14808     .13315   1.1121   0.266   -.112887      .409043
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.57751     1.3138   -0.4396  0.660   -3.15253      1.99751
    Bias-corrected |  2.1845     1.3138   1.6627   0.096   -.390486      4.75956
            Robust |  2.1845     1.2287   1.7780   0.075   -.223577      4.59265
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       159         270            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    83.369      83.369
       BW bias (b) |   143.589     143.589
         rho (h/b) |     0.581       0.581
        Unique obs |       285         246
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14896     .05568   2.6752   0.007    .039824      .258088
    Bias-corrected |   .1645     .05568   2.9543   0.003    .055363      .273627
            Robust |   .1645     .05914   2.7814   0.005     .04858       .28041
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.3689     1.3036   -0.2830  0.777   -2.92399      2.18618
    Bias-corrected | -.65378     1.3036   -0.5015  0.616   -3.20886       1.9013
            Robust | -.65378     1.5689   -0.4167  0.677   -3.72877      2.42121
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03201     .03446   -0.9288  0.353   -.099552      .035537
    Bias-corrected |  -.0107     .03446   -0.3104  0.756   -.078243      .056846
            Robust |  -.0107     .04932   -0.2169  0.828   -.107363      .085966
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  10.113     12.504   0.8088   0.419   -14.3942      34.6201
    Bias-corrected |   50.52     12.504   4.0403   0.000    26.0127       75.027
            Robust |   50.52     21.921   2.3046   0.021     7.5554      93.4843
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01698     .01502   1.1300   0.258    -.01247      .046424
    Bias-corrected | -.00235     .01502   -0.1563  0.876   -.031796      .027098
            Robust | -.00235     .02572   -0.0913  0.927    -.05276      .048062
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.3297     6.1332   -0.5429  0.587   -15.3505      8.69119
    Bias-corrected | -11.171     6.1332   -1.8214  0.069   -23.1917      .849971
            Robust | -11.171     10.725   -1.0416  0.298   -32.1916      9.84988
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1347        1507            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.024      80.024
       BW bias (b) |   132.993     132.993
         rho (h/b) |     0.602       0.602
        Unique obs |       386         281

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00772     .00932   0.8281   0.408   -.010552      .025994
    Bias-corrected |  .01064     .00932   1.1410   0.254   -.007636       .02891
            Robust |  .01064     .01144   0.9296   0.353    -.01179      .033064
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -10.884     15.473   -0.7034  0.482   -41.2107      19.4422
    Bias-corrected | -10.134     15.473   -0.6550  0.512   -40.4606      20.1923
            Robust | -10.134     18.902   -0.5361  0.592   -47.1811      26.9128
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) al
> l

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.11664     .15975   -0.7301  0.465   -.429754       .19647
    Bias-corrected | -.04756     .15975   -0.2977  0.766   -.360676      .265548
            Robust | -.04756     .30689   -0.1550  0.877    -.64905      .553921
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.8054     5.9528   -0.6393  0.523   -15.4727       7.8618
    Bias-corrected |  3.3984     5.9528   0.5709   0.568   -8.26883      15.0656
            Robust |  3.3984     13.138   0.2587   0.796   -22.3508      29.1477
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) al
> l

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08281     .06373   1.2994   0.194   -.042101      .207728
    Bias-corrected |  .00223     .06373   0.0350   0.972   -.122682      .127147
            Robust |  .00223     .11388   0.0196   0.984   -.220959      .225423
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .30866     2.2835   0.1352   0.892   -4.16701      4.78433
    Bias-corrected |   5.716     2.2835   2.5031   0.012    1.24031      10.1917
            Robust |   5.716     3.4766   1.6441   0.100   -1.09812      12.5301
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       366         861            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   117.036     117.036
       BW bias (b) |   199.937     199.937
         rho (h/b) |     0.585       0.585
        Unique obs |       304         259

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04981      .0315   1.5813   0.114    -.01193      .111557
    Bias-corrected |  .05439      .0315   1.7266   0.084   -.007351      .116135
            Robust |  .05439     .03747   1.4518   0.147   -.019039      .127823
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .3631     2.0018   0.1814   0.856   -3.56041      4.28661
    Bias-corrected | -.12989     2.0018   -0.0649  0.948    -4.0534      3.79362
            Robust | -.12989     2.3441   -0.0554  0.956   -4.72433      4.46456
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.22395     .18097   -1.2375  0.216    -.57864      .130736
    Bias-corrected | -.30565     .18097   -1.6890  0.091    -.66034      .049035
            Robust | -.30565     .29698   -1.0292  0.303   -.887721      .276416
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .26863     1.8739   0.1434   0.886   -3.40405      3.94131
    Bias-corrected |  1.3406     1.8739   0.7154   0.474   -2.33204      5.01332
            Robust |  1.3406     6.6135   0.2027   0.839   -11.6215      14.3028
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02391     .07357   -0.3251  0.745   -.168102      .120276
    Bias-corrected | -.10086     .07357   -1.3709  0.170   -.245045      .043332
            Robust | -.10086     .13615   -0.7408  0.459   -.367705      .165992
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -6.5966     23.231   -0.2840  0.776   -52.1294      38.9362
    Bias-corrected |  6.9808     23.231   0.3005   0.764    -38.552      52.5136
            Robust |  6.9808     41.143   0.1697   0.865   -73.6573      87.6189
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |       124         314            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   120.213     120.213
       BW bias (b) |   168.233     168.233
         rho (h/b) |     0.715       0.715
        Unique obs |       130         233

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00882     .03722   0.2369   0.813   -.064139      .081779
    Bias-corrected |  .00687     .03722   0.1844   0.854   -.066093      .079825
            Robust |  .00687     .04915   0.1397   0.889   -.089457      .103189
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.5391     39.708   0.2150   0.830    -69.287      86.3652
    Bias-corrected |  2.9889     39.708   0.0753   0.940   -74.8372       80.815
            Robust |  2.9889     51.887   0.0576   0.954   -98.7085      104.686
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04054     .33124   0.1224   0.903   -.608677      .689758
    Bias-corrected |  .76925     .33124   2.3223   0.020    .120032      1.41847
            Robust |  .76925     .96609   0.7963   0.426   -1.12424      2.66274
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  31.573      258.9   0.1219   0.903   -475.868      539.014
    Bias-corrected |  -587.2      258.9   -2.2680  0.023   -1094.64     -79.7586
            Robust |  -587.2     756.49   -0.7762  0.438   -2069.89      895.493
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .22333     .11507   1.9408   0.052   -.002207       .44886
    Bias-corrected |  .14808     .11507   1.2868   0.198   -.077456      .373612
            Robust |  .14808     .21244   0.6970   0.486   -.268289      .564445
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.57751     1.3389   -0.4313  0.666   -3.20175      2.04673
    Bias-corrected |  2.1845     1.3389   1.6316   0.103   -.439701      4.80878
            Robust |  2.1845     2.3511   0.9292   0.353   -2.42352      6.79259
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       126         181            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.585      69.585
       BW bias (b) |   138.587     138.587
         rho (h/b) |     0.502       0.502
        Unique obs |       285         246

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14499     .07189   2.0168   0.044    .004087      .285898
    Bias-corrected |  .15576     .07189   2.1665   0.030     .01485      .296661
            Robust |  .15576     .08075   1.9289   0.054   -.002507      .314018
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.4012     1.3394   -0.2995  0.765   -3.02644      2.22403
    Bias-corrected | -.56981     1.3394   -0.4254  0.671   -3.19504      2.05542
            Robust | -.56981     1.5168   -0.3757  0.707   -3.54263      2.40301
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 5 results.xls
dir : seeout

. 
. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclus
> ter province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03201     .03281   -0.9754  0.329   -.096321      .032306
    Bias-corrected |  -.0107     .03281   -0.3260  0.744   -.075012      .053615
            Robust |  -.0107     .04935   -0.2168  0.828    -.10743      .086032
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  10.113     10.531   0.9603   0.337   -10.5275      30.7535
    Bias-corrected |   50.52     10.531   4.7972   0.000    29.8794      71.1603
            Robust |   50.52     23.885   2.1151   0.034    3.70613      97.3335
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclus
> ter province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01698      .0144   1.1787   0.239   -.011253      .045207
    Bias-corrected | -.00235      .0144   -0.1631  0.870   -.030579      .025881
            Robust | -.00235     .02121   -0.1107  0.912   -.043917      .039219
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.3297     7.9732   -0.4176  0.676   -18.9568      12.2975
    Bias-corrected | -11.171     7.9732   -1.4011  0.161    -26.798      4.45626
            Robust | -11.171     13.477   -0.8289  0.407   -37.5848      15.2431
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province
> _code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1544        1841            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    92.597      92.597
       BW bias (b) |   160.009     160.009
         rho (h/b) |     0.579       0.579
        Unique obs |       386         281
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00697     .00906   0.7688   0.442   -.010796      .024732
    Bias-corrected |  .01277     .00906   1.4090   0.159   -.004993      .030534
            Robust |  .01277     .00928   1.3759   0.169   -.005421      .030962
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -12.778     20.644   -0.6190  0.536   -53.2385      27.6831
    Bias-corrected |  -5.208     20.644   -0.2523  0.801   -45.6688      35.2528
            Robust |  -5.208     21.246   -0.2451  0.806     -46.85      36.4341
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) al
> l vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.11664     .15493   -0.7529  0.452   -.420304       .18702
    Bias-corrected | -.04756     .15493   -0.3070  0.759   -.351226      .256097
            Robust | -.04756      .3128   -0.1521  0.879    -.66064      .565511
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.8054     6.4373   -0.5912  0.554   -16.4223      8.81141
    Bias-corrected |  3.3984     6.4373   0.5279   0.598   -9.21844      16.0153
            Robust |  3.3984     14.457   0.2351   0.814   -24.9358      31.7326
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) al
> l vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08281      .0637   1.3001   0.194   -.042033      .207659
    Bias-corrected |  .00223      .0637   0.0350   0.972   -.122614      .127078
            Robust |  .00223     .09659   0.0231   0.982    -.18708      .191545
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .30866     2.2041   0.1400   0.889   -4.01137      4.62869
    Bias-corrected |   5.716     2.2041   2.5933   0.010    1.39596       10.036
            Robust |   5.716     2.8239   2.0242   0.043    .181296      11.2507
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nnclus
> ter province_code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       511        1548            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   160.195     160.195
       BW bias (b) |   218.232     218.232
         rho (h/b) |     0.734       0.734
        Unique obs |       304         259
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04396      .0375   1.1724   0.241   -.029533      .117462
    Bias-corrected |  .03165      .0375   0.8440   0.399   -.041848      .105148
            Robust |  .03165     .04291   0.7375   0.461   -.052458      .115758
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8841     2.3083   0.8162   0.414   -2.64016      6.40839
    Bias-corrected |  1.5678     2.3083   0.6792   0.497   -2.95649      6.09206
            Robust |  1.5678     2.7322   0.5738   0.566   -3.78721      6.92279
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.22395     .18693   -1.1981  0.231   -.590327      .142423
    Bias-corrected | -.30565     .18693   -1.6351  0.102   -.672028      .060723
            Robust | -.30565     .34129   -0.8956  0.370   -.974567      .363262
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .26863     2.1022   0.1278   0.898    -3.8517      4.38896
    Bias-corrected |  1.3406     2.1022   0.6377   0.524   -2.77969      5.46097
            Robust |  1.3406     4.8811   0.2747   0.784   -8.22617      10.9074
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02391     .07369   -0.3245  0.746   -.168338      .120512
    Bias-corrected | -.10086     .07369   -1.3687  0.171   -.245282      .043569
            Robust | -.10086     .13612   -0.7410  0.459   -.367639      .165926
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -6.5966     22.189   -0.2973  0.766   -50.0861      36.8928
    Bias-corrected |  6.9808     22.189   0.3146   0.753   -36.5087      50.4702
            Robust |  6.9808     42.112   0.1658   0.868   -75.5571      89.5187
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |       135         415            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   136.434     136.434
       BW bias (b) |   181.403     181.403
         rho (h/b) |     0.752       0.752
        Unique obs |       130         233
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00603     .03084   0.1955   0.845   -.054422      .066483
    Bias-corrected |  .00703     .03084   0.2280   0.820   -.053421      .067484
            Robust |  .00703      .0376   0.1870   0.852   -.066665      .080728
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  14.389      78.59   0.1831   0.855   -139.644      168.421
    Bias-corrected |   -.169      78.59   -0.0022  0.998   -154.202      153.864
            Robust |   -.169     97.269   -0.0017  0.999   -190.813      190.475
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04054       .305   0.1329   0.894   -.557246      .638327
    Bias-corrected |  .76925       .305   2.5221   0.012    .171463      1.36704
            Robust |  .76925     1.2073   0.6371   0.524   -1.59709      3.13559
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  31.573     237.35   0.1330   0.894   -433.632      496.777
    Bias-corrected |  -587.2     237.35   -2.4739  0.013    -1052.4     -121.995
            Robust |  -587.2     934.06   -0.6287  0.530   -2417.92      1243.52
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .22333     .09666   2.3105   0.021    .033881      .412771
    Bias-corrected |  .14808     .09666   1.5320   0.126   -.041367      .337523
            Robust |  .14808     .13315   1.1121   0.266   -.112887      .409043
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.57751     1.3138   -0.4396  0.660   -3.15253      1.99751
    Bias-corrected |  2.1845     1.3138   1.6627   0.096   -.390486      4.75956
            Robust |  2.1845     1.2287   1.7780   0.075   -.223577      4.59265
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       159         270            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    83.369      83.369
       BW bias (b) |   143.589     143.589
         rho (h/b) |     0.581       0.581
        Unique obs |       285         246
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14896     .05568   2.6752   0.007    .039824      .258088
    Bias-corrected |   .1645     .05568   2.9543   0.003    .055363      .273627
            Robust |   .1645     .05914   2.7814   0.005     .04858       .28041
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.3689     1.3036   -0.2830  0.777   -2.92399      2.18618
    Bias-corrected | -.65378     1.3036   -0.5015  0.616   -3.20886       1.9013
            Robust | -.65378     1.5689   -0.4167  0.677   -3.72877      2.42121
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Rural/Earn
> ing Sheet 6 results.xls
dir : seeout

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No contr
> ol/Rural/Rural 1979 Highgen FuzzyOption No Control.log
  log type:  text
 closed on:   8 Aug 2024, 12:54:02
---------------------------------------------------------------------------------------------
