---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male T
> enure controlled/Urban 1979 Higheredu FuzzyOption MaleTenure controlled.log
  log type:  text
 opened on:   6 Aug 2024, 17:15:43

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,431 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(33,372 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(5,190 real changes made)

. 
. *Step Two: Regressions
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02619     .05855   0.4473   0.655    -.08857      .140944
    Bias-corrected | -.02056     .05855   -0.3511  0.726   -.135314      .094201
            Robust | -.02056     .08972   -0.2291  0.819   -.196397      .155285
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.4042      9.682   0.4549   0.649   -14.5721      23.3805
    Bias-corrected |  12.929      9.682   1.3354   0.182    -6.0474      31.9052
            Robust |  12.929     15.053   0.8589   0.390   -16.5753      42.4331
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05015     .03592   1.3963   0.163   -.020248      .120552
    Bias-corrected |  .03698     .03592   1.0295   0.303   -.033423      .107377
            Robust |  .03698     .05206   0.7103   0.478   -.065057      .139011
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.5365     1.3123   1.1709   0.242   -1.03553      4.10863
    Bias-corrected |  2.5691     1.3123   1.9577   0.050   -.002979      5.14118
            Robust |  2.5691      1.918   1.3394   0.180    -1.1902      6.32841
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      3212        3399            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    82.090      82.090
       BW bias (b) |   126.785     126.785
         rho (h/b) |     0.647       0.647
        Unique obs |       370         261

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03436     .02536   1.3549   0.175   -.015342      .084053
    Bias-corrected |  .02649     .02536   1.0446   0.296    -.02321      .076186
            Robust |  .02649     .03045   0.8698   0.384   -.033201      .086176
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0927     1.1665   0.9367   0.349    -1.1936      3.37903
    Bias-corrected |  1.1108     1.1665   0.9522   0.341   -1.17551      3.39711
            Robust |  1.1108     1.4015   0.7926   0.428   -1.63605      3.85765
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(
> 12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00738     .07215   0.1023   0.918   -.134027      .148792
    Bias-corrected |  .08531     .07215   1.1824   0.237   -.056101      .226718
            Robust |  .08531      .1051   0.8117   0.417   -.120685      .291302
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  10.059     96.578   0.1042   0.917   -179.231      199.349
    Bias-corrected | -90.497     96.578   -0.9370  0.349   -279.787      98.7924
            Robust | -90.497     141.83   -0.6381  0.523    -368.47      187.475
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(
> 36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06401     .04429   1.4454   0.148    -.02279      .150816
    Bias-corrected |  .00223     .04429   0.0504   0.960   -.084571      .089035
            Robust |  .00223     .06422   0.0348   0.972   -.123645      .128109
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8401     1.4436   1.2747   0.202    -.98929      4.66946
    Bias-corrected |  2.9218     1.4436   2.0240   0.043     .09239      5.75114
            Robust |  2.9218     2.1366   1.3675   0.171   -1.26595      7.10947
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      2184        2845            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    91.240      91.240
       BW bias (b) |   142.318     142.318
         rho (h/b) |     0.641       0.641
        Unique obs |       320         248

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04647     .02976   1.5614   0.118   -.011863        .1048
    Bias-corrected |  .04206     .02976   1.4131   0.158   -.016274      .100388
            Robust |  .04206     .03586   1.1727   0.241   -.028233      .112347
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   1.255     1.0966   1.1444   0.252   -.894377      3.40439
    Bias-corrected |  .94064     1.0966   0.8577   0.391   -1.20874      3.09003
            Robust |  .94064     1.3218   0.7116   0.477   -1.65012       3.5314
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02458     .09965   -0.2467  0.805   -.219887      .170724
    Bias-corrected |  .10465     .09965   1.0502   0.294   -.090652      .299959
            Robust |  .10465     .12005   0.8718   0.383   -.130636      .339943
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.3347     17.505   0.2476   0.804   -29.9736      38.6429
    Bias-corrected |  27.503     17.505   1.5712   0.116    -6.8054      61.8111
            Robust |  27.503     22.228   1.2373   0.216   -16.0628      71.0685
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08632     .06829   1.2640   0.206    -.04753      .220172
    Bias-corrected |  .02569     .06829   0.3762   0.707   -.108161       .15954
            Robust |  .02569     .09299   0.2763   0.782   -.156568      .207947
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.5565     1.4882   1.0459   0.296   -1.36026      4.47328
    Bias-corrected |  1.5292     1.4882   1.0275   0.304    -1.3876      4.44594
            Robust |  1.5292     2.2035   0.6940   0.488   -2.78964      5.84799
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       460         505            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.766      55.766
       BW bias (b) |    95.209      95.209
         rho (h/b) |     0.586       0.586
        Unique obs |       236         243

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0487     .05895   0.8262   0.409   -.066833      .164234
    Bias-corrected |  .05289     .05895   0.8972   0.370   -.062649      .168419
            Robust |  .05289     .06837   0.7735   0.439   -.081124      .186894
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.7517     3.3268   0.8272   0.408   -3.76861      9.27211
    Bias-corrected |  2.9644     3.3268   0.8911   0.373   -3.55593      9.48479
            Robust |  2.9644     3.8874   0.7626   0.446   -4.65477      10.5836
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00893     .07687   0.1162   0.907   -.141723      .159591
    Bias-corrected |   .0447     .07687   0.5815   0.561   -.105955      .195359
            Robust |   .0447     .10917   0.4095   0.682   -.169275      .258678
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  18.415     157.58   0.1169   0.907   -290.428      327.258
    Bias-corrected | -47.687     157.58   -0.3026  0.762    -356.53      261.156
            Robust | -47.687     224.87   -0.2121  0.832   -488.417      393.043
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04372     .04764   0.9178   0.359   -.049649      .137096
    Bias-corrected |  .00403     .04764   0.0846   0.933   -.089343      .097402
            Robust |  .00403     .06875   0.0586   0.953   -.130709      .138768
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.4512     3.0238   0.8106   0.418    -3.4753      8.37774
    Bias-corrected |  4.3662     3.0238   1.4439   0.149   -1.56036      10.2927
            Robust |  4.3662     4.4478   0.9816   0.326   -4.35137      13.0837
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |      1034        1403            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.838      66.838
       BW bias (b) |   105.984     105.984
         rho (h/b) |     0.631       0.631
        Unique obs |       315         237

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02538      .0376   0.6750   0.500   -.048314      .099079
    Bias-corrected |   .0149      .0376   0.3963   0.692   -.058796      .088596
            Robust |   .0149     .04451   0.3348   0.738   -.072334      .102134
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.4699      3.096   0.4748   0.635   -4.59817      7.53801
    Bias-corrected |  1.4475      3.096   0.4675   0.640   -4.62057      7.51561
            Robust |  1.4475     3.6539   0.3962   0.692   -5.71393      8.60897
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 1 results.xls
dir : seeout

. 
. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(
> nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       487         439            Kernel        =    Uniform
Eff. Number of obs |       487         439            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02619     .07019   0.3731   0.709   -.111378      .163752
    Bias-corrected | -.02056     .07019   -0.2929  0.770   -.158121      .117009
            Robust | -.02056     .08639   -0.2379  0.812   -.189884      .148771
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.4042      11.97   0.3679   0.713   -19.0569      27.8653
    Bias-corrected |  12.929      11.97   1.0801   0.280   -10.5322        36.39
            Robust |  12.929     16.565   0.7805   0.435   -19.5376      45.3954
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(
> nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1278        1433            Kernel        =    Uniform
Eff. Number of obs |      1278        1433            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05015     .05578   0.8991   0.369   -.059173      .159477
    Bias-corrected |  .03698     .05578   0.6629   0.507   -.072348      .146302
            Robust |  .03698     .06595   0.5607   0.575   -.092281      .166235
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.5365     1.9485   0.7886   0.430   -2.28244      5.35554
    Bias-corrected |  2.5691     1.9485   1.3185   0.187   -1.24989      6.38809
            Robust |  2.5691     2.6313   0.9763   0.329   -2.58824      7.72645
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pr
> ovince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16101
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8341        7760            Kernel        = Epanechnikov
Eff. Number of obs |      3769        4039            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    95.326      95.326
       BW bias (b) |   125.785     125.785
         rho (h/b) |     0.758       0.758
        Unique obs |       370         261
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03841      .0429   0.8954   0.371   -.045674      .122504
    Bias-corrected |  .02691      .0429   0.6273   0.530   -.057175      .111003
            Robust |  .02691     .04525   0.5947   0.552    -.06178      .115607
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0461     1.8503   0.5654   0.572   -2.58042      4.67265
    Bias-corrected |  1.0739     1.8503   0.5804   0.562   -2.55263      4.70045
            Robust |  1.0739     1.9304   0.5563   0.578   -2.70957      4.85739
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(
> 12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        621
-------------------+----------------------            BW type       =     Manual
     Number of obs |       316         305            Kernel        =    Uniform
Eff. Number of obs |       316         305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00738     .07842   0.0941   0.925    -.14632      .161086
    Bias-corrected |  .08531     .07842   1.0878   0.277   -.068394      .239011
            Robust |  .08531     .09873   0.8641   0.388   -.108193      .278811
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  10.059     106.15   0.0948   0.925   -197.998      218.116
    Bias-corrected | -90.497     106.15   -0.8525  0.394   -298.554      117.559
            Robust | -90.497     142.44   -0.6353  0.525   -369.681      188.686
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(
> 36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1832
-------------------+----------------------            BW type       =     Manual
     Number of obs |       826        1006            Kernel        =    Uniform
Eff. Number of obs |       826        1006            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06401     .05873   1.0899   0.276   -.051104       .17913
    Bias-corrected |  .00223     .05873   0.0380   0.970   -.112885      .117349
            Robust |  .00223     .07378   0.0303   0.976   -.142366       .14683
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8401     2.0591   0.8936   0.372    -2.1957      5.87587
    Bias-corrected |  2.9218     2.0591   1.4189   0.156   -1.11402      6.95755
            Robust |  2.9218     2.7774   1.0520   0.293   -2.52177      8.36529
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(
> nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10633
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4641        5992            Kernel        = Epanechnikov
Eff. Number of obs |      2398        3199            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   100.789     100.789
       BW bias (b) |   145.404     145.404
         rho (h/b) |     0.693       0.693
        Unique obs |       320         248
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05227     .03843   1.3602   0.174   -.023048      .127598
    Bias-corrected |  .04624     .03843   1.2033   0.229   -.029079      .121566
            Robust |  .04624     .04417   1.0469   0.295   -.040332      .132819
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2389     1.7685   0.7005   0.484   -2.22734      4.70504
    Bias-corrected |  .89982     1.7685   0.5088   0.611   -2.56637      4.36601
            Robust |  .89982     1.8738   0.4802   0.631   -2.77273      4.57237
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106          99            Kernel        =    Uniform
Eff. Number of obs |       106          99            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02458       .091   -0.2701  0.787   -.202937      .153773
    Bias-corrected |  .10465       .091   1.1500   0.250   -.073701      .283008
            Robust |  .10465     .10503   0.9964   0.319   -.101208      .310514
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.3347     17.378   0.2494   0.803   -29.7266      38.3959
    Bias-corrected |  27.503     17.378   1.5826   0.114   -6.55836      61.5641
            Robust |  27.503      21.53   1.2774   0.201   -14.6954      69.7011
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08632     .07746   1.1145   0.265   -.065488      .238131
    Bias-corrected |  .02569     .07746   0.3317   0.740    -.12612      .177499
            Robust |  .02569      .0822   0.3125   0.755   -.135422      .186801
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.5565     1.7605   0.8841   0.377   -1.89408      5.00709
    Bias-corrected |  1.5292     1.7605   0.8686   0.385   -1.92142      4.97976
            Robust |  1.5292     2.3203   0.6590   0.510   -3.01849      6.07683
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2753
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1595            Kernel        = Epanechnikov
Eff. Number of obs |       514         559            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.292      62.292
       BW bias (b) |    93.859      93.859
         rho (h/b) |     0.664       0.664
        Unique obs |       236         243
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04513     .06751   0.6685   0.504   -.087189      .177446
    Bias-corrected |  .05023     .06751   0.7440   0.457   -.082091      .182544
            Robust |  .05023     .07986   0.6289   0.529   -.106297      .206749
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.6061     4.1911   0.6218   0.534   -5.60818      10.8205
    Bias-corrected |  2.9286     4.1911   0.6988   0.485   -5.28571      11.1429
            Robust |  2.9286      4.705   0.6224   0.534    -6.2931      12.1503
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        416
-------------------+----------------------            BW type       =     Manual
     Number of obs |       210         206            Kernel        =    Uniform
Eff. Number of obs |       210         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00893     .08936   0.1000   0.920   -.166213      .184081
    Bias-corrected |   .0447     .08936   0.5002   0.617   -.130445      .219849
            Robust |   .0447     .12006   0.3723   0.710   -.190604      .280008
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  18.415     182.83   0.1007   0.920   -339.925      376.755
    Bias-corrected | -47.687     182.83   -0.2608  0.794   -406.027      310.653
            Robust | -47.687     251.02   -0.1900  0.849   -539.668      444.293
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1201
-------------------+----------------------            BW type       =     Manual
     Number of obs |       523         678            Kernel        =    Uniform
Eff. Number of obs |       523         678            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04372     .06666   0.6559   0.512    -.08693      .174377
    Bias-corrected |  .00403     .06666   0.0604   0.952   -.126624      .134683
            Robust |  .00403     .08974   0.0449   0.964   -.171865      .179924
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.4512     3.9353   0.6229   0.533   -5.26175      10.1642
    Bias-corrected |  4.3662     3.9353   1.1095   0.267    -3.3468      12.0791
            Robust |  4.3662     5.3965   0.8091   0.418    -6.2108      14.9431
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7880
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3483        4397            Kernel        = Epanechnikov
Eff. Number of obs |      1129        1507            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.155      71.155
       BW bias (b) |   103.184     103.184
         rho (h/b) |     0.690       0.690
        Unique obs |       315         237
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02867     .05075   0.5649   0.572   -.070799      .128141
    Bias-corrected |  .01562     .05075   0.3078   0.758   -.083848      .115093
            Robust |  .01562      .0601   0.2599   0.795   -.102171      .133416
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3337     3.7679   0.3540   0.723   -6.05125      8.71859
    Bias-corrected |  1.3436     3.7679   0.3566   0.721   -6.04132      8.72852
            Robust |  1.3436     4.1201   0.3261   0.744   -6.73161       9.4188
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(
> 1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06549     .07025   0.9322   0.351   -.072194      .203165
    Bias-corrected |  .04608     .07025   0.6560   0.512   -.091596      .183764
            Robust |  .04608     .12988   0.3548   0.723   -.208474      .300642
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .68447     1.4965   0.4574   0.647    -2.2487      3.61764
    Bias-corrected | -.60502     1.4965   -0.4043  0.686   -3.53819      2.32815
            Robust | -.60502     2.7592   -0.2193  0.826   -6.01298      4.80293
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(
> 1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06645     .03846   1.7276   0.084   -.008937      .141838
    Bias-corrected |  .07453     .03846   1.9378   0.053   -.000853      .149923
            Robust |  .07453     .05989   1.2445   0.213   -.042846      .191916
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .71736     .82711   0.8673   0.386   -.903742      2.33846
    Bias-corrected |  .69307     .82711   0.8379   0.402   -.928028      2.31417
            Robust |  .69307     1.2718   0.5449   0.586   -1.79966       3.1858
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      1946        2126            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.472      53.472
       BW bias (b) |    85.932      85.932
         rho (h/b) |     0.622       0.622
        Unique obs |       369         260

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03935       .033   1.1925   0.233   -.025324      .104027
    Bias-corrected |  .03968       .033   1.2026   0.229   -.024992       .10436
            Robust |  .03968     .03964   1.0012   0.317   -.038001      .117369
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .42407     1.1546   0.3673   0.713   -1.83881      2.68694
    Bias-corrected |  .34403     1.1546   0.2980   0.766   -1.91885      2.60691
            Robust |  .34403     1.3829   0.2488   0.804   -2.36639      3.05445
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) ke
> rnel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03531     .09018   0.3916   0.695   -.141432      .212054
    Bias-corrected |  .23425     .09018   2.5977   0.009    .057505      .410991
            Robust |  .23425     .16208   1.4453   0.148   -.083416      .551912
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.97203       4.87   -0.1996  0.842    -10.517      8.57293
    Bias-corrected |  1.9204       4.87   0.3943   0.693   -7.62453      11.4654
            Robust |  1.9204     8.6306   0.2225   0.824   -14.9952       18.836
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) ke
> rnel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08399       .048   1.7496   0.080   -.010097      .178068
    Bias-corrected |  .02387       .048   0.4972   0.619   -.070218      .117948
            Robust |  .02387     .07622   0.3131   0.754   -.125514      .173244
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1103     .92099   1.2056   0.228   -.694789      2.91542
    Bias-corrected |  .72055     .92099   0.7824   0.434   -1.08455      2.52565
            Robust |  .72055     1.4622   0.4928   0.622   -2.14525      3.58635
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselec
> t(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1864        2345            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    79.109      79.109
       BW bias (b) |   126.772     126.772
         rho (h/b) |     0.624       0.624
        Unique obs |       319         247

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0492     .03335   1.4753   0.140   -.016165      .114575
    Bias-corrected |  .04551     .03335   1.3646   0.172   -.019858      .110881
            Robust |  .04551     .04032   1.1289   0.259   -.033507       .12453
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .68913     .99958   0.6894   0.491      -1.27      2.64827
    Bias-corrected |  .37656     .99958   0.3767   0.706   -1.58257       2.3357
            Robust |  .37656     1.2061   0.3122   0.755   -1.98744      2.74057
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04027     .15305   -0.2631  0.792   -.340228      .259697
    Bias-corrected |  .05521     .15305   0.3607   0.718   -.244754      .355172
            Robust |  .05521      .2765   0.1997   0.842   -.486727      .597144
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.2752     11.732   0.2792   0.780   -19.7197      26.2702
    Bias-corrected |  13.374     11.732   1.1399   0.254   -9.62093       36.369
            Robust |  13.374     21.038   0.6357   0.525   -27.8587      54.6068
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09894     .07936   1.2467   0.213   -.056609      .254484
    Bias-corrected |  .02995     .07936   0.3774   0.706   -.125593      .185501
            Robust |  .02995      .1286   0.2329   0.816   -.222094      .282002
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   1.803     1.5313   1.1774   0.239   -1.19833      4.80433
    Bias-corrected |  2.2399     1.5313   1.4627   0.144   -.761462       5.2412
            Robust |  2.2399     2.4991   0.8963   0.370   -2.65819      7.13794
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       629         650            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    79.933      79.933
       BW bias (b) |   143.767     143.767
         rho (h/b) |     0.556       0.556
        Unique obs |       235         242

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0446     .05522   0.8076   0.419   -.063638       .15283
    Bias-corrected |  .05677     .05522   1.0281   0.304   -.051462      .165006
            Robust |  .05677     .06474   0.8769   0.381   -.070125      .183668
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.2815     2.8232   0.8081   0.419   -3.25178      7.81483
    Bias-corrected |  1.7808     2.8232   0.6308   0.528   -3.75254      7.31407
            Robust |  1.7808     3.3195   0.5365   0.592   -4.72536      8.28689
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04756     .09792   0.4857   0.627   -.144352      .239476
    Bias-corrected |  .19756     .09792   2.0177   0.044     .00565      .389478
            Robust |  .19756     .17448   1.1323   0.257   -.144404      .539533
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13837     3.4348   -0.0403  0.968   -6.87043      6.59368
    Bias-corrected | -2.4752     3.4348   -0.7206  0.471    -9.2073      4.25682
            Robust | -2.4752     6.0912   -0.4064  0.684   -14.4138      9.46333
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06338     .05202   1.2185   0.223   -.038571      .165333
    Bias-corrected |  .03481     .05202   0.6693   0.503   -.067137      .136766
            Robust |  .03481     .08293   0.4198   0.675   -.127727      .197356
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .71461     1.4151   0.5050   0.614   -2.05899      3.48821
    Bias-corrected | -.54135     1.4151   -0.3825  0.702   -3.31495      2.23225
            Robust | -.54135       2.23   -0.2428  0.808   -4.91201      3.82931
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |       951        1289            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.743      62.743
       BW bias (b) |   100.860     100.860
         rho (h/b) |     0.622       0.622
        Unique obs |       314         236

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03299     .04105   0.8038   0.422   -.047458      .113444
    Bias-corrected |  .02317     .04105   0.5645   0.572   -.057281      .103621
            Robust |  .02317     .04932   0.4698   0.639   -.073502      .119842
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.33502      2.247   -0.1491  0.881   -4.73911      4.06907
    Bias-corrected |  -1.313      2.247   -0.5843  0.559   -5.71713      3.09105
            Robust |  -1.313     2.6792   -0.4901  0.624    -6.5642      3.93812
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(
> 1) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         380            Kernel        =    Uniform
Eff. Number of obs |       443         380            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06549     .08155   0.8031   0.422   -.094341      .225312
    Bias-corrected |  .04608     .08155   0.5651   0.572   -.113742       .20591
            Robust |  .04608      .1394   0.3306   0.741   -.227132        .3193
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .68447     1.5261   0.4485   0.654   -2.30669      3.67562
    Bias-corrected | -.60502     1.5261   -0.3964  0.692   -3.59618      2.38613
            Robust | -.60502     3.6623   -0.1652  0.869   -7.78291      6.57287
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(
> 1) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2608
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1234        1374            Kernel        =    Uniform
Eff. Number of obs |      1234        1374            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06645     .05665   1.1729   0.241    -.04459      .177491
    Bias-corrected |  .07453     .05665   1.3156   0.188   -.036505      .185575
            Robust |  .07453     .07308   1.0199   0.308     -.0687       .21777
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .71736     1.0781   0.6654   0.506   -1.39577      2.83048
    Bias-corrected |  .69307     1.0781   0.6428   0.520   -1.42005       2.8062
            Robust |  .69307     1.5978   0.4338   0.664   -2.43853      3.82468
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
>  vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15998
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8297        7701            Kernel        = Epanechnikov
Eff. Number of obs |      2374        2578            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.579      63.579
       BW bias (b) |    86.859      86.859
         rho (h/b) |     0.732       0.732
        Unique obs |       369         260
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03888     .04771   0.8148   0.415   -.054639      .132392
    Bias-corrected |  .03851     .04771   0.8070   0.420    -.05501      .132022
            Robust |  .03851     .05503   0.6998   0.484   -.069342      .146354
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .30986     1.6266   0.1905   0.849   -2.87827      3.49799
    Bias-corrected |   .1659     1.6266   0.1020   0.919   -3.02223      3.35402
            Robust |   .1659     1.7724   0.0936   0.925   -3.30795      3.63975
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) ke
> rnel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        540
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         260            Kernel        =    Uniform
Eff. Number of obs |       280         260            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03531      .0892   0.3959   0.692   -.139511      .210133
    Bias-corrected |  .23425      .0892   2.6262   0.009    .059426       .40907
            Robust |  .23425     .17059   1.3732   0.170   -.100103      .568599
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.97203     4.2808   -0.2271  0.820   -9.36217      7.41811
    Bias-corrected |  1.9204     4.2808   0.4486   0.654   -6.46971      10.3106
            Robust |  1.9204     7.6237   0.2519   0.801   -13.0217      16.8626
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) ke
> rnel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1751
-------------------+----------------------            BW type       =     Manual
     Number of obs |       790         961            Kernel        =    Uniform
Eff. Number of obs |       790         961            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08399     .05775   1.4544   0.146   -.029194      .197165
    Bias-corrected |  .02387     .05775   0.4133   0.679   -.089314      .137044
            Robust |  .02387     .07804   0.3058   0.760   -.129085      .176815
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1103     1.2085   0.9188   0.358   -1.25823      3.47886
    Bias-corrected |  .72055     1.2085   0.5963   0.551   -1.64799       3.0891
            Robust |  .72055     1.7748   0.4060   0.685   -2.75795      4.19905
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselec
> t(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10552
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4605        5947            Kernel        = Epanechnikov
Eff. Number of obs |      1864        2345            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    79.996      79.996
       BW bias (b) |   128.211     128.211
         rho (h/b) |     0.624       0.624
        Unique obs |       319         247
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04969     .04223   1.1768   0.239   -.033071      .132457
    Bias-corrected |  .04659     .04223   1.1034   0.270   -.036172      .129356
            Robust |  .04659     .04888   0.9532   0.340   -.049206       .14239
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .69588     1.7692   0.3933   0.694   -2.77176      4.16353
    Bias-corrected |  .37325     1.7692   0.2110   0.833    -3.0944      3.84089
            Robust |  .37325     1.8411   0.2027   0.839   -3.23526      3.98176
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        177
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          83            Kernel        =    Uniform
Eff. Number of obs |        94          83            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04027     .15354   -0.2622  0.793   -.341206      .260675
    Bias-corrected |  .05521     .15354   0.3596   0.719   -.245732       .35615
            Robust |  .05521     .27547   0.2004   0.841   -.484701      .595119
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.2752     13.173   0.2486   0.804   -22.5427      29.0932
    Bias-corrected |  13.374     13.173   1.0153   0.310   -12.4439       39.192
            Robust |  13.374     22.599   0.5918   0.554   -30.9185      57.6665
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        603
-------------------+----------------------            BW type       =     Manual
     Number of obs |       291         312            Kernel        =    Uniform
Eff. Number of obs |       291         312            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09894     .08735   1.1326   0.257    -.07227      .270145
    Bias-corrected |  .02995     .08735   0.3429   0.732   -.141253      .201161
            Robust |  .02995     .10717   0.2795   0.780   -.180088      .239996
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   1.803      1.664   1.0836   0.279    -1.4583       5.0643
    Bias-corrected |  2.2399      1.664   1.3461   0.178   -1.02143      5.50117
            Robust |  2.2399     2.1755   1.0296   0.303   -2.02411      6.50385
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all 
> vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2725
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1146        1579            Kernel        = Epanechnikov
Eff. Number of obs |       664         675            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    83.331      83.331
       BW bias (b) |   144.664     144.664
         rho (h/b) |     0.576       0.576
        Unique obs |       235         242
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04546     .06573   0.6917   0.489   -.083368      .174296
    Bias-corrected |  .05876     .06573   0.8940   0.371   -.070068      .187595
            Robust |  .05876     .07725   0.7607   0.447   -.092637      .210164
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.1407      3.508   0.6102   0.542   -4.73486      9.01618
    Bias-corrected |  1.6395      3.508   0.4674   0.640   -5.23601      8.51503
            Robust |  1.6395     3.9422   0.4159   0.677   -6.08703      9.36604
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       186         177            Kernel        =    Uniform
Eff. Number of obs |       186         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04756      .1013   0.4695   0.639   -.150987       .24611
    Bias-corrected |  .19756      .1013   1.9503   0.051   -.000984      .396113
            Robust |  .19756      .2087   0.9466   0.344   -.211489      .606618
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13837     2.9846   -0.0464  0.963   -5.98816      5.71141
    Bias-corrected | -2.4752     2.9846   -0.8293  0.407   -8.32503      3.37455
            Robust | -2.4752     6.3844   -0.3877  0.698   -14.9884      10.0379
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1148
-------------------+----------------------            BW type       =     Manual
     Number of obs |       499         649            Kernel        =    Uniform
Eff. Number of obs |       499         649            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06338     .06408   0.9892   0.323   -.062206      .188968
    Bias-corrected |  .03481     .06408   0.5433   0.587   -.090772      .160401
            Robust |  .03481     .09783   0.3559   0.722   -.156932      .226561
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .71461     1.7272   0.4137   0.679   -2.67058       4.0998
    Bias-corrected | -.54135     1.7272   -0.3134  0.754   -3.92654      2.84384
            Robust | -.54135     2.4307   -0.2227  0.824   -5.30543      4.22273
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all 
> vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7827
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3459        4368            Kernel        = Epanechnikov
Eff. Number of obs |       921        1211            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.283      60.283
       BW bias (b) |    92.696      92.696
         rho (h/b) |     0.650       0.650
        Unique obs |       314         236
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03079     .05469   0.5630   0.573   -.076394      .137968
    Bias-corrected |  .02072     .05469   0.3788   0.705   -.086464      .127898
            Robust |  .02072     .06563   0.3157   0.752   -.107918      .149353
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.28181     3.3982   -0.0829  0.934   -6.94215      6.37853
    Bias-corrected | -1.2238     3.3982   -0.3601  0.719   -7.88413      5.43655
            Robust | -1.2238     3.6052   -0.3394  0.734   -8.28991      5.84233
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 4 results.xls
dir : seeout

. 
. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(
> 1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09459     .09025   1.0481   0.295   -.082291      .271475
    Bias-corrected |  .11706     .09025   1.2971   0.195   -.059824      .293942
            Robust |  .11706      .2055   0.5696   0.569   -.285711      .519829
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .35657     1.3437   0.2654   0.791   -2.27696      2.99011
    Bias-corrected | -2.7429     1.3437   -2.0413  0.041    -5.3764      -.10933
            Robust | -2.7429     3.1903   -0.8597  0.390   -8.99584       3.5101
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(
> 1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07366     .04188   1.7586   0.079   -.008433      .155745
    Bias-corrected |  .10072     .04188   2.4049   0.016    .018635      .182813
            Robust |  .10072     .07165   1.4058   0.160   -.039702      .241149
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .60963     .80655   0.7558   0.450   -.971187      2.19045
    Bias-corrected |  .38279     .80655   0.4746   0.635   -1.19802      1.96361
            Robust |  .38279     1.3722   0.2790   0.780   -2.30663      3.07222
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      1632        1819            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.713      47.713
       BW bias (b) |    80.538      80.538
         rho (h/b) |     0.592       0.592
        Unique obs |       368         259

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04981     .03771   1.3210   0.187   -.024096      .123725
    Bias-corrected |  .05266     .03771   1.3964   0.163    -.02125      .126571
            Robust |  .05266     .04559   1.1550   0.248   -.036699       .14202
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .27657     1.0567   0.2617   0.794    -1.7946      2.34773
    Bias-corrected |  .21604     1.0567   0.2044   0.838   -1.85513       2.2872
            Robust |  .21604     1.2755   0.1694   0.865   -2.28381      2.71589
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) ke
> rnel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05749      .1213   -0.4740  0.636   -.295248      .180259
    Bias-corrected |  .17259      .1213   1.4228   0.155   -.065164      .410343
            Robust |  .17259     .29165   0.5918   0.554   -.399043      .744222
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    1.48     3.7487   0.3948   0.693    -5.8673      8.82727
    Bias-corrected |  14.563     3.7487   3.8848   0.000    7.21559      21.9102
            Robust |  14.563     9.0293   1.6128   0.107    -3.1342      32.2599
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) ke
> rnel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07044     .05256   1.3402   0.180   -.032572      .173444
    Bias-corrected | -.03923     .05256   -0.7465  0.455   -.142242      .063774
            Robust | -.03923     .09335   -0.4203  0.674   -.222203      .143735
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.4465     1.3284   1.0889   0.276   -1.15708       4.0501
    Bias-corrected |  1.9013     1.3284   1.4313   0.152   -.702303      4.50488
            Robust |  1.9013     2.3464   0.8103   0.418   -2.69748      6.50006
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselec
> t(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |      1158        1465            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.757      52.757
       BW bias (b) |    87.719      87.719
         rho (h/b) |     0.601       0.601
        Unique obs |       318         246

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03259     .04462   0.7304   0.465   -.054866      .120056
    Bias-corrected |  .02633     .04462   0.5901   0.555    -.06113      .113791
            Robust |  .02633     .05439   0.4841   0.628   -.080274      .132935
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   1.637     2.5987   0.6299   0.529   -3.45634      6.73044
    Bias-corrected |  1.9767     2.5987   0.7606   0.447   -3.11672      7.07005
            Robust |  1.9767     3.1655   0.6244   0.532   -4.22764      8.18097
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0497     .19041   -0.2610  0.794    -.42289      .323499
    Bias-corrected |  .18785     .19041   0.9865   0.324   -.185347      .561041
            Robust |  .18785     .46416   0.4047   0.686    -.72189      1.09758
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.0087     14.178   0.2827   0.777   -23.7797      31.7971
    Bias-corrected |  33.571     14.178   2.3678   0.018     5.7824      61.3591
            Robust |  33.571     32.965   1.0184   0.308   -31.0389      98.1804
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11816     .08459   1.3969   0.162   -.047633      .283954
    Bias-corrected |  .04368     .08459   0.5164   0.606    -.12211      .209477
            Robust |  .04368     .14921   0.2928   0.770   -.248764      .336131
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6081     1.2531   1.2832   0.199   -.848028      4.06417
    Bias-corrected |   2.012     1.2531   1.6056   0.108   -.444116      4.46809
            Robust |   2.012     2.1613   0.9309   0.352   -2.22411      6.24808
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       603         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    76.882      76.882
       BW bias (b) |   142.068     142.068
         rho (h/b) |     0.541       0.541
        Unique obs |       234         241

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04894     .05818   0.8413   0.400   -.065086      .162974
    Bias-corrected |  .06252     .05818   1.0746   0.283   -.051511      .176549
            Robust |  .06252     .06828   0.9157   0.360   -.071303      .196341
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.1427     2.5486   0.8407   0.400   -2.85247      7.13792
    Bias-corrected |  1.6751     2.5486   0.6573   0.511   -3.32007      6.67032
            Robust |  1.6751     2.9979   0.5588   0.576   -4.20059      7.55084
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0398     .13385   -0.2973  0.766   -.302139      .222542
    Bias-corrected |  .08962     .13385   0.6696   0.503   -.172718      .351962
            Robust |  .08962     .31888   0.2811   0.779   -.535376       .71462
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0573     5.7819   -0.0099  0.992   -11.3897      11.2751
    Bias-corrected |  9.5094     5.7819   1.6447   0.100   -1.82293      20.8418
            Robust |  9.5094     13.712   0.6935   0.488   -17.3652      36.3841
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04424     .05731   0.7720   0.440    -.06809      .156577
    Bias-corrected | -.03229     .05731   -0.5633  0.573   -.144619      .080047
            Robust | -.03229     .10274   -0.3143  0.753    -.23365      .169078
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2274     2.4924   0.4925   0.622   -3.65754      6.11235
    Bias-corrected |  .26716     2.4924   0.1072   0.915   -4.61779      5.15211
            Robust |  .26716     4.4966   0.0594   0.953   -8.54601      9.08032
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       721         962            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.338      50.338
       BW bias (b) |    86.972      86.972
         rho (h/b) |     0.579       0.579
        Unique obs |       313         235

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00822     .04981   0.1650   0.869   -.089408      .105849
    Bias-corrected | -.00594     .04981   -0.1193  0.905   -.103572      .091685
            Robust | -.00594     .05979   -0.0994  0.921   -.123131      .111243
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   -1.13     13.487   -0.0838  0.933   -27.5643      25.3043
    Bias-corrected | -5.4123     13.487   -0.4013  0.688   -31.8465       21.022
            Robust | -5.4123     16.114   -0.3359  0.737   -36.9959      26.1714
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 5 results.xls
dir : seeout

. 
. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(
> 1) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        719
-------------------+----------------------            BW type       =     Manual
     Number of obs |       395         324            Kernel        =    Uniform
Eff. Number of obs |       395         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09459      .0873   1.0836   0.279   -.076506      .265689
    Bias-corrected |  .11706      .0873   1.3409   0.180   -.054038      .288156
            Robust |  .11706     .20734   0.5646   0.572   -.289326      .523444
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .35657     1.1344   0.3143   0.753   -1.86673      2.57988
    Bias-corrected | -2.7429     1.1344   -2.4180  0.016   -4.96617     -.519562
            Robust | -2.7429     3.5894   -0.7642  0.445    -9.7779      4.29217
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(
> 1) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2504
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1186        1318            Kernel        =    Uniform
Eff. Number of obs |      1186        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07366      .0564   1.3059   0.192   -.036887        .1842
    Bias-corrected |  .10072      .0564   1.7859   0.074    -.00982      .211267
            Robust |  .10072     .07355   1.3694   0.171   -.043434      .244881
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .60963     .88935   0.6855   0.493   -1.13346      2.35272
    Bias-corrected |  .38279     .88935   0.4304   0.667    -1.3603      2.12588
            Robust |  .38279     1.3405   0.2856   0.775   -2.24459      3.01017
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
>  vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15894
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8249        7645            Kernel        = Epanechnikov
Eff. Number of obs |      1985        2160            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.423      55.423
       BW bias (b) |    77.995      77.995
         rho (h/b) |     0.711       0.711
        Unique obs |       368         259
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04071     .04705   0.8653   0.387   -.051499      .132919
    Bias-corrected |  .04659     .04705   0.9904   0.322   -.045616      .138802
            Robust |  .04659     .05449   0.8551   0.393   -.060204      .153391
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .24988     1.6388   0.1525   0.879   -2.96215      3.46191
    Bias-corrected |  .24427     1.6388   0.1490   0.882   -2.96776      3.45629
            Robust |  .24427     1.8673   0.1308   0.896   -3.41552      3.90406
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) ke
> rnel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        470
-------------------+----------------------            BW type       =     Manual
     Number of obs |       244         226            Kernel        =    Uniform
Eff. Number of obs |       244         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05749     .09628   -0.5971  0.550   -.246206      .131217
    Bias-corrected |  .17259     .09628   1.7925   0.073   -.016122      .361301
            Robust |  .17259     .27196   0.6346   0.526   -.360436      .705614
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    1.48     3.1594   0.4684   0.639   -4.71242       7.6724
    Bias-corrected |  14.563     3.1594   4.6093   0.000    8.37046      20.7553
            Robust |  14.563     8.8782   1.6403   0.101   -2.83817      31.9639
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) ke
> rnel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1681
-------------------+----------------------            BW type       =     Manual
     Number of obs |       754         927            Kernel        =    Uniform
Eff. Number of obs |       754         927            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07044     .06006   1.1727   0.241   -.047283      .188154
    Bias-corrected | -.03923     .06006   -0.6532  0.514   -.156952      .078484
            Robust | -.03923     .08612   -0.4556  0.649   -.208024      .129556
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.4465     1.4623   0.9892   0.323   -1.41953      4.31254
    Bias-corrected |  1.9013     1.4623   1.3002   0.194   -.964747      4.76732
            Robust |  1.9013     2.1079   0.9020   0.367   -2.23012      6.03269
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselec
> t(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10482
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4569        5913            Kernel        = Epanechnikov
Eff. Number of obs |      1116        1404            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.118      50.118
       BW bias (b) |    80.134      80.134
         rho (h/b) |     0.625       0.625
        Unique obs |       318         246
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03324     .05048   0.6586   0.510   -.065691      .132175
    Bias-corrected |  .02836     .05048   0.5618   0.574   -.070574      .127292
            Robust |  .02836     .06137   0.4621   0.644   -.091918      .148635
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6601     3.4355   0.4832   0.629   -5.07335      8.39359
    Bias-corrected |  2.1993     3.4355   0.6402   0.522    -4.5342      8.93274
            Robust |  2.1993     3.8804   0.5668   0.571   -5.40616      9.80471
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0497     .21389   -0.2323  0.816   -.468908      .369517
    Bias-corrected |  .18785     .21389   0.8783   0.380   -.231365      .607059
            Robust |  .18785     .48488   0.3874   0.698   -.762509       1.1382
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.0087     16.974   0.2362   0.813   -29.2602      37.2776
    Bias-corrected |  33.571     16.974   1.9777   0.048    .301891      66.8396
            Robust |  33.571     38.571   0.8704   0.384   -42.0278      109.169
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       280         306            Kernel        =    Uniform
Eff. Number of obs |       280         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11816     .09209   1.2831   0.199   -.062332      .298653
    Bias-corrected |  .04368     .09209   0.4744   0.635   -.136809      .224176
            Robust |  .04368     .13388   0.3263   0.744   -.218712      .306078
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6081     1.2666   1.2696   0.204   -.874501      4.09065
    Bias-corrected |   2.012     1.2666   1.5884   0.112   -.470588      4.49456
            Robust |   2.012     1.6635   1.2095   0.226   -1.24844      5.27241
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all 
> vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2708
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1135        1573            Kernel        = Epanechnikov
Eff. Number of obs |       653         669            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    83.491      83.491
       BW bias (b) |   151.620     151.620
         rho (h/b) |     0.551       0.551
        Unique obs |       234         241
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05077     .06588   0.7707   0.441   -.078344      .179894
    Bias-corrected |   .0671     .06588   1.0186   0.308   -.062014      .196224
            Robust |   .0671     .07637   0.8787   0.380   -.082581       .21679
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.9024     2.7655   0.6879   0.492   -3.51787      7.32262
    Bias-corrected |   1.418     2.7655   0.5128   0.608   -4.00221      6.83828
            Robust |   1.418      3.082   0.4601   0.645   -4.62261      7.45868
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        310
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         149            Kernel        =    Uniform
Eff. Number of obs |       161         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0398     .13274   -0.2998  0.764   -.299969      .220372
    Bias-corrected |  .08962     .13274   0.6752   0.500   -.170549      .349792
            Robust |  .08962     .26031   0.3443   0.731    -.42057      .599814
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0573     4.1933   -0.0137  0.989   -8.27598      8.16137
    Bias-corrected |  9.5094     4.1933   2.2678   0.023    1.29077      17.7281
            Robust |  9.5094     12.899   0.7372   0.461   -15.7714      34.7903
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(uni) p(1
> ) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1095
-------------------+----------------------            BW type       =     Manual
     Number of obs |       474         621            Kernel        =    Uniform
Eff. Number of obs |       474         621            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04424     .07044   0.6281   0.530   -.093818      .182305
    Bias-corrected | -.03229     .07044   -0.4583  0.647   -.170347      .105775
            Robust | -.03229     .12019   -0.2686  0.788   -.267852       .20328
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2274     2.6507   0.4631   0.643   -3.96782      6.42263
    Bias-corrected |  .26716     2.6507   0.1008   0.920   -4.92806      5.46238
            Robust |  .26716     4.1893   0.0638   0.949   -7.94365      8.47796
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male tenure tenuresqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all 
> vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7774
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3434        4340            Kernel        = Epanechnikov
Eff. Number of obs |       682         906            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    48.879      48.879
       BW bias (b) |    84.804      84.804
         rho (h/b) |     0.576       0.576
        Unique obs |       313         235
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00947      .0638   0.1484   0.882   -.115588      .134522
    Bias-corrected | -.00482      .0638   -0.0756  0.940   -.129876      .120234
            Robust | -.00482     .07629   -0.0632  0.950   -.154351      .144709
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.75261     13.759   -0.0547  0.956   -27.7189      26.2137
    Bias-corrected | -3.4133     13.759   -0.2481  0.804   -30.3796      23.5529
            Robust | -3.4133      15.35   -0.2224  0.824   -33.4988      26.6721
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Tenure control
> led/Earning Sheet 6 results.xls
dir : seeout

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male T
> enure controlled/Urban 1979 Higheredu FuzzyOption MaleTenure controlled.log
  log type:  text
 closed on:   6 Aug 2024, 17:16:15
---------------------------------------------------------------------------------------------
