---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male c
> ontrolled/Rural/Rural 1979 Higheredu FuzzyOption Male controlled.log
  log type:  text
 opened on:   8 Aug 2024, 12:43:40

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(27,895 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,455 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(34,426 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(2,298 real changes made)

. 
. *Step Two: Regressions
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03774     .03614   1.0444   0.296   -.033084      .108564
    Bias-corrected | -.01966     .03614   -0.5442  0.586   -.090487      .051161
            Robust | -.01966     .05202   -0.3780  0.705   -.121617       .08229
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.9587     5.1813   -0.7640  0.445   -14.1138      6.19636
    Bias-corrected | -14.919     5.1813   -2.8794  0.004   -25.0743     -4.76409
            Robust | -14.919     7.8715   -1.8953  0.058   -30.3471      .508699
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00905     .02494   -0.3629  0.717   -.057926      .039828
    Bias-corrected |  .03967     .02494   1.5906   0.112   -.009212      .088543
            Robust |  .03967     .03356   1.1819   0.237   -.026112      .105443
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.8173     13.435   0.2841   0.776   -22.5154        30.15
    Bias-corrected |  27.636     13.435   2.0570   0.040    1.30319      53.9685
            Robust |  27.636     18.768   1.4725   0.141   -9.14873      64.4205
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs(ma
> le) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |       913         998            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.782      56.782
       BW bias (b) |    95.169      95.169
         rho (h/b) |     0.597       0.597
        Unique obs |       388         283

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01602     .02107   -0.7603  0.447   -.057307      .025272
    Bias-corrected | -.01101     .02107   -0.5227  0.601     -.0523      .030278
            Robust | -.01101     .02425   -0.4541  0.650   -.058531      .036509
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .89361     4.1537   0.2151   0.830   -7.24744      9.03467
    Bias-corrected |  .20471     4.1537   0.0493   0.961   -7.93635      8.34576
            Robust |  .20471     4.8436   0.0423   0.966   -9.28852      9.69793
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16918      .1471   1.1501   0.250    -.11913       .45748
    Bias-corrected | -.01462      .1471   -0.0994  0.921   -.302928      .273683
            Robust | -.01462     .16961   -0.0862  0.931   -.347056      .317811
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0325     1.4673   0.7037   0.482   -1.84335      3.90834
    Bias-corrected |  .61865     1.4673   0.4216   0.673    -2.2572      3.49449
            Robust |  .61865     2.3034   0.2686   0.788   -3.89599      5.13329
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00358     .09855   -0.0363  0.971   -.196729      .189569
    Bias-corrected |  .13787     .09855   1.3990   0.162   -.055279       .33102
            Robust |  .13787     .13701   1.0063   0.314    -.13067      .406411
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  5.3435     155.97   0.0343   0.973   -300.348      311.035
    Bias-corrected |  137.29     155.97   0.8802   0.379   -168.403      442.979
            Robust |  137.29      214.3   0.6406   0.522   -282.727      557.303
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       185         249            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.225      58.225
       BW bias (b) |    97.493      97.493
         rho (h/b) |     0.597       0.597
        Unique obs |       306         261

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01357     .08219   0.1651   0.869   -.147523      .174656
    Bias-corrected |  .03659     .08219   0.4452   0.656   -.124501      .197678
            Robust |  .03659     .09581   0.3819   0.703   -.151204      .224381
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .62748     10.176   0.0617   0.951   -19.3171      20.5721
    Bias-corrected |  .22927     10.176   0.0225   0.982   -19.7153      20.1739
            Robust |  .22927     11.954   0.0192   0.985   -23.2001      23.6587
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19696     .19373   1.0167   0.309   -.182747      .576665
    Bias-corrected | -.27002     .19373   -1.3938  0.163   -.649729      .109683
            Robust | -.27002     .24783   -1.0895  0.276   -.755766       .21572
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.62752     2.0017   -0.3135  0.754   -4.55076      3.29572
    Bias-corrected | -.05071     2.0017   -0.0253  0.980   -3.97395      3.87253
            Robust | -.05071     4.5865   -0.0111  0.991   -9.04011      8.93869
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02083     .11666   0.1786   0.858   -.207828       .24949
    Bias-corrected |  .09855     .11666   0.8447   0.398   -.130107      .327211
            Robust |  .09855     .17111   0.5760   0.565   -.236817      .433921
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.9013      18.81   0.1542   0.877   -33.9652      39.7678
    Bias-corrected | -8.5371      18.81   -0.4539  0.650   -45.4036      28.3294
            Robust | -8.5371     26.702   -0.3197  0.749   -60.8727      43.7985
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(mal
> e) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |        83         122            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.289      68.289
       BW bias (b) |   101.630     101.630
         rho (h/b) |     0.672       0.672
        Unique obs |       132         235

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0249      .0938   0.2655   0.791   -.158938      .208736
    Bias-corrected |  .03911      .0938   0.4170   0.677   -.144727      .222947
            Robust |  .03911     .10953   0.3571   0.721   -.175558      .253777
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3743     8.8231   0.1558   0.876   -15.9188      18.6673
    Bias-corrected |  .54768     8.8231   0.0621   0.951   -16.7453      17.8407
            Robust |  .54768     10.481   0.0523   0.958   -19.9951      21.0905
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .23654      .2272   1.0411   0.298   -.208778      .681849
    Bias-corrected |   .1475      .2272   0.6492   0.516   -.297818      .592809
            Robust |   .1475     .22713   0.6494   0.516   -.297666      .592657
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.9668     2.3161   0.8492   0.396   -2.57273      6.50632
    Bias-corrected |  -.4114     2.3161   -0.1776  0.859   -4.95093      4.12812
            Robust |  -.4114     2.4565   -0.1675  0.867     -5.226      4.40319
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04692     .15813   0.2967   0.767   -.263021      .356855
    Bias-corrected |   .2344     .15813   1.4823   0.138   -.075538      .544337
            Robust |   .2344     .22213   1.0552   0.291   -.200972      .669771
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.9902     10.543   -0.2836  0.777   -23.6547      17.6743
    Bias-corrected |  19.683     10.543   1.8669   0.062   -.981042      40.3479
            Robust |  19.683     14.696   1.3394   0.180   -9.12007       48.487
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(mal
> e) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |        94         110            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.996      49.996
       BW bias (b) |    93.473      93.473
         rho (h/b) |     0.535       0.535
        Unique obs |       286         247

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08235     .14152   0.5819   0.561   -.195027      .359733
    Bias-corrected |  .12052     .14152   0.8516   0.394   -.156865      .397896
            Robust |  .12052     .16046   0.7510   0.453   -.193987      .435018
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -1.118     2.9446   -0.3797  0.704   -6.88939      4.65339
    Bias-corrected |  -.4928     2.9446   -0.1674  0.867   -6.26419      5.27859
            Robust |  -.4928     3.3531   -0.1470  0.883   -7.06479      6.07919
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(nncluster provinc
> e_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03774     .04565   0.8267   0.408   -.051734      .127214
    Bias-corrected | -.01966     .04565   -0.4307  0.667   -.109137      .069811
            Robust | -.01966     .05569   -0.3531  0.724   -.128819      .089493
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -3.9587     7.3192   -0.5409  0.589   -18.3041      10.3867
    Bias-corrected | -14.919     7.3192   -2.0384  0.042   -29.2646      -.57378
            Robust | -14.919     10.609   -1.4063  0.160   -35.7125      5.87413
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(nncluster provinc
> e_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00905     .02189   -0.4133  0.679   -.051959      .033861
    Bias-corrected |  .03967     .02189   1.8117   0.070   -.003245      .082576
            Robust |  .03967     .03223   1.2305   0.218   -.023512      .102843
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.8173      12.68   0.3011   0.763   -21.0343      28.6689
    Bias-corrected |  27.636      12.68   2.1795   0.029    2.78423      52.4875
            Robust |  27.636     17.718   1.5598   0.119   -7.08982      62.3615
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs(ma
> le) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |      1180        1280            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.440      70.440
       BW bias (b) |    91.173      91.173
         rho (h/b) |     0.773       0.773
        Unique obs |       388         283
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01499     .02931   -0.5113  0.609   -.072425      .042455
    Bias-corrected | -.00677     .02931   -0.2310  0.817    -.06421       .05067
            Robust | -.00677     .02983   -0.2269  0.820   -.065236      .051696
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.7406     5.4094   0.3218   0.748   -8.86161      12.3428
    Bias-corrected |  .68126     5.4094   0.1259   0.900   -9.92094      11.2835
            Robust |  .68126     6.2748   0.1086   0.914    -11.617      12.9796
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(nnclu
> ster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16918     .17039   0.9929   0.321   -.164777      .503128
    Bias-corrected | -.01462     .17039   -0.0858  0.932   -.348575       .31933
            Robust | -.01462     .18744   -0.0780  0.938   -.381993      .352748
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0325      1.593   0.6481   0.517   -2.08976      4.15475
    Bias-corrected |  .61865      1.593   0.3883   0.698   -2.50361       3.7409
            Robust |  .61865     2.0416   0.3030   0.762   -3.38274      4.62004
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(nnclu
> ster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00358     .08921   -0.0401  0.968   -.178427      .171267
    Bias-corrected |  .13787     .08921   1.5455   0.122   -.036977      .312717
            Robust |  .13787     .14275   0.9658   0.334   -.141918      .417659
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  5.3435     144.62   0.0369   0.971     -278.1      288.787
    Bias-corrected |  137.29     144.62   0.9493   0.342   -146.155      420.731
            Robust |  137.29     225.75   0.6082   0.543   -305.165      579.741
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provinc
> e_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       245         374            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.734      77.734
       BW bias (b) |   110.622     110.622
         rho (h/b) |     0.703       0.703
        Unique obs |       306         261
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01508     .09256   0.1630   0.871   -.166328      .196498
    Bias-corrected |  .03717     .09256   0.4016   0.688   -.144243      .218583
            Robust |  .03717     .10404   0.3573   0.721   -.166752      .241093
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .84542     9.5394   0.0886   0.929   -17.8515      19.5423
    Bias-corrected | -1.1759     9.5394   -0.1233  0.902   -19.8727       17.521
            Robust | -1.1759     12.035   -0.0977  0.922   -24.7634      22.4117
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19696     .16354   1.2044   0.228   -.123565      .517483
    Bias-corrected | -.27002     .16354   -1.6512  0.099   -.590547      .050502
            Robust | -.27002     .20955   -1.2886  0.198   -.680729      .140683
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.62752     2.7264   -0.2302  0.818   -5.97112      4.71608
    Bias-corrected | -.05071     2.7264   -0.0186  0.985   -5.39431      5.29289
            Robust | -.05071     4.2151   -0.0120  0.990   -8.31222      8.21081
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02083     .11479   0.1815   0.856   -.204152      .245815
    Bias-corrected |  .09855     .11479   0.8585   0.391   -.126432      .323535
            Robust |  .09855     .20712   0.4758   0.634   -.307402      .504506
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.9013     19.604   0.1480   0.882   -35.5214       41.324
    Bias-corrected | -8.5371     19.604   -0.4355  0.663   -46.9598      29.8856
            Robust | -8.5371     32.757   -0.2606  0.794   -72.7391      55.6649
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(mal
> e) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |        92         138            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    73.735      73.735
       BW bias (b) |   107.824     107.824
         rho (h/b) |     0.684       0.684
        Unique obs |       132         235
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03634     .09447   0.3847   0.700   -.148807      .221491
    Bias-corrected |  .05511     .09447   0.5834   0.560   -.130036      .240263
            Robust |  .05511     .11419   0.4826   0.629   -.168699      .278926
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0368     5.0725   0.2044   0.838   -8.90515      10.9788
    Bias-corrected |  .28478     5.0725   0.0561   0.955    -9.6572      10.2268
            Robust |  .28478     6.1014   0.0467   0.963   -11.6738      12.2433
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10          10

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .23654     .19673   1.2023   0.229   -.149057      .622128
    Bias-corrected |   .1475     .19673   0.7497   0.453   -.238097      .533088
            Robust |   .1475     .25756   0.5727   0.567   -.357317      .652308
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.9668     1.6198   1.2142   0.225   -1.20799      5.14158
    Bias-corrected |  -.4114     1.6198   -0.2540  0.800   -3.58619      2.76338
            Robust |  -.4114      2.786   -0.1477  0.883   -5.87181        5.049
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04692     .13563   0.3459   0.729   -.218905      .312739
    Bias-corrected |   .2344     .13563   1.7283   0.084   -.031423      .500222
            Robust |   .2344     .17905   1.3092   0.190   -.116524      .585323
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.9902     8.1722   -0.3659  0.714   -19.0074       13.027
    Bias-corrected |  19.683     8.1722   2.4086   0.016    3.66621      35.7007
            Robust |  19.683     11.983   1.6426   0.100   -3.80335      43.1702
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(mal
> e) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |        90         102            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.324      47.324
       BW bias (b) |    91.267      91.267
         rho (h/b) |     0.519       0.519
        Unique obs |       286         247
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08076     .13299   0.6073   0.544   -.179889      .341407
    Bias-corrected |  .11492     .13299   0.8642   0.387   -.145725      .375571
            Robust |  .11492      .1483   0.7749   0.438   -.175735      .405581
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.0148     2.4485   -0.4145  0.679    -5.8138      3.78421
    Bias-corrected | -.48095     2.4485   -0.1964  0.844   -5.27996      4.31805
            Robust | -.48095     2.7276   -0.1763  0.860   -5.82696      4.86505
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03549     .04454   0.7967   0.426    -.05181      .122781
    Bias-corrected |  -.0884     .04454   -1.9847  0.047   -.175692     -.001101
            Robust |  -.0884     .07876   -1.1224  0.262   -.242761      .065967
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.6077     7.3488   -0.6270  0.531   -19.0111      9.79572
    Bias-corrected | -32.124     7.3488   -4.3713  0.000   -46.5272     -17.7203
            Robust | -32.124     13.221   -2.4298  0.015   -58.0358      -6.2116
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01388     .02721   -0.5101  0.610   -.067206      .039447
    Bias-corrected |  .03848     .02721   1.4143   0.157   -.014847      .091806
            Robust |  .03848     .04003   0.9612   0.336   -.039985      .116944
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6529     6.6636   0.2480   0.804   -11.4076      14.7133
    Bias-corrected |  9.0775     6.6636   1.3622   0.173   -3.98303       22.138
            Robust |  9.0775     10.524   0.8626   0.388   -11.5483      29.7033
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |       865         946            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.209      54.209
       BW bias (b) |    91.783      91.783
         rho (h/b) |     0.591       0.591
        Unique obs |       387         282

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01832     .02292   -0.7994  0.424   -.063239      .026597
    Bias-corrected |  -.0139     .02292   -0.6067  0.544   -.058823      .031013
            Robust |  -.0139      .0268   -0.5189  0.604    -.06643       .03862
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18728     3.7747   0.0496   0.960   -7.21105      7.58561
    Bias-corrected | -.93354     3.7747   -0.2473  0.805   -8.33188      6.46479
            Robust | -.93354      4.459   -0.2094  0.834   -9.67294      7.80585
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18051     .23165   0.7792   0.436   -.273516      .634544
    Bias-corrected | -.54071     .23165   -2.3342  0.020   -.994743     -.086682
            Robust | -.54071     .43379   -1.2465  0.213   -1.39093      .309504
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1189     2.1256   0.5264   0.599   -3.04727        5.285
    Bias-corrected |  .64182     2.1256   0.3019   0.763   -3.52431      4.80795
            Robust |  .64182     5.0165   0.1279   0.898   -9.19042      10.4741
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02908     .11405   -0.2550  0.799   -.252627      .194458
    Bias-corrected |  .12713     .11405   1.1146   0.265   -.096417      .350668
            Robust |  .12713     .19309   0.6584   0.510   -.251319       .50557
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8881     9.8488   0.1917   0.848   -17.4151      21.1913
    Bias-corrected | -1.0224     9.8488   -0.1038  0.917   -20.3256      18.2808
            Robust | -1.0224     15.654   -0.0653  0.948   -31.7036      29.6588
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       173         234            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.914      56.914
       BW bias (b) |    97.104      97.104
         rho (h/b) |     0.586       0.586
        Unique obs |       305         260

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00139     .09318   -0.0149  0.988   -.184023      .181238
    Bias-corrected |  .01896     .09318   0.2035   0.839   -.163669      .201591
            Robust |  .01896      .1111   0.1707   0.864   -.198782      .236704
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  12.974     878.98   0.0148   0.988    -1709.8      1735.75
    Bias-corrected |  199.53     878.98   0.2270   0.820   -1523.25       1922.3
            Robust |  199.53     1047.3   0.1905   0.849   -1853.07      2252.12
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10025     .18629   0.5381   0.590   -.264873      .465373
    Bias-corrected | -.84223     .18629   -4.5211  0.000   -1.20736      -.47711
            Robust | -.84223      .3048   -2.7632  0.006   -1.43964     -.244826
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.8314     6.9522   -0.4073  0.684   -16.4574      10.7946
    Bias-corrected | -30.452     6.9522   -4.3802  0.000   -44.0778     -16.8258
            Robust | -30.452      13.85   -2.1987  0.028   -57.5973     -3.30635
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01858     .11965   -0.1553  0.877   -.253089      .215922
    Bias-corrected |  .01581     .11965   0.1321   0.895   -.218696      .250314
            Robust |  .01581     .17288   0.0914   0.927   -.323039      .354657
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -1.572     15.148   -0.1038  0.917   -31.2612      28.1172
    Bias-corrected | -1.7576     15.148   -0.1160  0.908   -31.4468      27.9316
            Robust | -1.7576     22.279   -0.0789  0.937   -45.4232       41.908
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |        78         105            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.579      63.579
       BW bias (b) |    97.152      97.152
         rho (h/b) |     0.654       0.654
        Unique obs |       131         234

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0079     .09696   -0.0814  0.935    -.19794      .182146
    Bias-corrected | -.00528     .09696   -0.0545  0.957   -.195328      .184759
            Robust | -.00528     .11454   -0.0461  0.963    -.22978      .219211
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -1.161     27.217   -0.0427  0.966   -54.5062      52.1843
    Bias-corrected |  .88145     27.217   0.0324   0.974   -52.4638      54.2267
            Robust |  .88145     33.474   0.0263   0.979   -64.7255      66.4884
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .50446     .51237   0.9846   0.325   -.499775      1.50869
    Bias-corrected |  .97452     .51237   1.9020   0.057   -.029711      1.97876
            Robust |  .97452     1.5675   0.6217   0.534   -2.09776       4.0468
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.5457     2.9639   0.8589   0.390   -3.26346      8.35489
    Bias-corrected | -3.9339     2.9639   -1.3273  0.184   -9.74312      1.87523
            Robust | -3.9339     8.7272   -0.4508  0.652    -21.039      13.1711
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02895     .19308   0.1499   0.881   -.349487      .407391
    Bias-corrected |  .34501     .19308   1.7868   0.074   -.033426      .723452
            Robust |  .34501     .37644   0.9165   0.359   -.392806      1.08283
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -6.3464     41.967   -0.1512  0.880   -88.6001      75.9074
    Bias-corrected |  90.064     41.967   2.1461   0.032    7.80992      172.317
            Robust |  90.064      82.19   1.0958   0.273   -71.0266      251.154
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |        90         107            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.925      49.925
       BW bias (b) |    95.834      95.834
         rho (h/b) |     0.521       0.521
        Unique obs |       285         246

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06801     .17052   0.3989   0.690   -.266196      .402219
    Bias-corrected |  .11238     .17052   0.6591   0.510   -.221823      .446591
            Robust |  .11238     .19684   0.5709   0.568   -.273411      .498178
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.6543     5.2163   -0.3171  0.751   -11.8782      8.56952
    Bias-corrected | -.42452     5.2163   -0.0814  0.935   -10.6484      9.79932
            Robust | -.42452     6.0465   -0.0702  0.944   -12.2755      11.4265
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(
> nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03549     .05083   0.6981   0.485   -.064145      .135116
    Bias-corrected |  -.0884     .05083   -1.7390  0.082   -.188027      .011234
            Robust |  -.0884     .08932   -0.9897  0.322   -.263454       .08666
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.6077     8.6029   -0.5356  0.592   -21.4691      12.2537
    Bias-corrected | -32.124     8.6029   -3.7341  0.000   -48.9851     -15.2623
            Robust | -32.124     16.561   -1.9398  0.052   -64.5819      .334406
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(
> nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01388     .02214   -0.6269  0.531   -.057276      .029517
    Bias-corrected |  .03848     .02214   1.7379   0.082   -.004917      .081876
            Robust |  .03848     .03298   1.1668   0.243   -.026156      .103115
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6529     7.8697   0.2100   0.834   -13.7714      17.0771
    Bias-corrected |  9.0775     7.8697   1.1535   0.249   -6.34678      24.5017
            Robust |  9.0775      9.535   0.9520   0.341   -9.61087      27.7658
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pr
> ovince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |      1072        1176            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.267      66.267
       BW bias (b) |    91.531      91.531
         rho (h/b) |     0.724       0.724
        Unique obs |       387         282
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    -.02     .02858   -0.6999  0.484   -.076018      .036011
    Bias-corrected | -.01347     .02858   -0.4712  0.638   -.069481      .042548
            Robust | -.01347     .02966   -0.4541  0.650   -.071593      .044661
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .53811      4.103   0.1312   0.896   -7.50366      8.57989
    Bias-corrected | -.87313      4.103   -0.2128  0.831    -8.9149      7.16864
            Robust | -.87313     5.1708   -0.1689  0.866   -11.0078      9.26151
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18051     .25339   0.7124   0.476    -.31613      .677159
    Bias-corrected | -.54071     .25339   -2.1339  0.033   -1.03736     -.044068
            Robust | -.54071     .54534   -0.9915  0.321   -1.60956      .528132
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1189     2.4292   0.4606   0.645   -3.64236      5.88008
    Bias-corrected |  .64182     2.4292   0.2642   0.792    -4.1194      5.40304
            Robust |  .64182     4.7182   0.1360   0.892   -8.60567      9.88931
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02908     .09991   -0.2911  0.771   -.224902      .166732
    Bias-corrected |  .12713     .09991   1.2724   0.203   -.068692      .322942
            Robust |  .12713     .18358   0.6925   0.489   -.232678      .486928
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8881     9.9626   0.1895   0.850   -17.6383      21.4145
    Bias-corrected | -1.0224     9.9626   -0.1026  0.918   -20.5488       18.504
            Robust | -1.0224      15.43   -0.0663  0.947   -31.2653      29.2206
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(
> nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       199         272            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.027      64.027
       BW bias (b) |    95.298      95.298
         rho (h/b) |     0.672       0.672
        Unique obs |       305         260
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00804     .09826   -0.0818  0.935    -.20062      .184548
    Bias-corrected |  .01944     .09826   0.1979   0.843   -.173141      .212027
            Robust |  .01944     .11386   0.1708   0.864   -.203718      .242604
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.7099     30.525   0.0560   0.955   -58.1182      61.5379
    Bias-corrected |  6.7476     30.525   0.2211   0.825   -53.0805      66.5757
            Robust |  6.7476     37.567   0.1796   0.857   -66.8824      80.3776
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10025     .14903   0.6727   0.501   -.191834      .392335
    Bias-corrected | -.84223     .14903   -5.6516  0.000   -1.13432     -.550148
            Robust | -.84223     .29945   -2.8126  0.005   -1.42915      -.25532
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.8314      7.027   -0.4029  0.687   -16.6042      10.9413
    Bias-corrected | -30.452      7.027   -4.3335  0.000   -44.2246     -16.6791
            Robust | -30.452     13.866   -2.1961  0.028   -57.6294     -3.27427
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01858     .13722   -0.1354  0.892    -.28753      .250363
    Bias-corrected |  .01581     .13722   0.1152   0.908   -.253137      .284756
            Robust |  .01581     .21775   0.0726   0.942   -.410969      .442588
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -1.572     14.784   -0.1063  0.915   -30.5476      27.4035
    Bias-corrected | -1.7576     14.784   -0.1189  0.905   -30.7332       27.218
            Robust | -1.7576     27.197   -0.0646  0.948    -55.062      51.5468
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |        78         104            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.353      61.353
       BW bias (b) |   102.834     102.834
         rho (h/b) |     0.597       0.597
        Unique obs |       131         234
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00999      .0997   -0.1002  0.920   -.205405       .18543
    Bias-corrected | -.00273      .0997   -0.0274  0.978    -.19815      .192685
            Robust | -.00273     .12387   -0.0221  0.982   -.245513      .240048
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.1695     20.383   -0.0574  0.954     -41.12      38.7811
    Bias-corrected |  -.5435     20.383   -0.0267  0.979    -40.494       39.407
            Robust |  -.5435      25.91   -0.0210  0.983    -51.326       50.239
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .50446     .54864   0.9195   0.358   -.570857      1.57978
    Bias-corrected |  .97452     .54864   1.7763   0.076   -.100793      2.04984
            Robust |  .97452     1.4615   0.6668   0.505   -1.88995        3.839
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.5457     2.8118   0.9054   0.365   -2.96524      8.05667
    Bias-corrected | -3.9339     2.8118   -1.3991  0.162    -9.4449      1.57701
            Robust | -3.9339     6.5933   -0.5967  0.551   -16.8566      8.98867
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02895     .17683   0.1637   0.870    -.31763      .375535
    Bias-corrected |  .34501     .17683   1.9511   0.051    -.00157      .691595
            Robust |  .34501     .32158   1.0729   0.283   -.285265       .97529
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -6.3464     35.878   -0.1769  0.860   -76.6665      63.9738
    Bias-corrected |  90.064     35.878   2.5103   0.012    19.7435      160.384
            Robust |  90.064     69.186   1.3018   0.193    -45.539      225.666
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |        85          94            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.670      46.670
       BW bias (b) |    89.207      89.207
         rho (h/b) |     0.523       0.523
        Unique obs |       285         246
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06488     .17221   0.3767   0.706   -.272655      .402414
    Bias-corrected |  .10395     .17221   0.6036   0.546   -.233588      .441481
            Robust |  .10395     .19799   0.5250   0.600   -.284113      .492006
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.5612     4.4581   -0.3502  0.726    -10.299      7.17658
    Bias-corrected | -.47682     4.4581   -0.1070  0.915   -9.21462      8.26097
            Robust | -.47682     5.1034   -0.0934  0.926   -10.4792      9.52558
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04505     .06311   0.7137   0.475   -.078652      .168743
    Bias-corrected | -.16611     .06311   -2.6319  0.008   -.289803     -.042409
            Robust | -.16611     .14403   -1.1533  0.249   -.448398      .116186
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -5.6549      9.169   -0.6167  0.537   -23.6259       12.316
    Bias-corrected | -53.949      9.169   -5.8838  0.000   -71.9195     -35.9775
            Robust | -53.949     20.834   -2.5895  0.010   -94.7818     -13.1152
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01661     .03047   -0.5450  0.586   -.076332      .043117
    Bias-corrected |  .04503     .03047   1.4778   0.139   -.014691      .104758
            Robust |  .04503      .0513   0.8778   0.380   -.055515      .145582
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.9118     6.3161   0.3027   0.762   -10.4675      14.2912
    Bias-corrected |  11.144     6.3161   1.7644   0.078   -1.23501      23.5238
            Robust |  11.144     11.008   1.0124   0.311   -10.4303      32.7191
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |       826         916            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.859      53.859
       BW bias (b) |    94.054      94.054
         rho (h/b) |     0.573       0.573
        Unique obs |       386         281

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02073      .0253   -0.8195  0.413   -.070308      .028849
    Bias-corrected | -.01684      .0253   -0.6657  0.506   -.066418      .032738
            Robust | -.01684     .02981   -0.5649  0.572   -.075269      .041589
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .43677     3.5808   0.1220   0.903   -6.58151      7.45506
    Bias-corrected | -.39262     3.5808   -0.1096  0.913   -7.41091      6.62567
            Robust | -.39262     4.2437   -0.0925  0.926   -8.71014       7.9249
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .25629     .27607   0.9284   0.353    -.28479      .797369
    Bias-corrected | -.61328     .27607   -2.2215  0.026   -1.15436     -.072201
            Robust | -.61328     .70442   -0.8706  0.384   -1.99392      .767359
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2672     1.8517   0.6843   0.494   -2.36203      4.89635
    Bias-corrected |  1.8053     1.8517   0.9749   0.330   -1.82392      5.43445
            Robust |  1.8053     5.3461   0.3377   0.736    -8.6729      12.2834
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0226     .11934   -0.1894  0.850   -.256501      .211292
    Bias-corrected |  .16124     .11934   1.3511   0.177   -.072658      .395134
            Robust |  .16124      .2177   0.7406   0.459   -.265449      .587925
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.9453     13.406   0.1451   0.885   -24.3295      28.2201
    Bias-corrected | -2.0108     13.406   -0.1500  0.881   -28.2855       24.264
            Robust | -2.0108     22.633   -0.0888  0.929   -46.3713      42.3498
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       172         232            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.146      56.146
       BW bias (b) |    97.225      97.225
         rho (h/b) |     0.577       0.577
        Unique obs |       304         259

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00664     .09733   0.0682   0.946   -.184127      .197401
    Bias-corrected |   .0283     .09733   0.2908   0.771   -.162461      .219067
            Robust |   .0283     .11622   0.2435   0.808   -.199476      .256083
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.2624     28.093   -0.0449  0.964   -56.3229      53.7981
    Bias-corrected |  3.8952     28.093   0.1387   0.890   -51.1653      58.9557
            Robust |  3.8952     33.768   0.1154   0.908   -62.2884      70.0787
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11119      .2255   0.4931   0.622   -.330792      .553171
    Bias-corrected | -1.4525      .2255   -6.4412  0.000   -1.89449     -1.01053
            Robust | -1.4525     .56876   -2.5538  0.011   -2.56725      -.33777
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.5362     5.2624   -0.2919  0.770   -11.8502      8.77781
    Bias-corrected | -20.958     5.2624   -3.9827  0.000   -31.2723     -10.6442
            Robust | -20.958     14.581   -1.4373  0.151   -49.5369      7.62043
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01491     .13083   -0.1139  0.909   -.271338      .241521
    Bias-corrected |  .03082     .13083   0.2356   0.814    -.22561       .28725
            Robust |  .03082     .20784   0.1483   0.882   -.376541      .438181
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.5386     42.564   -0.1066  0.915   -87.9628      78.8857
    Bias-corrected | -19.825     42.564   -0.4658  0.641   -103.249      63.5997
            Robust | -19.825     68.766   -0.2883  0.773   -154.604      114.955
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |        77         102            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.909      61.909
       BW bias (b) |    96.181      96.181
         rho (h/b) |     0.644       0.644
        Unique obs |       130         233

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00388     .10458   -0.0371  0.970   -.208858      .201106
    Bias-corrected |  -.0023     .10458   -0.0220  0.982   -.207281      .202683
            Robust |  -.0023     .12541   -0.0183  0.985     -.2481      .243503
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -9.4654     260.09   -0.0364  0.971   -519.242      500.311
    Bias-corrected | -9.5383     260.09   -0.0367  0.971   -519.315      500.238
            Robust | -9.5383     314.15   -0.0304  0.976   -625.253      606.176
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .50446     .51237   0.9846   0.325   -.499775      1.50869
    Bias-corrected |  .97452     .51237   1.9020   0.057   -.029711      1.97876
            Robust |  .97452     1.5675   0.6217   0.534   -2.09776       4.0468
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.5457     2.9639   0.8589   0.390   -3.26346      8.35489
    Bias-corrected | -3.9339     2.9639   -1.3273  0.184   -9.74312      1.87523
            Robust | -3.9339     8.7272   -0.4508  0.652    -21.039      13.1711
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02895     .19308   0.1499   0.881   -.349487      .407391
    Bias-corrected |  .34501     .19308   1.7868   0.074   -.033426      .723452
            Robust |  .34501     .37644   0.9165   0.359   -.392806      1.08283
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -6.3464     41.967   -0.1512  0.880   -88.6001      75.9074
    Bias-corrected |  90.064     41.967   2.1461   0.032    7.80992      172.317
            Robust |  90.064      82.19   1.0958   0.273   -71.0266      251.154
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |        90         107            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.925      49.925
       BW bias (b) |    95.834      95.834
         rho (h/b) |     0.521       0.521
        Unique obs |       285         246

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06801     .17052   0.3989   0.690   -.266196      .402219
    Bias-corrected |  .11238     .17052   0.6591   0.510   -.221823      .446591
            Robust |  .11238     .19684   0.5709   0.568   -.273411      .498178
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.6543     5.2163   -0.3171  0.751   -11.8782      8.56952
    Bias-corrected | -.42452     5.2163   -0.0814  0.935   -10.6484      9.79932
            Robust | -.42452     6.0465   -0.0702  0.944   -12.2755      11.4265
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(
> nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04505     .07037   0.6401   0.522   -.092875      .182966
    Bias-corrected | -.16611     .07037   -2.3605  0.018   -.304026     -.028185
            Robust | -.16611     .17092   -0.9718  0.331     -.5011      .168888
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -5.6549      11.04   -0.5122  0.608   -27.2933      15.9834
    Bias-corrected | -53.949      11.04   -4.8866  0.000   -75.5868     -32.3102
            Robust | -53.949     27.629   -1.9526  0.051     -108.1      .203391
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(
> nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01661     .02472   -0.6719  0.502    -.06505      .031834
    Bias-corrected |  .04503     .02472   1.8221   0.068   -.003409      .093475
            Robust |  .04503     .04214   1.0686   0.285   -.037568      .127634
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.9118     7.3754   0.2592   0.795   -12.5436      16.3673
    Bias-corrected |  11.144     7.3754   1.5110   0.131   -3.31109      25.5998
            Robust |  11.144     9.8224   1.1346   0.257   -8.10708      30.3958
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pr
> ovince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1056        1160            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.674      66.674
       BW bias (b) |    95.972      95.972
         rho (h/b) |     0.695       0.695
        Unique obs |       386         281
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02193     .03093   -0.7088  0.478   -.082556      .038704
    Bias-corrected | -.01556     .03093   -0.5030  0.615    -.07619       .04507
            Robust | -.01556     .03377   -0.4608  0.645   -.081744      .050625
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .72723     3.9301   0.1850   0.853   -6.97558      8.43004
    Bias-corrected | -.14564     3.9301   -0.0371  0.970   -7.84845      7.55717
            Robust | -.14564     4.9649   -0.0293  0.977   -9.87658       9.5853
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .25629     .29332   0.8737   0.382   -.318615      .831195
    Bias-corrected | -.61328     .29332   -2.0908  0.037   -1.18819     -.038376
            Robust | -.61328     .76909   -0.7974  0.425   -2.12068      .894114
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2672     1.8928   0.6695   0.503   -2.44259      4.97691
    Bias-corrected |  1.8053     1.8928   0.9538   0.340   -1.90449      5.51501
            Robust |  1.8053     4.0182   0.4493   0.653   -6.07019      9.68072
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0226     .10285   -0.2198  0.826   -.224179       .17897
    Bias-corrected |  .16124     .10285   1.5678   0.117   -.040336      .362813
            Robust |  .16124      .2004   0.8046   0.421   -.231539      .554015
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.9453     13.195   0.1474   0.883   -23.9167      27.8074
    Bias-corrected | -2.0108     13.195   -0.1524  0.879   -27.8728      23.8513
            Robust | -2.0108     20.883   -0.0963  0.923   -42.9403      38.9188
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(
> nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       199         278            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.427      65.427
       BW bias (b) |   100.223     100.223
         rho (h/b) |     0.653       0.653
        Unique obs |       304         259
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00192     .10004   -0.0192  0.985    -.19799      .194145
    Bias-corrected |  .02625     .10004   0.2624   0.793   -.169818      .222317
            Robust |  .02625     .11655   0.2252   0.822   -.202192      .254691
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.1143     191.61   0.0163   0.987   -372.433      378.661
    Bias-corrected |  45.273     191.61   0.2363   0.813   -330.274       420.82
            Robust |  45.273     233.03   0.1943   0.846   -411.457      502.003
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11119     .18248   0.6093   0.542   -.246473      .468852
    Bias-corrected | -1.4525     .18248   -7.9597  0.000   -1.81017     -1.09485
            Robust | -1.4525     .63111   -2.3015  0.021   -2.68946     -.215561
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.5362     5.8272   -0.2636  0.792   -12.9572      9.88481
    Bias-corrected | -20.958     5.8272   -3.5966  0.000   -32.3793     -9.53722
            Robust | -20.958     14.359   -1.4596  0.144   -49.1015      7.18505
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01491     .15192   -0.0981  0.922    -.31266      .282843
    Bias-corrected |  .03082     .15192   0.2029   0.839   -.266932      .328571
            Robust |  .03082     .25961   0.1187   0.906   -.478008      .539648
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.5386     46.814   -0.0969  0.923   -96.2918      87.2147
    Bias-corrected | -19.825     46.814   -0.4235  0.672   -111.578      71.9287
            Robust | -19.825     84.231   -0.2354  0.814   -184.914      145.265
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |        76         100            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.191      60.191
       BW bias (b) |   102.430     102.430
         rho (h/b) |     0.588       0.588
        Unique obs |       130         233
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00512     .10928   -0.0468  0.963   -.219305      .209069
    Bias-corrected |  .00276     .10928   0.0252   0.980   -.211432      .216942
            Robust |  .00276     .13661   0.0202   0.984   -.265005      .270515
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -7.3154     162.11   -0.0451  0.964   -325.044      310.414
    Bias-corrected | -16.837     162.11   -0.1039  0.917   -334.566      300.892
            Robust | -16.837     204.88   -0.0822  0.935   -418.399      384.724
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .50446     .54864   0.9195   0.358   -.570857      1.57978
    Bias-corrected |  .97452     .54864   1.7763   0.076   -.100793      2.04984
            Robust |  .97452     1.4615   0.6668   0.505   -1.88995        3.839
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.5457     2.8118   0.9054   0.365   -2.96524      8.05667
    Bias-corrected | -3.9339     2.8118   -1.3991  0.162    -9.4449      1.57701
            Robust | -3.9339     6.5933   -0.5967  0.551   -16.8566      8.98867
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02895     .17683   0.1637   0.870    -.31763      .375535
    Bias-corrected |  .34501     .17683   1.9511   0.051    -.00157      .691595
            Robust |  .34501     .32158   1.0729   0.283   -.285265       .97529
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -6.3464     35.878   -0.1769  0.860   -76.6665      63.9738
    Bias-corrected |  90.064     35.878   2.5103   0.012    19.7435      160.384
            Robust |  90.064     69.186   1.3018   0.193    -45.539      225.666
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |        85          94            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.670      46.670
       BW bias (b) |    89.207      89.207
         rho (h/b) |     0.523       0.523
        Unique obs |       285         246
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06488     .17221   0.3767   0.706   -.272655      .402414
    Bias-corrected |  .10395     .17221   0.6036   0.546   -.233588      .441481
            Robust |  .10395     .19799   0.5250   0.600   -.284113      .492006
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.5612     4.4581   -0.3502  0.726    -10.299      7.17658
    Bias-corrected | -.47682     4.4581   -0.1070  0.915   -9.21462      8.26097
            Robust | -.47682     5.1034   -0.0934  0.926   -10.4792      9.52558
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Rur
> al/Earning Sheet 6 results.xls
dir : seeout

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male c
> ontrolled/Rural/Rural 1979 Higheredu FuzzyOption Male controlled.log
  log type:  text
 closed on:   8 Aug 2024, 12:44:09
---------------------------------------------------------------------------------------------
