---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Exp/Rural/IV Rural ATF&Birth Exp 1979 1971-1992.log
  log type:  text
 opened on:   8 Aug 2024, 12:36:29

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,408 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. **
. tab birthmonth, gen(birthmonthdum)

 birthmonth |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,879        8.22        8.22
          2 |      2,965        8.47       16.70
          3 |      2,870        8.20       24.89
          4 |      2,595        7.41       32.31
          5 |      2,663        7.61       39.92
          6 |      2,708        7.74       47.65
          7 |      2,646        7.56       55.21
          8 |      3,104        8.87       64.08
          9 |      3,121        8.92       72.99
         10 |      3,565       10.18       83.18
         11 |      3,001        8.57       91.75
         12 |      2,887        8.25      100.00
------------+-----------------------------------
      Total |     35,004      100.00

. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. *1)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  secgenhighedu secgenedu = t d td) if inrange(birthyear, 1971, 1992) & inrange(monthlyearni
> ng, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,854
                                                        F(17, 5836)   = 579.64
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6280
                                                        Adj R-squared = 0.6270
                                                        Root MSE      = 0.2063

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1579255   .0026625   -59.31   0.000    -.1631449    -.152706
         expsqr |   .0017735   .0000809    21.91   0.000     .0016149    .0019322
 birthmonthdum2 |   .0107664   .0134163     0.80   0.422    -.0155346    .0370673
 birthmonthdum3 |   .0062343   .0136734     0.46   0.648    -.0205706    .0330391
 birthmonthdum4 |   .0044691    .014018     0.32   0.750    -.0230115    .0319497
 birthmonthdum5 |   .0052634   .0135478     0.39   0.698    -.0212953    .0318221
 birthmonthdum6 |   .0263064   .0134834     1.95   0.051    -.0001261    .0527389
 birthmonthdum7 |   .0369306   .0138753     2.66   0.008     .0097298    .0641314
 birthmonthdum8 |   .0455672   .0132886     3.43   0.001     .0195166    .0716178
 birthmonthdum9 |   .0451672   .0129873     3.48   0.001     .0197073    .0706271
birthmonthdum10 |   .0478875   .0127369     3.76   0.000     .0229184    .0728565
birthmonthdum11 |   .0581137   .0133498     4.35   0.000     .0319432    .0842842
birthmonthdum12 |   .0660134   .0136824     4.82   0.000     .0391908     .092836
           male |  -.0031722    .005579    -0.57   0.570     -.014109    .0077647
              t |  -.0050327   .0002685   -18.75   0.000     -.005559   -.0045064
              d |   .0588725   .0127178     4.63   0.000     .0339408    .0838041
             td |  -.0034702   .0002532   -13.71   0.000    -.0039665   -.0029738
          _cons |    2.76065   .0327109    84.40   0.000     2.696525    2.824776
---------------------------------------------------------------------------------

                                                        Number of obs =  5,854
                                                        F(17, 5836)   = 469.65
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5777
                                                        Adj R-squared = 0.5765
                                                        Root MSE      = 0.2095

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1506678   .0027029   -55.74   0.000    -.1559665   -.1453691
         expsqr |   .0018932   .0000822    23.04   0.000     .0017321    .0020543
 birthmonthdum2 |   .0222495     .01362     1.63   0.102    -.0044507    .0489497
 birthmonthdum3 |   .0174137   .0138809     1.25   0.210    -.0097981    .0446255
 birthmonthdum4 |   .0039784   .0142309     0.28   0.780    -.0239193    .0318762
 birthmonthdum5 |    .011131   .0137534     0.81   0.418    -.0158308    .0380929
 birthmonthdum6 |   .0283865   .0136881     2.07   0.038     .0015527    .0552202
 birthmonthdum7 |   .0371169    .014086     2.64   0.008     .0095031    .0647306
 birthmonthdum8 |   .0470335   .0134903     3.49   0.000     .0205874    .0734796
 birthmonthdum9 |   .0437518   .0131844     3.32   0.001     .0179054    .0695982
birthmonthdum10 |   .0363869   .0129303     2.81   0.005     .0110388     .061735
birthmonthdum11 |   .0528823   .0135524     3.90   0.000     .0263145      .07945
birthmonthdum12 |   .0660289   .0138901     4.75   0.000     .0387991    .0932587
           male |    .000816   .0056637     0.14   0.885    -.0102868    .0119189
              t |  -.0039399   .0002725   -14.46   0.000    -.0044742   -.0034056
              d |   .0637942   .0129109     4.94   0.000      .038484    .0891044
             td |  -.0035283    .000257   -13.73   0.000    -.0040322   -.0030245
          _cons |    2.50626   .0332075    75.47   0.000     2.441161    2.571359
---------------------------------------------------------------------------------

                                                        Number of obs =  5,854
                                                        F(17, 5836)   = 398.70
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5373
                                                        Adj R-squared = 0.5360
                                                        Root MSE      = 0.2767

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1197732   .0035704   -33.55   0.000    -.1267726   -.1127738
         expsqr |  -.0000306   .0001085    -0.28   0.778    -.0002434    .0001822
 birthmonthdum2 |   .0133332   .0179915     0.74   0.459    -.0219368    .0486033
 birthmonthdum3 |    .023897   .0183362     1.30   0.193    -.0120488    .0598428
 birthmonthdum4 |   .0284155   .0187985     1.51   0.131    -.0084365    .0652674
 birthmonthdum5 |   .0482702   .0181678     2.66   0.008     .0126546    .0838859
 birthmonthdum6 |    .062602   .0180815     3.46   0.001     .0271555    .0980485
 birthmonthdum7 |   .0581055   .0186071     3.12   0.002     .0216287    .0945823
 birthmonthdum8 |   .0956495   .0178203     5.37   0.000     .0607152    .1305838
 birthmonthdum9 |   .1039794   .0174162     5.97   0.000     .0698372    .1381216
birthmonthdum10 |   .0607762   .0170804     3.56   0.000     .0272923    .0942602
birthmonthdum11 |    .100445   .0179023     5.61   0.000     .0653499    .1355401
birthmonthdum12 |   .1232745   .0183484     6.72   0.000     .0873049    .1592442
           male |   .0021532   .0074815     0.29   0.774    -.0125133    .0168197
              t |  -.0107503     .00036   -29.86   0.000    -.0114561   -.0100445
              d |   .0093281   .0170549     0.55   0.584    -.0241058    .0427619
             td |   .0007941   .0003395     2.34   0.019     .0001285    .0014597
          _cons |   2.862488    .043866    65.26   0.000     2.776494    2.948482
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,854
                                                  Wald chi2(17)   =     566.76
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0647
                                                  Root MSE        =      .6423

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.0600854   6.799825    -0.01   0.993     -13.3875    13.26733
  secgenhighedu |   .7216141   6.768555     0.11   0.915    -12.54451    13.98774
      secgenedu |   -.113083   .7526997    -0.15   0.881    -1.588347    1.362181
            exp |   .0377809   .0358117     1.05   0.291    -.0324088    .1079707
         expsqr |  -.0007823   .0007647    -1.02   0.306    -.0022811    .0007165
 birthmonthdum2 |   .0039699   .0951252     0.04   0.967    -.1824721    .1904119
 birthmonthdum3 |  -.0337684   .1013603    -0.33   0.739     -.232431    .1648943
 birthmonthdum4 |   .0674815   .0469441     1.44   0.151    -.0245273    .1594902
 birthmonthdum5 |  -.0117982   .0850252    -0.14   0.890    -.1784445    .1548481
 birthmonthdum6 |   .0551676   .0713253     0.77   0.439    -.0846275    .1949627
 birthmonthdum7 |   .0324021    .059695     0.54   0.587     -.084598    .1494022
 birthmonthdum8 |   .0293232   .0871501     0.34   0.737    -.1414878    .2001342
 birthmonthdum9 |   .0041255   .0754341     0.05   0.956    -.1437226    .1519736
birthmonthdum10 |   .0179205   .0528668     0.34   0.735    -.0856964    .1215374
birthmonthdum11 |   .0103885   .0547488     0.19   0.850    -.0969171    .1176941
birthmonthdum12 |   -.011729   .0968655    -0.12   0.904     -.201582    .1781239
           male |   .3751596   .0334093    11.23   0.000     .3096787    .4406406
          _cons |   7.418303   .3516187    21.10   0.000     6.729143    8.107463
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  30.9203  (p = 0.0000)
  Wu-Hausman F(3,5833)            =  10.3243  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  21.439  Chi-sq(17) P-value = 0.2073

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,854     8.10774     .664202   5.298317   9.721166
         exp |      5,854    19.00581     7.68698          1         36
      expsqr |      5,854    420.3003    304.5823          1       1296
birthmont~m2 |      5,854    .0833618    .2764519          0          1
birthmonth~3 |      5,854    .0770413    .2666798          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,854    .0698668    .2549441          0          1
birthmonth~5 |      5,854    .0801162    .2714961          0          1
birthmonth~6 |      5,854    .0818244    .2741204          0          1
birthmonth~7 |      5,854    .0732832    .2606231          0          1
birthmonth~8 |      5,854    .0876324    .2827837          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,854     .096686     .295555          0          1
birthmont~10 |      5,854    .1062521    .3081864          0          1
birthmont~11 |      5,854     .086095    .2805282          0          1
birthmont~12 |      5,854    .0789204    .2696375          0          1
        male |      5,854    .6229928    .4846781          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,854
                                                        F(31, 5822)   = 331.78
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6385
                                                        Adj R-squared = 0.6366
                                                        Root MSE      = 0.2036

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |    -.15572   .0026409   -58.96   0.000    -.1608972   -.1505428
         expsqr |   .0016255   .0000811    20.05   0.000     .0014666    .0017844
 birthmonthdum2 |   .0128239   .0132498     0.97   0.333    -.0131506    .0387984
 birthmonthdum3 |   .0084431   .0135029     0.63   0.532    -.0180277    .0349138
 birthmonthdum4 |   .0097089   .0138468     0.70   0.483    -.0174361    .0368538
 birthmonthdum5 |   .0092913   .0133823     0.69   0.488     -.016943    .0355256
 birthmonthdum6 |   .0311028    .013318     2.34   0.020     .0049946     .057211
 birthmonthdum7 |   .0443687   .0137182     3.23   0.001     .0174759    .0712614
 birthmonthdum8 |   .0539663   .0131347     4.11   0.000     .0282174    .0797152
 birthmonthdum9 |   .0516638    .012839     4.02   0.000     .0264945     .076833
birthmonthdum10 |   .0573014   .0126019     4.55   0.000     .0325971    .0820058
birthmonthdum11 |   .0646994   .0131933     4.90   0.000     .0388355    .0905632
birthmonthdum12 |   .0711292   .0135153     5.26   0.000     .0446342    .0976243
           male |  -.0046514   .0055222    -0.84   0.400    -.0154771    .0061742
   provincedum2 |   .0684123   .0220942     3.10   0.002     .0250995     .111725
   provincedum3 |   .0826467    .027477     3.01   0.003     .0287816    .1365118
   provincedum4 |   .0161304   .0230133     0.70   0.483    -.0289843    .0612451
   provincedum5 |   .0310032   .0176998     1.75   0.080     -.003695    .0657014
   provincedum6 |   .0792197   .0183169     4.32   0.000     .0433118    .1151277
   provincedum7 |   .0734639   .0183152     4.01   0.000     .0375593    .1093685
   provincedum8 |   .0772457   .0173395     4.45   0.000     .0432537    .1112376
   provincedum9 |  -.0026622   .0178523    -0.15   0.881    -.0376594    .0323349
  provincedum10 |  -.0212407   .0180394    -1.18   0.239    -.0566046    .0141231
  provincedum11 |   .0051194      .0177     0.29   0.772    -.0295792    .0398181
  provincedum12 |   .0015624   .0207327     0.08   0.940    -.0390814    .0422062
  provincedum13 |   .0201838   .0185349     1.09   0.276    -.0161514     .056519
  provincedum14 |   .0342197   .0190802     1.79   0.073    -.0031844    .0716239
  provincedum15 |   .0712707   .0193348     3.69   0.000     .0333673    .1091742
              t |  -.0056005   .0002707   -20.69   0.000    -.0061312   -.0050699
              d |   .0601375   .0125824     4.78   0.000     .0354713    .0848036
             td |  -.0031515   .0002518   -12.52   0.000    -.0036451   -.0026579
          _cons |   2.745647   .0345463    79.48   0.000     2.677923     2.81337
---------------------------------------------------------------------------------

                                                        Number of obs =  5,854
                                                        F(31, 5822)   = 266.28
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5864
                                                        Adj R-squared = 0.5842
                                                        Root MSE      = 0.2075

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1487467   .0026916   -55.26   0.000    -.1540232   -.1434703
         expsqr |   .0017608   .0000826    21.31   0.000     .0015989    .0019227
 birthmonthdum2 |    .024139   .0135038     1.79   0.074    -.0023334    .0506115
 birthmonthdum3 |   .0192544   .0137618     1.40   0.162    -.0077238    .0462325
 birthmonthdum4 |   .0085847   .0141123     0.61   0.543    -.0190806      .03625
 birthmonthdum5 |   .0144331   .0136389     1.06   0.290    -.0123042    .0411703
 birthmonthdum6 |   .0326573   .0135733     2.41   0.016     .0060486     .059266
 birthmonthdum7 |   .0431253   .0139812     3.08   0.002     .0157169    .0705336
 birthmonthdum8 |    .054181   .0133865     4.05   0.000     .0279385    .0804235
 birthmonthdum9 |   .0489786   .0130851     3.74   0.000     .0233269    .0746304
birthmonthdum10 |   .0443665   .0128435     3.45   0.001     .0191886    .0695445
birthmonthdum11 |   .0585861   .0134463     4.36   0.000     .0322265    .0849458
birthmonthdum12 |   .0704982   .0137744     5.12   0.000     .0434953    .0975012
           male |  -.0008968   .0056281    -0.16   0.873    -.0119299    .0101364
   provincedum2 |   .0731851   .0225177     3.25   0.001      .029042    .1173282
   provincedum3 |   .0828697   .0280037     2.96   0.003      .027972    .1377674
   provincedum4 |   .0235766   .0234545     1.01   0.315     -.022403    .0695561
   provincedum5 |   .0307113   .0180391     1.70   0.089     -.004652    .0660747
   provincedum6 |   .0814819    .018668     4.36   0.000     .0448856    .1180782
   provincedum7 |   .0695883   .0186663     3.73   0.000     .0329954    .1061812
   provincedum8 |    .077237    .017672     4.37   0.000     .0425934    .1118806
   provincedum9 |   .0137763   .0181945     0.76   0.449    -.0218917    .0494444
  provincedum10 |  -.0043173   .0183852    -0.23   0.814    -.0403591    .0317245
  provincedum11 |   .0123284   .0180394     0.68   0.494    -.0230355    .0476922
  provincedum12 |   .0135427   .0211301     0.64   0.522    -.0278803    .0549656
  provincedum13 |   .0300523   .0188902     1.59   0.112    -.0069795    .0670841
  provincedum14 |   .0375174   .0194459     1.93   0.054    -.0006039    .0756386
  provincedum15 |   .0789771   .0197055     4.01   0.000      .040347    .1176071
              t |  -.0044579   .0002759   -16.16   0.000    -.0049988   -.0039171
              d |   .0655449   .0128236     5.11   0.000     .0404059     .090684
             td |  -.0032463   .0002566   -12.65   0.000    -.0037494   -.0027432
          _cons |   2.485143   .0352086    70.58   0.000     2.416121    2.554165
---------------------------------------------------------------------------------

                                                        Number of obs =  5,854
                                                        F(31, 5822)   = 226.85
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5471
                                                        Adj R-squared = 0.5447
                                                        Root MSE      = 0.2741

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1179735   .0035546   -33.19   0.000    -.1249418   -.1110052
         expsqr |  -.0001774   .0001091    -1.63   0.104    -.0003912    .0000365
 birthmonthdum2 |   .0145478   .0178337     0.82   0.415    -.0204128    .0495084
 birthmonthdum3 |   .0239729   .0181744     1.32   0.187    -.0116557    .0596015
 birthmonthdum4 |    .032078   .0186373     1.72   0.085    -.0044581     .068614
 birthmonthdum5 |   .0496783   .0180121     2.76   0.006     .0143679    .0849886
 birthmonthdum6 |    .066855   .0179255     3.73   0.000     .0317144    .1019957
 birthmonthdum7 |   .0639406   .0184642     3.46   0.001     .0277439    .1001372
 birthmonthdum8 |   .1014099   .0176788     5.74   0.000     .0667529    .1360669
 birthmonthdum9 |    .106503   .0172808     6.16   0.000     .0726261    .1403798
birthmonthdum10 |   .0665708   .0169617     3.92   0.000     .0333197     .099822
birthmonthdum11 |   .1043967   .0177577     5.88   0.000      .069585    .1392085
birthmonthdum12 |   .1259487   .0181911     6.92   0.000     .0902875      .16161
           male |  -.0004697   .0074327    -0.06   0.950    -.0150406    .0141011
   provincedum2 |   .1707122   .0297379     5.74   0.000     .1124149    .2290094
   provincedum3 |   .1507398    .036983     4.08   0.000     .0782395    .2232401
   provincedum4 |   .0570953   .0309751     1.84   0.065    -.0036274    .1178179
   provincedum5 |   .0930204   .0238232     3.90   0.000      .046318    .1397228
   provincedum6 |   .1520376   .0246538     6.17   0.000     .1037069    .2003683
   provincedum7 |   .1209236   .0246515     4.91   0.000     .0725974    .1692498
   provincedum8 |   .1602615   .0233384     6.87   0.000     .1145096    .2060133
   provincedum9 |   .1098892   .0240285     4.57   0.000     .0627844    .1569939
  provincedum10 |    .109442   .0242803     4.51   0.000     .0618436    .1570404
  provincedum11 |   .0731639   .0238236     3.07   0.002     .0264609     .119867
  provincedum12 |   .0530425   .0279054     1.90   0.057    -.0016624    .1077475
  provincedum13 |   .0595787   .0249472     2.39   0.017     .0106728    .1084845
  provincedum14 |   .0741511   .0256811     2.89   0.004     .0238065    .1244957
  provincedum15 |   .1451161   .0260239     5.58   0.000     .0940996    .1961327
              t |  -.0114197   .0003644   -31.34   0.000     -.012134   -.0107054
              d |   .0149192   .0169354     0.88   0.378    -.0182805    .0481189
             td |   .0011479   .0003389     3.39   0.001     .0004835    .0018123
          _cons |   2.785042    .046498    59.90   0.000     2.693889    2.876196
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,854
                                                  Wald chi2(31)   =     698.33
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      .6643

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   1.742677   6.040377     0.29   0.773    -10.09625     13.5816
  secgenhighedu |  -1.004247   6.000924    -0.17   0.867    -12.76584    10.75735
      secgenedu |  -.4018767    .671618    -0.60   0.550    -1.718224    .9144703
            exp |   .0264181   .0308569     0.86   0.392    -.0340602    .0868965
         expsqr |  -.0005418   .0006692    -0.81   0.418    -.0018535    .0007698
 birthmonthdum2 |   .0222069   .0866397     0.26   0.798    -.1476038    .1920176
 birthmonthdum3 |   -.012628   .0905188    -0.14   0.889    -.1900417    .1647857
 birthmonthdum4 |   .0592349   .0471536     1.26   0.209    -.0331845    .1516543
 birthmonthdum5 |   .0049161   .0754695     0.07   0.948    -.1430014    .1528336
 birthmonthdum6 |   .0628765   .0661515     0.95   0.342    -.0667782    .1925311
 birthmonthdum7 |   .0488119    .054297     0.90   0.369    -.0576082     .155232
 birthmonthdum8 |   .0391085   .0761315     0.51   0.607    -.1101065    .1883235
 birthmonthdum9 |    .011131   .0647126     0.17   0.863    -.1157033    .1379654
birthmonthdum10 |    -.01018   .0552206    -0.18   0.854    -.1184103    .0980503
birthmonthdum11 |   .0063692   .0511231     0.12   0.901    -.0938303    .1065686
birthmonthdum12 |   .0098198    .085862     0.11   0.909    -.1584665    .1781062
           male |   .3874177   .0286511    13.52   0.000     .3312626    .4435727
   provincedum2 |  -.2229343   .1536972    -1.45   0.147    -.5241754    .0783067
   provincedum3 |  -.1151775   .1298514    -0.89   0.375    -.3696815    .1393265
   provincedum4 |  -.2486226   .1098993    -2.26   0.024    -.4640211    -.033224
   provincedum5 |   .0041209   .0813252     0.05   0.960    -.1552735    .1635152
   provincedum6 |   .0202029   .1237199     0.16   0.870    -.2222836    .2626893
   provincedum7 |   -.095261   .0786223    -1.21   0.226    -.2493578    .0588359
   provincedum8 |  -.1769722   .1148078    -1.54   0.123    -.4019913    .0480469
   provincedum9 |   .1634635   .1798368     0.91   0.363    -.1890101    .5159371
  provincedum10 |   .0532209   .1826019     0.29   0.771    -.3046723    .4111142
  provincedum11 |  -.0776434   .1078006    -0.72   0.471    -.2889288    .1336419
  provincedum12 |  -.1573729   .1255356    -1.25   0.210    -.4034181    .0886722
  provincedum13 |  -.1658322   .1138511    -1.46   0.145    -.3889762    .0573118
  provincedum14 |  -.2823655   .0899032    -3.14   0.002    -.4585726   -.1061584
  provincedum15 |  -.2226821   .1508515    -1.48   0.140    -.5183456    .0729814
          _cons |   7.625006   .2168339    35.17   0.000      7.20002    8.049993
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  22.2716  (p = 0.0001)
  Wu-Hausman F(3,5819)            =  7.40767  (p = 0.0001)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  72.685  Chi-sq(31) P-value = 0.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,854     8.10774     .664202   5.298317   9.721166
         exp |      5,854    19.00581     7.68698          1         36
      expsqr |      5,854    420.3003    304.5823          1       1296
birthmont~m2 |      5,854    .0833618    .2764519          0          1
birthmonth~3 |      5,854    .0770413    .2666798          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,854    .0698668    .2549441          0          1
birthmonth~5 |      5,854    .0801162    .2714961          0          1
birthmonth~6 |      5,854    .0818244    .2741204          0          1
birthmonth~7 |      5,854    .0732832    .2606231          0          1
birthmonth~8 |      5,854    .0876324    .2827837          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,854     .096686     .295555          0          1
birthmont~10 |      5,854    .1062521    .3081864          0          1
birthmont~11 |      5,854     .086095    .2805282          0          1
birthmont~12 |      5,854    .0789204    .2696375          0          1
        male |      5,854    .6229928    .4846781          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 
> 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,647
                                                        F(16, 3630)   = 362.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6152
                                                        Adj R-squared = 0.6135
                                                        Root MSE      = 0.2062

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1600516   .0034632   -46.22   0.000    -.1668416   -.1532617
         expsqr |   .0018194   .0001025    17.76   0.000     .0016186    .0020203
 birthmonthdum2 |   .0011647   .0166147     0.07   0.944    -.0314103    .0337397
 birthmonthdum3 |   .0057483   .0166906     0.34   0.731    -.0269757    .0384722
 birthmonthdum4 |   .0091762   .0173595     0.53   0.597    -.0248591    .0432115
 birthmonthdum5 |   .0102799   .0168251     0.61   0.541    -.0227077    .0432675
 birthmonthdum6 |   .0194441   .0166683     1.17   0.243    -.0132361    .0521242
 birthmonthdum7 |   .0305401    .017459     1.75   0.080    -.0036903    .0647704
 birthmonthdum8 |    .050087   .0163908     3.06   0.002     .0179509     .082223
 birthmonthdum9 |   .0415255    .016096     2.58   0.010     .0099674    .0730837
birthmonthdum10 |   .0510692   .0158369     3.22   0.001      .020019    .0821194
birthmonthdum11 |   .0437366   .0162996     2.68   0.007     .0117793    .0756939
birthmonthdum12 |   .0693886   .0171765     4.04   0.000      .035712    .1030653
              t |  -.0048503   .0003289   -14.75   0.000    -.0054951   -.0042055
              d |   .0571978   .0159205     3.59   0.000     .0259837    .0884118
             td |  -.0037861    .000315   -12.02   0.000    -.0044036   -.0031686
          _cons |   2.793053   .0422548    66.10   0.000     2.710207    2.875898
---------------------------------------------------------------------------------

                                                        Number of obs =  3,647
                                                        F(16, 3630)   = 297.75
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5675
                                                        Adj R-squared = 0.5656
                                                        Root MSE      = 0.2091

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1531147   .0035111   -43.61   0.000    -.1599987   -.1462307
         expsqr |   .0019296   .0001039    18.58   0.000     .0017259    .0021332
 birthmonthdum2 |   .0112134   .0168448     0.67   0.506    -.0218128    .0442396
 birthmonthdum3 |   .0154496   .0169218     0.91   0.361    -.0177276    .0486268
 birthmonthdum4 |  -.0018552   .0175999    -0.11   0.916    -.0363619    .0326515
 birthmonthdum5 |   .0145142   .0170581     0.85   0.395    -.0189303    .0479586
 birthmonthdum6 |   .0157086   .0168992     0.93   0.353    -.0174242    .0488414
 birthmonthdum7 |   .0268579   .0177008     1.52   0.129    -.0078465    .0615624
 birthmonthdum8 |   .0498483   .0166178     3.00   0.003     .0172671    .0824294
 birthmonthdum9 |    .039713   .0163189     2.43   0.015     .0077178    .0717082
birthmonthdum10 |   .0368721   .0160563     2.30   0.022     .0053919    .0683523
birthmonthdum11 |   .0386983   .0165254     2.34   0.019     .0062984    .0710982
birthmonthdum12 |   .0703322   .0174144     4.04   0.000     .0361892    .1044753
              t |  -.0038045   .0003334   -11.41   0.000    -.0044583   -.0031508
              d |    .054268    .016141     3.36   0.001     .0226217    .0859144
             td |  -.0037965   .0003193   -11.89   0.000    -.0044226   -.0031704
          _cons |    2.55949     .04284    59.75   0.000     2.475497    2.643483
---------------------------------------------------------------------------------

                                                        Number of obs =  3,647
                                                        F(16, 3630)   = 261.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5356
                                                        Adj R-squared = 0.5336
                                                        Root MSE      = 0.2763

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1247367   .0046403   -26.88   0.000    -.1338347   -.1156388
         expsqr |   .0000736   .0001373     0.54   0.592    -.0001956    .0003427
 birthmonthdum2 |   .0079277   .0222622     0.36   0.722      -.03572    .0515753
 birthmonthdum3 |   .0164953    .022364     0.74   0.461    -.0273519    .0603424
 birthmonthdum4 |   .0045219   .0232601     0.19   0.846    -.0410823    .0501262
 birthmonthdum5 |   .0481821   .0225441     2.14   0.033     .0039817    .0923825
 birthmonthdum6 |    .044903    .022334     2.01   0.044     .0011145    .0886915
 birthmonthdum7 |   .0354282   .0233934     1.51   0.130    -.0104374    .0812938
 birthmonthdum8 |   .1008174   .0219622     4.59   0.000      .057758    .1438769
 birthmonthdum9 |   .1025998   .0215672     4.76   0.000     .0603147    .1448849
birthmonthdum10 |   .0501145   .0212201     2.36   0.018       .00851    .0917189
birthmonthdum11 |   .0943519     .02184     4.32   0.000      .051532    .1371718
birthmonthdum12 |   .1175997    .023015     5.11   0.000      .072476    .1627234
              t |  -.0106661   .0004407   -24.20   0.000    -.0115301   -.0098021
              d |   .0066971   .0213321     0.31   0.754    -.0351269    .0485211
             td |   .0005883    .000422     1.39   0.163    -.0002391    .0014157
          _cons |   2.933584   .0566176    51.81   0.000     2.822579    3.044589
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,647
                                                  Wald chi2(16)   =      47.07
                                                  Prob > chi2     =     0.0001
                                                  R-squared       =          .
                                                  Root MSE        =     .71354

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   2.595567   34.77751     0.07   0.941    -65.56709    70.75823
  secgenhighedu |  -1.798514     35.273    -0.05   0.959    -70.93232    67.33529
      secgenedu |  -.5269381   3.189287    -0.17   0.869    -6.777825    5.723949
            exp |   .0349971   .2322287     0.15   0.880    -.4201628     .490157
         expsqr |  -.0007273   .0050302    -0.14   0.885    -.0105863    .0091318
 birthmonthdum2 |   .0457965   .3865646     0.12   0.906    -.7118563    .8034493
 birthmonthdum3 |  -.0515138   .4024976    -0.13   0.898    -.8403945     .737367
 birthmonthdum4 |    .019591   .3754356     0.05   0.958    -.7162493    .7554313
 birthmonthdum5 |  -.0084761   .3148907    -0.03   0.979    -.6256505    .6086983
 birthmonthdum6 |   .0414139   .0620771     0.67   0.505     -.080255    .1630827
 birthmonthdum7 |   .0074148   .0603799     0.12   0.902    -.1109275    .1257572
 birthmonthdum8 |   .0704179   .3455785     0.20   0.839    -.6069035    .7477393
 birthmonthdum9 |   .0471116   .2921138     0.16   0.872    -.5254209    .6196441
birthmonthdum10 |  -.0232914   .3205417    -0.07   0.942    -.6515415    .6049587
birthmonthdum11 |   .0522352   .1561346     0.33   0.738    -.2537829    .3582534
birthmonthdum12 |   .0524964   .4489743     0.12   0.907    -.8274771    .9324699
          _cons |   7.852342    2.45293     3.20   0.001     3.044687       12.66
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  21.6393  (p = 0.0001)
  Wu-Hausman F(3,3627)            =  7.21635  (p = 0.0001)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  12.962  Chi-sq(16) P-value = 0.6755

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,647    8.247666    .6410867   5.298317   9.721166
         exp |      3,647    19.08774    7.666347          2         36
      expsqr |      3,647    423.0987    306.1865          4       1296
birthmont~m2 |      3,647    .0825336    .2752137          0          1
birthmonth~3 |      3,647    .0808884     .272701          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,647    .0699205    .2550479          0          1
birthmonth~5 |      3,647    .0786948    .2692988          0          1
birthmonth~6 |      3,647     .081711    .2739615          0          1
birthmonth~7 |      3,647    .0690979    .2536553          0          1
birthmonth~8 |      3,647    .0880175    .2833593          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,647    .0951467    .2934577          0          1
birthmont~10 |      3,647    .1020016     .302692          0          1
birthmont~11 |      3,647    .0904853    .2869152          0          1
birthmont~12 |      3,647    .0745818    .2627515          0          1
        male |      3,647           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,647
                                                        F(30, 3616)   = 203.21
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6277
                                                        Adj R-squared = 0.6246
                                                        Root MSE      = 0.2033

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1579845   .0034309   -46.05   0.000    -.1647112   -.1512578
         expsqr |   .0016707   .0001023    16.33   0.000     .0014701    .0018712
 birthmonthdum2 |   .0043678    .016386     0.27   0.790     -.027759    .0364945
 birthmonthdum3 |   .0089296   .0164709     0.54   0.588    -.0233636    .0412229
 birthmonthdum4 |   .0155122   .0171326     0.91   0.365    -.0180783    .0491027
 birthmonthdum5 |   .0131031   .0166001     0.79   0.430    -.0194434    .0456497
 birthmonthdum6 |   .0246515   .0164475     1.50   0.134    -.0075958    .0568988
 birthmonthdum7 |    .039028   .0172598     2.26   0.024     .0051881    .0728679
 birthmonthdum8 |   .0584615   .0161886     3.61   0.000     .0267218    .0902012
 birthmonthdum9 |   .0474739   .0158908     2.99   0.003     .0163182    .0786297
birthmonthdum10 |   .0603576   .0156532     3.86   0.000     .0296676    .0910476
birthmonthdum11 |   .0518214   .0161015     3.22   0.001     .0202526    .0833902
birthmonthdum12 |   .0767437   .0169602     4.52   0.000     .0434913    .1099961
   provincedum2 |   .1141309   .0281059     4.06   0.000     .0590259    .1692359
   provincedum3 |   .1255758   .0343327     3.66   0.000     .0582623    .1928892
   provincedum4 |   .0440689   .0292099     1.51   0.131    -.0132007    .1013385
   provincedum5 |   .0396584   .0234604     1.69   0.091    -.0063385    .0856554
   provincedum6 |   .1056926    .024005     4.40   0.000     .0586278    .1527573
   provincedum7 |   .0888526   .0239522     3.71   0.000     .0418914    .1358138
   provincedum8 |    .097653   .0228655     4.27   0.000     .0528224    .1424836
   provincedum9 |   .0259375   .0234305     1.11   0.268    -.0200008    .0718757
  provincedum10 |  -.0019641   .0237172    -0.08   0.934    -.0484646    .0445364
  provincedum11 |   .0242099   .0233435     1.04   0.300    -.0215578    .0699777
  provincedum12 |   .0181173   .0266681     0.68   0.497    -.0341686    .0704032
  provincedum13 |   .0364861   .0242848     1.50   0.133    -.0111271    .0840993
  provincedum14 |   .0608368   .0253483     2.40   0.016     .0111383    .1105352
  provincedum15 |   .0882043   .0247105     3.57   0.000     .0397563    .1366523
              t |  -.0054461   .0003309   -16.46   0.000    -.0060949   -.0047972
              d |   .0606565   .0157531     3.85   0.000     .0297707    .0915423
             td |  -.0034619   .0003127   -11.07   0.000     -.004075   -.0028488
          _cons |   2.758052   .0448395    61.51   0.000     2.670138    2.845965
---------------------------------------------------------------------------------

                                                        Number of obs =  3,647
                                                        F(30, 3616)   = 164.60
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5773
                                                        Adj R-squared = 0.5738
                                                        Root MSE      = 0.2071

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1514601   .0034964   -43.32   0.000    -.1583153    -.144605
         expsqr |   .0018068   .0001043    17.33   0.000     .0016024    .0020112
 birthmonthdum2 |   .0139088   .0166989     0.83   0.405    -.0188313     .046649
 birthmonthdum3 |   .0181788   .0167854     1.08   0.279     -.014731    .0510886
 birthmonthdum4 |   .0031387   .0174597     0.18   0.857    -.0310931    .0373705
 birthmonthdum5 |   .0166259   .0169171     0.98   0.326     -.016542    .0497938
 birthmonthdum6 |   .0199795   .0167615     1.19   0.233    -.0128835    .0528425
 birthmonthdum7 |    .033221   .0175893     1.89   0.059    -.0012649     .067707
 birthmonthdum8 |   .0566812   .0164977     3.44   0.001     .0243355    .0890268
 birthmonthdum9 |   .0446233   .0161942     2.76   0.006     .0128727    .0763739
birthmonthdum10 |   .0443218   .0159521     2.78   0.005     .0130459    .0755977
birthmonthdum11 |   .0451994   .0164089     2.75   0.006     .0130279    .0773709
birthmonthdum12 |    .076425    .017284     4.42   0.000     .0425378    .1103123
   provincedum2 |   .0940732   .0286425     3.28   0.001     .0379162    .1502302
   provincedum3 |   .0988818   .0349882     2.83   0.005     .0302832    .1674804
   provincedum4 |   .0393477   .0297676     1.32   0.186    -.0190153    .0977107
   provincedum5 |   .0273692   .0239083     1.14   0.252    -.0195059    .0742443
   provincedum6 |   .0918527   .0244633     3.75   0.000     .0438894     .139816
   provincedum7 |    .063809   .0244095     2.61   0.009     .0159513    .1116668
   provincedum8 |   .0832282   .0233021     3.57   0.000     .0375417    .1289147
   provincedum9 |   .0259025   .0238778     1.08   0.278    -.0209128    .0727179
  provincedum10 |  -.0002374     .02417    -0.01   0.992    -.0476257    .0471509
  provincedum11 |   .0171698   .0237892     0.72   0.470    -.0294717    .0638114
  provincedum12 |   .0119136   .0271772     0.44   0.661    -.0413706    .0651978
  provincedum13 |   .0284312   .0247484     1.15   0.251    -.0200911    .0769534
  provincedum14 |    .053077   .0258323     2.05   0.040     .0024297    .1037243
  provincedum15 |   .0764345   .0251823     3.04   0.002     .0270615    .1258074
              t |  -.0043072   .0003372   -12.77   0.000    -.0049685    -.003646
              d |   .0578632   .0160538     3.60   0.000     .0263877    .0893387
             td |    -.00353   .0003187   -11.08   0.000    -.0041548   -.0029052
          _cons |   2.531868   .0456956    55.41   0.000     2.442276     2.62146
---------------------------------------------------------------------------------

                                                        Number of obs =  3,647
                                                        F(30, 3616)   = 146.93
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5493
                                                        Adj R-squared = 0.5456
                                                        Root MSE      = 0.2728

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1229144   .0046042   -26.70   0.000    -.1319414   -.1138874
         expsqr |  -.0000896   .0001373    -0.65   0.514    -.0003587    .0001796
 birthmonthdum2 |   .0084972   .0219894     0.39   0.699    -.0346157    .0516102
 birthmonthdum3 |   .0155829   .0221034     0.70   0.481    -.0277535    .0589192
 birthmonthdum4 |   .0096287   .0229913     0.42   0.675    -.0354485    .0547059
 birthmonthdum5 |   .0487901   .0222768     2.19   0.029     .0051138    .0924663
 birthmonthdum6 |   .0509534   .0220719     2.31   0.021     .0076787    .0942281
 birthmonthdum7 |   .0443428    .023162     1.91   0.056    -.0010691    .0897547
 birthmonthdum8 |   .1057448   .0217245     4.87   0.000     .0631513    .1483383
 birthmonthdum9 |   .1053778   .0213248     4.94   0.000     .0635679    .1471877
birthmonthdum10 |   .0549342    .021006     2.62   0.009     .0137493     .096119
birthmonthdum11 |   .0994231   .0216075     4.60   0.000     .0570589    .1417873
birthmonthdum12 |   .1223527   .0227599     5.38   0.000     .0777292    .1669762
   provincedum2 |    .199032   .0377171     5.28   0.000     .1250832    .2729809
   provincedum3 |   .1688936   .0460732     3.67   0.000     .0785615    .2592257
   provincedum4 |   .0801876   .0391986     2.05   0.041     .0033339    .1570413
   provincedum5 |   .1269519    .031483     4.03   0.000     .0652257     .188678
   provincedum6 |   .1840228   .0322139     5.71   0.000     .1208637    .2471819
   provincedum7 |   .1423672    .032143     4.43   0.000     .0793471    .2053873
   provincedum8 |   .1958518   .0306847     6.38   0.000     .1356909    .2560128
   provincedum9 |   .1411742   .0314428     4.49   0.000     .0795267    .2028216
  provincedum10 |   .1306705   .0318276     4.11   0.000     .0682686    .1930724
  provincedum11 |   .0822816   .0313261     2.63   0.009      .020863    .1437003
  provincedum12 |   .0802988   .0357875     2.24   0.025      .010133    .1504645
  provincedum13 |   .0605497   .0325892     1.86   0.063    -.0033455    .1244448
  provincedum14 |   .0989658   .0340165     2.91   0.004     .0322724    .1656593
  provincedum15 |   .1642235   .0331606     4.95   0.000     .0992081    .2292388
              t |  -.0114385   .0004441   -25.76   0.000    -.0123092   -.0105678
              d |   .0149812     .02114     0.71   0.479    -.0264664    .0564288
             td |   .0009976   .0004196     2.38   0.017     .0001749    .0018203
          _cons |   2.835365    .060173    47.12   0.000     2.717389    2.953341
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,647
                                                  Wald chi2(30)   =      33.80
                                                  Prob > chi2     =     0.2889
                                                  R-squared       =          .
                                                  Root MSE        =     1.4707

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -11.00807   134.2004    -0.08   0.935     -274.036    252.0198
  secgenhighedu |   11.90538   135.4405     0.09   0.930    -253.5532     277.364
      secgenedu |   .7440298   12.80657     0.06   0.954    -24.35638    25.84444
            exp |   .1199355   .8865199     0.14   0.892    -1.617612    1.857483
         expsqr |  -.0025864   .0193814    -0.13   0.894    -.0405733    .0354004
 birthmonthdum2 |  -.1060845   1.415495    -0.07   0.940    -2.880403    2.668234
 birthmonthdum3 |  -.2043687   1.469426    -0.14   0.889    -3.084391    2.675653
 birthmonthdum4 |   .1617656   1.539211     0.11   0.916    -2.855033    3.178565
 birthmonthdum5 |  -.1250023   1.127572    -0.11   0.912    -2.335004    2.084999
 birthmonthdum6 |    .028869   .1309455     0.22   0.826    -.2277795    .2855174
 birthmonthdum7 |   .0290705   .2071737     0.14   0.888    -.3769824    .4351234
 birthmonthdum8 |  -.0659155   1.197797    -0.06   0.956    -2.413554    2.281723
 birthmonthdum9 |  -.0732638   1.035107    -0.07   0.944    -2.102037    1.955509
birthmonthdum10 |   .0908461   1.398388     0.06   0.948    -2.649944    2.831636
birthmonthdum11 |  -.0170391   .4575739    -0.04   0.970    -.9138675    .8797893
birthmonthdum12 |  -.1191169   1.628691    -0.07   0.942    -3.311293    3.073059
   provincedum2 |  -.1959699   .2026119    -0.97   0.333    -.5930819     .201142
   provincedum3 |   .0070983   1.311581     0.01   0.996    -2.563553    2.577749
   provincedum4 |  -.2410785   .4935618    -0.49   0.625    -1.208442    .7262849
   provincedum5 |   .0465036    .170421     0.27   0.785    -.2875154    .3805225
   provincedum6 |  -.0035299   .6414573    -0.01   0.996    -1.260763    1.253703
   provincedum7 |   .0928479   1.464761     0.06   0.949     -2.77803    2.963726
   provincedum8 |  -.1903937   .7016743    -0.27   0.786     -1.56565    1.184863
   provincedum9 |  -.0223165   1.846624    -0.01   0.990    -3.641634    3.597001
  provincedum10 |  -.0569786   1.920826    -0.03   0.976    -3.821729    3.707772
  provincedum11 |  -.0730449   .2142183    -0.34   0.733     -.492905    .3468152
  provincedum12 |  -.1777901   .2884351    -0.62   0.538    -.7431126    .3875324
  provincedum13 |  -.1717913   .3180103    -0.54   0.589      -.79508    .4514974
  provincedum14 |  -.3246758   .3509827    -0.93   0.355    -1.012589    .3632378
  provincedum15 |  -.2678437    .647536    -0.41   0.679    -1.536991    1.001303
          _cons |   7.061582   9.007553     0.78   0.433     -10.5929    24.71606
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  15.8356  (p = 0.0012)
  Wu-Hausman F(3,3613)            =  5.25213  (p = 0.0013)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.422  Chi-sq(30) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,647    8.247666    .6410867   5.298317   9.721166
         exp |      3,647    19.08774    7.666347          2         36
      expsqr |      3,647    423.0987    306.1865          4       1296
birthmont~m2 |      3,647    .0825336    .2752137          0          1
birthmonth~3 |      3,647    .0808884     .272701          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,647    .0699205    .2550479          0          1
birthmonth~5 |      3,647    .0786948    .2692988          0          1
birthmonth~6 |      3,647     .081711    .2739615          0          1
birthmonth~7 |      3,647    .0690979    .2536553          0          1
birthmonth~8 |      3,647    .0880175    .2833593          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,647    .0951467    .2934577          0          1
birthmont~10 |      3,647    .1020016     .302692          0          1
birthmont~11 |      3,647    .0904853    .2869152          0          1
birthmont~12 |      3,647    .0745818    .2627515          0          1
        male |      3,647           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 
> 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,207
                                                        F(16, 2190)   = 253.06
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6490
                                                        Adj R-squared = 0.6464
                                                        Root MSE      = 0.2067

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1547882   .0041988   -36.87   0.000    -.1630221   -.1465542
         expsqr |   .0017053   .0001335    12.77   0.000     .0014435    .0019671
 birthmonthdum2 |   .0268394   .0229267     1.17   0.242     -.018121    .0717997
 birthmonthdum3 |    .007682   .0239448     0.32   0.748    -.0392748    .0546389
 birthmonthdum4 |  -.0027237   .0239562    -0.11   0.909     -.049703    .0442555
 birthmonthdum5 |   -.001613   .0230752    -0.07   0.944    -.0468644    .0436385
 birthmonthdum6 |   .0375325   .0231084     1.62   0.104    -.0077842    .0828492
 birthmonthdum7 |   .0455697   .0232237     1.96   0.050      .000027    .0911125
 birthmonthdum8 |   .0393573   .0228554     1.72   0.085    -.0054633    .0841778
 birthmonthdum9 |   .0508322    .022215     2.29   0.022     .0072676    .0943969
birthmonthdum10 |   .0438739   .0217065     2.02   0.043     .0013063    .0864414
birthmonthdum11 |   .0856536   .0233312     3.67   0.000     .0398999    .1314073
birthmonthdum12 |   .0612931   .0229881     2.67   0.008     .0162124    .1063739
              t |  -.0053522   .0004675   -11.45   0.000    -.0062691   -.0044354
              d |   .0641218   .0213151     3.01   0.003     .0223218    .1059217
             td |  -.0029382   .0004303    -6.83   0.000    -.0037821   -.0020943
          _cons |   2.704254   .0517345    52.27   0.000       2.6028    2.805708
---------------------------------------------------------------------------------

                                                        Number of obs =  2,207
                                                        F(16, 2190)   = 201.47
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5955
                                                        Adj R-squared = 0.5925
                                                        Root MSE      = 0.2102

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1475682    .004271   -34.55   0.000    -.1559438   -.1391925
         expsqr |   .0018568   .0001358    13.67   0.000     .0015905    .0021231
 birthmonthdum2 |   .0422502   .0233213     1.81   0.070    -.0034839    .0879843
 birthmonthdum3 |   .0225947   .0243569     0.93   0.354    -.0251704    .0703598
 birthmonthdum4 |   .0167095   .0243685     0.69   0.493    -.0310783    .0644973
 birthmonthdum5 |   .0092464   .0234723     0.39   0.694     -.036784    .0552767
 birthmonthdum6 |   .0510662   .0235061     2.17   0.030     .0049695    .0971629
 birthmonthdum7 |   .0539381   .0236234     2.28   0.023     .0076116    .1002647
 birthmonthdum8 |   .0449121   .0232488     1.93   0.054    -.0006799    .0905041
 birthmonthdum9 |   .0523698   .0225973     2.32   0.021     .0080554    .0966843
birthmonthdum10 |    .038819   .0220801     1.76   0.079    -.0044812    .0821192
birthmonthdum11 |   .0813965   .0237328     3.43   0.001     .0348553    .1279377
birthmonthdum12 |   .0623082   .0233837     2.66   0.008     .0164515    .1081648
              t |  -.0041732   .0004756    -8.78   0.000    -.0051058   -.0032406
              d |   .0835312    .021682     3.85   0.000     .0410118    .1260505
             td |  -.0030896   .0004377    -7.06   0.000     -.003948   -.0022311
          _cons |   2.423592   .0526249    46.05   0.000     2.320391    2.526792
---------------------------------------------------------------------------------

                                                        Number of obs =  2,207
                                                        F(16, 2190)   = 162.41
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5427
                                                        Adj R-squared = 0.5393
                                                        Root MSE      = 0.2775

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |   -.113547   .0056381   -20.14   0.000    -.1246036   -.1024903
         expsqr |  -.0001578   .0001793    -0.88   0.379    -.0005094    .0001938
 birthmonthdum2 |   .0253144   .0307861     0.82   0.411    -.0350586    .0856874
 birthmonthdum3 |   .0385346   .0321532     1.20   0.231    -.0245194    .1015886
 birthmonthdum4 |   .0722327   .0321685     2.25   0.025     .0091487    .1353168
 birthmonthdum5 |   .0530765   .0309855     1.71   0.087    -.0076875    .1138404
 birthmonthdum6 |   .0948308   .0310301     3.06   0.002     .0339793    .1556824
 birthmonthdum7 |   .0954603   .0311849     3.06   0.002     .0343052    .1566153
 birthmonthdum8 |   .0903846   .0306904     2.95   0.003     .0301993    .1505699
 birthmonthdum9 |   .1104914   .0298304     3.70   0.000     .0519925    .1689903
birthmonthdum10 |   .0810713   .0291477     2.78   0.005     .0239114    .1382313
birthmonthdum11 |   .1141364   .0313293     3.64   0.000      .052698    .1755747
birthmonthdum12 |   .1360966   .0308685     4.41   0.000      .075562    .1966313
              t |  -.0108535   .0006278   -17.29   0.000    -.0120846   -.0096224
              d |   .0165718   .0286221     0.58   0.563    -.0395574    .0727011
             td |   .0010364   .0005779     1.79   0.073    -.0000968    .0021696
          _cons |    2.76661   .0694694    39.82   0.000     2.630377    2.902843
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,207
                                                  Wald chi2(16)   =      75.62
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .66639

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.313524   3.801583    -0.35   0.730     -8.76449    6.137443
  secgenhighedu |   1.508448     3.5939     0.42   0.675    -5.535467    8.552364
      secgenedu |    .429978   .6181457     0.70   0.487    -.7815653    1.641521
            exp |    .012706    .018236     0.70   0.486     -.023036     .048448
         expsqr |  -.0002088    .000416    -0.50   0.616     -.001024    .0006065
 birthmonthdum2 |   -.025865   .0950553    -0.27   0.786      -.21217      .16044
 birthmonthdum3 |    .036001   .1037482     0.35   0.729    -.1673417    .2393436
 birthmonthdum4 |   .0414473   .1335896     0.31   0.756    -.2203835    .3032781
 birthmonthdum5 |   -.013354   .0994609    -0.13   0.893    -.2082937    .1815857
 birthmonthdum6 |   .0445165   .1171168     0.38   0.704    -.1850281    .2740612
 birthmonthdum7 |   .0271101    .103448     0.26   0.793    -.1756442    .2298644
 birthmonthdum8 |  -.0122595   .0934852    -0.13   0.896    -.1954872    .1709682
 birthmonthdum9 |  -.0574423   .0896008    -0.64   0.521    -.2330567     .118172
birthmonthdum10 |   .0283941   .0713496     0.40   0.691    -.1114486    .1682367
birthmonthdum11 |  -.0495212   .0800453    -0.62   0.536    -.2064071    .1073647
birthmonthdum12 |  -.0904119   .0977514    -0.92   0.355    -.2820012    .1011773
          _cons |   7.637533   .1791945    42.62   0.000     7.286319    7.988748
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  12.3221  (p = 0.0064)
  Wu-Hausman F(3,2187)            =  4.09301  (p = 0.0066)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  14.732  Chi-sq(16) P-value = 0.5443

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,207    7.876517    .6366901   5.298317   9.721166
         exp |      2,207    18.87041    7.720789          1         34
      expsqr |      2,207     415.676    301.9249          1       1156
birthmont~m2 |      2,207    .0847304    .2785432          0          1
birthmonth~3 |      2,207    .0706842    .2563547          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,207     .069778    .2548302          0          1
birthmonth~5 |      2,207    .0824649     .275134          0          1
birthmonth~6 |      2,207    .0820118    .2744449          0          1
birthmonth~7 |      2,207    .0801994    .2716631          0          1
birthmonth~8 |      2,207    .0869959     .281893          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,207    .0992297     .299038          0          1
birthmont~10 |      2,207    .1132759    .3170016          0          1
birthmont~11 |      2,207    .0788401      .26955          0          1
birthmont~12 |      2,207    .0860897      .28056          0          1
        male |      2,207           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992)
>  & inrange(monthlyearning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,207
                                                        F(30, 2176)   = 140.08
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6588
                                                        Adj R-squared = 0.6541
                                                        Root MSE      = 0.2044

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1526052   .0041907   -36.42   0.000    -.1608234    -.144387
         expsqr |   .0015664    .000135    11.61   0.000     .0013017     .001831
 birthmonthdum2 |   .0233414   .0227398     1.03   0.305    -.0212526    .0679354
 birthmonthdum3 |   .0070504   .0237515     0.30   0.767    -.0395276    .0536284
 birthmonthdum4 |  -.0012561   .0237787    -0.05   0.958    -.0478875    .0453752
 birthmonthdum5 |   .0000602   .0228929     0.00   0.998     -.044834    .0449544
 birthmonthdum6 |   .0401154   .0229064     1.75   0.080    -.0048053     .085036
 birthmonthdum7 |   .0495396   .0230236     2.15   0.032      .004389    .0946901
 birthmonthdum8 |   .0458348   .0226834     2.02   0.043     .0013515    .0903182
 birthmonthdum9 |   .0572883   .0220685     2.60   0.009     .0140108    .1005657
birthmonthdum10 |   .0507907   .0215379     2.36   0.018     .0085537    .0930278
birthmonthdum11 |   .0850078   .0231522     3.67   0.000     .0396051    .1304104
birthmonthdum12 |    .061362   .0227799     2.69   0.007     .0166894    .1060346
   provincedum2 |  -.0094157   .0365884    -0.26   0.797    -.0811675    .0623362
   provincedum3 |   .0056736   .0466999     0.12   0.903    -.0859076    .0972547
   provincedum4 |  -.0253097   .0381627    -0.66   0.507    -.1001489    .0495295
   provincedum5 |   .0189466   .0271426     0.70   0.485    -.0342815    .0721747
   provincedum6 |   .0424223   .0285764     1.48   0.138    -.0136177    .0984622
   provincedum7 |   .0561511   .0286924     1.96   0.050    -.0001163    .1124185
   provincedum8 |   .0501995   .0268097     1.87   0.061    -.0023758    .1027748
   provincedum9 |     -.0424   .0277918    -1.53   0.127    -.0969013    .0121012
  provincedum10 |  -.0456393   .0280003    -1.63   0.103    -.1005494    .0092708
  provincedum11 |  -.0193045    .027332    -0.71   0.480     -.072904    .0342951
  provincedum12 |  -.0151462   .0334729    -0.45   0.651    -.0807884    .0504959
  provincedum13 |    .001242   .0289144     0.04   0.966    -.0554606    .0579447
  provincedum14 |  -.0004338   .0291696    -0.01   0.988     -.057637    .0567694
  provincedum15 |   .0535398   .0321503     1.67   0.096    -.0095087    .1165883
              t |  -.0058451   .0004748   -12.31   0.000    -.0067762    -.004914
              d |   .0622627   .0211341     2.95   0.003     .0208176    .1037078
             td |  -.0026659   .0004306    -6.19   0.000    -.0035103   -.0018214
          _cons |   2.717107   .0545808    49.78   0.000     2.610071    2.824143
---------------------------------------------------------------------------------

                                                        Number of obs =  2,207
                                                        F(30, 2176)   = 110.90
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6046
                                                        Adj R-squared = 0.5991
                                                        Root MSE      = 0.2085

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1451172    .004275   -33.95   0.000    -.1535007   -.1367336
         expsqr |   .0017048   .0001377    12.38   0.000     .0014348    .0019748
 birthmonthdum2 |   .0397724   .0231973     1.71   0.087    -.0057188    .0852636
 birthmonthdum3 |    .021246   .0242293     0.88   0.381    -.0262691    .0687611
 birthmonthdum4 |   .0173518   .0242571     0.72   0.474    -.0302176    .0649213
 birthmonthdum5 |   .0106392   .0233534     0.46   0.649    -.0351582    .0564365
 birthmonthdum6 |   .0530894   .0233672     2.27   0.023     .0072649    .0989138
 birthmonthdum7 |   .0569019   .0234868     2.42   0.015      .010843    .1029608
 birthmonthdum8 |   .0506493   .0231397     2.19   0.029      .005271    .0960276
 birthmonthdum9 |   .0569698   .0225124     2.53   0.011     .0128217     .101118
birthmonthdum10 |   .0445837   .0219713     2.03   0.043     .0014968    .0876705
birthmonthdum11 |    .081221    .023618     3.44   0.001     .0349049    .1275372
birthmonthdum12 |   .0619758   .0232382     2.67   0.008     .0164044    .1075472
   provincedum2 |   .0333514   .0373245     0.89   0.372     -.039844    .1065468
   provincedum3 |   .0466976   .0476395     0.98   0.327    -.0467261    .1401213
   provincedum4 |  -.0070253   .0389305    -0.18   0.857    -.0833702    .0693196
   provincedum5 |   .0317934   .0276887     1.15   0.251    -.0225056    .0860924
   provincedum6 |   .0652461   .0291514     2.24   0.025     .0080787    .1224135
   provincedum7 |   .0803245   .0292697     2.74   0.006      .022925    .1377239
   provincedum8 |   .0659604   .0273491     2.41   0.016     .0123273    .1195935
   provincedum9 |  -.0063513   .0283509    -0.22   0.823     -.061949    .0492465
  provincedum10 |  -.0112797   .0285636    -0.39   0.693    -.0672946    .0447351
  provincedum11 |   .0034118   .0278819     0.12   0.903    -.0512661    .0580897
  provincedum12 |   .0208073   .0341463     0.61   0.542    -.0461555    .0877701
  provincedum13 |   .0328688   .0294961     1.11   0.265    -.0249746    .0907122
  provincedum14 |   .0159373   .0297565     0.54   0.592    -.0424168    .0742914
  provincedum15 |    .089395   .0327971     2.73   0.006      .025078     .153712
              t |  -.0047232   .0004843    -9.75   0.000     -.005673   -.0037734
              d |   .0831274   .0215593     3.86   0.000     .0408485    .1254063
             td |  -.0027859   .0004393    -6.34   0.000    -.0036473   -.0019244
          _cons |   2.413031   .0556789    43.34   0.000     2.303841     2.52222
---------------------------------------------------------------------------------

                                                        Number of obs =  2,207
                                                        F(30, 2176)   =  88.16
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5486
                                                        Adj R-squared = 0.5424
                                                        Root MSE      = 0.2766

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1116392   .0056708   -19.69   0.000    -.1227599   -.1005185
         expsqr |  -.0002817   .0001826    -1.54   0.123    -.0006399    .0000764
 birthmonthdum2 |   .0252833   .0307711     0.82   0.411    -.0350605     .085627
 birthmonthdum3 |   .0365785   .0321401     1.14   0.255      -.02645    .0996069
 birthmonthdum4 |   .0709705   .0321769     2.21   0.028     .0078699    .1340711
 birthmonthdum5 |   .0531152   .0309782     1.71   0.087    -.0076347    .1138651
 birthmonthdum6 |   .0949413   .0309965     3.06   0.002     .0341555     .155727
 birthmonthdum7 |   .0951454   .0311551     3.05   0.002     .0340486    .1562423
 birthmonthdum8 |   .0922229   .0306947     3.00   0.003     .0320289    .1524168
 birthmonthdum9 |   .1090935   .0298626     3.65   0.000     .0505313    .1676557
birthmonthdum10 |   .0844718   .0291447     2.90   0.004     .0273174    .1416262
birthmonthdum11 |   .1132384   .0313291     3.61   0.000     .0518004    .1746765
birthmonthdum12 |    .134044   .0308253     4.35   0.000     .0735939    .1944941
   provincedum2 |   .1265571   .0495107     2.56   0.011     .0294639    .2236503
   provincedum3 |   .1230991   .0631935     1.95   0.052    -.0008268    .2470249
   provincedum4 |   .0259991   .0516411     0.50   0.615    -.0752719    .1272701
   provincedum5 |   .0424629   .0367288     1.16   0.248    -.0295643    .1144901
   provincedum6 |    .104651   .0386691     2.71   0.007     .0288189    .1804832
   provincedum7 |   .0890245    .038826     2.29   0.022     .0128846    .1651645
   provincedum8 |   .1057629   .0362784     2.92   0.004      .034619    .1769068
   provincedum9 |   .0617141   .0376073     1.64   0.101    -.0120359    .1354642
  provincedum10 |   .0787947   .0378895     2.08   0.038     .0044914     .153098
  provincedum11 |   .0606334   .0369852     1.64   0.101    -.0118965    .1331633
  provincedum12 |   .0134306   .0452949     0.30   0.767    -.0753951    .1022564
  provincedum13 |   .0611294   .0391264     1.56   0.118    -.0155995    .1378584
  provincedum14 |   .0400109   .0394718     1.01   0.311    -.0373954    .1174172
  provincedum15 |   .1234006   .0435052     2.84   0.005     .0380845    .2087166
              t |  -.0113696   .0006425   -17.70   0.000    -.0126295   -.0101097
              d |    .019223   .0285982     0.67   0.502    -.0368596    .0753057
             td |   .0013239   .0005827     2.27   0.023     .0001812    .0024666
          _cons |   2.714681   .0738577    36.76   0.000     2.569842     2.85952
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,207
                                                  Wald chi2(30)   =     167.52
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0420
                                                  Root MSE        =     .62304

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.5582094   3.143077    -0.18   0.859    -6.718526    5.602107
  secgenhighedu |   1.004809   2.997382     0.34   0.737    -4.869952     6.87957
      secgenedu |   .1339337   .4984597     0.27   0.788    -.8430292    1.110897
            exp |   .0141608   .0164447     0.86   0.389    -.0180703    .0463919
         expsqr |  -.0002411   .0003803    -0.63   0.526    -.0009865    .0005043
 birthmonthdum2 |  -.0112067   .0870387    -0.13   0.898    -.1817994    .1593861
 birthmonthdum3 |   .0503954   .0899415     0.56   0.575    -.1258867    .2266774
 birthmonthdum4 |   .0619212   .1115702     0.55   0.579    -.1567524    .2805949
 birthmonthdum5 |   .0038345   .0868693     0.04   0.965    -.1664262    .1740951
 birthmonthdum6 |   .0637779   .0991805     0.64   0.520    -.1306122    .2581681
 birthmonthdum7 |   .0613902   .0880632     0.70   0.486    -.1112105     .233991
 birthmonthdum8 |  -.0048954    .081153    -0.06   0.952    -.1639524    .1541616
 birthmonthdum9 |  -.0415602   .0756869    -0.55   0.583    -.1899039    .1067835
birthmonthdum10 |   .0327511   .0657357     0.50   0.618    -.0960886    .1615908
birthmonthdum11 |  -.0362746   .0737101    -0.49   0.623    -.1807437    .1081945
birthmonthdum12 |  -.0616285   .0841695    -0.73   0.464    -.2265978    .1033407
   provincedum2 |   -.392417   .2132417    -1.84   0.066    -.8103629     .025529
   provincedum3 |  -.2260624   .2237502    -1.01   0.312    -.6646047      .21248
   provincedum4 |  -.4004191   .1358791    -2.95   0.003    -.6667372    -.134101
   provincedum5 |  -.0849091   .0990783    -0.86   0.391    -.2790991    .1092809
   provincedum6 |  -.0979441   .1373951    -0.71   0.476    -.3672335    .1713453
   provincedum7 |  -.2382172   .1338128    -1.78   0.075    -.5004854    .0240509
   provincedum8 |  -.2980325   .1175231    -2.54   0.011    -.5283735   -.0676915
   provincedum9 |   .0940061   .1647333     0.57   0.568    -.2288652    .4168774
  provincedum10 |   -.164116   .1682521    -0.98   0.329    -.4938841    .1656521
  provincedum11 |  -.1650477   .1296749    -1.27   0.203    -.4192059    .0891105
  provincedum12 |  -.2179186   .1539374    -1.42   0.157    -.5196303    .0837931
  provincedum13 |  -.1901294   .1498957    -1.27   0.205    -.4839195    .1036607
  provincedum14 |  -.3004376   .1103425    -2.72   0.006     -.516705   -.0841703
  provincedum15 |  -.3296996   .1806402    -1.83   0.068    -.6837479    .0243487
          _cons |   7.802787   .1952333    39.97   0.000     7.420137    8.185437
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  7.85238  (p = 0.0492)
  Wu-Hausman F(3,2173)            =  2.58634  (p = 0.0515)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  51.534  Chi-sq(30) P-value = 0.0085

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,207    7.876517    .6366901   5.298317   9.721166
         exp |      2,207    18.87041    7.720789          1         34
      expsqr |      2,207     415.676    301.9249          1       1156
birthmont~m2 |      2,207    .0847304    .2785432          0          1
birthmonth~3 |      2,207    .0706842    .2563547          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,207     .069778    .2548302          0          1
birthmonth~5 |      2,207    .0824649     .275134          0          1
birthmonth~6 |      2,207    .0820118    .2744449          0          1
birthmonth~7 |      2,207    .0801994    .2716631          0          1
birthmonth~8 |      2,207    .0869959     .281893          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,207    .0992297     .299038          0          1
birthmont~10 |      2,207    .1132759    .3170016          0          1
birthmont~11 |      2,207    .0788401      .26955          0          1
birthmont~12 |      2,207    .0860897      .28056          0          1
        male |      2,207           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 
> 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,854
                                                        F(17, 5836)   = 579.64
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6280
                                                        Adj R-squared = 0.6270
                                                        Root MSE      = 0.2063

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1579255   .0026625   -59.31   0.000    -.1631449    -.152706
         expsqr |   .0017735   .0000809    21.91   0.000     .0016149    .0019322
 birthmonthdum2 |   .0107664   .0134163     0.80   0.422    -.0155346    .0370673
 birthmonthdum3 |   .0062343   .0136734     0.46   0.648    -.0205706    .0330391
 birthmonthdum4 |   .0044691    .014018     0.32   0.750    -.0230115    .0319497
 birthmonthdum5 |   .0052634   .0135478     0.39   0.698    -.0212953    .0318221
 birthmonthdum6 |   .0263064   .0134834     1.95   0.051    -.0001261    .0527389
 birthmonthdum7 |   .0369306   .0138753     2.66   0.008     .0097298    .0641314
 birthmonthdum8 |   .0455672   .0132886     3.43   0.001     .0195166    .0716178
 birthmonthdum9 |   .0451672   .0129873     3.48   0.001     .0197073    .0706271
birthmonthdum10 |   .0478875   .0127369     3.76   0.000     .0229184    .0728565
birthmonthdum11 |   .0581137   .0133498     4.35   0.000     .0319432    .0842842
birthmonthdum12 |   .0660134   .0136824     4.82   0.000     .0391908     .092836
           male |  -.0031722    .005579    -0.57   0.570     -.014109    .0077647
              t |  -.0050327   .0002685   -18.75   0.000     -.005559   -.0045064
              d |   .0588725   .0127178     4.63   0.000     .0339408    .0838041
             td |  -.0034702   .0002532   -13.71   0.000    -.0039665   -.0029738
          _cons |    2.76065   .0327109    84.40   0.000     2.696525    2.824776
---------------------------------------------------------------------------------

                                                        Number of obs =  5,854
                                                        F(17, 5836)   = 469.65
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5777
                                                        Adj R-squared = 0.5765
                                                        Root MSE      = 0.2095

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1506678   .0027029   -55.74   0.000    -.1559665   -.1453691
         expsqr |   .0018932   .0000822    23.04   0.000     .0017321    .0020543
 birthmonthdum2 |   .0222495     .01362     1.63   0.102    -.0044507    .0489497
 birthmonthdum3 |   .0174137   .0138809     1.25   0.210    -.0097981    .0446255
 birthmonthdum4 |   .0039784   .0142309     0.28   0.780    -.0239193    .0318762
 birthmonthdum5 |    .011131   .0137534     0.81   0.418    -.0158308    .0380929
 birthmonthdum6 |   .0283865   .0136881     2.07   0.038     .0015527    .0552202
 birthmonthdum7 |   .0371169    .014086     2.64   0.008     .0095031    .0647306
 birthmonthdum8 |   .0470335   .0134903     3.49   0.000     .0205874    .0734796
 birthmonthdum9 |   .0437518   .0131844     3.32   0.001     .0179054    .0695982
birthmonthdum10 |   .0363869   .0129303     2.81   0.005     .0110388     .061735
birthmonthdum11 |   .0528823   .0135524     3.90   0.000     .0263145      .07945
birthmonthdum12 |   .0660289   .0138901     4.75   0.000     .0387991    .0932587
           male |    .000816   .0056637     0.14   0.885    -.0102868    .0119189
              t |  -.0039399   .0002725   -14.46   0.000    -.0044742   -.0034056
              d |   .0637942   .0129109     4.94   0.000      .038484    .0891044
             td |  -.0035283    .000257   -13.73   0.000    -.0040322   -.0030245
          _cons |    2.50626   .0332075    75.47   0.000     2.441161    2.571359
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,854
                                                  Wald chi2(16)   =     535.02
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0092
                                                  Root MSE        =     .66107

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.067156   1.175417    -0.91   0.364     -3.37093    1.236618
  secgenhighedu |   1.719441   1.342348     1.28   0.200    -.9115118    4.350395
            exp |   .0427749   .0137136     3.12   0.002     .0158968     .069653
         expsqr |  -.0008878   .0003119    -2.85   0.004     -.001499   -.0002765
 birthmonthdum2 |  -.0086292   .0462113    -0.19   0.852    -.0992017    .0819432
 birthmonthdum3 |  -.0473926   .0466002    -1.02   0.309    -.1387273    .0439421
 birthmonthdum4 |    .064879   .0449058     1.44   0.149    -.0231347    .1528927
 birthmonthdum5 |  -.0228128   .0443177    -0.51   0.607     -.109674    .0640483
 birthmonthdum6 |   .0465754   .0438652     1.06   0.288    -.0393987    .1325496
 birthmonthdum7 |   .0263122   .0451019     0.58   0.560    -.0620859    .1147102
 birthmonthdum8 |   .0178867   .0436705     0.41   0.682    -.0677059    .1034793
 birthmonthdum9 |  -.0054012   .0420502    -0.13   0.898    -.0878182    .0770157
birthmonthdum10 |   .0231515   .0409438     0.57   0.572    -.0570969    .1033999
birthmonthdum11 |   .0050529   .0428842     0.12   0.906    -.0789985    .0891043
birthmonthdum12 |  -.0246695   .0456099    -0.54   0.589    -.1140632    .0647242
           male |   .3709131   .0183314    20.23   0.000     .3349843    .4068419
          _cons |   7.369155   .1326736    55.54   0.000      7.10912    7.629191
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  32.8723  (p = 0.0000)
  Wu-Hausman F(2,5835)            =  16.4753  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .021308  (p = 0.8839)
  Basmann chi2(1)        =  .021242  (p = 0.8841)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  19.725  Chi-sq(17) P-value = 0.2885

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,854     8.10774     .664202   5.298317   9.721166
         exp |      5,854    19.00581     7.68698          1         36
      expsqr |      5,854    420.3003    304.5823          1       1296
birthmont~m2 |      5,854    .0833618    .2764519          0          1
birthmonth~3 |      5,854    .0770413    .2666798          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,854    .0698668    .2549441          0          1
birthmonth~5 |      5,854    .0801162    .2714961          0          1
birthmonth~6 |      5,854    .0818244    .2741204          0          1
birthmonth~7 |      5,854    .0732832    .2606231          0          1
birthmonth~8 |      5,854    .0876324    .2827837          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,854     .096686     .295555          0          1
birthmont~10 |      5,854    .1062521    .3081864          0          1
birthmont~11 |      5,854     .086095    .2805282          0          1
birthmont~12 |      5,854    .0789204    .2696375          0          1
        male |      5,854    .6229928    .4846781          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & in
> range(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,854
                                                        F(31, 5822)   = 331.78
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6385
                                                        Adj R-squared = 0.6366
                                                        Root MSE      = 0.2036

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |    -.15572   .0026409   -58.96   0.000    -.1608972   -.1505428
         expsqr |   .0016255   .0000811    20.05   0.000     .0014666    .0017844
 birthmonthdum2 |   .0128239   .0132498     0.97   0.333    -.0131506    .0387984
 birthmonthdum3 |   .0084431   .0135029     0.63   0.532    -.0180277    .0349138
 birthmonthdum4 |   .0097089   .0138468     0.70   0.483    -.0174361    .0368538
 birthmonthdum5 |   .0092913   .0133823     0.69   0.488     -.016943    .0355256
 birthmonthdum6 |   .0311028    .013318     2.34   0.020     .0049946     .057211
 birthmonthdum7 |   .0443687   .0137182     3.23   0.001     .0174759    .0712614
 birthmonthdum8 |   .0539663   .0131347     4.11   0.000     .0282174    .0797152
 birthmonthdum9 |   .0516638    .012839     4.02   0.000     .0264945     .076833
birthmonthdum10 |   .0573014   .0126019     4.55   0.000     .0325971    .0820058
birthmonthdum11 |   .0646994   .0131933     4.90   0.000     .0388355    .0905632
birthmonthdum12 |   .0711292   .0135153     5.26   0.000     .0446342    .0976243
           male |  -.0046514   .0055222    -0.84   0.400    -.0154771    .0061742
   provincedum2 |   .0684123   .0220942     3.10   0.002     .0250995     .111725
   provincedum3 |   .0826467    .027477     3.01   0.003     .0287816    .1365118
   provincedum4 |   .0161304   .0230133     0.70   0.483    -.0289843    .0612451
   provincedum5 |   .0310032   .0176998     1.75   0.080     -.003695    .0657014
   provincedum6 |   .0792197   .0183169     4.32   0.000     .0433118    .1151277
   provincedum7 |   .0734639   .0183152     4.01   0.000     .0375593    .1093685
   provincedum8 |   .0772457   .0173395     4.45   0.000     .0432537    .1112376
   provincedum9 |  -.0026622   .0178523    -0.15   0.881    -.0376594    .0323349
  provincedum10 |  -.0212407   .0180394    -1.18   0.239    -.0566046    .0141231
  provincedum11 |   .0051194      .0177     0.29   0.772    -.0295792    .0398181
  provincedum12 |   .0015624   .0207327     0.08   0.940    -.0390814    .0422062
  provincedum13 |   .0201838   .0185349     1.09   0.276    -.0161514     .056519
  provincedum14 |   .0342197   .0190802     1.79   0.073    -.0031844    .0716239
  provincedum15 |   .0712707   .0193348     3.69   0.000     .0333673    .1091742
              t |  -.0056005   .0002707   -20.69   0.000    -.0061312   -.0050699
              d |   .0601375   .0125824     4.78   0.000     .0354713    .0848036
             td |  -.0031515   .0002518   -12.52   0.000    -.0036451   -.0026579
          _cons |   2.745647   .0345463    79.48   0.000     2.677923     2.81337
---------------------------------------------------------------------------------

                                                        Number of obs =  5,854
                                                        F(31, 5822)   = 266.28
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5864
                                                        Adj R-squared = 0.5842
                                                        Root MSE      = 0.2075

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1487467   .0026916   -55.26   0.000    -.1540232   -.1434703
         expsqr |   .0017608   .0000826    21.31   0.000     .0015989    .0019227
 birthmonthdum2 |    .024139   .0135038     1.79   0.074    -.0023334    .0506115
 birthmonthdum3 |   .0192544   .0137618     1.40   0.162    -.0077238    .0462325
 birthmonthdum4 |   .0085847   .0141123     0.61   0.543    -.0190806      .03625
 birthmonthdum5 |   .0144331   .0136389     1.06   0.290    -.0123042    .0411703
 birthmonthdum6 |   .0326573   .0135733     2.41   0.016     .0060486     .059266
 birthmonthdum7 |   .0431253   .0139812     3.08   0.002     .0157169    .0705336
 birthmonthdum8 |    .054181   .0133865     4.05   0.000     .0279385    .0804235
 birthmonthdum9 |   .0489786   .0130851     3.74   0.000     .0233269    .0746304
birthmonthdum10 |   .0443665   .0128435     3.45   0.001     .0191886    .0695445
birthmonthdum11 |   .0585861   .0134463     4.36   0.000     .0322265    .0849458
birthmonthdum12 |   .0704982   .0137744     5.12   0.000     .0434953    .0975012
           male |  -.0008968   .0056281    -0.16   0.873    -.0119299    .0101364
   provincedum2 |   .0731851   .0225177     3.25   0.001      .029042    .1173282
   provincedum3 |   .0828697   .0280037     2.96   0.003      .027972    .1377674
   provincedum4 |   .0235766   .0234545     1.01   0.315     -.022403    .0695561
   provincedum5 |   .0307113   .0180391     1.70   0.089     -.004652    .0660747
   provincedum6 |   .0814819    .018668     4.36   0.000     .0448856    .1180782
   provincedum7 |   .0695883   .0186663     3.73   0.000     .0329954    .1061812
   provincedum8 |    .077237    .017672     4.37   0.000     .0425934    .1118806
   provincedum9 |   .0137763   .0181945     0.76   0.449    -.0218917    .0494444
  provincedum10 |  -.0043173   .0183852    -0.23   0.814    -.0403591    .0317245
  provincedum11 |   .0123284   .0180394     0.68   0.494    -.0230355    .0476922
  provincedum12 |   .0135427   .0211301     0.64   0.522    -.0278803    .0549656
  provincedum13 |   .0300523   .0188902     1.59   0.112    -.0069795    .0670841
  provincedum14 |   .0375174   .0194459     1.93   0.054    -.0006039    .0756386
  provincedum15 |   .0789771   .0197055     4.01   0.000      .040347    .1176071
              t |  -.0044579   .0002759   -16.16   0.000    -.0049988   -.0039171
              d |   .0655449   .0128236     5.11   0.000     .0404059     .090684
             td |  -.0032463   .0002566   -12.65   0.000    -.0037494   -.0027432
          _cons |   2.485143   .0352086    70.58   0.000     2.416121    2.554165
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,854
                                                  Wald chi2(30)   =     670.47
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .67779

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.799296    1.22749    -1.47   0.143    -4.205132    .6065403
  secgenhighedu |   2.491588   1.398666     1.78   0.075    -.2497476    5.232923
            exp |   .0429866   .0138945     3.09   0.002     .0157539    .0702194
         expsqr |  -.0008965    .000317    -2.83   0.005    -.0015179   -.0002751
 birthmonthdum2 |  -.0214986   .0475455    -0.45   0.651     -.114686    .0716888
 birthmonthdum3 |  -.0589588   .0478406    -1.23   0.218    -.1527246     .034807
 birthmonthdum4 |   .0511102   .0460734     1.11   0.267     -.039192    .1414124
 birthmonthdum5 |  -.0315458     .04543    -0.69   0.487     -.120587    .0574954
 birthmonthdum6 |   .0333931    .045035     0.74   0.458     -.054874    .1216601
 birthmonthdum7 |   .0308896   .0462082     0.67   0.504    -.0596768     .121456
 birthmonthdum8 |   .0018854   .0447803     0.04   0.966    -.0858824    .0896532
 birthmonthdum9 |  -.0182149    .043077    -0.42   0.672    -.1026443    .0662145
birthmonthdum10 |    .011766   .0421197     0.28   0.780    -.0707871    .0943191
birthmonthdum11 |  -.0100709   .0439882    -0.23   0.819    -.0962863    .0761444
birthmonthdum12 |  -.0336207   .0467765    -0.72   0.472    -.1253009    .0580595
           male |   .3742538   .0187276    19.98   0.000     .3375483    .4109592
   provincedum2 |  -.3031896   .0765834    -3.96   0.000    -.4532904   -.1530888
   provincedum3 |  -.1705103   .0930116    -1.83   0.067    -.3528097    .0117891
   provincedum4 |  -.2957426   .0782166    -3.78   0.000    -.4490443   -.1424409
   provincedum5 |   -.029957   .0592337    -0.51   0.613    -.1460529    .0861388
   provincedum6 |  -.0436172   .0639712    -0.68   0.495    -.1689985    .0817641
   provincedum7 |   -.125351    .061665    -2.03   0.042    -.2462122   -.0044899
   provincedum8 |  -.2360313   .0598355    -3.94   0.000    -.3533068   -.1187558
   provincedum9 |    .062857   .0651101     0.97   0.334    -.0647564    .1904705
  provincedum10 |  -.0494031   .0639569    -0.77   0.440    -.1747563    .0759501
  provincedum11 |  -.1314699   .0606122    -2.17   0.030    -.2502677   -.0126722
  provincedum12 |  -.2195603   .0718442    -3.06   0.002    -.3603724   -.0787482
  provincedum13 |  -.2223637   .0648229    -3.43   0.001    -.3494144   -.0953131
  provincedum14 |  -.3204321   .0648152    -4.94   0.000    -.4474676   -.1933966
  provincedum15 |  -.3031823   .0696298    -4.35   0.000    -.4396542   -.1667104
          _cons |   7.521703   .1338592    56.19   0.000     7.259344    7.784063
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  21.7832  (p = 0.0000)
  Wu-Hausman F(2,5821)            =  10.8706  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .343937  (p = 0.5576)
  Basmann chi2(1)        =  .342077  (p = 0.5586)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  60.952  Chi-sq(31) P-value = 0.0010

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,854     8.10774     .664202   5.298317   9.721166
         exp |      5,854    19.00581     7.68698          1         36
      expsqr |      5,854    420.3003    304.5823          1       1296
birthmont~m2 |      5,854    .0833618    .2764519          0          1
birthmonth~3 |      5,854    .0770413    .2666798          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,854    .0698668    .2549441          0          1
birthmonth~5 |      5,854    .0801162    .2714961          0          1
birthmonth~6 |      5,854    .0818244    .2741204          0          1
birthmonth~7 |      5,854    .0732832    .2606231          0          1
birthmonth~8 |      5,854    .0876324    .2827837          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,854     .096686     .295555          0          1
birthmont~10 |      5,854    .1062521    .3081864          0          1
birthmont~11 |      5,854     .086095    .2805282          0          1
birthmont~12 |      5,854    .0789204    .2696375          0          1
        male |      5,854    .6229928    .4846781          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667
> ) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,647
                                                        F(16, 3630)   = 362.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6152
                                                        Adj R-squared = 0.6135
                                                        Root MSE      = 0.2062

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1600516   .0034632   -46.22   0.000    -.1668416   -.1532617
         expsqr |   .0018194   .0001025    17.76   0.000     .0016186    .0020203
 birthmonthdum2 |   .0011647   .0166147     0.07   0.944    -.0314103    .0337397
 birthmonthdum3 |   .0057483   .0166906     0.34   0.731    -.0269757    .0384722
 birthmonthdum4 |   .0091762   .0173595     0.53   0.597    -.0248591    .0432115
 birthmonthdum5 |   .0102799   .0168251     0.61   0.541    -.0227077    .0432675
 birthmonthdum6 |   .0194441   .0166683     1.17   0.243    -.0132361    .0521242
 birthmonthdum7 |   .0305401    .017459     1.75   0.080    -.0036903    .0647704
 birthmonthdum8 |    .050087   .0163908     3.06   0.002     .0179509     .082223
 birthmonthdum9 |   .0415255    .016096     2.58   0.010     .0099674    .0730837
birthmonthdum10 |   .0510692   .0158369     3.22   0.001      .020019    .0821194
birthmonthdum11 |   .0437366   .0162996     2.68   0.007     .0117793    .0756939
birthmonthdum12 |   .0693886   .0171765     4.04   0.000      .035712    .1030653
              t |  -.0048503   .0003289   -14.75   0.000    -.0054951   -.0042055
              d |   .0571978   .0159205     3.59   0.000     .0259837    .0884118
             td |  -.0037861    .000315   -12.02   0.000    -.0044036   -.0031686
          _cons |   2.793053   .0422548    66.10   0.000     2.710207    2.875898
---------------------------------------------------------------------------------

                                                        Number of obs =  3,647
                                                        F(16, 3630)   = 297.75
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5675
                                                        Adj R-squared = 0.5656
                                                        Root MSE      = 0.2091

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1531147   .0035111   -43.61   0.000    -.1599987   -.1462307
         expsqr |   .0019296   .0001039    18.58   0.000     .0017259    .0021332
 birthmonthdum2 |   .0112134   .0168448     0.67   0.506    -.0218128    .0442396
 birthmonthdum3 |   .0154496   .0169218     0.91   0.361    -.0177276    .0486268
 birthmonthdum4 |  -.0018552   .0175999    -0.11   0.916    -.0363619    .0326515
 birthmonthdum5 |   .0145142   .0170581     0.85   0.395    -.0189303    .0479586
 birthmonthdum6 |   .0157086   .0168992     0.93   0.353    -.0174242    .0488414
 birthmonthdum7 |   .0268579   .0177008     1.52   0.129    -.0078465    .0615624
 birthmonthdum8 |   .0498483   .0166178     3.00   0.003     .0172671    .0824294
 birthmonthdum9 |    .039713   .0163189     2.43   0.015     .0077178    .0717082
birthmonthdum10 |   .0368721   .0160563     2.30   0.022     .0053919    .0683523
birthmonthdum11 |   .0386983   .0165254     2.34   0.019     .0062984    .0710982
birthmonthdum12 |   .0703322   .0174144     4.04   0.000     .0361892    .1044753
              t |  -.0038045   .0003334   -11.41   0.000    -.0044583   -.0031508
              d |    .054268    .016141     3.36   0.001     .0226217    .0859144
             td |  -.0037965   .0003193   -11.89   0.000    -.0044226   -.0031704
          _cons |    2.55949     .04284    59.75   0.000     2.475497    2.643483
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,647
                                                  Wald chi2(15)   =      41.25
                                                  Prob > chi2     =     0.0003
                                                  R-squared       =          .
                                                  Root MSE        =     .76196

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -3.141872   2.024649    -1.55   0.121    -7.110112    .8263671
  secgenhighedu |   4.018434   2.302938     1.74   0.081    -.4952417     8.53211
            exp |   .0731963   .0233147     3.14   0.002     .0275002    .1188923
         expsqr |  -.0015543   .0005272    -2.95   0.003    -.0025876   -.0005211
 birthmonthdum2 |  -.0172537   .0658754    -0.26   0.793    -.1463672    .1118598
 birthmonthdum3 |   -.117221   .0662173    -1.77   0.077    -.2470046    .0125626
 birthmonthdum4 |   .0807279   .0677865     1.19   0.234    -.0521313    .2135871
 birthmonthdum5 |  -.0595606   .0637045    -0.93   0.350     -.184419    .0652979
 birthmonthdum6 |   .0375804   .0614857     0.61   0.541    -.0829294    .1580902
 birthmonthdum7 |   .0073477   .0644763     0.11   0.909    -.1190234    .1337189
 birthmonthdum8 |   .0141388   .0622379     0.23   0.820    -.1078452    .1361229
 birthmonthdum9 |  -.0002436   .0602317    -0.00   0.997    -.1182955    .1178083
birthmonthdum10 |   .0288505   .0599433     0.48   0.630    -.0886361    .1463372
birthmonthdum11 |    .028175   .0601388     0.47   0.639     -.089695    .1460449
birthmonthdum12 |  -.0209246   .0684131    -0.31   0.760    -.1550118    .1131625
          _cons |   7.448636   .2303028    32.34   0.000      6.99725    7.900021
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  22.4937  (p = 0.0000)
  Wu-Hausman F(2,3629)            =  11.2608  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .023938  (p = 0.8770)
  Basmann chi2(1)        =  .023827  (p = 0.8773)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   6.305  Chi-sq(16) P-value = 0.9845

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,647    8.247666    .6410867   5.298317   9.721166
         exp |      3,647    19.08774    7.666347          2         36
      expsqr |      3,647    423.0987    306.1865          4       1296
birthmont~m2 |      3,647    .0825336    .2752137          0          1
birthmonth~3 |      3,647    .0808884     .272701          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,647    .0699205    .2550479          0          1
birthmonth~5 |      3,647    .0786948    .2692988          0          1
birthmonth~6 |      3,647     .081711    .2739615          0          1
birthmonth~7 |      3,647    .0690979    .2536553          0          1
birthmonth~8 |      3,647    .0880175    .2833593          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,647    .0951467    .2934577          0          1
birthmont~10 |      3,647    .1020016     .302692          0          1
birthmont~11 |      3,647    .0904853    .2869152          0          1
birthmont~12 |      3,647    .0745818    .2627515          0          1
        male |      3,647           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange
> (monthlyearning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,647
                                                        F(30, 3616)   = 203.21
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6277
                                                        Adj R-squared = 0.6246
                                                        Root MSE      = 0.2033

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1579845   .0034309   -46.05   0.000    -.1647112   -.1512578
         expsqr |   .0016707   .0001023    16.33   0.000     .0014701    .0018712
 birthmonthdum2 |   .0043678    .016386     0.27   0.790     -.027759    .0364945
 birthmonthdum3 |   .0089296   .0164709     0.54   0.588    -.0233636    .0412229
 birthmonthdum4 |   .0155122   .0171326     0.91   0.365    -.0180783    .0491027
 birthmonthdum5 |   .0131031   .0166001     0.79   0.430    -.0194434    .0456497
 birthmonthdum6 |   .0246515   .0164475     1.50   0.134    -.0075958    .0568988
 birthmonthdum7 |    .039028   .0172598     2.26   0.024     .0051881    .0728679
 birthmonthdum8 |   .0584615   .0161886     3.61   0.000     .0267218    .0902012
 birthmonthdum9 |   .0474739   .0158908     2.99   0.003     .0163182    .0786297
birthmonthdum10 |   .0603576   .0156532     3.86   0.000     .0296676    .0910476
birthmonthdum11 |   .0518214   .0161015     3.22   0.001     .0202526    .0833902
birthmonthdum12 |   .0767437   .0169602     4.52   0.000     .0434913    .1099961
   provincedum2 |   .1141309   .0281059     4.06   0.000     .0590259    .1692359
   provincedum3 |   .1255758   .0343327     3.66   0.000     .0582623    .1928892
   provincedum4 |   .0440689   .0292099     1.51   0.131    -.0132007    .1013385
   provincedum5 |   .0396584   .0234604     1.69   0.091    -.0063385    .0856554
   provincedum6 |   .1056926    .024005     4.40   0.000     .0586278    .1527573
   provincedum7 |   .0888526   .0239522     3.71   0.000     .0418914    .1358138
   provincedum8 |    .097653   .0228655     4.27   0.000     .0528224    .1424836
   provincedum9 |   .0259375   .0234305     1.11   0.268    -.0200008    .0718757
  provincedum10 |  -.0019641   .0237172    -0.08   0.934    -.0484646    .0445364
  provincedum11 |   .0242099   .0233435     1.04   0.300    -.0215578    .0699777
  provincedum12 |   .0181173   .0266681     0.68   0.497    -.0341686    .0704032
  provincedum13 |   .0364861   .0242848     1.50   0.133    -.0111271    .0840993
  provincedum14 |   .0608368   .0253483     2.40   0.016     .0111383    .1105352
  provincedum15 |   .0882043   .0247105     3.57   0.000     .0397563    .1366523
              t |  -.0054461   .0003309   -16.46   0.000    -.0060949   -.0047972
              d |   .0606565   .0157531     3.85   0.000     .0297707    .0915423
             td |  -.0034619   .0003127   -11.07   0.000     -.004075   -.0028488
          _cons |   2.758052   .0448395    61.51   0.000     2.670138    2.845965
---------------------------------------------------------------------------------

                                                        Number of obs =  3,647
                                                        F(30, 3616)   = 164.60
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5773
                                                        Adj R-squared = 0.5738
                                                        Root MSE      = 0.2071

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1514601   .0034964   -43.32   0.000    -.1583153    -.144605
         expsqr |   .0018068   .0001043    17.33   0.000     .0016024    .0020112
 birthmonthdum2 |   .0139088   .0166989     0.83   0.405    -.0188313     .046649
 birthmonthdum3 |   .0181788   .0167854     1.08   0.279     -.014731    .0510886
 birthmonthdum4 |   .0031387   .0174597     0.18   0.857    -.0310931    .0373705
 birthmonthdum5 |   .0166259   .0169171     0.98   0.326     -.016542    .0497938
 birthmonthdum6 |   .0199795   .0167615     1.19   0.233    -.0128835    .0528425
 birthmonthdum7 |    .033221   .0175893     1.89   0.059    -.0012649     .067707
 birthmonthdum8 |   .0566812   .0164977     3.44   0.001     .0243355    .0890268
 birthmonthdum9 |   .0446233   .0161942     2.76   0.006     .0128727    .0763739
birthmonthdum10 |   .0443218   .0159521     2.78   0.005     .0130459    .0755977
birthmonthdum11 |   .0451994   .0164089     2.75   0.006     .0130279    .0773709
birthmonthdum12 |    .076425    .017284     4.42   0.000     .0425378    .1103123
   provincedum2 |   .0940732   .0286425     3.28   0.001     .0379162    .1502302
   provincedum3 |   .0988818   .0349882     2.83   0.005     .0302832    .1674804
   provincedum4 |   .0393477   .0297676     1.32   0.186    -.0190153    .0977107
   provincedum5 |   .0273692   .0239083     1.14   0.252    -.0195059    .0742443
   provincedum6 |   .0918527   .0244633     3.75   0.000     .0438894     .139816
   provincedum7 |    .063809   .0244095     2.61   0.009     .0159513    .1116668
   provincedum8 |   .0832282   .0233021     3.57   0.000     .0375417    .1289147
   provincedum9 |   .0259025   .0238778     1.08   0.278    -.0209128    .0727179
  provincedum10 |  -.0002374     .02417    -0.01   0.992    -.0476257    .0471509
  provincedum11 |   .0171698   .0237892     0.72   0.470    -.0294717    .0638114
  provincedum12 |   .0119136   .0271772     0.44   0.661    -.0413706    .0651978
  provincedum13 |   .0284312   .0247484     1.15   0.251    -.0200911    .0769534
  provincedum14 |    .053077   .0258323     2.05   0.040     .0024297    .1037243
  provincedum15 |   .0764345   .0251823     3.04   0.002     .0270615    .1258074
              t |  -.0043072   .0003372   -12.77   0.000    -.0049685    -.003646
              d |   .0578632   .0160538     3.60   0.000     .0263877    .0893387
             td |    -.00353   .0003187   -11.08   0.000    -.0041548   -.0029052
          _cons |   2.531868   .0456956    55.41   0.000     2.442276     2.62146
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,647
                                                  Wald chi2(29)   =     128.94
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .75295

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -3.214451   1.933625    -1.66   0.096    -7.004286     .575385
  secgenhighedu |   4.040585   2.200481     1.84   0.066    -.2722785    8.353449
            exp |   .0684944   .0225376     3.04   0.002     .0243215    .1126674
         expsqr |  -.0014619   .0005115    -2.86   0.004    -.0024644   -.0004595
 birthmonthdum2 |   -.024177   .0647789    -0.37   0.709    -.1511412    .1027872
 birthmonthdum3 |  -.1193198   .0651917    -1.83   0.067    -.2470932    .0084536
 birthmonthdum4 |   .0726661   .0671135     1.08   0.279     -.058874    .2042063
 birthmonthdum5 |  -.0598813   .0627465    -0.95   0.340    -.1828622    .0630996
 birthmonthdum6 |   .0320671   .0608267     0.53   0.598     -.087151    .1512853
 birthmonthdum7 |    .019456   .0638087     0.30   0.760    -.1056067    .1445187
 birthmonthdum8 |   .0033251   .0612943     0.05   0.957    -.1168095    .1234597
 birthmonthdum9 |  -.0135065   .0594704    -0.23   0.820    -.1300664    .1030534
birthmonthdum10 |   .0098849   .0595619     0.17   0.868    -.1068543    .1266241
birthmonthdum11 |   .0086745   .0594488     0.15   0.884    -.1078429     .125192
birthmonthdum12 |  -.0248016    .067174    -0.37   0.712    -.1564603    .1068571
   provincedum2 |  -.1971201   .1032321    -1.91   0.056    -.3994512    .0052111
   provincedum3 |  -.0677033   .1280324    -0.53   0.597    -.3186422    .1832356
   provincedum4 |  -.2151498   .1079043    -1.99   0.046    -.4266384   -.0036613
   provincedum5 |   .0473372   .0869383     0.54   0.586    -.1230587    .2177331
   provincedum6 |   .0323834   .0877103     0.37   0.712    -.1395257    .2042925
   provincedum7 |   .0083661   .0901521     0.09   0.926    -.1683288     .185061
   provincedum8 |  -.1507388   .0832797    -1.81   0.070     -.313964    .0124864
   provincedum9 |   .0845087   .0873676     0.97   0.333    -.0867286    .2557459
  provincedum10 |   .0541691   .0879774     0.62   0.538    -.1182635    .2266017
  provincedum11 |   -.065343   .0861471    -0.76   0.448    -.2341881    .1035022
  provincedum12 |   -.165321    .098652    -1.68   0.094    -.3586755    .0280334
  provincedum13 |  -.1872194   .0895715    -2.09   0.037    -.3627763   -.0116625
  provincedum14 |  -.3072479   .0932881    -3.29   0.001    -.4900893   -.1244066
  provincedum15 |  -.2316542   .0905539    -2.56   0.011    -.4091365   -.0541719
          _cons |   7.584202   .2377915    31.89   0.000     7.118139    8.050265
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  15.2106  (p = 0.0005)
  Wu-Hausman F(2,3615)            =  7.57015  (p = 0.0005)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .012878  (p = 0.9096)
  Basmann chi2(1)        =  .012769  (p = 0.9100)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  23.276  Chi-sq(30) P-value = 0.8038

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,647    8.247666    .6410867   5.298317   9.721166
         exp |      3,647    19.08774    7.666347          2         36
      expsqr |      3,647    423.0987    306.1865          4       1296
birthmont~m2 |      3,647    .0825336    .2752137          0          1
birthmonth~3 |      3,647    .0808884     .272701          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,647    .0699205    .2550479          0          1
birthmonth~5 |      3,647    .0786948    .2692988          0          1
birthmonth~6 |      3,647     .081711    .2739615          0          1
birthmonth~7 |      3,647    .0690979    .2536553          0          1
birthmonth~8 |      3,647    .0880175    .2833593          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,647    .0951467    .2934577          0          1
birthmont~10 |      3,647    .1020016     .302692          0          1
birthmont~11 |      3,647    .0904853    .2869152          0          1
birthmont~12 |      3,647    .0745818    .2627515          0          1
        male |      3,647           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667
> ) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,207
                                                        F(16, 2190)   = 253.06
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6490
                                                        Adj R-squared = 0.6464
                                                        Root MSE      = 0.2067

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1547882   .0041988   -36.87   0.000    -.1630221   -.1465542
         expsqr |   .0017053   .0001335    12.77   0.000     .0014435    .0019671
 birthmonthdum2 |   .0268394   .0229267     1.17   0.242     -.018121    .0717997
 birthmonthdum3 |    .007682   .0239448     0.32   0.748    -.0392748    .0546389
 birthmonthdum4 |  -.0027237   .0239562    -0.11   0.909     -.049703    .0442555
 birthmonthdum5 |   -.001613   .0230752    -0.07   0.944    -.0468644    .0436385
 birthmonthdum6 |   .0375325   .0231084     1.62   0.104    -.0077842    .0828492
 birthmonthdum7 |   .0455697   .0232237     1.96   0.050      .000027    .0911125
 birthmonthdum8 |   .0393573   .0228554     1.72   0.085    -.0054633    .0841778
 birthmonthdum9 |   .0508322    .022215     2.29   0.022     .0072676    .0943969
birthmonthdum10 |   .0438739   .0217065     2.02   0.043     .0013063    .0864414
birthmonthdum11 |   .0856536   .0233312     3.67   0.000     .0398999    .1314073
birthmonthdum12 |   .0612931   .0229881     2.67   0.008     .0162124    .1063739
              t |  -.0053522   .0004675   -11.45   0.000    -.0062691   -.0044354
              d |   .0641218   .0213151     3.01   0.003     .0223218    .1059217
             td |  -.0029382   .0004303    -6.83   0.000    -.0037821   -.0020943
          _cons |   2.704254   .0517345    52.27   0.000       2.6028    2.805708
---------------------------------------------------------------------------------

                                                        Number of obs =  2,207
                                                        F(16, 2190)   = 201.47
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5955
                                                        Adj R-squared = 0.5925
                                                        Root MSE      = 0.2102

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1475682    .004271   -34.55   0.000    -.1559438   -.1391925
         expsqr |   .0018568   .0001358    13.67   0.000     .0015905    .0021231
 birthmonthdum2 |   .0422502   .0233213     1.81   0.070    -.0034839    .0879843
 birthmonthdum3 |   .0225947   .0243569     0.93   0.354    -.0251704    .0703598
 birthmonthdum4 |   .0167095   .0243685     0.69   0.493    -.0310783    .0644973
 birthmonthdum5 |   .0092464   .0234723     0.39   0.694     -.036784    .0552767
 birthmonthdum6 |   .0510662   .0235061     2.17   0.030     .0049695    .0971629
 birthmonthdum7 |   .0539381   .0236234     2.28   0.023     .0076116    .1002647
 birthmonthdum8 |   .0449121   .0232488     1.93   0.054    -.0006799    .0905041
 birthmonthdum9 |   .0523698   .0225973     2.32   0.021     .0080554    .0966843
birthmonthdum10 |    .038819   .0220801     1.76   0.079    -.0044812    .0821192
birthmonthdum11 |   .0813965   .0237328     3.43   0.001     .0348553    .1279377
birthmonthdum12 |   .0623082   .0233837     2.66   0.008     .0164515    .1081648
              t |  -.0041732   .0004756    -8.78   0.000    -.0051058   -.0032406
              d |   .0835312    .021682     3.85   0.000     .0410118    .1260505
             td |  -.0030896   .0004377    -7.06   0.000     -.003948   -.0022311
          _cons |   2.423592   .0526249    46.05   0.000     2.320391    2.526792
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,207
                                                  Wald chi2(15)   =      81.74
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      .6389

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   1.152306   1.316499     0.88   0.381    -1.427985    3.732596
  secgenhighedu |  -.7385978   1.510033    -0.49   0.625    -3.698208    2.221012
            exp |   .0111439   .0173507     0.64   0.521    -.0228629    .0451507
         expsqr |  -.0001992   .0003986    -0.50   0.617    -.0009804     .000582
 birthmonthdum2 |   .0110771   .0755833     0.15   0.883    -.1370635    .1592176
 birthmonthdum3 |   .0815004   .0772082     1.06   0.291    -.0698249    .2328258
 birthmonthdum4 |   .1146977    .078809     1.46   0.146    -.0397652    .2691605
 birthmonthdum5 |   .0314675   .0726404     0.43   0.665     -.110905    .1738399
 birthmonthdum6 |   .1044704   .0760227     1.37   0.169    -.0445314    .2534722
 birthmonthdum7 |   .0743844   .0747738     0.99   0.320    -.0721696    .2209385
 birthmonthdum8 |   .0263063   .0721652     0.36   0.715    -.1151349    .1677474
 birthmonthdum9 |  -.0207532   .0694434    -0.30   0.765    -.1568597    .1153533
birthmonthdum10 |   .0390177    .066821     0.58   0.559     -.091949    .1699844
birthmonthdum11 |  -.0319462   .0728201    -0.44   0.661    -.1746709    .1107786
birthmonthdum12 |  -.0469929   .0721238    -0.65   0.515    -.1883529    .0943671
          _cons |   7.648635   .1711202    44.70   0.000     7.313245    7.984024
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  12.8526  (p = 0.0016)
  Wu-Hausman F(2,2189)            =  6.41121  (p = 0.0017)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .526379  (p = 0.4681)
  Basmann chi2(1)        =  .522449  (p = 0.4698)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  19.680  Chi-sq(16) P-value = 0.2350

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,207    7.876517    .6366901   5.298317   9.721166
         exp |      2,207    18.87041    7.720789          1         34
      expsqr |      2,207     415.676    301.9249          1       1156
birthmont~m2 |      2,207    .0847304    .2785432          0          1
birthmonth~3 |      2,207    .0706842    .2563547          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,207     .069778    .2548302          0          1
birthmonth~5 |      2,207    .0824649     .275134          0          1
birthmonth~6 |      2,207    .0820118    .2744449          0          1
birthmonth~7 |      2,207    .0801994    .2716631          0          1
birthmonth~8 |      2,207    .0869959     .281893          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,207    .0992297     .299038          0          1
birthmont~10 |      2,207    .1132759    .3170016          0          1
birthmont~11 |      2,207    .0788401      .26955          0          1
birthmont~12 |      2,207    .0860897      .28056          0          1
        male |      2,207           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange
> (monthlyearning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,207
                                                        F(30, 2176)   = 140.08
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6588
                                                        Adj R-squared = 0.6541
                                                        Root MSE      = 0.2044

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1526052   .0041907   -36.42   0.000    -.1608234    -.144387
         expsqr |   .0015664    .000135    11.61   0.000     .0013017     .001831
 birthmonthdum2 |   .0233414   .0227398     1.03   0.305    -.0212526    .0679354
 birthmonthdum3 |   .0070504   .0237515     0.30   0.767    -.0395276    .0536284
 birthmonthdum4 |  -.0012561   .0237787    -0.05   0.958    -.0478875    .0453752
 birthmonthdum5 |   .0000602   .0228929     0.00   0.998     -.044834    .0449544
 birthmonthdum6 |   .0401154   .0229064     1.75   0.080    -.0048053     .085036
 birthmonthdum7 |   .0495396   .0230236     2.15   0.032      .004389    .0946901
 birthmonthdum8 |   .0458348   .0226834     2.02   0.043     .0013515    .0903182
 birthmonthdum9 |   .0572883   .0220685     2.60   0.009     .0140108    .1005657
birthmonthdum10 |   .0507907   .0215379     2.36   0.018     .0085537    .0930278
birthmonthdum11 |   .0850078   .0231522     3.67   0.000     .0396051    .1304104
birthmonthdum12 |    .061362   .0227799     2.69   0.007     .0166894    .1060346
   provincedum2 |  -.0094157   .0365884    -0.26   0.797    -.0811675    .0623362
   provincedum3 |   .0056736   .0466999     0.12   0.903    -.0859076    .0972547
   provincedum4 |  -.0253097   .0381627    -0.66   0.507    -.1001489    .0495295
   provincedum5 |   .0189466   .0271426     0.70   0.485    -.0342815    .0721747
   provincedum6 |   .0424223   .0285764     1.48   0.138    -.0136177    .0984622
   provincedum7 |   .0561511   .0286924     1.96   0.050    -.0001163    .1124185
   provincedum8 |   .0501995   .0268097     1.87   0.061    -.0023758    .1027748
   provincedum9 |     -.0424   .0277918    -1.53   0.127    -.0969013    .0121012
  provincedum10 |  -.0456393   .0280003    -1.63   0.103    -.1005494    .0092708
  provincedum11 |  -.0193045    .027332    -0.71   0.480     -.072904    .0342951
  provincedum12 |  -.0151462   .0334729    -0.45   0.651    -.0807884    .0504959
  provincedum13 |    .001242   .0289144     0.04   0.966    -.0554606    .0579447
  provincedum14 |  -.0004338   .0291696    -0.01   0.988     -.057637    .0567694
  provincedum15 |   .0535398   .0321503     1.67   0.096    -.0095087    .1165883
              t |  -.0058451   .0004748   -12.31   0.000    -.0067762    -.004914
              d |   .0622627   .0211341     2.95   0.003     .0208176    .1037078
             td |  -.0026659   .0004306    -6.19   0.000    -.0035103   -.0018214
          _cons |   2.717107   .0545808    49.78   0.000     2.610071    2.824143
---------------------------------------------------------------------------------

                                                        Number of obs =  2,207
                                                        F(30, 2176)   = 110.90
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6046
                                                        Adj R-squared = 0.5991
                                                        Root MSE      = 0.2085

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1451172    .004275   -33.95   0.000    -.1535007   -.1367336
         expsqr |   .0017048   .0001377    12.38   0.000     .0014348    .0019748
 birthmonthdum2 |   .0397724   .0231973     1.71   0.087    -.0057188    .0852636
 birthmonthdum3 |    .021246   .0242293     0.88   0.381    -.0262691    .0687611
 birthmonthdum4 |   .0173518   .0242571     0.72   0.474    -.0302176    .0649213
 birthmonthdum5 |   .0106392   .0233534     0.46   0.649    -.0351582    .0564365
 birthmonthdum6 |   .0530894   .0233672     2.27   0.023     .0072649    .0989138
 birthmonthdum7 |   .0569019   .0234868     2.42   0.015      .010843    .1029608
 birthmonthdum8 |   .0506493   .0231397     2.19   0.029      .005271    .0960276
 birthmonthdum9 |   .0569698   .0225124     2.53   0.011     .0128217     .101118
birthmonthdum10 |   .0445837   .0219713     2.03   0.043     .0014968    .0876705
birthmonthdum11 |    .081221    .023618     3.44   0.001     .0349049    .1275372
birthmonthdum12 |   .0619758   .0232382     2.67   0.008     .0164044    .1075472
   provincedum2 |   .0333514   .0373245     0.89   0.372     -.039844    .1065468
   provincedum3 |   .0466976   .0476395     0.98   0.327    -.0467261    .1401213
   provincedum4 |  -.0070253   .0389305    -0.18   0.857    -.0833702    .0693196
   provincedum5 |   .0317934   .0276887     1.15   0.251    -.0225056    .0860924
   provincedum6 |   .0652461   .0291514     2.24   0.025     .0080787    .1224135
   provincedum7 |   .0803245   .0292697     2.74   0.006      .022925    .1377239
   provincedum8 |   .0659604   .0273491     2.41   0.016     .0123273    .1195935
   provincedum9 |  -.0063513   .0283509    -0.22   0.823     -.061949    .0492465
  provincedum10 |  -.0112797   .0285636    -0.39   0.693    -.0672946    .0447351
  provincedum11 |   .0034118   .0278819     0.12   0.903    -.0512661    .0580897
  provincedum12 |   .0208073   .0341463     0.61   0.542    -.0461555    .0877701
  provincedum13 |   .0328688   .0294961     1.11   0.265    -.0249746    .0907122
  provincedum14 |   .0159373   .0297565     0.54   0.592    -.0424168    .0742914
  provincedum15 |    .089395   .0327971     2.73   0.006      .025078     .153712
              t |  -.0047232   .0004843    -9.75   0.000     -.005673   -.0037734
              d |   .0831274   .0215593     3.86   0.000     .0408485    .1254063
             td |  -.0027859   .0004393    -6.34   0.000    -.0036473   -.0019244
          _cons |   2.413031   .0556789    43.34   0.000     2.303841     2.52222
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,207
                                                  Wald chi2(29)   =     172.19
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0684
                                                  Root MSE        =     .61439

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .1994711   1.369024     0.15   0.884    -2.483767    2.882709
  secgenhighedu |   .3205762   1.559075     0.21   0.837    -2.735154    3.376307
            exp |   .0143141   .0162067     0.88   0.377    -.0174505    .0460786
         expsqr |  -.0002514   .0003731    -0.67   0.501    -.0009827    .0004799
 birthmonthdum2 |   .0007661     .07373     0.01   0.992     -.143742    .1452742
 birthmonthdum3 |   .0635047   .0745097     0.85   0.394    -.0825317    .2095411
 birthmonthdum4 |   .0835193   .0763002     1.09   0.274    -.0660264    .2330649
 birthmonthdum5 |   .0171924   .0702486     0.24   0.807    -.1204924    .1548772
 birthmonthdum6 |   .0813273   .0736027     1.10   0.269    -.0629314    .2255859
 birthmonthdum7 |   .0746048   .0720365     1.04   0.300    -.0665841    .2157937
 birthmonthdum8 |   .0058042   .0697299     0.08   0.934    -.1308639    .1424723
 birthmonthdum9 |  -.0325025   .0668246    -0.49   0.627    -.1634763    .0984713
birthmonthdum10 |    .034815   .0643791     0.54   0.589    -.0913656    .1609957
birthmonthdum11 |  -.0311745   .0702355    -0.44   0.657    -.1688336    .1064845
birthmonthdum12 |  -.0491988   .0693415    -0.71   0.478    -.1851056    .0867079
   provincedum2 |  -.3477473   .1316901    -2.64   0.008    -.6058552   -.0896393
   provincedum3 |  -.1839459   .1574561    -1.17   0.243    -.4925543    .1246624
   provincedum4 |  -.3831447   .1180458    -3.25   0.001    -.6145103   -.1517791
   provincedum5 |  -.0724917   .0864235    -0.84   0.402    -.2418788    .0968953
   provincedum6 |  -.0726529    .098699    -0.74   0.462    -.2660993    .1207935
   provincedum7 |  -.2155436   .1024099    -2.10   0.035    -.4162633   -.0148239
   provincedum8 |  -.2782384   .0902972    -3.08   0.002    -.4552176   -.1012591
   provincedum9 |   .1289051   .0999215     1.29   0.197    -.0669374    .3247476
  provincedum10 |   -.127401   .0968095    -1.32   0.188    -.3171442    .0623421
  provincedum11 |  -.1404633   .0906161    -1.55   0.121    -.3180676    .0371411
  provincedum12 |  -.1915845   .1170587    -1.64   0.102    -.4210152    .0378463
  provincedum13 |  -.1612911   .1031876    -1.56   0.118     -.363535    .0409528
  provincedum14 |  -.2851766   .0932889    -3.06   0.002    -.4680195   -.1023336
  provincedum15 |  -.2940767   .1209917    -2.43   0.015     -.531216   -.0569374
          _cons |   7.775868   .1652412    47.06   0.000     7.452001    8.099735
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =    8.349  (p = 0.0154)
  Wu-Hausman F(2,2175)            =   4.1296  (p = 0.0162)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .074244  (p = 0.7853)
  Basmann chi2(1)        =  .073204  (p = 0.7867)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  52.766  Chi-sq(30) P-value = 0.0063

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,207    7.876517    .6366901   5.298317   9.721166
         exp |      2,207    18.87041    7.720789          1         34
      expsqr |      2,207     415.676    301.9249          1       1156
birthmont~m2 |      2,207    .0847304    .2785432          0          1
birthmonth~3 |      2,207    .0706842    .2563547          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,207     .069778    .2548302          0          1
birthmonth~5 |      2,207    .0824649     .275134          0          1
birthmonth~6 |      2,207    .0820118    .2744449          0          1
birthmonth~7 |      2,207    .0801994    .2716631          0          1
birthmonth~8 |      2,207    .0869959     .281893          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,207    .0992297     .299038          0          1
birthmont~10 |      2,207    .1132759    .3170016          0          1
birthmont~11 |      2,207    .0788401      .26955          0          1
birthmont~12 |      2,207    .0860897      .28056          0          1
        male |      2,207           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667) & educa
> t != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,854
                                                        F(17, 5836)   = 579.64
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6280
                                                        Adj R-squared = 0.6270
                                                        Root MSE      = 0.2063

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1579255   .0026625   -59.31   0.000    -.1631449    -.152706
         expsqr |   .0017735   .0000809    21.91   0.000     .0016149    .0019322
 birthmonthdum2 |   .0107664   .0134163     0.80   0.422    -.0155346    .0370673
 birthmonthdum3 |   .0062343   .0136734     0.46   0.648    -.0205706    .0330391
 birthmonthdum4 |   .0044691    .014018     0.32   0.750    -.0230115    .0319497
 birthmonthdum5 |   .0052634   .0135478     0.39   0.698    -.0212953    .0318221
 birthmonthdum6 |   .0263064   .0134834     1.95   0.051    -.0001261    .0527389
 birthmonthdum7 |   .0369306   .0138753     2.66   0.008     .0097298    .0641314
 birthmonthdum8 |   .0455672   .0132886     3.43   0.001     .0195166    .0716178
 birthmonthdum9 |   .0451672   .0129873     3.48   0.001     .0197073    .0706271
birthmonthdum10 |   .0478875   .0127369     3.76   0.000     .0229184    .0728565
birthmonthdum11 |   .0581137   .0133498     4.35   0.000     .0319432    .0842842
birthmonthdum12 |   .0660134   .0136824     4.82   0.000     .0391908     .092836
           male |  -.0031722    .005579    -0.57   0.570     -.014109    .0077647
              t |  -.0050327   .0002685   -18.75   0.000     -.005559   -.0045064
              d |   .0588725   .0127178     4.63   0.000     .0339408    .0838041
             td |  -.0034702   .0002532   -13.71   0.000    -.0039665   -.0029738
          _cons |    2.76065   .0327109    84.40   0.000     2.696525    2.824776
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,854
                                                  Wald chi2(15)   =     573.84
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0791
                                                  Root MSE        =     .63734

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .4371102   .0479677     9.11   0.000     .3430952    .5311252
            exp |   .0284557   .0076581     3.72   0.000      .013446    .0434653
         expsqr |  -.0005668    .000179    -3.17   0.002    -.0009176    -.000216
 birthmonthdum2 |   .0132025   .0414115     0.32   0.750    -.0679626    .0943675
 birthmonthdum3 |  -.0269507   .0422107    -0.64   0.523    -.1096823    .0557808
 birthmonthdum4 |   .0653395   .0432924     1.51   0.131    -.0195121    .1501911
 birthmonthdum5 |  -.0111033    .041808    -0.27   0.791    -.0930455    .0708389
 birthmonthdum6 |   .0568486   .0415777     1.37   0.172    -.0246422    .1383393
 birthmonthdum7 |   .0366643   .0427791     0.86   0.391    -.0471811    .1205097
 birthmonthdum8 |   .0311907   .0408948     0.76   0.446    -.0489616     .111343
 birthmonthdum9 |    .003289   .0400096     0.08   0.934    -.0751285    .0817064
birthmonthdum10 |   .0167511    .039179     0.43   0.669    -.0600384    .0935406
birthmonthdum11 |   .0114364   .0410647     0.28   0.781    -.0690488    .0919216
birthmonthdum12 |  -.0072469   .0419718    -0.17   0.863    -.0895101    .0750163
           male |   .3761871   .0172218    21.84   0.000     .3424331    .4099412
          _cons |   7.498064   .0833513    89.96   0.000     7.334698    7.661429
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =    31.61  (p = 0.0000)
  Wu-Hausman F(1,5837)            =  31.6893  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  1.78814  (p = 0.4090)
  Basmann chi2(2)        =  1.78318  (p = 0.4100)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  20.724  Chi-sq(17) P-value = 0.2389

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,854     8.10774     .664202   5.298317   9.721166
         exp |      5,854    19.00581     7.68698          1         36
      expsqr |      5,854    420.3003    304.5823          1       1296
birthmont~m2 |      5,854    .0833618    .2764519          0          1
birthmonth~3 |      5,854    .0770413    .2666798          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,854    .0698668    .2549441          0          1
birthmonth~5 |      5,854    .0801162    .2714961          0          1
birthmonth~6 |      5,854    .0818244    .2741204          0          1
birthmonth~7 |      5,854    .0732832    .2606231          0          1
birthmonth~8 |      5,854    .0876324    .2827837          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,854     .096686     .295555          0          1
birthmont~10 |      5,854    .1062521    .3081864          0          1
birthmont~11 |      5,854     .086095    .2805282          0          1
birthmont~12 |      5,854    .0789204    .2696375          0          1
        male |      5,854    .6229928    .4846781          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthly
> earning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,854
                                                        F(31, 5822)   = 331.78
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6385
                                                        Adj R-squared = 0.6366
                                                        Root MSE      = 0.2036

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |    -.15572   .0026409   -58.96   0.000    -.1608972   -.1505428
         expsqr |   .0016255   .0000811    20.05   0.000     .0014666    .0017844
 birthmonthdum2 |   .0128239   .0132498     0.97   0.333    -.0131506    .0387984
 birthmonthdum3 |   .0084431   .0135029     0.63   0.532    -.0180277    .0349138
 birthmonthdum4 |   .0097089   .0138468     0.70   0.483    -.0174361    .0368538
 birthmonthdum5 |   .0092913   .0133823     0.69   0.488     -.016943    .0355256
 birthmonthdum6 |   .0311028    .013318     2.34   0.020     .0049946     .057211
 birthmonthdum7 |   .0443687   .0137182     3.23   0.001     .0174759    .0712614
 birthmonthdum8 |   .0539663   .0131347     4.11   0.000     .0282174    .0797152
 birthmonthdum9 |   .0516638    .012839     4.02   0.000     .0264945     .076833
birthmonthdum10 |   .0573014   .0126019     4.55   0.000     .0325971    .0820058
birthmonthdum11 |   .0646994   .0131933     4.90   0.000     .0388355    .0905632
birthmonthdum12 |   .0711292   .0135153     5.26   0.000     .0446342    .0976243
           male |  -.0046514   .0055222    -0.84   0.400    -.0154771    .0061742
   provincedum2 |   .0684123   .0220942     3.10   0.002     .0250995     .111725
   provincedum3 |   .0826467    .027477     3.01   0.003     .0287816    .1365118
   provincedum4 |   .0161304   .0230133     0.70   0.483    -.0289843    .0612451
   provincedum5 |   .0310032   .0176998     1.75   0.080     -.003695    .0657014
   provincedum6 |   .0792197   .0183169     4.32   0.000     .0433118    .1151277
   provincedum7 |   .0734639   .0183152     4.01   0.000     .0375593    .1093685
   provincedum8 |   .0772457   .0173395     4.45   0.000     .0432537    .1112376
   provincedum9 |  -.0026622   .0178523    -0.15   0.881    -.0376594    .0323349
  provincedum10 |  -.0212407   .0180394    -1.18   0.239    -.0566046    .0141231
  provincedum11 |   .0051194      .0177     0.29   0.772    -.0295792    .0398181
  provincedum12 |   .0015624   .0207327     0.08   0.940    -.0390814    .0422062
  provincedum13 |   .0201838   .0185349     1.09   0.276    -.0161514     .056519
  provincedum14 |   .0342197   .0190802     1.79   0.073    -.0031844    .0716239
  provincedum15 |   .0712707   .0193348     3.69   0.000     .0333673    .1091742
              t |  -.0056005   .0002707   -20.69   0.000    -.0061312   -.0050699
              d |   .0601375   .0125824     4.78   0.000     .0354713    .0848036
             td |  -.0031515   .0002518   -12.52   0.000    -.0036451   -.0026579
          _cons |   2.745647   .0345463    79.48   0.000     2.677923     2.81337
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,854
                                                  Wald chi2(29)   =     783.89
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1134
                                                  Root MSE        =     .62535

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .3854803    .046925     8.21   0.000     .2935089    .4774517
            exp |   .0229178   .0075035     3.05   0.002     .0082112    .0376245
         expsqr |  -.0004446   .0001755    -2.53   0.011    -.0007886   -.0001007
 birthmonthdum2 |   .0102942   .0406595     0.25   0.800    -.0693969    .0899852
 birthmonthdum3 |  -.0296051   .0414386    -0.71   0.475    -.1108233    .0516131
 birthmonthdum4 |   .0519759   .0425067     1.22   0.221    -.0313357    .1352875
 birthmonthdum5 |  -.0151947    .041051    -0.37   0.711    -.0956532    .0652638
 birthmonthdum6 |   .0484153   .0408161     1.19   0.236    -.0315827    .1284133
 birthmonthdum7 |   .0445072    .042046     1.06   0.290    -.0379014    .1269158
 birthmonthdum8 |   .0205529   .0401688     0.51   0.609    -.0581765    .0992823
 birthmonthdum9 |  -.0069698   .0393154    -0.18   0.859    -.0840266     .070087
birthmonthdum10 |   .0017164   .0385111     0.04   0.964    -.0737639    .0771967
birthmonthdum11 |  -.0011781    .040323    -0.03   0.977    -.0802097    .0778535
birthmonthdum12 |  -.0088708   .0412101    -0.22   0.830    -.0896411    .0718994
           male |    .380782   .0169447    22.47   0.000     .3475709    .4139931
   provincedum2 |  -.2615279   .0672834    -3.89   0.000     -.393401   -.1296548
   provincedum3 |   -.136897   .0840315    -1.63   0.103    -.3015957    .0278018
   provincedum4 |  -.2658171   .0704815    -3.77   0.000    -.4039582   -.1276759
   provincedum5 |  -.0140397   .0540258    -0.26   0.795    -.1199283    .0918489
   provincedum6 |  -.0043988   .0554169    -0.08   0.937     -.113014    .1042164
   provincedum7 |  -.1011112    .055492    -1.82   0.068    -.2098734     .007651
   provincedum8 |  -.2022949   .0523684    -3.86   0.000    -.3049352   -.0996547
   provincedum9 |   .1110125   .0546508     2.03   0.042      .003899    .2181261
  provincedum10 |  -.0103375   .0554318    -0.19   0.852    -.1189817    .0983068
  provincedum11 |  -.1048001   .0541903    -1.93   0.053    -.2110112    .0014109
  provincedum12 |  -.1832574   .0635636    -2.88   0.004    -.3078397    -.058675
  provincedum13 |  -.1855141   .0566811    -3.27   0.001    -.2966071   -.0744211
  provincedum14 |  -.2939358   .0582051    -5.05   0.000    -.4080156   -.1798559
  provincedum15 |  -.2528126   .0587077    -4.31   0.000    -.3678776   -.1377476
          _cons |   7.668985   .0971303    78.96   0.000     7.478613    7.859357
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  18.6384  (p = 0.0000)
  Wu-Hausman F(1,5823)            =  18.5989  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  4.13192  (p = 0.1267)
  Basmann chi2(2)        =  4.11223  (p = 0.1279)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  83.562  Chi-sq(31) P-value = 0.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,854     8.10774     .664202   5.298317   9.721166
         exp |      5,854    19.00581     7.68698          1         36
      expsqr |      5,854    420.3003    304.5823          1       1296
birthmont~m2 |      5,854    .0833618    .2764519          0          1
birthmonth~3 |      5,854    .0770413    .2666798          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      5,854    .0698668    .2549441          0          1
birthmonth~5 |      5,854    .0801162    .2714961          0          1
birthmonth~6 |      5,854    .0818244    .2741204          0          1
birthmonth~7 |      5,854    .0732832    .2606231          0          1
birthmonth~8 |      5,854    .0876324    .2827837          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      5,854     .096686     .295555          0          1
birthmont~10 |      5,854    .1062521    .3081864          0          1
birthmont~11 |      5,854     .086095    .2805282          0          1
birthmont~12 |      5,854    .0789204    .2696375          0          1
        male |      5,854    .6229928    .4846781          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu  = t
>  d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667) & male == 1
>  & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,647
                                                        F(16, 3630)   = 362.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6152
                                                        Adj R-squared = 0.6135
                                                        Root MSE      = 0.2062

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1600516   .0034632   -46.22   0.000    -.1668416   -.1532617
         expsqr |   .0018194   .0001025    17.76   0.000     .0016186    .0020203
 birthmonthdum2 |   .0011647   .0166147     0.07   0.944    -.0314103    .0337397
 birthmonthdum3 |   .0057483   .0166906     0.34   0.731    -.0269757    .0384722
 birthmonthdum4 |   .0091762   .0173595     0.53   0.597    -.0248591    .0432115
 birthmonthdum5 |   .0102799   .0168251     0.61   0.541    -.0227077    .0432675
 birthmonthdum6 |   .0194441   .0166683     1.17   0.243    -.0132361    .0521242
 birthmonthdum7 |   .0305401    .017459     1.75   0.080    -.0036903    .0647704
 birthmonthdum8 |    .050087   .0163908     3.06   0.002     .0179509     .082223
 birthmonthdum9 |   .0415255    .016096     2.58   0.010     .0099674    .0730837
birthmonthdum10 |   .0510692   .0158369     3.22   0.001      .020019    .0821194
birthmonthdum11 |   .0437366   .0162996     2.68   0.007     .0117793    .0756939
birthmonthdum12 |   .0693886   .0171765     4.04   0.000      .035712    .1030653
              t |  -.0048503   .0003289   -14.75   0.000    -.0054951   -.0042055
              d |   .0571978   .0159205     3.59   0.000     .0259837    .0884118
             td |  -.0037861    .000315   -12.02   0.000    -.0044036   -.0031686
          _cons |   2.793053   .0422548    66.10   0.000     2.710207    2.875898
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,647
                                                  Wald chi2(14)   =      54.18
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0035
                                                  Root MSE        =     .63987

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .3888098   .0594601     6.54   0.000     .2722701    .5053496
            exp |    .037694   .0095605     3.94   0.000     .0189558    .0564323
         expsqr |  -.0007608   .0002239    -3.40   0.001    -.0011997   -.0003219
 birthmonthdum2 |   .0246346   .0515158     0.48   0.633    -.0763345    .1256038
 birthmonthdum3 |  -.0750547   .0517718    -1.45   0.147    -.1765255    .0264161
 birthmonthdum4 |   .0423571   .0538461     0.79   0.431    -.0631794    .1478935
 birthmonthdum5 |  -.0348001   .0521526    -0.67   0.505    -.1370173    .0674172
 birthmonthdum6 |   .0364498   .0516306     0.71   0.480    -.0647444    .1376439
 birthmonthdum7 |   .0146384    .054031     0.27   0.786    -.0912604    .1205373
 birthmonthdum8 |   .0407291   .0506743     0.80   0.422    -.0585906    .1400488
 birthmonthdum9 |   .0184393   .0497748     0.37   0.711    -.0791175     .115996
birthmonthdum10 |     .00419   .0489191     0.09   0.932    -.0916897    .1000697
birthmonthdum11 |    .036727   .0503344     0.73   0.466    -.0619267    .1353806
birthmonthdum12 |   .0254791   .0529326     0.48   0.630    -.0782669     .129225
          _cons |   7.789967   .1020725    76.32   0.000     7.589909    7.990026
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  18.2764  (p = 0.0000)
  Wu-Hausman F(1,3631)            =  18.2879  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  4.35147  (p = 0.1135)
  Basmann chi2(2)        =  4.33636  (p = 0.1144)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  17.100  Chi-sq(16) P-value = 0.3791

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,647    8.247666    .6410867   5.298317   9.721166
         exp |      3,647    19.08774    7.666347          2         36
      expsqr |      3,647    423.0987    306.1865          4       1296
birthmont~m2 |      3,647    .0825336    .2752137          0          1
birthmonth~3 |      3,647    .0808884     .272701          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,647    .0699205    .2550479          0          1
birthmonth~5 |      3,647    .0786948    .2692988          0          1
birthmonth~6 |      3,647     .081711    .2739615          0          1
birthmonth~7 |      3,647    .0690979    .2536553          0          1
birthmonth~8 |      3,647    .0880175    .2833593          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,647    .0951467    .2934577          0          1
birthmont~10 |      3,647    .1020016     .302692          0          1
birthmont~11 |      3,647    .0904853    .2869152          0          1
birthmont~12 |      3,647    .0745818    .2627515          0          1
        male |      3,647           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearni
> ng, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  3,647
                                                        F(30, 3616)   = 203.21
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6277
                                                        Adj R-squared = 0.6246
                                                        Root MSE      = 0.2033

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1579845   .0034309   -46.05   0.000    -.1647112   -.1512578
         expsqr |   .0016707   .0001023    16.33   0.000     .0014701    .0018712
 birthmonthdum2 |   .0043678    .016386     0.27   0.790     -.027759    .0364945
 birthmonthdum3 |   .0089296   .0164709     0.54   0.588    -.0233636    .0412229
 birthmonthdum4 |   .0155122   .0171326     0.91   0.365    -.0180783    .0491027
 birthmonthdum5 |   .0131031   .0166001     0.79   0.430    -.0194434    .0456497
 birthmonthdum6 |   .0246515   .0164475     1.50   0.134    -.0075958    .0568988
 birthmonthdum7 |    .039028   .0172598     2.26   0.024     .0051881    .0728679
 birthmonthdum8 |   .0584615   .0161886     3.61   0.000     .0267218    .0902012
 birthmonthdum9 |   .0474739   .0158908     2.99   0.003     .0163182    .0786297
birthmonthdum10 |   .0603576   .0156532     3.86   0.000     .0296676    .0910476
birthmonthdum11 |   .0518214   .0161015     3.22   0.001     .0202526    .0833902
birthmonthdum12 |   .0767437   .0169602     4.52   0.000     .0434913    .1099961
   provincedum2 |   .1141309   .0281059     4.06   0.000     .0590259    .1692359
   provincedum3 |   .1255758   .0343327     3.66   0.000     .0582623    .1928892
   provincedum4 |   .0440689   .0292099     1.51   0.131    -.0132007    .1013385
   provincedum5 |   .0396584   .0234604     1.69   0.091    -.0063385    .0856554
   provincedum6 |   .1056926    .024005     4.40   0.000     .0586278    .1527573
   provincedum7 |   .0888526   .0239522     3.71   0.000     .0418914    .1358138
   provincedum8 |    .097653   .0228655     4.27   0.000     .0528224    .1424836
   provincedum9 |   .0259375   .0234305     1.11   0.268    -.0200008    .0718757
  provincedum10 |  -.0019641   .0237172    -0.08   0.934    -.0484646    .0445364
  provincedum11 |   .0242099   .0233435     1.04   0.300    -.0215578    .0699777
  provincedum12 |   .0181173   .0266681     0.68   0.497    -.0341686    .0704032
  provincedum13 |   .0364861   .0242848     1.50   0.133    -.0111271    .0840993
  provincedum14 |   .0608368   .0253483     2.40   0.016     .0111383    .1105352
  provincedum15 |   .0882043   .0247105     3.57   0.000     .0397563    .1366523
              t |  -.0054461   .0003309   -16.46   0.000    -.0060949   -.0047972
              d |   .0606565   .0157531     3.85   0.000     .0297707    .0915423
             td |  -.0034619   .0003127   -11.07   0.000     -.004075   -.0028488
          _cons |   2.758052   .0448395    61.51   0.000     2.670138    2.845965
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      3,647
                                                  Wald chi2(28)   =     180.86
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0420
                                                  Root MSE        =      .6274

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .3338278   .0579636     5.76   0.000     .2202212    .4474344
            exp |    .032601   .0093475     3.49   0.000     .0142802    .0509218
         expsqr |  -.0006564   .0002191    -3.00   0.003    -.0010859   -.0002269
 birthmonthdum2 |   .0175064   .0505546     0.35   0.729    -.0815787    .1165915
 birthmonthdum3 |  -.0771066   .0508317    -1.52   0.129     -.176735    .0225218
 birthmonthdum4 |   .0324623   .0528631     0.61   0.539    -.0711476    .1360721
 birthmonthdum5 |  -.0364768   .0511938    -0.71   0.476    -.1368148    .0638613
 birthmonthdum6 |   .0301484   .0506767     0.59   0.552    -.0691761     .129473
 birthmonthdum7 |   .0230369   .0531441     0.43   0.665    -.0811236    .1271974
 birthmonthdum8 |   .0283804   .0497922     0.57   0.569    -.0692106    .1259713
 birthmonthdum9 |   .0042326   .0488959     0.09   0.931    -.0916016    .1000668
birthmonthdum10 |  -.0171887   .0480856    -0.36   0.721    -.1114348    .0770574
birthmonthdum11 |   .0155248   .0494384     0.31   0.754    -.0813727    .1124223
birthmonthdum12 |   .0209094   .0519877     0.40   0.688    -.0809847    .1228034
   provincedum2 |  -.2099752   .0858207    -2.45   0.014    -.3781807   -.0417698
   provincedum3 |  -.1020174   .1055412    -0.97   0.334    -.3088744    .1048397
   provincedum4 |  -.2012049   .0896889    -2.24   0.025     -.376992   -.0254179
   provincedum5 |   .0284732   .0719343     0.40   0.692    -.1125154    .1694618
   provincedum6 |   .0441001   .0728915     0.61   0.545    -.0987646    .1869647
   provincedum7 |  -.0314416   .0729155    -0.43   0.666    -.1743532    .1114701
   provincedum8 |  -.1457933    .069357    -2.10   0.036    -.2817305   -.0098561
   provincedum9 |   .1095009   .0719107     1.52   0.128    -.0314414    .2504433
  provincedum10 |   .0672578   .0730667     0.92   0.357    -.0759503    .2104659
  provincedum11 |  -.0715513   .0717272    -1.00   0.318    -.2121341    .0690315
  provincedum12 |  -.1742093   .0821034    -2.12   0.034     -.335129   -.0132897
  provincedum13 |  -.1935896   .0745799    -2.60   0.009    -.3397636   -.0474156
  provincedum14 |  -.2975104   .0776072    -3.83   0.000    -.4496177   -.1454032
  provincedum15 |  -.2219283   .0753253    -2.95   0.003    -.3695633   -.0742934
          _cons |   7.930234   .1208437    65.62   0.000     7.693384    8.167083
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  10.4597  (p = 0.0012)
  Wu-Hausman F(1,3617)            =  10.4035  (p = 0.0013)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  4.87475  (p = 0.0874)
  Basmann chi2(2)        =  4.83978  (p = 0.0889)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  67.885  Chi-sq(30) P-value = 0.0001

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      3,647    8.247666    .6410867   5.298317   9.721166
         exp |      3,647    19.08774    7.666347          2         36
      expsqr |      3,647    423.0987    306.1865          4       1296
birthmont~m2 |      3,647    .0825336    .2752137          0          1
birthmonth~3 |      3,647    .0808884     .272701          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      3,647    .0699205    .2550479          0          1
birthmonth~5 |      3,647    .0786948    .2692988          0          1
birthmonth~6 |      3,647     .081711    .2739615          0          1
birthmonth~7 |      3,647    .0690979    .2536553          0          1
birthmonth~8 |      3,647    .0880175    .2833593          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      3,647    .0951467    .2934577          0          1
birthmont~10 |      3,647    .1020016     .302692          0          1
birthmont~11 |      3,647    .0904853    .2869152          0          1
birthmont~12 |      3,647    .0745818    .2627515          0          1
        male |      3,647           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu  = t
>  d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667) & male == 0
>  & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,207
                                                        F(16, 2190)   = 253.06
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6490
                                                        Adj R-squared = 0.6464
                                                        Root MSE      = 0.2067

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1547882   .0041988   -36.87   0.000    -.1630221   -.1465542
         expsqr |   .0017053   .0001335    12.77   0.000     .0014435    .0019671
 birthmonthdum2 |   .0268394   .0229267     1.17   0.242     -.018121    .0717997
 birthmonthdum3 |    .007682   .0239448     0.32   0.748    -.0392748    .0546389
 birthmonthdum4 |  -.0027237   .0239562    -0.11   0.909     -.049703    .0442555
 birthmonthdum5 |   -.001613   .0230752    -0.07   0.944    -.0468644    .0436385
 birthmonthdum6 |   .0375325   .0231084     1.62   0.104    -.0077842    .0828492
 birthmonthdum7 |   .0455697   .0232237     1.96   0.050      .000027    .0911125
 birthmonthdum8 |   .0393573   .0228554     1.72   0.085    -.0054633    .0841778
 birthmonthdum9 |   .0508322    .022215     2.29   0.022     .0072676    .0943969
birthmonthdum10 |   .0438739   .0217065     2.02   0.043     .0013063    .0864414
birthmonthdum11 |   .0856536   .0233312     3.67   0.000     .0398999    .1314073
birthmonthdum12 |   .0612931   .0229881     2.67   0.008     .0162124    .1063739
              t |  -.0053522   .0004675   -11.45   0.000    -.0062691   -.0044354
              d |   .0641218   .0213151     3.01   0.003     .0223218    .1059217
             td |  -.0029382   .0004303    -6.83   0.000    -.0037821   -.0020943
          _cons |   2.704254   .0517345    52.27   0.000       2.6028    2.805708
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,207
                                                  Wald chi2(14)   =      84.19
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0247
                                                  Root MSE        =     .62863

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .5096305   .0809907     6.29   0.000     .3508916    .6683695
            exp |   .0167676   .0127857     1.31   0.190    -.0082918     .041827
         expsqr |  -.0003263   .0002975    -1.10   0.273    -.0009093    .0002568
 birthmonthdum2 |  -.0018994    .069637    -0.03   0.978    -.1383853    .1345866
 birthmonthdum3 |   .0705216   .0726863     0.97   0.332     -.071941    .2129841
 birthmonthdum4 |   .1014296   .0728044     1.39   0.164    -.0412644    .2441237
 birthmonthdum5 |    .024468   .0700724     0.35   0.727    -.1128714    .1618075
 birthmonthdum6 |   .0915103   .0701108     1.31   0.192    -.0459043    .2289249
 birthmonthdum7 |   .0639379   .0705072     0.91   0.364    -.0742537    .2021295
 birthmonthdum8 |   .0184154   .0692085     0.27   0.790    -.1172308    .1540617
 birthmonthdum9 |   -.026309   .0674072    -0.39   0.696    -.1584247    .1058067
birthmonthdum10 |   .0379487    .065712     0.58   0.564    -.0908444    .1667417
birthmonthdum11 |  -.0375042   .0707722    -0.53   0.596    -.1762151    .1012067
birthmonthdum12 |  -.0543712   .0693952    -0.78   0.433    -.1903833     .081641
          _cons |   7.601941   .1397352    54.40   0.000     7.328065    7.875817
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  12.9494  (p = 0.0003)
  Wu-Hausman F(1,2191)            =  12.9314  (p = 0.0003)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .790838  (p = 0.6734)
  Basmann chi2(2)        =  .785028  (p = 0.6754)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  20.986  Chi-sq(16) P-value = 0.1791

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,207    7.876517    .6366901   5.298317   9.721166
         exp |      2,207    18.87041    7.720789          1         34
      expsqr |      2,207     415.676    301.9249          1       1156
birthmont~m2 |      2,207    .0847304    .2785432          0          1
birthmonth~3 |      2,207    .0706842    .2563547          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,207     .069778    .2548302          0          1
birthmonth~5 |      2,207    .0824649     .275134          0          1
birthmonth~6 |      2,207    .0820118    .2744449          0          1
birthmonth~7 |      2,207    .0801994    .2716631          0          1
birthmonth~8 |      2,207    .0869959     .281893          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,207    .0992297     .299038          0          1
birthmont~10 |      2,207    .1132759    .3170016          0          1
birthmont~11 |      2,207    .0788401      .26955          0          1
birthmont~12 |      2,207    .0860897      .28056          0          1
        male |      2,207           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearnin
> g, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  2,207
                                                        F(30, 2176)   = 140.08
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6588
                                                        Adj R-squared = 0.6541
                                                        Root MSE      = 0.2044

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1526052   .0041907   -36.42   0.000    -.1608234    -.144387
         expsqr |   .0015664    .000135    11.61   0.000     .0013017     .001831
 birthmonthdum2 |   .0233414   .0227398     1.03   0.305    -.0212526    .0679354
 birthmonthdum3 |   .0070504   .0237515     0.30   0.767    -.0395276    .0536284
 birthmonthdum4 |  -.0012561   .0237787    -0.05   0.958    -.0478875    .0453752
 birthmonthdum5 |   .0000602   .0228929     0.00   0.998     -.044834    .0449544
 birthmonthdum6 |   .0401154   .0229064     1.75   0.080    -.0048053     .085036
 birthmonthdum7 |   .0495396   .0230236     2.15   0.032      .004389    .0946901
 birthmonthdum8 |   .0458348   .0226834     2.02   0.043     .0013515    .0903182
 birthmonthdum9 |   .0572883   .0220685     2.60   0.009     .0140108    .1005657
birthmonthdum10 |   .0507907   .0215379     2.36   0.018     .0085537    .0930278
birthmonthdum11 |   .0850078   .0231522     3.67   0.000     .0396051    .1304104
birthmonthdum12 |    .061362   .0227799     2.69   0.007     .0166894    .1060346
   provincedum2 |  -.0094157   .0365884    -0.26   0.797    -.0811675    .0623362
   provincedum3 |   .0056736   .0466999     0.12   0.903    -.0859076    .0972547
   provincedum4 |  -.0253097   .0381627    -0.66   0.507    -.1001489    .0495295
   provincedum5 |   .0189466   .0271426     0.70   0.485    -.0342815    .0721747
   provincedum6 |   .0424223   .0285764     1.48   0.138    -.0136177    .0984622
   provincedum7 |   .0561511   .0286924     1.96   0.050    -.0001163    .1124185
   provincedum8 |   .0501995   .0268097     1.87   0.061    -.0023758    .1027748
   provincedum9 |     -.0424   .0277918    -1.53   0.127    -.0969013    .0121012
  provincedum10 |  -.0456393   .0280003    -1.63   0.103    -.1005494    .0092708
  provincedum11 |  -.0193045    .027332    -0.71   0.480     -.072904    .0342951
  provincedum12 |  -.0151462   .0334729    -0.45   0.651    -.0807884    .0504959
  provincedum13 |    .001242   .0289144     0.04   0.966    -.0554606    .0579447
  provincedum14 |  -.0004338   .0291696    -0.01   0.988     -.057637    .0567694
  provincedum15 |   .0535398   .0321503     1.67   0.096    -.0095087    .1165883
              t |  -.0058451   .0004748   -12.31   0.000    -.0067762    -.004914
              d |   .0622627   .0211341     2.95   0.003     .0208176    .1037078
             td |  -.0026659   .0004306    -6.19   0.000    -.0035103   -.0018214
          _cons |   2.717107   .0545808    49.78   0.000     2.610071    2.824143
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      2,207
                                                  Wald chi2(28)   =     171.77
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0664
                                                  Root MSE        =     .61506

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .4804927   .0797167     6.03   0.000     .3242508    .6367345
            exp |   .0122014   .0125471     0.97   0.331    -.0123905    .0367932
         expsqr |  -.0002035   .0002919    -0.70   0.486    -.0007756    .0003686
 birthmonthdum2 |   .0065076   .0683128     0.10   0.924    -.1273831    .1403982
 birthmonthdum3 |   .0679821   .0713349     0.95   0.341    -.0718318     .207796
 birthmonthdum4 |   .0890478   .0714842     1.25   0.213    -.0510587    .2291542
 birthmonthdum5 |   .0202132   .0687705     0.29   0.769    -.1145746     .155001
 birthmonthdum6 |   .0867839   .0687274     1.26   0.207    -.0479194    .2214872
 birthmonthdum7 |   .0788184    .069136     1.14   0.254    -.0566858    .2143226
 birthmonthdum8 |   .0091304   .0679019     0.13   0.893    -.1239549    .1422158
 birthmonthdum9 |  -.0305391   .0662114    -0.46   0.645    -.1603109    .0992328
birthmonthdum10 |   .0350507   .0644394     0.54   0.586    -.0912483    .1613497
birthmonthdum11 |  -.0288669   .0694091    -0.42   0.677    -.1649062    .1071724
birthmonthdum12 |  -.0463732   .0680406    -0.68   0.496    -.1797304     .086984
   provincedum2 |  -.3326842   .1095536    -3.04   0.002    -.5474052   -.1179632
   provincedum3 |  -.1691171   .1401228    -1.21   0.227    -.4437528    .1055187
   provincedum4 |    -.37753   .1149701    -3.28   0.001    -.6028674   -.1521927
   provincedum5 |  -.0663643   .0812123    -0.82   0.414    -.2255376    .0928089
   provincedum6 |  -.0623006   .0849851    -0.73   0.464    -.2288683    .1042672
   provincedum7 |  -.2038277   .0851888    -2.39   0.017    -.3707947   -.0368608
   provincedum8 |  -.2693328    .079319    -3.40   0.001    -.4247951   -.1138704
   provincedum9 |    .140106   .0838589     1.67   0.095    -.0242544    .3044664
  provincedum10 |  -.1176905   .0846018    -1.39   0.164     -.283507     .048126
  provincedum11 |  -.1325626   .0821565    -1.61   0.107    -.2935865    .0284612
  provincedum12 |    -.17923   .1005723    -1.78   0.075     -.376348     .017888
  provincedum13 |  -.1497505   .0866834    -1.73   0.084    -.3196468    .0201458
  provincedum14 |  -.2783679     .08731    -3.19   0.001    -.4494923   -.1072435
  provincedum15 |  -.2788453     .09577    -2.91   0.004     -.466551   -.0911396
          _cons |   7.783475   .1612229    48.28   0.000     7.467484    8.099466
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  8.89029  (p = 0.0029)
  Wu-Hausman F(1,2177)            =  8.80491  (p = 0.0030)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .116269  (p = 0.9435)
  Basmann chi2(2)        =  .114641  (p = 0.9443)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  53.053  Chi-sq(30) P-value = 0.0059

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      2,207    7.876517    .6366901   5.298317   9.721166
         exp |      2,207    18.87041    7.720789          1         34
      expsqr |      2,207     415.676    301.9249          1       1156
birthmont~m2 |      2,207    .0847304    .2785432          0          1
birthmonth~3 |      2,207    .0706842    .2563547          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      2,207     .069778    .2548302          0          1
birthmonth~5 |      2,207    .0824649     .275134          0          1
birthmonth~6 |      2,207    .0820118    .2744449          0          1
birthmonth~7 |      2,207    .0801994    .2716631          0          1
birthmonth~8 |      2,207    .0869959     .281893          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      2,207    .0992297     .299038          0          1
birthmont~10 |      2,207    .1132759    .3170016          0          1
birthmont~11 |      2,207    .0788401      .26955          0          1
birthmont~12 |      2,207    .0860897      .28056          0          1
        male |      2,207           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 1971-1992.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Exp/Rural/IV Rural ATF&Birth Exp 1979 1971-1992.log
  log type:  text
 closed on:   8 Aug 2024, 12:36:46
---------------------------------------------------------------------------------------------
