---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Exp/Rural/IV Rural ATF&Birth Exp 1979 3years.log
  log type:  text
 opened on:   8 Aug 2024, 12:36:07

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,408 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. **
. tab birthmonth, gen(birthmonthdum)

 birthmonth |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,879        8.22        8.22
          2 |      2,965        8.47       16.70
          3 |      2,870        8.20       24.89
          4 |      2,595        7.41       32.31
          5 |      2,663        7.61       39.92
          6 |      2,708        7.74       47.65
          7 |      2,646        7.56       55.21
          8 |      3,104        8.87       64.08
          9 |      3,121        8.92       72.99
         10 |      3,565       10.18       83.18
         11 |      3,001        8.57       91.75
         12 |      2,887        8.25      100.00
------------+-----------------------------------
      Total |     35,004      100.00

. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. local months = 36

. 
. 
. *1)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  secgenhighedu secgenedu = t d td) if inrange(t, -`months', `months'-1) & inrange(monthlyea
> rning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(17, 1173)   =  84.14
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5494
                                                        Adj R-squared = 0.5429
                                                        Root MSE      = 0.1673

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4277388   .0234702   -18.22   0.000    -.4737871   -.3816906
         expsqr |   .0078934   .0005399    14.62   0.000     .0068342    .0089527
 birthmonthdum2 |  -.0208116   .0250118    -0.83   0.406    -.0698844    .0282612
 birthmonthdum3 |  -.0254591   .0275313    -0.92   0.355    -.0794751    .0285569
 birthmonthdum4 |  -.0203269   .0270845    -0.75   0.453    -.0734664    .0328125
 birthmonthdum5 |  -.0115507   .0256984    -0.45   0.653    -.0619706    .0388693
 birthmonthdum6 |  -.0322749   .0253198    -1.27   0.203     -.081952    .0174022
 birthmonthdum7 |  -.0218254   .0264141    -0.83   0.409    -.0736496    .0299989
 birthmonthdum8 |  -.0054395   .0254591    -0.21   0.831    -.0553898    .0445109
 birthmonthdum9 |   .0169999   .0245042     0.69   0.488     -.031077    .0650769
birthmonthdum10 |    .010197   .0247217     0.41   0.680    -.0383067    .0587007
birthmonthdum11 |   .0090446   .0255881     0.35   0.724    -.0411589    .0592481
birthmonthdum12 |   .0078417   .0257589     0.30   0.761    -.0426969    .0583803
           male |   .0118958   .0100722     1.18   0.238    -.0078657    .0316572
              t |  -.0036774   .0007483    -4.91   0.000    -.0051455   -.0022092
              d |   .0111393    .020119     0.55   0.580    -.0283339    .0506125
             td |   -.002702   .0009823    -2.75   0.006    -.0046294   -.0007747
          _cons |   5.707456   .2565592    22.25   0.000      5.20409    6.210823
---------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(17, 1173)   =  48.47
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4126
                                                        Adj R-squared = 0.4041
                                                        Root MSE      = 0.1649

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3434625   .0231226   -14.85   0.000    -.3888288   -.2980962
         expsqr |   .0064966   .0005319    12.21   0.000     .0054531    .0075402
 birthmonthdum2 |  -.0083945   .0246414    -0.34   0.733    -.0567406    .0399515
 birthmonthdum3 |  -.0147675   .0271235    -0.54   0.586    -.0679835    .0384486
 birthmonthdum4 |  -.0148977   .0266834    -0.56   0.577    -.0672502    .0374548
 birthmonthdum5 |  -.0075596   .0253178    -0.30   0.765    -.0572328    .0421137
 birthmonthdum6 |  -.0345752   .0249448    -1.39   0.166    -.0835167    .0143662
 birthmonthdum7 |   -.026807    .026023    -1.03   0.303    -.0778638    .0242498
 birthmonthdum8 |  -.0127784    .025082    -0.51   0.611    -.0619891    .0364322
 birthmonthdum9 |   .0009231   .0241413     0.04   0.970    -.0464419    .0482881
birthmonthdum10 |   -.032247   .0243556    -1.32   0.186    -.0800324    .0155384
birthmonthdum11 |  -.0081202   .0252091    -0.32   0.747    -.0575802    .0413399
birthmonthdum12 |   .0036417   .0253774     0.14   0.886    -.0461484    .0534319
           male |   .0148197    .009923     1.49   0.136    -.0046491    .0342885
              t |  -.0025856   .0007372    -3.51   0.000     -.004032   -.0011393
              d |   .0137311    .019821     0.69   0.489    -.0251575    .0526198
             td |   -.001835   .0009678    -1.90   0.058    -.0037338    .0000638
          _cons |   4.490313   .2527598    17.77   0.000     3.994401    4.986225
---------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(17, 1173)   =  45.32
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.3964
                                                        Adj R-squared = 0.3877
                                                        Root MSE      = 0.2612

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1116949   .0366382    -3.05   0.002    -.1835786   -.0398112
         expsqr |   .0001067   .0008428     0.13   0.899    -.0015469    .0017603
 birthmonthdum2 |  -.0037197   .0390447    -0.10   0.924    -.0803249    .0728856
 birthmonthdum3 |   .0166713   .0429778     0.39   0.698    -.0676505    .1009932
 birthmonthdum4 |   .0341463   .0422803     0.81   0.419    -.0488072    .1170998
 birthmonthdum5 |     .05124   .0401166     1.28   0.202    -.0274682    .1299483
 birthmonthdum6 |   .0261645   .0395255     0.66   0.508    -.0513842    .1037131
 birthmonthdum7 |   .0632525   .0412339     1.53   0.125    -.0176479     .144153
 birthmonthdum8 |   .0236643    .039743     0.60   0.552    -.0543109    .1016395
 birthmonthdum9 |   .0866787   .0382524     2.27   0.024      .011628    .1617294
birthmonthdum10 |   .0185266   .0385919     0.48   0.631    -.0571902    .0942435
birthmonthdum11 |   .1109583   .0399444     2.78   0.006      .032588    .1893287
birthmonthdum12 |   .1017997    .040211     2.53   0.011     .0229063    .1806932
           male |  -.0017545   .0157232    -0.11   0.911    -.0326032    .0290942
              t |  -.0095259   .0011681    -8.15   0.000    -.0118177   -.0072341
              d |  -.0396498   .0314068    -1.26   0.207    -.1012696    .0219699
             td |   .0021671   .0015335     1.41   0.158    -.0008416    .0051758
          _cons |   2.625136   .4005027     6.55   0.000     1.839354    3.410918
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(17)   =      80.88
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .95611

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -4.365891   14.12382    -0.31   0.757    -32.04806    23.31628
  secgenhighedu |   6.111921   20.06721     0.30   0.761    -33.21908    45.44292
      secgenedu |   .1699556   .8164509     0.21   0.835    -1.430259     1.77017
            exp |   .0221912   1.052326     0.02   0.983     -2.04033    2.084712
         expsqr |  -.0003633   .0223458    -0.02   0.987    -.0441603    .0434337
 birthmonthdum2 |   .1061714    .186081     0.57   0.568    -.2585406    .4708834
 birthmonthdum3 |   .0641203   .1756654     0.37   0.715    -.2801776    .4084182
 birthmonthdum4 |   .0863368   .1662568     0.52   0.604    -.2395205    .4121941
 birthmonthdum5 |  -.0049979   .1596915    -0.03   0.975    -.3179876    .3079917
 birthmonthdum6 |   .2901649   .2960998     0.98   0.327    -.2901799    .8705098
 birthmonthdum7 |   .0683556   .2841935     0.24   0.810    -.4886534    .6253646
 birthmonthdum8 |   .1461671   .2400961     0.61   0.543    -.3244127    .6167468
 birthmonthdum9 |  -.0027787   .2541051    -0.01   0.991    -.5008155    .4952581
birthmonthdum10 |   .3143549   .7972094     0.39   0.693    -1.248147    1.876857
birthmonthdum11 |   .0957397   .2999178     0.32   0.750    -.4920884    .6835678
birthmonthdum12 |   .0016759   .1596276     0.01   0.992    -.3111884    .3145402
           male |   .4401314   .1413269     3.11   0.002     .1631358    .7171271
          _cons |   7.400312   12.39631     0.60   0.551      -16.896    31.69663
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  .724046  (p = 0.8675)
  Wu-Hausman F(3,1170)            =  .237237  (p = 0.8704)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.669  Chi-sq(17) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
birthmont~m2 |      1,191    .0940386    .2920051          0          1
birthmonth~3 |      1,191    .0621327    .2414977          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,191    .0654912    .2474945          0          1
birthmonth~5 |      1,191    .0831234    .2761847          0          1
birthmonth~6 |      1,191    .0906801    .2872743          0          1
birthmonth~7 |      1,191    .0747271     .263061          0          1
birthmonth~8 |      1,191    .0890008    .2848646          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,191    .1074727    .3098434          0          1
birthmont~10 |      1,191    .1007557    .3011314          0          1
birthmont~11 |      1,191    .0848027    .2787049          0          1
birthmont~12 |      1,191    .0839631    .2774489          0          1
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `mo
> nths'-1) & inrange(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(31, 1159)   =  48.90
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5667
                                                        Adj R-squared = 0.5551
                                                        Root MSE      = 0.1651

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4209328   .0236547   -17.79   0.000    -.4673436   -.3745219
         expsqr |   .0076295   .0005446    14.01   0.000     .0065611    .0086979
 birthmonthdum2 |   -.016871   .0249562    -0.68   0.499    -.0658354    .0320935
 birthmonthdum3 |  -.0180612   .0273722    -0.66   0.509    -.0717658    .0356434
 birthmonthdum4 |  -.0190519   .0268784    -0.71   0.479    -.0717876    .0336838
 birthmonthdum5 |  -.0068923     .02552    -0.27   0.787     -.056963    .0431783
 birthmonthdum6 |  -.0246139   .0253329    -0.97   0.331    -.0743174    .0250895
 birthmonthdum7 |   -.013103   .0262162    -0.50   0.617    -.0645395    .0383335
 birthmonthdum8 |   .0073237   .0253693     0.29   0.773    -.0424511    .0570985
 birthmonthdum9 |   .0238145    .024412     0.98   0.330    -.0240822    .0717112
birthmonthdum10 |   .0196241   .0247186     0.79   0.427    -.0288741    .0681222
birthmonthdum11 |   .0170386   .0254763     0.67   0.504    -.0329462    .0670234
birthmonthdum12 |   .0152091   .0256939     0.59   0.554    -.0352027    .0656209
           male |    .011528   .0099637     1.16   0.248    -.0080209     .031077
   provincedum2 |   .0872432    .041896     2.08   0.038     .0050427    .1694437
   provincedum3 |   .1213672   .0498946     2.43   0.015     .0234733    .2192612
   provincedum4 |   .0830774   .0423261     1.96   0.050     .0000331    .1661217
   provincedum5 |   .0983329   .0335683     2.93   0.003     .0324715    .1641943
   provincedum6 |   .1537497   .0355709     4.32   0.000     .0839591    .2235402
   provincedum7 |   .1012143   .0341781     2.96   0.003     .0341563    .1682722
   provincedum8 |   .1379622   .0334347     4.13   0.000      .072363    .2035614
   provincedum9 |    .054468   .0342258     1.59   0.112    -.0126835    .1216196
  provincedum10 |   .0729505   .0345504     2.11   0.035     .0051622    .1407389
  provincedum11 |   .0646291   .0346375     1.87   0.062    -.0033301    .1325884
  provincedum12 |   .0830725   .0402161     2.07   0.039      .004168    .1619771
  provincedum13 |   .0657628    .036184     1.82   0.069    -.0052308    .1367563
  provincedum14 |   .0855766   .0355061     2.41   0.016     .0159133    .1552399
  provincedum15 |   .1237622   .0382276     3.24   0.001     .0487591    .1987653
              t |  -.0041925   .0007486    -5.60   0.000    -.0056613   -.0027238
              d |   .0158501   .0200019     0.79   0.428    -.0233939    .0550942
             td |  -.0027152   .0009735    -2.79   0.005    -.0046251   -.0008052
          _cons |   5.591549   .2565068    21.80   0.000     5.088279    6.094818
---------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(31, 1159)   =  27.54
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4242
                                                        Adj R-squared = 0.4088
                                                        Root MSE      = 0.1642

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3364848   .0235298   -14.30   0.000    -.3826506    -.290319
         expsqr |   .0062746   .0005417    11.58   0.000     .0052118    .0073374
 birthmonthdum2 |  -.0067154   .0248245    -0.27   0.787    -.0554213    .0419905
 birthmonthdum3 |  -.0121147   .0272277    -0.44   0.656    -.0655358    .0413063
 birthmonthdum4 |  -.0150257   .0267365    -0.56   0.574     -.067483    .0374315
 birthmonthdum5 |  -.0059233   .0253853    -0.23   0.816    -.0557296     .043883
 birthmonthdum6 |  -.0308336   .0251991    -1.22   0.221    -.0802746    .0186074
 birthmonthdum7 |  -.0215258   .0260778    -0.83   0.409    -.0726908    .0296391
 birthmonthdum8 |  -.0041748   .0252353    -0.17   0.869    -.0536868    .0453372
 birthmonthdum9 |   .0040862   .0242831     0.17   0.866    -.0435576      .05173
birthmonthdum10 |   -.028056   .0245881    -1.14   0.254    -.0762981    .0201861
birthmonthdum11 |  -.0056926   .0253418    -0.22   0.822    -.0554135    .0440284
birthmonthdum12 |   .0080779   .0255582     0.32   0.752    -.0420677    .0582235
           male |   .0139889   .0099111     1.41   0.158    -.0054569    .0334346
   provincedum2 |   .0289868   .0416748     0.70   0.487    -.0527797    .1107533
   provincedum3 |   .0741709   .0496312     1.49   0.135    -.0232062     .171548
   provincedum4 |   .0263469   .0421026     0.63   0.532    -.0562589    .1089528
   provincedum5 |   .0313482    .033391     0.94   0.348    -.0341654    .0968619
   provincedum6 |   .0884795   .0353831     2.50   0.013     .0190574    .1579015
   provincedum7 |   .0372125   .0339977     1.09   0.274    -.0294914    .1039164
   provincedum8 |    .059224   .0332581     1.78   0.075    -.0060289    .1244769
   provincedum9 |   .0126398   .0340451     0.37   0.711    -.0541572    .0794368
  provincedum10 |   .0201529    .034368     0.59   0.558    -.0472776    .0875833
  provincedum11 |    .010366   .0344546     0.30   0.764    -.0572344    .0779664
  provincedum12 |   .0117315   .0400038     0.29   0.769    -.0667565    .0902195
  provincedum13 |   .0052909    .035993     0.15   0.883    -.0653278    .0759096
  provincedum14 |   .0297443   .0353186     0.84   0.400    -.0395512    .0990399
  provincedum15 |   .0556942   .0380258     1.46   0.143    -.0189129    .1303012
              t |  -.0030114   .0007447    -4.04   0.000    -.0044724   -.0015503
              d |   .0192298   .0198963     0.97   0.334     -.019807    .0582667
             td |  -.0017313   .0009683    -1.79   0.074    -.0036312    .0001686
          _cons |   4.409615   .2551526    17.28   0.000     3.909002    4.910227
---------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(31, 1159)   =  27.05
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4198
                                                        Adj R-squared = 0.4042
                                                        Root MSE      = 0.2577

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1076067   .0369207    -2.91   0.004    -.1800456   -.0351677
         expsqr |  -.0001135   .0008499    -0.13   0.894    -.0017811    .0015541
 birthmonthdum2 |   .0086583   .0389521     0.22   0.824    -.0677663    .0850829
 birthmonthdum3 |   .0250312    .042723     0.59   0.558    -.0587919    .1088543
 birthmonthdum4 |   .0344411   .0419522     0.82   0.412    -.0478697    .1167519
 birthmonthdum5 |   .0590559   .0398322     1.48   0.138    -.0190953    .1372071
 birthmonthdum6 |   .0430802     .03954     1.09   0.276    -.0344978    .1206582
 birthmonthdum7 |   .0701288   .0409187     1.71   0.087    -.0101543    .1504118
 birthmonthdum8 |   .0421218   .0395968     1.06   0.288    -.0355677    .1198112
 birthmonthdum9 |   .0936188   .0381027     2.46   0.014     .0188607    .1683769
birthmonthdum10 |   .0294557   .0385812     0.76   0.445    -.0462412    .1051525
birthmonthdum11 |   .1223974   .0397639     3.08   0.002     .0443801    .2004146
birthmonthdum12 |   .1124377   .0401035     2.80   0.005     .0337541    .1911213
           male |  -.0025657   .0155516    -0.16   0.869    -.0330781    .0279466
   provincedum2 |   .1849371   .0653921     2.83   0.005      .056637    .3132372
   provincedum3 |   .2271484   .0778765     2.92   0.004     .0743537     .379943
   provincedum4 |   .0743771   .0660633     1.13   0.260      -.05524    .2039942
   provincedum5 |   .1314001    .052394     2.51   0.012     .0286024    .2341977
   provincedum6 |   .1995894   .0555197     3.59   0.000      .090659    .3085198
   provincedum7 |   .1363432   .0533459     2.56   0.011      .031678    .2410085
   provincedum8 |   .1958497   .0521854     3.75   0.000     .0934612    .2982382
   provincedum9 |   .1352329   .0534203     2.53   0.011     .0304215    .2400443
  provincedum10 |   .1402888   .0539269     2.60   0.009     .0344835    .2460942
  provincedum11 |   .0804638   .0540628     1.49   0.137    -.0256082    .1865358
  provincedum12 |   .0461207   .0627701     0.73   0.463    -.0770351    .1692764
  provincedum13 |   .0687597   .0564767     1.22   0.224    -.0420484    .1795677
  provincedum14 |   .0871701   .0554185     1.57   0.116    -.0215617    .1959019
  provincedum15 |   .1951181   .0596664     3.27   0.001     .0780519    .3121843
              t |  -.0101863   .0011684    -8.72   0.000    -.0124788   -.0078938
              d |  -.0305223   .0312194    -0.98   0.328    -.0917752    .0307305
             td |   .0021987   .0015194     1.45   0.148    -.0007824    .0051798
          _cons |    2.50339   .4003606     6.25   0.000     1.717877    3.288903
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(31)   =     131.22
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .84628

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -3.704393   8.053458    -0.46   0.646    -19.48888    12.08009
  secgenhighedu |    4.83375   11.67226     0.41   0.679    -18.04347    27.71097
      secgenedu |   .1880833   .6845649     0.27   0.784    -1.153639    1.529806
            exp |    -.11074   .7338779    -0.15   0.880    -1.549114    1.327634
         expsqr |   .0024859   .0155709     0.16   0.873    -.0280325    .0330042
 birthmonthdum2 |   .0777451   .1408367     0.55   0.581    -.1982898      .35378
 birthmonthdum3 |   .0279864   .1475983     0.19   0.850    -.2613009    .3172738
 birthmonthdum4 |    .032063     .14987     0.21   0.831    -.2616767    .3258028
 birthmonthdum5 |  -.0288453   .1426904    -0.20   0.840    -.3085133    .2508227
 birthmonthdum6 |   .2334592   .2262788     1.03   0.302     -.210039    .6769575
 birthmonthdum7 |   .0180491   .2144528     0.08   0.933    -.4022707     .438369
 birthmonthdum8 |   .0919614   .1768813     0.52   0.603    -.2547196    .4386424
 birthmonthdum9 |  -.0581526   .1952589    -0.30   0.766    -.4408531    .3245478
birthmonthdum10 |   .2251127   .4974309     0.45   0.651    -.7498338    1.200059
birthmonthdum11 |   .0379835   .2358673     0.16   0.872    -.4243079    .5002748
birthmonthdum12 |  -.0520954   .1434996    -0.36   0.717    -.3333494    .2291586
           male |   .4561839   .0877119     5.20   0.000     .2842718    .6280959
   provincedum2 |  -.1916447   .3903767    -0.49   0.623     -.956769    .5734796
   provincedum3 |  -.2977077   .2654357    -1.12   0.262    -.8179521    .2225368
   provincedum4 |  -.2738824   .4026467    -0.68   0.496    -1.063055    .5152905
   provincedum5 |   .0577938   .4246166     0.14   0.892    -.7744394    .8900271
   provincedum6 |   .0039748   .2472411     0.02   0.987    -.4806087    .4885584
   provincedum7 |  -.1258418   .3862807    -0.33   0.745    -.8829381    .6312544
   provincedum8 |  -.1514983   .4142808    -0.37   0.715    -.9634738    .6604773
   provincedum9 |   .0057152   .3119401     0.02   0.985    -.6056763    .6171066
  provincedum10 |   .0141756   .3652108     0.04   0.969    -.7016244    .7299755
  provincedum11 |  -.0875049   .4089412    -0.21   0.831    -.8890151    .7140052
  provincedum12 |   -.190682    .546971    -0.35   0.727    -1.262725    .8813614
  provincedum13 |   -.066753   .4756531    -0.14   0.888     -.999016      .86551
  provincedum14 |  -.2723978   .3627839    -0.75   0.453    -.9834411    .4386456
  provincedum15 |   -.391019   .3577074    -1.09   0.274    -1.092113    .3100746
          _cons |   9.083506   8.913697     1.02   0.308    -8.387019    26.55403
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  .480539  (p = 0.9231)
  Wu-Hausman F(3,1156)            =  .155535  (p = 0.9261)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   6.113  Chi-sq(31) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
birthmont~m2 |      1,191    .0940386    .2920051          0          1
birthmonth~3 |      1,191    .0621327    .2414977          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,191    .0654912    .2474945          0          1
birthmonth~5 |      1,191    .0831234    .2761847          0          1
birthmonth~6 |      1,191    .0906801    .2872743          0          1
birthmonth~7 |      1,191    .0747271     .263061          0          1
birthmonth~8 |      1,191    .0890008    .2848646          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,191    .1074727    .3098434          0          1
birthmont~10 |      1,191    .1007557    .3011314          0          1
birthmont~11 |      1,191    .0848027    .2787049          0          1
birthmont~12 |      1,191    .0839631    .2774489          0          1
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearnin
> g, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(16, 731)    =  50.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5252
                                                        Adj R-squared = 0.5148
                                                        Root MSE      = 0.1819

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3854351   .0315715   -12.21   0.000    -.4474167   -.3234535
         expsqr |   .0068336   .0007241     9.44   0.000      .005412    .0082551
 birthmonthdum2 |  -.0191298   .0336044    -0.57   0.569    -.0851025    .0468429
 birthmonthdum3 |   .0129162   .0373223     0.35   0.729    -.0603554    .0861879
 birthmonthdum4 |   .0320915   .0360679     0.89   0.374    -.0387176    .1029005
 birthmonthdum5 |   .0192121    .034397     0.56   0.577    -.0483166    .0867409
 birthmonthdum6 |    -.00671   .0341493    -0.20   0.844    -.0737523    .0603324
 birthmonthdum7 |  -.0124698   .0355228    -0.35   0.726    -.0822086    .0572691
 birthmonthdum8 |   .0279299    .034408     0.81   0.417    -.0396203    .0954802
 birthmonthdum9 |   .0511066   .0325189     1.57   0.116     -.012735    .1149482
birthmonthdum10 |   .0432934   .0339398     1.28   0.203    -.0233376    .1099245
birthmonthdum11 |   .0327366   .0342443     0.96   0.339    -.0344923    .0999656
birthmonthdum12 |   .0460852   .0348727     1.32   0.187    -.0223775    .1145479
              t |   -.004465    .000996    -4.48   0.000    -.0064203   -.0025098
              d |   .0126712   .0277746     0.46   0.648    -.0418563    .0671988
             td |  -.0027973     .00135    -2.07   0.039    -.0054476    -.000147
          _cons |    5.28962    .347313    15.23   0.000      4.60777     5.97147
---------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(16, 731)    =  30.96
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4039
                                                        Adj R-squared = 0.3909
                                                        Root MSE      = 0.1798

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3008585   .0312001    -9.64   0.000    -.3621109   -.2396061
         expsqr |   .0053793   .0007156     7.52   0.000     .0039745    .0067841
 birthmonthdum2 |  -.0203136   .0332091    -0.61   0.541    -.0855102     .044883
 birthmonthdum3 |   .0022121   .0368832     0.06   0.952    -.0701976    .0746218
 birthmonthdum4 |   .0094372   .0356436     0.26   0.791    -.0605388    .0794133
 birthmonthdum5 |   .0101992   .0339924     0.30   0.764    -.0565351    .0769336
 birthmonthdum6 |  -.0432278   .0337475    -1.28   0.201    -.1094814    .0230259
 birthmonthdum7 |  -.0599727   .0351049    -1.71   0.088    -.1288911    .0089458
 birthmonthdum8 |  -.0073594   .0340032    -0.22   0.829     -.074115    .0593962
 birthmonthdum9 |   .0117527   .0321363     0.37   0.715    -.0513378    .0748432
birthmonthdum10 |  -.0244894   .0335405    -0.73   0.466    -.0903366    .0413578
birthmonthdum11 |   .0037198   .0338415     0.11   0.913    -.0627183    .0701578
birthmonthdum12 |   .0223226   .0344625     0.65   0.517    -.0453346    .0899799
              t |  -.0034517   .0009842    -3.51   0.000    -.0053839   -.0015194
              d |   .0108232   .0274479     0.39   0.693    -.0430628    .0647093
             td |  -.0020031   .0013341    -1.50   0.134    -.0046222     .000616
          _cons |   4.124534   .3432271    12.02   0.000     3.450706    4.798362
---------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(16, 731)    =  33.67
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4243
                                                        Adj R-squared = 0.4117
                                                        Root MSE      = 0.2612

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.0827496   .0453269    -1.83   0.068     -.171736    .0062368
         expsqr |  -.0006226   .0010396    -0.60   0.549    -.0026635    .0014182
 birthmonthdum2 |   -.017634   .0482456    -0.37   0.715    -.1123504    .0770824
 birthmonthdum3 |    .008706   .0535833     0.16   0.871    -.0964895    .1139014
 birthmonthdum4 |   .0168218   .0517824     0.32   0.745    -.0848382    .1184817
 birthmonthdum5 |   .0505452   .0493835     1.02   0.306    -.0464052    .1474957
 birthmonthdum6 |  -.0015711   .0490278    -0.03   0.974    -.0978232     .094681
 birthmonthdum7 |   .0225047   .0509997     0.44   0.659    -.0776187    .1226281
 birthmonthdum8 |   .0081794   .0493992     0.17   0.869    -.0888019    .1051607
 birthmonthdum9 |   .0850044   .0466871     1.82   0.069    -.0066524    .1766612
birthmonthdum10 |  -.0033326    .048727    -0.07   0.945    -.0989942     .092329
birthmonthdum11 |   .1243784   .0491642     2.53   0.012     .0278585    .2208984
birthmonthdum12 |   .1068069   .0500665     2.13   0.033     .0085156    .2050981
              t |  -.0096659   .0014299    -6.76   0.000     -.012473   -.0068587
              d |  -.0333252   .0398758    -0.84   0.404    -.1116099    .0449594
             td |   .0011446   .0019382     0.59   0.555    -.0026604    .0049496
          _cons |   2.366438   .4986341     4.75   0.000     1.387512    3.345363
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(16)   =       1.14
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =     2.8182

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   17.52591   148.1416     0.12   0.906    -272.8263    307.8781
  secgenhighedu |  -24.79301   201.8139    -0.12   0.902     -420.341     370.755
      secgenedu |   .5957388   4.144556     0.14   0.886    -7.527441    8.718919
            exp |  -.8601563   3.990959    -0.22   0.829    -8.682291    6.961979
         expsqr |   .0184151   .0866787     0.21   0.832    -.1514721    .1883023
 birthmonthdum2 |   -.024795   1.354464    -0.02   0.985    -2.679495    2.629905
 birthmonthdum3 |  -.0936892   1.611042    -0.06   0.954    -3.251273    3.063895
 birthmonthdum4 |  -.2470497   2.949657    -0.08   0.933    -6.028271    5.534171
 birthmonthdum5 |  -.1426403   1.076427    -0.13   0.895    -2.252397    1.967117
 birthmonthdum6 |  -.7433281   7.816999    -0.10   0.924    -16.06436    14.57771
 birthmonthdum7 |  -1.325947   10.37949    -0.13   0.898    -21.66937    19.01748
 birthmonthdum8 |   -.595428   5.715759    -0.10   0.917    -11.79811    10.60725
 birthmonthdum9 |  -.7866435   5.478651    -0.14   0.886     -11.5246    9.951316
birthmonthdum10 |  -1.299297   11.33916    -0.11   0.909    -23.52364    20.92505
birthmonthdum11 |  -.5634406   4.425437    -0.13   0.899    -9.237137    8.110256
birthmonthdum12 |  -.2240188   2.658915    -0.08   0.933    -5.435396    4.987358
          _cons |   18.76818   49.62412     0.38   0.705     -78.4933    116.0297
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  .601515  (p = 0.8961)
  Wu-Hausman F(3,728)             =  .195301  (p = 0.8996)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.020  Chi-sq(16) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0601604    .2379429          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748    .0909091    .2876721          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748    .0828877    .2758969          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'
> -1) & inrange(monthlyearning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =  28.57
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5445
                                                        Adj R-squared = 0.5254
                                                        Root MSE      = 0.1799

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3764884   .0318215   -11.83   0.000    -.4389629    -.314014
         expsqr |   .0065198   .0007305     8.92   0.000     .0050856     .007954
 birthmonthdum2 |  -.0281822   .0338055    -0.83   0.405    -.0945518    .0381874
 birthmonthdum3 |   .0053497   .0371881     0.14   0.886     -.067661    .0783604
 birthmonthdum4 |   .0226496    .035918     0.63   0.529    -.0478675    .0931666
 birthmonthdum5 |   .0152297   .0343641     0.44   0.658    -.0522367    .0826961
 birthmonthdum6 |  -.0095915   .0343182    -0.28   0.780    -.0769677    .0577847
 birthmonthdum7 |  -.0088972   .0353841    -0.25   0.802     -.078366    .0605716
 birthmonthdum8 |   .0231676   .0343055     0.68   0.500    -.0441837    .0905188
 birthmonthdum9 |   .0463144   .0324264     1.43   0.154    -.0173476    .1099763
birthmonthdum10 |   .0413811   .0338554     1.22   0.222    -.0250865    .1078487
birthmonthdum11 |   .0294558   .0343241     0.86   0.391    -.0379319    .0968435
birthmonthdum12 |   .0425571   .0347909     1.22   0.222    -.0257472    .1108614
   provincedum2 |   .0781477   .0582457     1.34   0.180    -.0362048    .1925003
   provincedum3 |   .1226871   .0664103     1.85   0.065    -.0076948     .253069
   provincedum4 |   .0686481   .0562711     1.22   0.223    -.0418276    .1791239
   provincedum5 |   .0914814   .0449143     2.04   0.042     .0033022    .1796606
   provincedum6 |   .1492551   .0472998     3.16   0.002     .0563924    .2421177
   provincedum7 |   .0817448   .0450174     1.82   0.070    -.0066368    .1701264
   provincedum8 |   .1266204   .0444623     2.85   0.005     .0393285    .2139123
   provincedum9 |   .0377928   .0453655     0.83   0.405    -.0512724     .126858
  provincedum10 |   .0441531   .0463496     0.95   0.341    -.0468442    .1351503
  provincedum11 |   .0651077   .0460722     1.41   0.158    -.0253449    .1555602
  provincedum12 |   .0962054    .054273     1.77   0.077    -.0103475    .2027583
  provincedum13 |   .0315249   .0484405     0.65   0.515    -.0635773    .1266271
  provincedum14 |   .0657647   .0477124     1.38   0.169    -.0279081    .1594374
  provincedum15 |   .1134843   .0501434     2.26   0.024      .015039    .2119297
              t |  -.0052157   .0010002    -5.21   0.000    -.0071793   -.0032521
              d |   .0191701   .0277818     0.69   0.490    -.0353733    .0737135
             td |  -.0024622     .00135    -1.82   0.069    -.0051127    .0001883
          _cons |   5.170363   .3468433    14.91   0.000     4.489413    5.851313
---------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =  17.51
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4228
                                                        Adj R-squared = 0.3987
                                                        Root MSE      = 0.1786

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2929807    .031593    -9.27   0.000    -.3550065   -.2309549
         expsqr |   .0051156   .0007253     7.05   0.000     .0036917    .0065395
 birthmonthdum2 |  -.0287372   .0335628    -0.86   0.392    -.0946302    .0371558
 birthmonthdum3 |  -.0067579   .0369211    -0.18   0.855    -.0792443    .0657285
 birthmonthdum4 |  -.0006626   .0356601    -0.02   0.985    -.0706733    .0693481
 birthmonthdum5 |   .0051685   .0341174     0.15   0.880    -.0618135    .0721504
 birthmonthdum6 |  -.0463139   .0340718    -1.36   0.174    -.1132063    .0205785
 birthmonthdum7 |  -.0598647     .03513    -1.70   0.089    -.1288347    .0091053
 birthmonthdum8 |  -.0107071   .0340592    -0.31   0.753    -.0775747    .0561606
 birthmonthdum9 |   .0061244   .0321935     0.19   0.849    -.0570804    .0693293
birthmonthdum10 |  -.0295319   .0336123    -0.88   0.380    -.0955222    .0364584
birthmonthdum11 |  -.0026822   .0340776    -0.08   0.937     -.069586    .0642216
birthmonthdum12 |   .0189198   .0345411     0.55   0.584    -.0488941    .0867336
   provincedum2 |   .0385092   .0578275     0.67   0.506    -.0750223    .1520407
   provincedum3 |   .1034369   .0659335     1.57   0.117    -.0260088    .2328826
   provincedum4 |   .0341243    .055867     0.61   0.542    -.0755582    .1438069
   provincedum5 |     .04463   .0445918     1.00   0.317    -.0429161    .1321761
   provincedum6 |   .1216761   .0469602     2.59   0.010     .0294802     .213872
   provincedum7 |   .0441543   .0446941     0.99   0.324    -.0435927    .1319013
   provincedum8 |   .0744295   .0441431     1.69   0.092    -.0122356    .1610946
   provincedum9 |   .0214422   .0450398     0.48   0.634    -.0669834    .1098679
  provincedum10 |   .0186166   .0460168     0.40   0.686    -.0717272    .1089605
  provincedum11 |   .0229524   .0457414     0.50   0.616    -.0668507    .1127554
  provincedum12 |   .0323129   .0538833     0.60   0.549     -.073475    .1381007
  provincedum13 |  -.0052065   .0480927    -0.11   0.914    -.0996258    .0892128
  provincedum14 |   .0404638   .0473698     0.85   0.393    -.0525364    .1334639
  provincedum15 |   .0831745   .0497833     1.67   0.095     -.014564     .180913
              t |   -.004141    .000993    -4.17   0.000    -.0060905   -.0021915
              d |   .0177582   .0275823     0.64   0.520    -.0363935      .07191
             td |   -.001621   .0013403    -1.21   0.227    -.0042524    .0010105
          _cons |   4.038273   .3443529    11.73   0.000     3.362213    4.714334
---------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =  19.75
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4525
                                                        Adj R-squared = 0.4295
                                                        Root MSE      = 0.2572

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |   -.077975   .0454893    -1.71   0.087    -.1672832    .0113332
         expsqr |    -.00087   .0010443    -0.83   0.405    -.0029202    .0011802
 birthmonthdum2 |  -.0220404   .0483255    -0.46   0.648    -.1169167     .072836
 birthmonthdum3 |  -.0040286    .053161    -0.08   0.940    -.1083985    .1003414
 birthmonthdum4 |   .0011758   .0513454     0.02   0.982    -.0996295     .101981
 birthmonthdum5 |   .0422201   .0491241     0.86   0.390    -.0542242    .1386643
 birthmonthdum6 |   .0067532   .0490585     0.14   0.891    -.0895622    .1030686
 birthmonthdum7 |   .0180883   .0505821     0.36   0.721    -.0812185     .117395
 birthmonthdum8 |   .0056511   .0490403     0.12   0.908    -.0906286    .1019309
 birthmonthdum9 |   .0765052    .046354     1.65   0.099    -.0145006     .167511
birthmonthdum10 |  -.0105708   .0483969    -0.22   0.827    -.1055873    .0844457
birthmonthdum11 |   .1228456   .0490668     2.50   0.013     .0265139    .2191774
birthmonthdum12 |   .1019234   .0497342     2.05   0.041     .0042813    .1995655
   provincedum2 |   .1936791   .0832632     2.33   0.020     .0302103     .357148
   provincedum3 |   .2100578   .0949346     2.21   0.027     .0236747    .3964408
   provincedum4 |   .0833502   .0804404     1.04   0.300    -.0745767    .2412771
   provincedum5 |   .1459149   .0642057     2.27   0.023     .0198612    .2719685
   provincedum6 |   .2213455   .0676158     3.27   0.001     .0885968    .3540941
   provincedum7 |   .1199825    .064353     1.86   0.063    -.0063605    .2463254
   provincedum8 |   .2079488   .0635596     3.27   0.001     .0831636     .332734
   provincedum9 |   .1289598   .0648508     1.99   0.047     .0016397    .2562799
  provincedum10 |   .1384385   .0662576     2.09   0.037     .0083565    .2685205
  provincedum11 |     .06562    .065861     1.00   0.319    -.0636833    .1949234
  provincedum12 |   .0668922   .0775841     0.86   0.389    -.0854269    .2192114
  provincedum13 |   .0462855   .0692465     0.67   0.504    -.0896646    .1822356
  provincedum14 |    .099021   .0682057     1.45   0.147    -.0348858    .2329277
  provincedum15 |   .1973261   .0716807     2.75   0.006     .0565969    .3380553
              t |  -.0105923   .0014297    -7.41   0.000    -.0133993   -.0077853
              d |  -.0186964   .0397145    -0.47   0.638    -.0966671    .0592742
             td |   .0014927   .0019299     0.77   0.439    -.0022962    .0052817
          _cons |   2.250408   .4958181     4.54   0.000     1.276979    3.223836
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(30)   =      12.36
                                                  Prob > chi2     =     0.9981
                                                  R-squared       =          .
                                                  Root MSE        =     1.3838

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   6.999349   29.46066     0.24   0.812    -50.74249    64.74119
  secgenhighedu |  -11.64144   41.35203    -0.28   0.778    -92.68992    69.40704
      secgenedu |   .9354371   2.129695     0.44   0.660    -3.238688    5.109563
            exp |  -.8803785    1.38397    -0.64   0.525    -3.592909    1.832152
         expsqr |   .0187935   .0297829     0.63   0.528    -.0395799     .077167
 birthmonthdum2 |   .0119096    .437658     0.03   0.978    -.8458842    .8697035
 birthmonthdum3 |  -.0405844   .5226384    -0.08   0.938    -1.064937    .9837681
 birthmonthdum4 |  -.1130359   .7499058    -0.15   0.880    -1.582824    1.356752
 birthmonthdum5 |  -.1250909   .3958293    -0.32   0.752    -.9009021    .6507204
 birthmonthdum6 |  -.2857874   1.698005    -0.17   0.866    -3.613815     3.04224
 birthmonthdum7 |  -.7224831   2.278698    -0.32   0.751     -5.18865    3.743684
 birthmonthdum8 |  -.2428553   1.183004    -0.21   0.837      -2.5615    2.075789
 birthmonthdum9 |  -.4811728   1.245979    -0.39   0.699    -2.923247    1.960902
birthmonthdum10 |  -.6124133   2.429338    -0.25   0.801    -5.373828    4.149001
birthmonthdum11 |  -.4115739   1.150736    -0.36   0.721    -2.666975    1.843827
birthmonthdum12 |   -.101902   .6547776    -0.16   0.876    -1.385242    1.181439
   provincedum2 |  -.5154337   1.024616    -0.50   0.615    -2.523643    1.492776
   provincedum3 |   .0401848   .6660892     0.06   0.952    -1.265326    1.345696
   provincedum4 |  -.4900516    .817184    -0.60   0.549    -2.091703    1.111599
   provincedum5 |  -.2871723   1.052122    -0.27   0.785    -2.349294     1.77495
   provincedum6 |   .1637183   .5412748     0.30   0.762    -.8971609    1.224597
   provincedum7 |  -.3109032   .7808797    -0.40   0.691    -1.841399    1.219593
   provincedum8 |  -.4593695   .9455526    -0.49   0.627    -2.312619     1.39388
   provincedum9 |  -.1222342   .5143445    -0.24   0.812    -1.130331    .8858625
  provincedum10 |  -.2676023   .7836486    -0.34   0.733    -1.803525    1.268321
  provincedum11 |  -.3944156   1.082943    -0.36   0.716    -2.516945    1.728114
  provincedum12 |    -.74348   1.608962    -0.46   0.644    -3.896988    2.410028
  provincedum13 |  -.5791696   1.236337    -0.47   0.639    -3.002346    1.844006
  provincedum14 |  -.4375573   .5223934    -0.84   0.402    -1.461429    .5863149
  provincedum15 |  -.4863906   .4001408    -1.22   0.224    -1.270652    .2978709
          _cons |   19.08899   17.14873     1.11   0.266    -14.52191    52.69989
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  1.16493  (p = 0.7614)
  Wu-Hausman F(3,714)             =  .371239  (p = 0.7738)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.610  Chi-sq(30) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0601604    .2379429          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748    .0909091    .2876721          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748    .0828877    .2758969          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu secgenedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearnin
> g, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(16, 426)    =  46.76
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6372
                                                        Adj R-squared = 0.6236
                                                        Root MSE      = 0.1363

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4927082   .0335671   -14.68   0.000    -.5586859   -.4267305
         expsqr |   .0095955   .0007759    12.37   0.000     .0080705    .0111206
 birthmonthdum2 |  -.0315701   .0349607    -0.90   0.367    -.1002871    .0371469
 birthmonthdum3 |  -.0885733   .0382969    -2.31   0.021    -.1638477   -.0132989
 birthmonthdum4 |  -.1202148   .0386818    -3.11   0.002    -.1962458   -.0441839
 birthmonthdum5 |  -.0667532   .0363178    -1.84   0.067    -.1381376    .0046313
 birthmonthdum6 |  -.0799919   .0352248    -2.27   0.024    -.1492279   -.0107559
 birthmonthdum7 |  -.0467656   .0367249    -1.27   0.204    -.1189501     .025419
 birthmonthdum8 |  -.0683448   .0355591    -1.92   0.055    -.1382379    .0015484
 birthmonthdum9 |  -.0397896   .0353165    -1.13   0.261    -.1092058    .0296266
birthmonthdum10 |   -.050001   .0335935    -1.49   0.137    -.1160307    .0160286
birthmonthdum11 |  -.0361658   .0360236    -1.00   0.316    -.1069718    .0346402
birthmonthdum12 |  -.0566579   .0356384    -1.59   0.113    -.1267069     .013391
              t |  -.0016794   .0010896    -1.54   0.124     -.003821    .0004622
              d |  -.0015566   .0274651    -0.06   0.955    -.0555407    .0524274
             td |  -.0029379   .0013413    -2.19   0.029    -.0055744   -.0003015
          _cons |   6.341695   .3619551    17.52   0.000     5.630255    7.053136
---------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(16, 426)    =  26.85
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5021
                                                        Adj R-squared = 0.4834
                                                        Root MSE      = 0.1301

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4133551   .0320578   -12.89   0.000    -.4763663   -.3503439
         expsqr |   .0084255    .000741    11.37   0.000     .0069691     .009882
 birthmonthdum2 |   .0118778   .0333888     0.36   0.722    -.0537495    .0775052
 birthmonthdum3 |  -.0314074    .036575    -0.86   0.391    -.1032973    .0404826
 birthmonthdum4 |  -.0570999   .0369426    -1.55   0.123    -.1297123    .0155126
 birthmonthdum5 |  -.0316554   .0346849    -0.91   0.362    -.0998303    .0365195
 birthmonthdum6 |   -.016708    .033641    -0.50   0.620     -.082831    .0494151
 birthmonthdum7 |    .030031   .0350737     0.86   0.392     -.038908      .09897
 birthmonthdum8 |  -.0235705   .0339603    -0.69   0.488    -.0903211      .04318
 birthmonthdum9 |  -.0060759   .0337286    -0.18   0.857    -.0723711    .0602192
birthmonthdum10 |  -.0435287   .0320831    -1.36   0.176    -.1065895    .0195321
birthmonthdum11 |   -.029231   .0344039    -0.85   0.396    -.0968534    .0383915
birthmonthdum12 |  -.0201838    .034036    -0.59   0.553    -.0870832    .0467156
              t |  -.0002851   .0010406    -0.27   0.784    -.0023304    .0017603
              d |   .0100691   .0262303     0.38   0.701    -.0414878    .0616259
             td |  -.0020024    .001281    -1.56   0.119    -.0045203    .0005155
          _cons |   5.063853    .345681    14.65   0.000       4.3844    5.743306
---------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(16, 426)    =  14.82
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.3576
                                                        Adj R-squared = 0.3334
                                                        Root MSE      = 0.2631

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1527897   .0648031    -2.36   0.019    -.2801632   -.0254161
         expsqr |   .0012131   .0014979     0.81   0.418     -.001731    .0041573
 birthmonthdum2 |    .023598   .0674936     0.35   0.727    -.1090639      .15626
 birthmonthdum3 |    .043812   .0739343     0.59   0.554    -.1015094    .1891334
 birthmonthdum4 |   .0737355   .0746773     0.99   0.324    -.0730464    .2205175
 birthmonthdum5 |   .0600986   .0701136     0.86   0.392     -.077713    .1979102
 birthmonthdum6 |   .0791217   .0680034     1.16   0.245    -.0545422    .2127856
 birthmonthdum7 |   .1385306   .0708994     1.95   0.051    -.0008257    .2778869
 birthmonthdum8 |   .0557102   .0686488     0.81   0.418    -.0792222    .1906427
 birthmonthdum9 |    .095883   .0681804     1.41   0.160    -.0381288    .2298948
birthmonthdum10 |   .0567069   .0648541     0.87   0.382     -.070767    .1841807
birthmonthdum11 |   .0893617   .0695455     1.28   0.200    -.0473333    .2260566
birthmonthdum12 |   .1023707   .0688018     1.49   0.138    -.0328627     .237604
              t |  -.0093617   .0021035    -4.45   0.000    -.0134962   -.0052272
              d |  -.0384834    .053023    -0.73   0.468    -.1427026    .0657358
             td |   .0038332   .0025895     1.48   0.140    -.0012566     .008923
          _cons |   2.932925   .6987743     4.20   0.000     1.559451      4.3064
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(16)   =       0.55
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =     3.4739

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -16.63062   54.99361    -0.30   0.762    -124.4161    91.15488
  secgenhighedu |   29.28603   94.12521     0.31   0.756     -155.196     213.768
      secgenedu |   2.881716   9.484207     0.30   0.761    -15.70699    21.47042
            exp |   4.083991   13.76433     0.30   0.767     -22.8936    31.06158
         expsqr |  -.0850601   .2884341    -0.29   0.768    -.6503806    .4802604
 birthmonthdum2 |  -.7632926   3.115275    -0.25   0.806    -6.869119    5.342533
 birthmonthdum3 |  -.5422473   2.456388    -0.22   0.825    -5.356679    4.272184
 birthmonthdum4 |  -.4079974   2.259081    -0.18   0.857    -4.835715    4.019721
 birthmonthdum5 |  -.2577837   1.581281    -0.16   0.871    -3.357037    2.841469
 birthmonthdum6 |   -.827974   3.595898    -0.23   0.818    -7.875804    6.219856
 birthmonthdum7 |  -1.933572   6.561544    -0.29   0.768    -14.79396    10.92682
 birthmonthdum8 |  -.4533558   2.179528    -0.21   0.835    -4.725152    3.818441
 birthmonthdum9 |  -.6713432    2.60186    -0.26   0.796    -5.770895    4.428208
birthmonthdum10 |    .389973   1.384614     0.28   0.778     -2.32382    3.103766
birthmonthdum11 |    .094216   1.078965     0.09   0.930    -2.020516    2.208948
birthmonthdum12 |  -.7646087   2.360569    -0.32   0.746     -5.39124    3.862022
          _cons |  -40.52238   161.8124    -0.25   0.802    -357.6688    276.6241
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =   3.5384  (p = 0.3158)
  Wu-Hausman F(3,423)             =  1.13528  (p = 0.3345)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.073  Chi-sq(16) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
birthmont~m2 |        443    .0948081    .2932809          0          1
birthmonth~3 |        443    .0654628    .2476203          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        443    .0609481    .2395055          0          1
birthmonth~5 |        443    .0812641    .2735492          0          1
birthmonth~6 |        443    .0902935    .2869257          0          1
birthmonth~7 |        443    .0744921    .2628669          0          1
birthmonth~8 |        443    .0948081    .2932809          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        443    .0970655    .2963816          0          1
birthmont~10 |        443    .1173815    .3222382          0          1
birthmont~11 |        443    .0812641    .2735492          0          1
birthmont~12 |        443    .0857788    .2803537          0          1
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu secgenedu = t d td ) if inrange(t, -`months', `months'
> -1) & inrange(monthlyearning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(30, 412)    =  26.12
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6554
                                                        Adj R-squared = 0.6304
                                                        Root MSE      = 0.1350

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4949005   .0345194   -14.34   0.000    -.5627567   -.4270443
         expsqr |   .0095319   .0007976    11.95   0.000      .007964    .0110997
 birthmonthdum2 |  -.0174578   .0356927    -0.49   0.625    -.0876202    .0527047
 birthmonthdum3 |  -.0675315   .0392887    -1.72   0.086    -.1447629    .0096999
 birthmonthdum4 |  -.1138887   .0393045    -2.90   0.004     -.191151   -.0366263
 birthmonthdum5 |  -.0575525   .0369154    -1.56   0.120    -.1301186    .0150135
 birthmonthdum6 |  -.0676118   .0360681    -1.87   0.062    -.1385122    .0032887
 birthmonthdum7 |  -.0343947      .0371    -0.93   0.354    -.1073237    .0385343
 birthmonthdum8 |  -.0442274    .037162    -1.19   0.235    -.1172782    .0288233
 birthmonthdum9 |  -.0289846   .0365587    -0.79   0.428    -.1008494    .0428802
birthmonthdum10 |   -.033405   .0348817    -0.96   0.339    -.1019733    .0351632
birthmonthdum11 |  -.0217604   .0365594    -0.60   0.552    -.0936267    .0501059
birthmonthdum12 |  -.0427544   .0368956    -1.16   0.247    -.1152814    .0297727
   provincedum2 |   .1297945   .0578523     2.24   0.025      .016072    .2435169
   provincedum3 |   .1226651   .0732846     1.67   0.095    -.0213932    .2667234
   provincedum4 |   .1200876   .0616524     1.95   0.052     -.001105    .2412801
   provincedum5 |   .1248739   .0488696     2.56   0.011      .028809    .2209389
   provincedum6 |   .1790987   .0526248     3.40   0.001     .0756521    .2825453
   provincedum7 |   .1516125    .051056     2.97   0.003     .0512497    .2519753
   provincedum8 |   .1656194   .0494492     3.35   0.001     .0684152    .2628236
   provincedum9 |   .1099743   .0506426     2.17   0.030     .0104241    .2095244
  provincedum10 |   .1426888    .050207     2.84   0.005      .043995    .2413825
  provincedum11 |   .0979581   .0513621     1.91   0.057    -.0030063    .1989226
  provincedum12 |   .0853564   .0577701     1.48   0.140    -.0282046    .1989173
  provincedum13 |   .1392433   .0526681     2.64   0.009     .0357115    .2427751
  provincedum14 |   .1371482   .0518324     2.65   0.008     .0352593    .2390371
  provincedum15 |   .1578813   .0579273     2.73   0.007     .0440114    .2717511
              t |  -.0017668   .0011092    -1.59   0.112    -.0039472    .0004136
              d |  -.0081094   .0280651    -0.29   0.773    -.0632781    .0470592
             td |  -.0033494   .0013431    -2.49   0.013    -.0059897   -.0007092
          _cons |   6.287843   .3703746    16.98   0.000     5.559783    7.015903
---------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(30, 412)    =  14.07
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5060
                                                        Adj R-squared = 0.4701
                                                        Root MSE      = 0.1318

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4176098   .0336945   -12.39   0.000    -.4838445   -.3513752
         expsqr |    .008504   .0007785    10.92   0.000     .0069737    .0100344
 birthmonthdum2 |   .0147181   .0348397     0.42   0.673    -.0537677    .0832039
 birthmonthdum3 |  -.0264544   .0383498    -0.69   0.491    -.1018402    .0489313
 birthmonthdum4 |  -.0537566   .0383652    -1.40   0.162    -.1291725    .0216594
 birthmonthdum5 |   -.027583   .0360332    -0.77   0.444     -.098415    .0432489
 birthmonthdum6 |  -.0116702   .0352061    -0.33   0.740    -.0808763    .0575359
 birthmonthdum7 |   .0348235   .0362134     0.96   0.337    -.0363627    .1060096
 birthmonthdum8 |  -.0153555   .0362739    -0.42   0.672    -.0866605    .0559496
 birthmonthdum9 |  -.0038479    .035685    -0.11   0.914    -.0739954    .0662995
birthmonthdum10 |   -.038553   .0340481    -1.13   0.258    -.1054826    .0283766
birthmonthdum11 |  -.0260318   .0356858    -0.73   0.466    -.0961807    .0441171
birthmonthdum12 |  -.0169001   .0360139    -0.47   0.639    -.0876939    .0538938
   provincedum2 |   .0214244   .0564698     0.38   0.705    -.0895805    .1324292
   provincedum3 |    .016382   .0715333     0.23   0.819    -.1242337    .1569978
   provincedum4 |   .0222755   .0601791     0.37   0.711    -.0960208    .1405719
   provincedum5 |   .0072967   .0477018     0.15   0.879    -.0864725     .101066
   provincedum6 |   .0339988   .0513672     0.66   0.508    -.0669757    .1349733
   provincedum7 |   .0198355   .0498359     0.40   0.691    -.0781289    .1177999
   provincedum8 |   .0261291   .0482675     0.54   0.589    -.0687521    .1210104
   provincedum9 |    .011302   .0494324     0.23   0.819    -.0858692    .1084731
  provincedum10 |   .0320786   .0490071     0.65   0.513    -.0642566    .1284139
  provincedum11 |   .0016121   .0501347     0.03   0.974    -.0969396    .1001638
  provincedum12 |  -.0131196   .0563896    -0.23   0.816    -.1239667    .0977275
  provincedum13 |   .0188115   .0514095     0.37   0.715    -.0822461    .1198692
  provincedum14 |   .0100375   .0505937     0.20   0.843    -.0894165    .1094915
  provincedum15 |   .0034797    .056543     0.06   0.951     -.107669    .1146283
              t |  -.0003648   .0010827    -0.34   0.736    -.0024931    .0017635
              d |   .0132213   .0273944     0.48   0.630     -.040629    .0670715
             td |  -.0020498    .001311    -1.56   0.119     -.004627    .0005273
          _cons |   5.098512   .3615237    14.10   0.000     4.387851    5.809173
---------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(30, 412)    =   8.42
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.3799
                                                        Adj R-squared = 0.3348
                                                        Root MSE      = 0.2628

---------------------------------------------------------------------------------
      secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.1633445   .0671815    -2.43   0.015    -.2954058   -.0312831
         expsqr |   .0013119   .0015522     0.85   0.399    -.0017394    .0043632
 birthmonthdum2 |   .0581893   .0694649     0.84   0.403    -.0783605    .1947391
 birthmonthdum3 |   .0803016   .0764635     1.05   0.294    -.0700057    .2306088
 birthmonthdum4 |   .0890217   .0764941     1.16   0.245    -.0613458    .2393892
 birthmonthdum5 |    .089566   .0718446     1.25   0.213    -.0516616    .2307936
 birthmonthdum6 |   .1060727   .0701955     1.51   0.132    -.0319133    .2440586
 birthmonthdum7 |   .1667001   .0722039     2.31   0.021     .0247662     .308634
 birthmonthdum8 |   .0980861   .0723244     1.36   0.176    -.0440848    .2402571
 birthmonthdum9 |   .1229311   .0711503     1.73   0.085    -.0169318    .2627939
birthmonthdum10 |   .0912504   .0678865     1.34   0.180    -.0421966    .2246975
birthmonthdum11 |   .1226603   .0711518     1.72   0.085    -.0172055    .2625261
birthmonthdum12 |   .1343588   .0718059     1.87   0.062    -.0067929    .2755105
   provincedum2 |   .1892064   .1125918     1.68   0.094    -.0321196    .4105324
   provincedum3 |   .2656188    .142626     1.86   0.063    -.0147467    .5459842
   provincedum4 |   .0838971   .1199876     0.70   0.485    -.1519671    .3197613
   provincedum5 |   .1177857   .0951098     1.24   0.216    -.0691753    .3047467
   provincedum6 |   .1771501   .1024181     1.73   0.084    -.0241771    .3784772
   provincedum7 |   .1733641   .0993649     1.74   0.082    -.0219613    .3686896
   provincedum8 |   .1929947   .0962377     2.01   0.046     .0038165    .3821729
   provincedum9 |   .1642358   .0985603     1.67   0.096    -.0295081    .3579796
  provincedum10 |   .1594001   .0977125     1.63   0.104    -.0326771    .3514773
  provincedum11 |   .1114997   .0999606     1.12   0.265    -.0849967    .3079961
  provincedum12 |   .0289479   .1124318     0.26   0.797    -.1920637    .2499595
  provincedum13 |   .1157517   .1025024     1.13   0.259    -.0857413    .3172446
  provincedum14 |   .0780309   .1008759     0.77   0.440    -.1202647    .2763264
  provincedum15 |   .2021107   .1127377     1.79   0.074    -.0195022    .4237235
              t |  -.0097513   .0021587    -4.52   0.000    -.0139949   -.0055078
              d |  -.0304429   .0546201    -0.56   0.578    -.1378117     .076926
             td |   .0032882    .002614     1.26   0.209    -.0018501    .0084266
          _cons |   2.952869   .7208208     4.10   0.000     1.535924    4.369815
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(30)   =       3.49
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =     2.1592

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -10.01078   16.94634    -0.59   0.555    -43.22498    23.20343
  secgenhighedu |   17.44418   30.56936     0.57   0.568    -42.47067    77.35903
      secgenedu |   1.976195   3.613252     0.55   0.584     -5.10565     9.05804
            exp |   2.448243   5.448293     0.45   0.653    -8.230215     13.1267
         expsqr |  -.0508024   .1142302    -0.44   0.657    -.2746894    .1730846
 birthmonthdum2 |  -.4918579   1.049408    -0.47   0.639     -2.54866    1.564944
 birthmonthdum3 |  -.3864611   .9042688    -0.43   0.669    -2.158795    1.385873
 birthmonthdum4 |  -.3337055   1.014176    -0.33   0.742    -2.321453    1.654042
 birthmonthdum5 |  -.2670398   .7996435    -0.33   0.738    -1.834312    1.300233
 birthmonthdum6 |  -.5464599   1.252956    -0.44   0.663    -3.002209    1.909289
 birthmonthdum7 |   -1.24145   2.149995    -0.58   0.564    -5.455362    2.972463
 birthmonthdum8 |  -.3304135    .841528    -0.39   0.695    -1.979778    1.318951
 birthmonthdum9 |   -.498706   .9690464    -0.51   0.607    -2.398002     1.40059
birthmonthdum10 |    .181868   .7743246     0.23   0.814     -1.33578    1.699516
birthmonthdum11 |  -.0302952   .6948467    -0.04   0.965     -1.39217    1.331579
birthmonthdum12 |  -.6500143   .9253917    -0.70   0.482    -2.463749     1.16372
   provincedum2 |  -.0617854   1.245042    -0.05   0.960    -2.502022    2.378451
   provincedum3 |  -.5485665   1.325568    -0.41   0.679    -3.146632    2.049499
   provincedum4 |  -.0769245   1.408249    -0.05   0.956    -2.837041    2.683192
   provincedum5 |   .4611193   1.569059     0.29   0.769     -2.61418    3.536419
   provincedum6 |   .4613907   1.560515     0.30   0.767    -2.597163    3.519944
   provincedum7 |   .1503775    1.51575     0.10   0.921    -2.820438    3.121193
   provincedum8 |   .1812929   1.487384     0.12   0.903    -2.733926    3.096511
   provincedum9 |   .1485733   1.177661     0.13   0.900    -2.159599    2.456745
  provincedum10 |   .1512656   1.133172     0.13   0.894    -2.069711    2.372242
  provincedum11 |   .1639213   1.363534     0.12   0.904    -2.508557    2.836399
  provincedum12 |   .3442028   1.827592     0.19   0.851    -3.237812    3.926218
  provincedum13 |   .3801784   1.503598     0.25   0.800     -2.56682    3.327177
  provincedum14 |   .3074509   1.797307     0.17   0.864    -3.215205    3.830107
  provincedum15 |   .3454011   1.992601     0.17   0.862    -3.560025    4.250827
          _cons |  -21.43354   65.33193    -0.33   0.743    -149.4818    106.6147
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  4.83227  (p = 0.1845)
  Wu-Hausman F(3,409)             =  1.50353  (p = 0.2131)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.425  Chi-sq(30) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
birthmont~m2 |        443    .0948081    .2932809          0          1
birthmonth~3 |        443    .0654628    .2476203          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        443    .0609481    .2395055          0          1
birthmonth~5 |        443    .0812641    .2735492          0          1
birthmonth~6 |        443    .0902935    .2869257          0          1
birthmonth~7 |        443    .0744921    .2628669          0          1
birthmonth~8 |        443    .0948081    .2932809          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        443    .0970655    .2963816          0          1
birthmont~10 |        443    .1173815    .3222382          0          1
birthmont~11 |        443    .0812641    .2735492          0          1
birthmont~12 |        443    .0857788    .2803537          0          1
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 20
> 0, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(17, 1173)   =  84.14
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5494
                                                        Adj R-squared = 0.5429
                                                        Root MSE      = 0.1673

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4277388   .0234702   -18.22   0.000    -.4737871   -.3816906
         expsqr |   .0078934   .0005399    14.62   0.000     .0068342    .0089527
 birthmonthdum2 |  -.0208116   .0250118    -0.83   0.406    -.0698844    .0282612
 birthmonthdum3 |  -.0254591   .0275313    -0.92   0.355    -.0794751    .0285569
 birthmonthdum4 |  -.0203269   .0270845    -0.75   0.453    -.0734664    .0328125
 birthmonthdum5 |  -.0115507   .0256984    -0.45   0.653    -.0619706    .0388693
 birthmonthdum6 |  -.0322749   .0253198    -1.27   0.203     -.081952    .0174022
 birthmonthdum7 |  -.0218254   .0264141    -0.83   0.409    -.0736496    .0299989
 birthmonthdum8 |  -.0054395   .0254591    -0.21   0.831    -.0553898    .0445109
 birthmonthdum9 |   .0169999   .0245042     0.69   0.488     -.031077    .0650769
birthmonthdum10 |    .010197   .0247217     0.41   0.680    -.0383067    .0587007
birthmonthdum11 |   .0090446   .0255881     0.35   0.724    -.0411589    .0592481
birthmonthdum12 |   .0078417   .0257589     0.30   0.761    -.0426969    .0583803
           male |   .0118958   .0100722     1.18   0.238    -.0078657    .0316572
              t |  -.0036774   .0007483    -4.91   0.000    -.0051455   -.0022092
              d |   .0111393    .020119     0.55   0.580    -.0283339    .0506125
             td |   -.002702   .0009823    -2.75   0.006    -.0046294   -.0007747
          _cons |   5.707456   .2565592    22.25   0.000      5.20409    6.210823
---------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(17, 1173)   =  48.47
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4126
                                                        Adj R-squared = 0.4041
                                                        Root MSE      = 0.1649

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3434625   .0231226   -14.85   0.000    -.3888288   -.2980962
         expsqr |   .0064966   .0005319    12.21   0.000     .0054531    .0075402
 birthmonthdum2 |  -.0083945   .0246414    -0.34   0.733    -.0567406    .0399515
 birthmonthdum3 |  -.0147675   .0271235    -0.54   0.586    -.0679835    .0384486
 birthmonthdum4 |  -.0148977   .0266834    -0.56   0.577    -.0672502    .0374548
 birthmonthdum5 |  -.0075596   .0253178    -0.30   0.765    -.0572328    .0421137
 birthmonthdum6 |  -.0345752   .0249448    -1.39   0.166    -.0835167    .0143662
 birthmonthdum7 |   -.026807    .026023    -1.03   0.303    -.0778638    .0242498
 birthmonthdum8 |  -.0127784    .025082    -0.51   0.611    -.0619891    .0364322
 birthmonthdum9 |   .0009231   .0241413     0.04   0.970    -.0464419    .0482881
birthmonthdum10 |   -.032247   .0243556    -1.32   0.186    -.0800324    .0155384
birthmonthdum11 |  -.0081202   .0252091    -0.32   0.747    -.0575802    .0413399
birthmonthdum12 |   .0036417   .0253774     0.14   0.886    -.0461484    .0534319
           male |   .0148197    .009923     1.49   0.136    -.0046491    .0342885
              t |  -.0025856   .0007372    -3.51   0.000     -.004032   -.0011393
              d |   .0137311    .019821     0.69   0.489    -.0251575    .0526198
             td |   -.001835   .0009678    -1.90   0.058    -.0037338    .0000638
          _cons |   4.490313   .2527598    17.77   0.000     3.994401    4.986225
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(16)   =     112.26
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .81132

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -2.939913   10.48093    -0.28   0.779    -23.48215    17.60233
  secgenhighedu |   4.435183   15.59632     0.28   0.776    -26.13305    35.00342
            exp |   .0269166   .8927593     0.03   0.976    -1.722859    1.776693
         expsqr |  -.0004618   .0189576    -0.02   0.981     -.037618    .0366945
 birthmonthdum2 |   .1221577    .143827     0.85   0.396     -.159738    .4040535
 birthmonthdum3 |    .079263   .1356819     0.58   0.559    -.1866686    .3451946
 birthmonthdum4 |   .0967381   .1345574     0.72   0.472    -.1669896    .3604658
 birthmonthdum5 |   .0080842    .124574     0.06   0.948    -.2360763    .2522446
 birthmonthdum6 |   .2816757   .2488654     1.13   0.258    -.2060915    .7694428
 birthmonthdum7 |   .0639822   .2404967     0.27   0.790    -.4073827    .5353472
 birthmonthdum8 |   .1370712   .2003347     0.68   0.494    -.2555777    .5297201
 birthmonthdum9 |  -.0105543   .2132822    -0.05   0.961    -.4285798    .4074711
birthmonthdum10 |   .2488219   .6215034     0.40   0.689    -.9693024    1.466946
birthmonthdum11 |   .0873724   .2522037     0.35   0.729    -.4069378    .5816826
birthmonthdum12 |   .0125631   .1279775     0.10   0.922    -.2382682    .2633943
           male |   .4478582   .1157148     3.87   0.000     .2210613    .6746551
          _cons |   7.353007    10.5173     0.70   0.484    -13.26053    27.96654
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .486158  (p = 0.7842)
  Wu-Hausman F(2,1172)            =  .239299  (p = 0.7872)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .060178  (p = 0.8062)
  Basmann chi2(1)        =  .059272  (p = 0.8077)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   5.097  Chi-sq(17) P-value = 0.9975

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
birthmont~m2 |      1,191    .0940386    .2920051          0          1
birthmonth~3 |      1,191    .0621327    .2414977          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,191    .0654912    .2474945          0          1
birthmonth~5 |      1,191    .0831234    .2761847          0          1
birthmonth~6 |      1,191    .0906801    .2872743          0          1
birthmonth~7 |      1,191    .0747271     .263061          0          1
birthmonth~8 |      1,191    .0890008    .2848646          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,191    .1074727    .3098434          0          1
birthmont~10 |      1,191    .1007557    .3011314          0          1
birthmont~11 |      1,191    .0848027    .2787049          0          1
birthmont~12 |      1,191    .0839631    .2774489          0          1
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) &
>  inrange(monthlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(31, 1159)   =  48.90
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5667
                                                        Adj R-squared = 0.5551
                                                        Root MSE      = 0.1651

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4209328   .0236547   -17.79   0.000    -.4673436   -.3745219
         expsqr |   .0076295   .0005446    14.01   0.000     .0065611    .0086979
 birthmonthdum2 |   -.016871   .0249562    -0.68   0.499    -.0658354    .0320935
 birthmonthdum3 |  -.0180612   .0273722    -0.66   0.509    -.0717658    .0356434
 birthmonthdum4 |  -.0190519   .0268784    -0.71   0.479    -.0717876    .0336838
 birthmonthdum5 |  -.0068923     .02552    -0.27   0.787     -.056963    .0431783
 birthmonthdum6 |  -.0246139   .0253329    -0.97   0.331    -.0743174    .0250895
 birthmonthdum7 |   -.013103   .0262162    -0.50   0.617    -.0645395    .0383335
 birthmonthdum8 |   .0073237   .0253693     0.29   0.773    -.0424511    .0570985
 birthmonthdum9 |   .0238145    .024412     0.98   0.330    -.0240822    .0717112
birthmonthdum10 |   .0196241   .0247186     0.79   0.427    -.0288741    .0681222
birthmonthdum11 |   .0170386   .0254763     0.67   0.504    -.0329462    .0670234
birthmonthdum12 |   .0152091   .0256939     0.59   0.554    -.0352027    .0656209
           male |    .011528   .0099637     1.16   0.248    -.0080209     .031077
   provincedum2 |   .0872432    .041896     2.08   0.038     .0050427    .1694437
   provincedum3 |   .1213672   .0498946     2.43   0.015     .0234733    .2192612
   provincedum4 |   .0830774   .0423261     1.96   0.050     .0000331    .1661217
   provincedum5 |   .0983329   .0335683     2.93   0.003     .0324715    .1641943
   provincedum6 |   .1537497   .0355709     4.32   0.000     .0839591    .2235402
   provincedum7 |   .1012143   .0341781     2.96   0.003     .0341563    .1682722
   provincedum8 |   .1379622   .0334347     4.13   0.000      .072363    .2035614
   provincedum9 |    .054468   .0342258     1.59   0.112    -.0126835    .1216196
  provincedum10 |   .0729505   .0345504     2.11   0.035     .0051622    .1407389
  provincedum11 |   .0646291   .0346375     1.87   0.062    -.0033301    .1325884
  provincedum12 |   .0830725   .0402161     2.07   0.039      .004168    .1619771
  provincedum13 |   .0657628    .036184     1.82   0.069    -.0052308    .1367563
  provincedum14 |   .0855766   .0355061     2.41   0.016     .0159133    .1552399
  provincedum15 |   .1237622   .0382276     3.24   0.001     .0487591    .1987653
              t |  -.0041925   .0007486    -5.60   0.000    -.0056613   -.0027238
              d |   .0158501   .0200019     0.79   0.428    -.0233939    .0550942
             td |  -.0027152   .0009735    -2.79   0.005    -.0046251   -.0008052
          _cons |   5.591549   .2565068    21.80   0.000     5.088279    6.094818
---------------------------------------------------------------------------------

                                                        Number of obs =  1,191
                                                        F(31, 1159)   =  27.54
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4242
                                                        Adj R-squared = 0.4088
                                                        Root MSE      = 0.1642

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3364848   .0235298   -14.30   0.000    -.3826506    -.290319
         expsqr |   .0062746   .0005417    11.58   0.000     .0052118    .0073374
 birthmonthdum2 |  -.0067154   .0248245    -0.27   0.787    -.0554213    .0419905
 birthmonthdum3 |  -.0121147   .0272277    -0.44   0.656    -.0655358    .0413063
 birthmonthdum4 |  -.0150257   .0267365    -0.56   0.574     -.067483    .0374315
 birthmonthdum5 |  -.0059233   .0253853    -0.23   0.816    -.0557296     .043883
 birthmonthdum6 |  -.0308336   .0251991    -1.22   0.221    -.0802746    .0186074
 birthmonthdum7 |  -.0215258   .0260778    -0.83   0.409    -.0726908    .0296391
 birthmonthdum8 |  -.0041748   .0252353    -0.17   0.869    -.0536868    .0453372
 birthmonthdum9 |   .0040862   .0242831     0.17   0.866    -.0435576      .05173
birthmonthdum10 |   -.028056   .0245881    -1.14   0.254    -.0762981    .0201861
birthmonthdum11 |  -.0056926   .0253418    -0.22   0.822    -.0554135    .0440284
birthmonthdum12 |   .0080779   .0255582     0.32   0.752    -.0420677    .0582235
           male |   .0139889   .0099111     1.41   0.158    -.0054569    .0334346
   provincedum2 |   .0289868   .0416748     0.70   0.487    -.0527797    .1107533
   provincedum3 |   .0741709   .0496312     1.49   0.135    -.0232062     .171548
   provincedum4 |   .0263469   .0421026     0.63   0.532    -.0562589    .1089528
   provincedum5 |   .0313482    .033391     0.94   0.348    -.0341654    .0968619
   provincedum6 |   .0884795   .0353831     2.50   0.013     .0190574    .1579015
   provincedum7 |   .0372125   .0339977     1.09   0.274    -.0294914    .1039164
   provincedum8 |    .059224   .0332581     1.78   0.075    -.0060289    .1244769
   provincedum9 |   .0126398   .0340451     0.37   0.711    -.0541572    .0794368
  provincedum10 |   .0201529    .034368     0.59   0.558    -.0472776    .0875833
  provincedum11 |    .010366   .0344546     0.30   0.764    -.0572344    .0779664
  provincedum12 |   .0117315   .0400038     0.29   0.769    -.0667565    .0902195
  provincedum13 |   .0052909    .035993     0.15   0.883    -.0653278    .0759096
  provincedum14 |   .0297443   .0353186     0.84   0.400    -.0395512    .0990399
  provincedum15 |   .0556942   .0380258     1.46   0.143    -.0189129    .1303012
              t |  -.0030114   .0007447    -4.04   0.000    -.0044724   -.0015503
              d |   .0192298   .0198963     0.97   0.334     -.019807    .0582667
             td |  -.0017313   .0009683    -1.79   0.074    -.0036312    .0001686
          _cons |   4.409615   .2551526    17.28   0.000     3.909002    4.910227
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(30)   =     150.12
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .79099

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -3.025722   7.164455    -0.42   0.673     -17.0678    11.01635
  secgenhighedu |   4.296845   10.75565     0.40   0.690    -16.78385    25.37754
            exp |   -.038206   .6400088    -0.06   0.952      -1.2926    1.216188
         expsqr |   .0009469   .0135792     0.07   0.944    -.0256678    .0275615
 birthmonthdum2 |   .0889672   .1259774     0.71   0.480     -.157944    .3358784
 birthmonthdum3 |   .0402071   .1315415     0.31   0.760    -.2176094    .2980236
 birthmonthdum4 |   .0447894   .1332196     0.34   0.737    -.2163162    .3058951
 birthmonthdum5 |  -.0146773   .1243537    -0.12   0.906    -.2584062    .2290515
 birthmonthdum6 |   .2417114    .209623     1.15   0.249    -.1691421    .6525649
 birthmonthdum7 |   .0280298   .1975446     0.14   0.887    -.3591505      .41521
 birthmonthdum8 |    .094405   .1651153     0.57   0.567    -.2292151     .418025
 birthmonthdum9 |  -.0533371   .1817646    -0.29   0.769    -.4095891    .3029148
birthmonthdum10 |   .2022111   .4583562     0.44   0.659    -.6961505    1.100573
birthmonthdum11 |   .0456391   .2189127     0.21   0.835    -.3834218    .4747001
birthmonthdum12 |  -.0382851   .1256263    -0.30   0.761    -.2845082     .207938
           male |   .4556951   .0819642     5.56   0.000     .2950483    .6163419
   provincedum2 |  -.1998715   .3637958    -0.55   0.583    -.9128981    .5131551
   provincedum3 |  -.2974218    .248091    -1.20   0.231    -.7836713    .1888278
   provincedum4 |  -.3019993   .3639809    -0.83   0.407    -1.015389    .4113901
   provincedum5 |   .0335862   .3882354     0.09   0.931    -.7273413    .7945137
   provincedum6 |  -.0158389   .2210383    -0.07   0.943    -.4490661    .4173883
   provincedum7 |  -.1480026   .3530837    -0.42   0.675     -.840034    .5440288
   provincedum8 |  -.1758023    .378283    -0.46   0.642    -.9172233    .5656188
   provincedum9 |   .0019187   .2912727     0.01   0.995    -.5689653    .5728028
  provincedum10 |   .0038494   .3395367     0.01   0.991    -.6616302     .669329
  provincedum11 |  -.1105616   .3740877    -0.30   0.768    -.8437601    .6226369
  provincedum12 |  -.2304595   .4929997    -0.47   0.640    -1.196721    .7358021
  provincedum13 |    -.09445   .4344761    -0.22   0.828    -.9460076    .7571075
  provincedum14 |  -.2963555   .3291402    -0.90   0.368    -.9414584    .3487474
  provincedum15 |  -.4073771   .3296721    -1.24   0.217    -1.053523    .2387684
          _cons |   8.259416   7.845459     1.05   0.292    -7.117402    23.63623
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .378525  (p = 0.8276)
  Wu-Hausman F(2,1158)            =  .184077  (p = 0.8319)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .086409  (p = 0.7688)
  Basmann chi2(1)        =  .084094  (p = 0.7718)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.794  Chi-sq(31) P-value = 0.9999

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
birthmont~m2 |      1,191    .0940386    .2920051          0          1
birthmonth~3 |      1,191    .0621327    .2414977          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,191    .0654912    .2474945          0          1
birthmonth~5 |      1,191    .0831234    .2761847          0          1
birthmonth~6 |      1,191    .0906801    .2872743          0          1
birthmonth~7 |      1,191    .0747271     .263061          0          1
birthmonth~8 |      1,191    .0890008    .2848646          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,191    .1074727    .3098434          0          1
birthmont~10 |      1,191    .1007557    .3011314          0          1
birthmont~11 |      1,191    .0848027    .2787049          0          1
birthmont~12 |      1,191    .0839631    .2774489          0          1
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16
> 667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(16, 731)    =  50.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5252
                                                        Adj R-squared = 0.5148
                                                        Root MSE      = 0.1819

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3854351   .0315715   -12.21   0.000    -.4474167   -.3234535
         expsqr |   .0068336   .0007241     9.44   0.000      .005412    .0082551
 birthmonthdum2 |  -.0191298   .0336044    -0.57   0.569    -.0851025    .0468429
 birthmonthdum3 |   .0129162   .0373223     0.35   0.729    -.0603554    .0861879
 birthmonthdum4 |   .0320915   .0360679     0.89   0.374    -.0387176    .1029005
 birthmonthdum5 |   .0192121    .034397     0.56   0.577    -.0483166    .0867409
 birthmonthdum6 |    -.00671   .0341493    -0.20   0.844    -.0737523    .0603324
 birthmonthdum7 |  -.0124698   .0355228    -0.35   0.726    -.0822086    .0572691
 birthmonthdum8 |   .0279299    .034408     0.81   0.417    -.0396203    .0954802
 birthmonthdum9 |   .0511066   .0325189     1.57   0.116     -.012735    .1149482
birthmonthdum10 |   .0432934   .0339398     1.28   0.203    -.0233376    .1099245
birthmonthdum11 |   .0327366   .0342443     0.96   0.339    -.0344923    .0999656
birthmonthdum12 |   .0460852   .0348727     1.32   0.187    -.0223775    .1145479
              t |   -.004465    .000996    -4.48   0.000    -.0064203   -.0025098
              d |   .0126712   .0277746     0.46   0.648    -.0418563    .0671988
             td |  -.0027973     .00135    -2.07   0.039    -.0054476    -.000147
          _cons |    5.28962    .347313    15.23   0.000      4.60777     5.97147
---------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(16, 731)    =  30.96
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4039
                                                        Adj R-squared = 0.3909
                                                        Root MSE      = 0.1798

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3008585   .0312001    -9.64   0.000    -.3621109   -.2396061
         expsqr |   .0053793   .0007156     7.52   0.000     .0039745    .0067841
 birthmonthdum2 |  -.0203136   .0332091    -0.61   0.541    -.0855102     .044883
 birthmonthdum3 |   .0022121   .0368832     0.06   0.952    -.0701976    .0746218
 birthmonthdum4 |   .0094372   .0356436     0.26   0.791    -.0605388    .0794133
 birthmonthdum5 |   .0101992   .0339924     0.30   0.764    -.0565351    .0769336
 birthmonthdum6 |  -.0432278   .0337475    -1.28   0.201    -.1094814    .0230259
 birthmonthdum7 |  -.0599727   .0351049    -1.71   0.088    -.1288911    .0089458
 birthmonthdum8 |  -.0073594   .0340032    -0.22   0.829     -.074115    .0593962
 birthmonthdum9 |   .0117527   .0321363     0.37   0.715    -.0513378    .0748432
birthmonthdum10 |  -.0244894   .0335405    -0.73   0.466    -.0903366    .0413578
birthmonthdum11 |   .0037198   .0338415     0.11   0.913    -.0627183    .0701578
birthmonthdum12 |   .0223226   .0344625     0.65   0.517    -.0453346    .0899799
              t |  -.0034517   .0009842    -3.51   0.000    -.0053839   -.0015194
              d |   .0108232   .0274479     0.39   0.693    -.0430628    .0647093
             td |  -.0020031   .0013341    -1.50   0.134    -.0046222     .000616
          _cons |   4.124534   .3432271    12.02   0.000     3.450706    4.798362
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(15)   =       7.68
                                                  Prob > chi2     =     0.9359
                                                  R-squared       =          .
                                                  Root MSE        =     1.0756

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   5.720146   47.05724     0.12   0.903    -86.51035    97.95064
  secgenhighedu |  -7.815794   62.45941    -0.13   0.900     -130.234    114.6024
            exp |  -.3638509   .7639326    -0.48   0.634    -1.861131     1.13343
         expsqr |   .0076801   .0167921     0.46   0.647    -.0252318    .0405919
 birthmonthdum2 |   .0879355   .4214957     0.21   0.835    -.7381808    .9140519
 birthmonthdum3 |   .0303046    .519332     0.06   0.953    -.9875675    1.048177
 birthmonthdum4 |  -.0161127   .9441708    -0.02   0.986    -1.866653    1.834428
 birthmonthdum5 |  -.0554461   .3394012    -0.16   0.870    -.7206602    .6097681
 birthmonthdum6 |  -.0835618   2.415103    -0.03   0.972    -4.817076    4.649953
 birthmonthdum7 |  -.4374424   3.182533    -0.14   0.891    -6.675093    5.800208
 birthmonthdum8 |  -.1282889   1.794645    -0.07   0.943    -3.645729    3.389151
 birthmonthdum9 |  -.3272285   1.698391    -0.19   0.847    -3.656015    3.001558
birthmonthdum10 |  -.3763365   3.567189    -0.11   0.916    -7.367898    6.615225
birthmonthdum11 |  -.1694521   1.326123    -0.13   0.898    -2.768605      2.4297
birthmonthdum12 |   .0036074   .8152349     0.00   0.996    -1.594224    1.601438
          _cons |   12.70613   9.981832     1.27   0.203    -6.857897    32.27017
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .044415  (p = 0.9780)
  Wu-Hausman F(2,730)             =  .021674  (p = 0.9786)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .141824  (p = 0.7065)
  Basmann chi2(1)        =  .138627  (p = 0.7096)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.651  Chi-sq(16) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0601604    .2379429          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748    .0909091    .2876721          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748    .0828877    .2758969          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inra
> nge(monthlyearning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =  28.57
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5445
                                                        Adj R-squared = 0.5254
                                                        Root MSE      = 0.1799

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3764884   .0318215   -11.83   0.000    -.4389629    -.314014
         expsqr |   .0065198   .0007305     8.92   0.000     .0050856     .007954
 birthmonthdum2 |  -.0281822   .0338055    -0.83   0.405    -.0945518    .0381874
 birthmonthdum3 |   .0053497   .0371881     0.14   0.886     -.067661    .0783604
 birthmonthdum4 |   .0226496    .035918     0.63   0.529    -.0478675    .0931666
 birthmonthdum5 |   .0152297   .0343641     0.44   0.658    -.0522367    .0826961
 birthmonthdum6 |  -.0095915   .0343182    -0.28   0.780    -.0769677    .0577847
 birthmonthdum7 |  -.0088972   .0353841    -0.25   0.802     -.078366    .0605716
 birthmonthdum8 |   .0231676   .0343055     0.68   0.500    -.0441837    .0905188
 birthmonthdum9 |   .0463144   .0324264     1.43   0.154    -.0173476    .1099763
birthmonthdum10 |   .0413811   .0338554     1.22   0.222    -.0250865    .1078487
birthmonthdum11 |   .0294558   .0343241     0.86   0.391    -.0379319    .0968435
birthmonthdum12 |   .0425571   .0347909     1.22   0.222    -.0257472    .1108614
   provincedum2 |   .0781477   .0582457     1.34   0.180    -.0362048    .1925003
   provincedum3 |   .1226871   .0664103     1.85   0.065    -.0076948     .253069
   provincedum4 |   .0686481   .0562711     1.22   0.223    -.0418276    .1791239
   provincedum5 |   .0914814   .0449143     2.04   0.042     .0033022    .1796606
   provincedum6 |   .1492551   .0472998     3.16   0.002     .0563924    .2421177
   provincedum7 |   .0817448   .0450174     1.82   0.070    -.0066368    .1701264
   provincedum8 |   .1266204   .0444623     2.85   0.005     .0393285    .2139123
   provincedum9 |   .0377928   .0453655     0.83   0.405    -.0512724     .126858
  provincedum10 |   .0441531   .0463496     0.95   0.341    -.0468442    .1351503
  provincedum11 |   .0651077   .0460722     1.41   0.158    -.0253449    .1555602
  provincedum12 |   .0962054    .054273     1.77   0.077    -.0103475    .2027583
  provincedum13 |   .0315249   .0484405     0.65   0.515    -.0635773    .1266271
  provincedum14 |   .0657647   .0477124     1.38   0.169    -.0279081    .1594374
  provincedum15 |   .1134843   .0501434     2.26   0.024      .015039    .2119297
              t |  -.0052157   .0010002    -5.21   0.000    -.0071793   -.0032521
              d |   .0191701   .0277818     0.69   0.490    -.0353733    .0737135
             td |  -.0024622     .00135    -1.82   0.069    -.0051127    .0001883
          _cons |   5.170363   .3468433    14.91   0.000     4.489413    5.851313
---------------------------------------------------------------------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =  17.51
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4228
                                                        Adj R-squared = 0.3987
                                                        Root MSE      = 0.1786

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.2929807    .031593    -9.27   0.000    -.3550065   -.2309549
         expsqr |   .0051156   .0007253     7.05   0.000     .0036917    .0065395
 birthmonthdum2 |  -.0287372   .0335628    -0.86   0.392    -.0946302    .0371558
 birthmonthdum3 |  -.0067579   .0369211    -0.18   0.855    -.0792443    .0657285
 birthmonthdum4 |  -.0006626   .0356601    -0.02   0.985    -.0706733    .0693481
 birthmonthdum5 |   .0051685   .0341174     0.15   0.880    -.0618135    .0721504
 birthmonthdum6 |  -.0463139   .0340718    -1.36   0.174    -.1132063    .0205785
 birthmonthdum7 |  -.0598647     .03513    -1.70   0.089    -.1288347    .0091053
 birthmonthdum8 |  -.0107071   .0340592    -0.31   0.753    -.0775747    .0561606
 birthmonthdum9 |   .0061244   .0321935     0.19   0.849    -.0570804    .0693293
birthmonthdum10 |  -.0295319   .0336123    -0.88   0.380    -.0955222    .0364584
birthmonthdum11 |  -.0026822   .0340776    -0.08   0.937     -.069586    .0642216
birthmonthdum12 |   .0189198   .0345411     0.55   0.584    -.0488941    .0867336
   provincedum2 |   .0385092   .0578275     0.67   0.506    -.0750223    .1520407
   provincedum3 |   .1034369   .0659335     1.57   0.117    -.0260088    .2328826
   provincedum4 |   .0341243    .055867     0.61   0.542    -.0755582    .1438069
   provincedum5 |     .04463   .0445918     1.00   0.317    -.0429161    .1321761
   provincedum6 |   .1216761   .0469602     2.59   0.010     .0294802     .213872
   provincedum7 |   .0441543   .0446941     0.99   0.324    -.0435927    .1319013
   provincedum8 |   .0744295   .0441431     1.69   0.092    -.0122356    .1610946
   provincedum9 |   .0214422   .0450398     0.48   0.634    -.0669834    .1098679
  provincedum10 |   .0186166   .0460168     0.40   0.686    -.0717272    .1089605
  provincedum11 |   .0229524   .0457414     0.50   0.616    -.0668507    .1127554
  provincedum12 |   .0323129   .0538833     0.60   0.549     -.073475    .1381007
  provincedum13 |  -.0052065   .0480927    -0.11   0.914    -.0996258    .0892128
  provincedum14 |   .0404638   .0473698     0.85   0.393    -.0525364    .1334639
  provincedum15 |   .0831745   .0497833     1.67   0.095     -.014564     .180913
              t |   -.004141    .000993    -4.17   0.000    -.0060905   -.0021915
              d |   .0177582   .0275823     0.64   0.520    -.0363935      .07191
             td |   -.001621   .0013403    -1.21   0.227    -.0042524    .0010105
          _cons |   4.038273   .3443529    11.73   0.000     3.362213    4.714334
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(29)   =      57.87
                                                  Prob > chi2     =     0.0011
                                                  R-squared       =     0.0122
                                                  Root MSE        =     .63461

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .9480505   11.94218     0.08   0.937     -22.4582     24.3543
  secgenhighedu |  -1.624916   15.81946    -0.10   0.918     -32.6305    29.38067
            exp |  -.3167371   .2377109    -1.33   0.183    -.7826418    .1491676
         expsqr |   .0066729   .0051385     1.30   0.194    -.0033983    .0167441
 birthmonthdum2 |   .1150458   .1693754     0.68   0.497    -.2169239    .4470154
 birthmonthdum3 |   .0614143   .2147205     0.29   0.775    -.3594301    .4822586
 birthmonthdum4 |   .0351075   .3071563     0.11   0.909    -.5669079    .6371229
 birthmonthdum5 |  -.0401741   .1584007    -0.25   0.800    -.3506337    .2702856
 birthmonthdum6 |   .1350351   .6428989     0.21   0.834    -1.125024    1.395094
 birthmonthdum7 |  -.1536029   .8597896    -0.18   0.858     -1.83876    1.531554
 birthmonthdum8 |   .0214972   .4670631     0.05   0.963    -.8939296     .936924
 birthmonthdum9 |  -.1835037   .4794856    -0.38   0.702    -1.123278    .7562708
birthmonthdum10 |  -.0780362   .9643066    -0.08   0.936    -1.968042     1.81197
birthmonthdum11 |  -.0955966   .4118886    -0.23   0.816    -.9028834    .7116902
birthmonthdum12 |    .059087    .248825     0.24   0.812    -.4286011     .546775
   provincedum2 |  -.2510119   .3802255    -0.66   0.509    -.9962402    .4942164
   provincedum3 |  -.0611202   .2865679    -0.21   0.831     -.622783    .5005425
   provincedum4 |  -.3430829   .3419004    -1.00   0.316    -1.013195    .3270295
   provincedum5 |  -.0462398   .4117342    -0.11   0.911    -.8532241    .7607444
   provincedum6 |   .0500521   .2180179     0.23   0.818    -.3772551    .4773593
   provincedum7 |  -.1484024   .3153645    -0.47   0.638    -.7665054    .4697007
   provincedum8 |  -.2425509   .3698442    -0.66   0.512    -.9674323    .4823305
   provincedum9 |   .0098466   .1913638     0.05   0.959    -.3652195    .3849128
  provincedum10 |  -.0543802   .2821203    -0.19   0.847    -.6073259    .4985654
  provincedum11 |  -.1778393   .4421666    -0.40   0.688     -1.04447    .6887913
  provincedum12 |  -.4226943   .6574673    -0.64   0.520    -1.711306    .8659179
  provincedum13 |  -.2941606   .4826117    -0.61   0.542    -1.240062     .651741
  provincedum14 |  -.3460991   .2197131    -1.58   0.115    -.7767288    .0845307
  provincedum15 |  -.4484347   .1791719    -2.50   0.012    -.7996051   -.0972643
          _cons |   12.21281   3.210266     3.80   0.000       5.9208    18.50481
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .233264  (p = 0.8899)
  Wu-Hausman F(2,716)             =  .111677  (p = 0.8943)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .917357  (p = 0.3382)
  Basmann chi2(1)        =  .880418  (p = 0.3481)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  25.645  Chi-sq(30) P-value = 0.6931

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0601604    .2379429          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748    .0909091    .2876721          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748    .0828877    .2758969          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu secg
> enhighedu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16
> 667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(16, 426)    =  46.76
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6372
                                                        Adj R-squared = 0.6236
                                                        Root MSE      = 0.1363

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4927082   .0335671   -14.68   0.000    -.5586859   -.4267305
         expsqr |   .0095955   .0007759    12.37   0.000     .0080705    .0111206
 birthmonthdum2 |  -.0315701   .0349607    -0.90   0.367    -.1002871    .0371469
 birthmonthdum3 |  -.0885733   .0382969    -2.31   0.021    -.1638477   -.0132989
 birthmonthdum4 |  -.1202148   .0386818    -3.11   0.002    -.1962458   -.0441839
 birthmonthdum5 |  -.0667532   .0363178    -1.84   0.067    -.1381376    .0046313
 birthmonthdum6 |  -.0799919   .0352248    -2.27   0.024    -.1492279   -.0107559
 birthmonthdum7 |  -.0467656   .0367249    -1.27   0.204    -.1189501     .025419
 birthmonthdum8 |  -.0683448   .0355591    -1.92   0.055    -.1382379    .0015484
 birthmonthdum9 |  -.0397896   .0353165    -1.13   0.261    -.1092058    .0296266
birthmonthdum10 |   -.050001   .0335935    -1.49   0.137    -.1160307    .0160286
birthmonthdum11 |  -.0361658   .0360236    -1.00   0.316    -.1069718    .0346402
birthmonthdum12 |  -.0566579   .0356384    -1.59   0.113    -.1267069     .013391
              t |  -.0016794   .0010896    -1.54   0.124     -.003821    .0004622
              d |  -.0015566   .0274651    -0.06   0.955    -.0555407    .0524274
             td |  -.0029379   .0013413    -2.19   0.029    -.0055744   -.0003015
          _cons |   6.341695   .3619551    17.52   0.000     5.630255    7.053136
---------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(16, 426)    =  26.85
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5021
                                                        Adj R-squared = 0.4834
                                                        Root MSE      = 0.1301

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4133551   .0320578   -12.89   0.000    -.4763663   -.3503439
         expsqr |   .0084255    .000741    11.37   0.000     .0069691     .009882
 birthmonthdum2 |   .0118778   .0333888     0.36   0.722    -.0537495    .0775052
 birthmonthdum3 |  -.0314074    .036575    -0.86   0.391    -.1032973    .0404826
 birthmonthdum4 |  -.0570999   .0369426    -1.55   0.123    -.1297123    .0155126
 birthmonthdum5 |  -.0316554   .0346849    -0.91   0.362    -.0998303    .0365195
 birthmonthdum6 |   -.016708    .033641    -0.50   0.620     -.082831    .0494151
 birthmonthdum7 |    .030031   .0350737     0.86   0.392     -.038908      .09897
 birthmonthdum8 |  -.0235705   .0339603    -0.69   0.488    -.0903211      .04318
 birthmonthdum9 |  -.0060759   .0337286    -0.18   0.857    -.0723711    .0602192
birthmonthdum10 |  -.0435287   .0320831    -1.36   0.176    -.1065895    .0195321
birthmonthdum11 |   -.029231   .0344039    -0.85   0.396    -.0968534    .0383915
birthmonthdum12 |  -.0201838    .034036    -0.59   0.553    -.0870832    .0467156
              t |  -.0002851   .0010406    -0.27   0.784    -.0023304    .0017603
              d |   .0100691   .0262303     0.38   0.701    -.0414878    .0616259
             td |  -.0020024    .001281    -1.56   0.119    -.0045203    .0005155
          _cons |   5.063853    .345681    14.65   0.000       4.3844    5.743306
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(15)   =      11.80
                                                  Prob > chi2     =     0.6940
                                                  R-squared       =          .
                                                  Root MSE        =      .6812

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.4114315   2.593065    -0.16   0.874    -5.493745    4.670882
  secgenhighedu |   2.471251   6.417748     0.39   0.700     -10.1073    15.04981
            exp |   .5130985   1.404992     0.37   0.715    -2.240636    3.266833
         expsqr |  -.0102878   .0295015    -0.35   0.727    -.0681097    .0475341
 birthmonthdum2 |   .1209118   .2180451     0.55   0.579    -.3064489    .5482724
 birthmonthdum3 |   .1381222   .1980202     0.70   0.485    -.2499902    .5262347
 birthmonthdum4 |   .1810433    .227427     0.80   0.426    -.2647054     .626792
 birthmonthdum5 |   .1149473   .1956587     0.59   0.557    -.2685368    .4984314
 birthmonthdum6 |   .2207463   .1978024     1.12   0.264    -.1669394    .6084319
 birthmonthdum7 |  -.0160963    .352336    -0.05   0.964    -.7066622    .6744697
 birthmonthdum8 |   .1446871   .1835616     0.79   0.431    -.2150869    .5044612
 birthmonthdum9 |   .0703268   .1766325     0.40   0.691    -.2758666    .4165202
birthmonthdum10 |   .1803919   .2354204     0.77   0.444    -.2810236    .6418074
birthmonthdum11 |   .1462618   .2088909     0.70   0.484    -.2631568    .5556805
birthmonthdum12 |  -.1062087   .1836156    -0.58   0.563    -.4660886    .2536713
          _cons |   1.365002   16.61373     0.08   0.935    -31.19731    33.92732
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .902262  (p = 0.6369)
  Wu-Hausman F(2,425)             =  .433684  (p = 0.6484)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  2.40099  (p = 0.1213)
  Basmann chi2(1)        =  2.32143  (p = 0.1276)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.613  Chi-sq(16) P-value = 0.8861

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
birthmont~m2 |        443    .0948081    .2932809          0          1
birthmonth~3 |        443    .0654628    .2476203          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        443    .0609481    .2395055          0          1
birthmonth~5 |        443    .0812641    .2735492          0          1
birthmonth~6 |        443    .0902935    .2869257          0          1
birthmonth~7 |        443    .0744921    .2628669          0          1
birthmonth~8 |        443    .0948081    .2932809          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        443    .0970655    .2963816          0          1
birthmont~10 |        443    .1173815    .3222382          0          1
birthmont~11 |        443    .0812641    .2735492          0          1
birthmont~12 |        443    .0857788    .2803537          0          1
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu secgenhighedu = t d td ) if inrange(t, -`months', `months'-1) & inra
> nge(monthlyearning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(30, 412)    =  26.12
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6554
                                                        Adj R-squared = 0.6304
                                                        Root MSE      = 0.1350

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4949005   .0345194   -14.34   0.000    -.5627567   -.4270443
         expsqr |   .0095319   .0007976    11.95   0.000      .007964    .0110997
 birthmonthdum2 |  -.0174578   .0356927    -0.49   0.625    -.0876202    .0527047
 birthmonthdum3 |  -.0675315   .0392887    -1.72   0.086    -.1447629    .0096999
 birthmonthdum4 |  -.1138887   .0393045    -2.90   0.004     -.191151   -.0366263
 birthmonthdum5 |  -.0575525   .0369154    -1.56   0.120    -.1301186    .0150135
 birthmonthdum6 |  -.0676118   .0360681    -1.87   0.062    -.1385122    .0032887
 birthmonthdum7 |  -.0343947      .0371    -0.93   0.354    -.1073237    .0385343
 birthmonthdum8 |  -.0442274    .037162    -1.19   0.235    -.1172782    .0288233
 birthmonthdum9 |  -.0289846   .0365587    -0.79   0.428    -.1008494    .0428802
birthmonthdum10 |   -.033405   .0348817    -0.96   0.339    -.1019733    .0351632
birthmonthdum11 |  -.0217604   .0365594    -0.60   0.552    -.0936267    .0501059
birthmonthdum12 |  -.0427544   .0368956    -1.16   0.247    -.1152814    .0297727
   provincedum2 |   .1297945   .0578523     2.24   0.025      .016072    .2435169
   provincedum3 |   .1226651   .0732846     1.67   0.095    -.0213932    .2667234
   provincedum4 |   .1200876   .0616524     1.95   0.052     -.001105    .2412801
   provincedum5 |   .1248739   .0488696     2.56   0.011      .028809    .2209389
   provincedum6 |   .1790987   .0526248     3.40   0.001     .0756521    .2825453
   provincedum7 |   .1516125    .051056     2.97   0.003     .0512497    .2519753
   provincedum8 |   .1656194   .0494492     3.35   0.001     .0684152    .2628236
   provincedum9 |   .1099743   .0506426     2.17   0.030     .0104241    .2095244
  provincedum10 |   .1426888    .050207     2.84   0.005      .043995    .2413825
  provincedum11 |   .0979581   .0513621     1.91   0.057    -.0030063    .1989226
  provincedum12 |   .0853564   .0577701     1.48   0.140    -.0282046    .1989173
  provincedum13 |   .1392433   .0526681     2.64   0.009     .0357115    .2427751
  provincedum14 |   .1371482   .0518324     2.65   0.008     .0352593    .2390371
  provincedum15 |   .1578813   .0579273     2.73   0.007     .0440114    .2717511
              t |  -.0017668   .0011092    -1.59   0.112    -.0039472    .0004136
              d |  -.0081094   .0280651    -0.29   0.773    -.0632781    .0470592
             td |  -.0033494   .0013431    -2.49   0.013    -.0059897   -.0007092
          _cons |   6.287843   .3703746    16.98   0.000     5.559783    7.015903
---------------------------------------------------------------------------------

                                                        Number of obs =    443
                                                        F(30, 412)    =  14.07
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5060
                                                        Adj R-squared = 0.4701
                                                        Root MSE      = 0.1318

---------------------------------------------------------------------------------
  secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4176098   .0336945   -12.39   0.000    -.4838445   -.3513752
         expsqr |    .008504   .0007785    10.92   0.000     .0069737    .0100344
 birthmonthdum2 |   .0147181   .0348397     0.42   0.673    -.0537677    .0832039
 birthmonthdum3 |  -.0264544   .0383498    -0.69   0.491    -.1018402    .0489313
 birthmonthdum4 |  -.0537566   .0383652    -1.40   0.162    -.1291725    .0216594
 birthmonthdum5 |   -.027583   .0360332    -0.77   0.444     -.098415    .0432489
 birthmonthdum6 |  -.0116702   .0352061    -0.33   0.740    -.0808763    .0575359
 birthmonthdum7 |   .0348235   .0362134     0.96   0.337    -.0363627    .1060096
 birthmonthdum8 |  -.0153555   .0362739    -0.42   0.672    -.0866605    .0559496
 birthmonthdum9 |  -.0038479    .035685    -0.11   0.914    -.0739954    .0662995
birthmonthdum10 |   -.038553   .0340481    -1.13   0.258    -.1054826    .0283766
birthmonthdum11 |  -.0260318   .0356858    -0.73   0.466    -.0961807    .0441171
birthmonthdum12 |  -.0169001   .0360139    -0.47   0.639    -.0876939    .0538938
   provincedum2 |   .0214244   .0564698     0.38   0.705    -.0895805    .1324292
   provincedum3 |    .016382   .0715333     0.23   0.819    -.1242337    .1569978
   provincedum4 |   .0222755   .0601791     0.37   0.711    -.0960208    .1405719
   provincedum5 |   .0072967   .0477018     0.15   0.879    -.0864725     .101066
   provincedum6 |   .0339988   .0513672     0.66   0.508    -.0669757    .1349733
   provincedum7 |   .0198355   .0498359     0.40   0.691    -.0781289    .1177999
   provincedum8 |   .0261291   .0482675     0.54   0.589    -.0687521    .1210104
   provincedum9 |    .011302   .0494324     0.23   0.819    -.0858692    .1084731
  provincedum10 |   .0320786   .0490071     0.65   0.513    -.0642566    .1284139
  provincedum11 |   .0016121   .0501347     0.03   0.974    -.0969396    .1001638
  provincedum12 |  -.0131196   .0563896    -0.23   0.816    -.1239667    .0977275
  provincedum13 |   .0188115   .0514095     0.37   0.715    -.0822461    .1198692
  provincedum14 |   .0100375   .0505937     0.20   0.843    -.0894165    .1094915
  provincedum15 |   .0034797    .056543     0.06   0.951     -.107669    .1146283
              t |  -.0003648   .0010827    -0.34   0.736    -.0024931    .0017635
              d |   .0132213   .0273944     0.48   0.630     -.040629    .0670715
             td |  -.0020498    .001311    -1.56   0.119     -.004627    .0005273
          _cons |   5.098512   .3615237    14.10   0.000     4.387851    5.809173
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(29)   =      27.84
                                                  Prob > chi2     =     0.5265
                                                  R-squared       =          .
                                                  Root MSE        =     .73112

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -1.478003   2.240462    -0.66   0.509    -5.869227    2.913222
  secgenhighedu |   3.856212   6.031217     0.64   0.523    -7.964757    15.67718
            exp |   .6030467   1.448592     0.42   0.677    -2.236141    3.442235
         expsqr |   -.012207    .030416    -0.40   0.688    -.0718214    .0474073
 birthmonthdum2 |  -.0353037   .2153396    -0.16   0.870    -.4573615    .3867541
 birthmonthdum3 |  -.0451968   .2216201    -0.20   0.838    -.4795643    .3891707
 birthmonthdum4 |   .0420848   .2525896     0.17   0.868    -.4529817    .5371514
 birthmonthdum5 |  -.0037344   .2161963    -0.02   0.986    -.4274713    .4200025
 birthmonthdum6 |   .0531411   .2054158     0.26   0.796    -.3494665    .4557486
 birthmonthdum7 |  -.1948334     .33186    -0.59   0.557    -.8452669    .4556002
 birthmonthdum8 |  -.0100303   .2045788    -0.05   0.961    -.4109974    .3909368
 birthmonthdum9 |  -.0722793   .1948579    -0.37   0.711    -.4541937    .3096351
birthmonthdum10 |   .0992517   .2571562     0.39   0.700    -.4047652    .6032687
birthmonthdum11 |   .0370357   .2315595     0.16   0.873    -.4168126     .490884
birthmonthdum12 |  -.2670187   .2048458    -1.30   0.192    -.6685092    .1344718
   provincedum2 |  -.4667985   .3389068    -1.38   0.168    -1.131044    .1974465
   provincedum3 |  -.7737542   .4266491    -1.81   0.070    -1.609971    .0624626
   provincedum4 |  -.6004222   .3497713    -1.72   0.086    -1.285961     .085117
   provincedum5 |  -.2128119   .3289238    -0.65   0.518    -.8574906    .4318669
   provincedum6 |  -.2093042   .3267922    -0.64   0.522     -.849805    .4311967
   provincedum7 |  -.4876688   .3276911    -1.49   0.137    -1.129932    .1545938
   provincedum8 |  -.4456751   .3209139    -1.39   0.165    -1.074655    .1833046
   provincedum9 |   -.260005   .3082678    -0.84   0.399    -.8641987    .3441887
  provincedum10 |  -.2455484    .294743    -0.83   0.405     -.823234    .3321372
  provincedum11 |  -.3626007   .3269747    -1.11   0.267    -1.003459    .2782579
  provincedum12 |  -.4316768    .390157    -1.11   0.269     -1.19637    .3330168
  provincedum13 |  -.2567374    .322067    -0.80   0.425     -.887977    .3745022
  provincedum14 |  -.4994486   .3475863    -1.44   0.151    -1.180705    .1818081
  provincedum15 |  -.4972814   .4278482    -1.16   0.245    -1.335848    .3412856
          _cons |   .8245642   17.30576     0.05   0.962     -33.0941    34.74323
---------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  .754001  (p = 0.6859)
  Wu-Hausman F(2,411)             =  .350364  (p = 0.7046)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  2.60895  (p = 0.1063)
  Basmann chi2(1)        =  2.44075  (p = 0.1182)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  13.088  Chi-sq(30) P-value = 0.9969

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
birthmont~m2 |        443    .0948081    .2932809          0          1
birthmonth~3 |        443    .0654628    .2476203          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        443    .0609481    .2395055          0          1
birthmonth~5 |        443    .0812641    .2735492          0          1
birthmonth~6 |        443    .0902935    .2869257          0          1
birthmonth~7 |        443    .0744921    .2628669          0          1
birthmonth~8 |        443    .0948081    .2932809          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        443    .0970655    .2963816          0          1
birthmont~10 |        443    .1173815    .3222382          0          1
birthmont~11 |        443    .0812641    .2735492          0          1
birthmont~12 |        443    .0857788    .2803537          0          1
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male (higheredu
>  = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & ed
> ucat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(17, 1173)   =  84.14
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5494
                                                        Adj R-squared = 0.5429
                                                        Root MSE      = 0.1673

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4277388   .0234702   -18.22   0.000    -.4737871   -.3816906
         expsqr |   .0078934   .0005399    14.62   0.000     .0068342    .0089527
 birthmonthdum2 |  -.0208116   .0250118    -0.83   0.406    -.0698844    .0282612
 birthmonthdum3 |  -.0254591   .0275313    -0.92   0.355    -.0794751    .0285569
 birthmonthdum4 |  -.0203269   .0270845    -0.75   0.453    -.0734664    .0328125
 birthmonthdum5 |  -.0115507   .0256984    -0.45   0.653    -.0619706    .0388693
 birthmonthdum6 |  -.0322749   .0253198    -1.27   0.203     -.081952    .0174022
 birthmonthdum7 |  -.0218254   .0264141    -0.83   0.409    -.0736496    .0299989
 birthmonthdum8 |  -.0054395   .0254591    -0.21   0.831    -.0553898    .0445109
 birthmonthdum9 |   .0169999   .0245042     0.69   0.488     -.031077    .0650769
birthmonthdum10 |    .010197   .0247217     0.41   0.680    -.0383067    .0587007
birthmonthdum11 |   .0090446   .0255881     0.35   0.724    -.0411589    .0592481
birthmonthdum12 |   .0078417   .0257589     0.30   0.761    -.0426969    .0583803
           male |   .0118958   .0100722     1.18   0.238    -.0078657    .0316572
              t |  -.0036774   .0007483    -4.91   0.000    -.0051455   -.0022092
              d |   .0111393    .020119     0.55   0.580    -.0283339    .0506125
             td |   -.002702   .0009823    -2.75   0.006    -.0046294   -.0007747
          _cons |   5.707456   .2565592    22.25   0.000      5.20409    6.210823
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(15)   =     187.88
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1356
                                                  Root MSE        =     .62692

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .0390625   .2589548     0.15   0.880    -.4684795    .5466045
            exp |  -.2205184   .1544208    -1.43   0.153    -.5231775    .0821408
         expsqr |   .0047983   .0032093     1.50   0.135    -.0014917    .0110884
 birthmonthdum2 |   .1443368   .0933789     1.55   0.122    -.0386825     .327356
 birthmonthdum3 |   .0861233   .1031735     0.83   0.404    -.1160931    .2883398
 birthmonthdum4 |   .0884073    .101481     0.87   0.384    -.1104919    .2873064
 birthmonthdum5 |   .0055574   .0960156     0.06   0.954    -.1826297    .1937444
 birthmonthdum6 |   .2201017    .094799     2.32   0.020      .034299    .4059044
 birthmonthdum7 |   .0060812   .0989022     0.06   0.951    -.1877635    .1999258
 birthmonthdum8 |   .0919876   .0946391     0.97   0.331    -.0935017     .277477
 birthmonthdum9 |  -.0610586   .0912599    -0.67   0.503    -.2399247    .1178074
birthmonthdum10 |   .0753916   .0924938     0.82   0.415    -.1058928     .256676
birthmonthdum11 |   .0248994   .0957193     0.26   0.795     -.162707    .2125058
birthmonthdum12 |   .0042216   .0962581     0.04   0.965    -.1844409     .192884
           male |   .4776448   .0380009    12.57   0.000     .4031643    .5521252
          _cons |   10.26476   1.856602     5.53   0.000     6.625887    13.90363
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .364506  (p = 0.5460)
  Wu-Hausman F(1,1174)            =  .359413  (p = 0.5489)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .236221  (p = 0.8886)
  Basmann chi2(2)        =  .232697  (p = 0.8902)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  19.098  Chi-sq(17) P-value = 0.3230

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
birthmont~m2 |      1,191    .0940386    .2920051          0          1
birthmonth~3 |      1,191    .0621327    .2414977          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,191    .0654912    .2474945          0          1
birthmonth~5 |      1,191    .0831234    .2761847          0          1
birthmonth~6 |      1,191    .0906801    .2872743          0          1
birthmonth~7 |      1,191    .0747271     .263061          0          1
birthmonth~8 |      1,191    .0890008    .2848646          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,191    .1074727    .3098434          0          1
birthmont~10 |      1,191    .1007557    .3011314          0          1
birthmont~11 |      1,191    .0848027    .2787049          0          1
birthmont~12 |      1,191    .0839631    .2774489          0          1
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male provincedu
> m2-provincedum15 (higheredu  = t d td ) if inrange(t, -`months', `months'-1) & inrange(mont
> hlyearning, 200, 16667) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  1,191
                                                        F(31, 1159)   =  48.90
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5667
                                                        Adj R-squared = 0.5551
                                                        Root MSE      = 0.1651

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4209328   .0236547   -17.79   0.000    -.4673436   -.3745219
         expsqr |   .0076295   .0005446    14.01   0.000     .0065611    .0086979
 birthmonthdum2 |   -.016871   .0249562    -0.68   0.499    -.0658354    .0320935
 birthmonthdum3 |  -.0180612   .0273722    -0.66   0.509    -.0717658    .0356434
 birthmonthdum4 |  -.0190519   .0268784    -0.71   0.479    -.0717876    .0336838
 birthmonthdum5 |  -.0068923     .02552    -0.27   0.787     -.056963    .0431783
 birthmonthdum6 |  -.0246139   .0253329    -0.97   0.331    -.0743174    .0250895
 birthmonthdum7 |   -.013103   .0262162    -0.50   0.617    -.0645395    .0383335
 birthmonthdum8 |   .0073237   .0253693     0.29   0.773    -.0424511    .0570985
 birthmonthdum9 |   .0238145    .024412     0.98   0.330    -.0240822    .0717112
birthmonthdum10 |   .0196241   .0247186     0.79   0.427    -.0288741    .0681222
birthmonthdum11 |   .0170386   .0254763     0.67   0.504    -.0329462    .0670234
birthmonthdum12 |   .0152091   .0256939     0.59   0.554    -.0352027    .0656209
           male |    .011528   .0099637     1.16   0.248    -.0080209     .031077
   provincedum2 |   .0872432    .041896     2.08   0.038     .0050427    .1694437
   provincedum3 |   .1213672   .0498946     2.43   0.015     .0234733    .2192612
   provincedum4 |   .0830774   .0423261     1.96   0.050     .0000331    .1661217
   provincedum5 |   .0983329   .0335683     2.93   0.003     .0324715    .1641943
   provincedum6 |   .1537497   .0355709     4.32   0.000     .0839591    .2235402
   provincedum7 |   .1012143   .0341781     2.96   0.003     .0341563    .1682722
   provincedum8 |   .1379622   .0334347     4.13   0.000      .072363    .2035614
   provincedum9 |    .054468   .0342258     1.59   0.112    -.0126835    .1216196
  provincedum10 |   .0729505   .0345504     2.11   0.035     .0051622    .1407389
  provincedum11 |   .0646291   .0346375     1.87   0.062    -.0033301    .1325884
  provincedum12 |   .0830725   .0402161     2.07   0.039      .004168    .1619771
  provincedum13 |   .0657628    .036184     1.82   0.069    -.0052308    .1367563
  provincedum14 |   .0855766   .0355061     2.41   0.016     .0159133    .1552399
  provincedum15 |   .1237622   .0382276     3.24   0.001     .0487591    .1987653
              t |  -.0041925   .0007486    -5.60   0.000    -.0056613   -.0027238
              d |   .0158501   .0200019     0.79   0.428    -.0233939    .0550942
             td |  -.0027152   .0009735    -2.79   0.005    -.0046251   -.0008052
          _cons |   5.591549   .2565068    21.80   0.000     5.088279    6.094818
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      1,191
                                                  Wald chi2(29)   =     249.62
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1734
                                                  Root MSE        =     .61307

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.1662972   .2433265    -0.68   0.494    -.6432084     .310614
            exp |  -.2823163   .1475383    -1.91   0.056     -.571486    .0068534
         expsqr |    .006136   .0030685     2.00   0.046     .0001219    .0121501
 birthmonthdum2 |   .1052444    .092393     1.14   0.255    -.0758424    .2863313
 birthmonthdum3 |   .0355594   .1015538     0.35   0.726    -.1634824    .2346012
 birthmonthdum4 |   .0311504   .0998058     0.31   0.755    -.1644654    .2267663
 birthmonthdum5 |  -.0245629   .0944549    -0.26   0.795    -.2096911    .1605652
 birthmonthdum6 |   .1733379    .093811     1.85   0.065    -.0105283     .357204
 birthmonthdum7 |  -.0330314   .0969983    -0.34   0.733    -.2231447    .1570818
 birthmonthdum8 |   .0491881   .0931767     0.53   0.598    -.1334349    .2318111
 birthmonthdum9 |  -.1091707    .090073    -1.21   0.226    -.2857105    .0673691
birthmonthdum10 |   .0252787   .0915103     0.28   0.782    -.1540782    .2046355
birthmonthdum11 |  -.0270374   .0943793    -0.29   0.775    -.2120173    .1579426
birthmonthdum12 |  -.0492384   .0950215    -0.52   0.604     -.235477    .1370003
           male |   .4822217   .0372448    12.95   0.000     .4092231    .5552203
   provincedum2 |  -.3213666   .1547376    -2.08   0.038    -.6246469   -.0180864
   provincedum3 |  -.3230272   .1857591    -1.74   0.082    -.6871084    .0410539
   provincedum4 |  -.4229452   .1566076    -2.70   0.007    -.7298903       -.116
   provincedum5 |  -.1077103   .1240897    -0.87   0.385    -.3509216     .135501
   provincedum6 |  -.0718962   .1323714    -0.54   0.587    -.3313393    .1875469
   provincedum7 |  -.2734226   .1252313    -2.18   0.029    -.5188715   -.0279738
   provincedum8 |  -.3127908   .1238058    -2.53   0.012    -.5554458   -.0701359
   provincedum9 |  -.0945837   .1261441    -0.75   0.453    -.3418217    .1526543
  provincedum10 |  -.1143256   .1291867    -0.88   0.376    -.3675268    .1388756
  provincedum11 |  -.2447687   .1275578    -1.92   0.055    -.4947774      .00524
  provincedum12 |  -.4119205   .1485397    -2.77   0.006     -.703053    -.120788
  provincedum13 |  -.2538397   .1333187    -1.90   0.057    -.5151395    .0074601
  provincedum14 |  -.4090623   .1313966    -3.11   0.002    -.6665949   -.1515298
  provincedum15 |  -.5172032   .1410269    -3.67   0.000    -.7936108   -.2407956
          _cons |   11.25964   1.759044     6.40   0.000     7.811981    14.70731
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 male
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .075982  (p = 0.7828)
  Wu-Hausman F(1,1160)            =  .074009  (p = 0.7856)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .409515  (p = 0.8148)
  Basmann chi2(2)        =  .398649  (p = 0.8193)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  33.956  Chi-sq(31) P-value = 0.3270

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      1,191    8.124997    .6746072   5.298317   9.721166
         exp |      1,191    23.19647    2.655583         13         29
      expsqr |      1,191    545.1226     119.189        169        841
birthmont~m2 |      1,191    .0940386    .2920051          0          1
birthmonth~3 |      1,191    .0621327    .2414977          0          1
-------------+---------------------------------------------------------
birthmonth~4 |      1,191    .0654912    .2474945          0          1
birthmonth~5 |      1,191    .0831234    .2761847          0          1
birthmonth~6 |      1,191    .0906801    .2872743          0          1
birthmonth~7 |      1,191    .0747271     .263061          0          1
birthmonth~8 |      1,191    .0890008    .2848646          0          1
-------------+---------------------------------------------------------
birthmonth~9 |      1,191    .1074727    .3098434          0          1
birthmont~10 |      1,191    .1007557    .3011314          0          1
birthmont~11 |      1,191    .0848027    .2787049          0          1
birthmont~12 |      1,191    .0839631    .2774489          0          1
        male |      1,191    .6280437    .4835299          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu  = t
>  d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male =
> = 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(16, 731)    =  50.53
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5252
                                                        Adj R-squared = 0.5148
                                                        Root MSE      = 0.1819

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3854351   .0315715   -12.21   0.000    -.4474167   -.3234535
         expsqr |   .0068336   .0007241     9.44   0.000      .005412    .0082551
 birthmonthdum2 |  -.0191298   .0336044    -0.57   0.569    -.0851025    .0468429
 birthmonthdum3 |   .0129162   .0373223     0.35   0.729    -.0603554    .0861879
 birthmonthdum4 |   .0320915   .0360679     0.89   0.374    -.0387176    .1029005
 birthmonthdum5 |   .0192121    .034397     0.56   0.577    -.0483166    .0867409
 birthmonthdum6 |    -.00671   .0341493    -0.20   0.844    -.0737523    .0603324
 birthmonthdum7 |  -.0124698   .0355228    -0.35   0.726    -.0822086    .0572691
 birthmonthdum8 |   .0279299    .034408     0.81   0.417    -.0396203    .0954802
 birthmonthdum9 |   .0511066   .0325189     1.57   0.116     -.012735    .1149482
birthmonthdum10 |   .0432934   .0339398     1.28   0.203    -.0233376    .1099245
birthmonthdum11 |   .0327366   .0342443     0.96   0.339    -.0344923    .0999656
birthmonthdum12 |   .0460852   .0348727     1.32   0.187    -.0223775    .1145479
              t |   -.004465    .000996    -4.48   0.000    -.0064203   -.0025098
              d |   .0126712   .0277746     0.46   0.648    -.0418563    .0671988
             td |  -.0027973     .00135    -2.07   0.039    -.0054476    -.000147
          _cons |    5.28962    .347313    15.23   0.000      4.60777     5.97147
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(14)   =      22.46
                                                  Prob > chi2     =     0.0697
                                                  R-squared       =     0.0312
                                                  Root MSE        =     .62848

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.1680176   .2758781    -0.61   0.543    -.7087287    .3726934
            exp |  -.2752059   .1670687    -1.65   0.100    -.6026545    .0522428
         expsqr |   .0057156   .0034823     1.64   0.101    -.0011096    .0125408
 birthmonthdum2 |   .1344791   .1158475     1.16   0.246    -.0925778     .361536
 birthmonthdum3 |   .0891633   .1286249     0.69   0.488    -.1629369    .3412634
 birthmonthdum4 |   .0989851   .1245402     0.79   0.427    -.1451093    .3430795
 birthmonthdum5 |  -.0213811   .1184313    -0.18   0.857    -.2535021    .2107399
 birthmonthdum6 |   .2176091   .1169962     1.86   0.063    -.0116992    .4469174
 birthmonthdum7 |  -.0400647   .1225197    -0.33   0.744    -.2801989    .2000694
 birthmonthdum8 |   .0948562   .1179794     0.80   0.421    -.1363791    .3260916
 birthmonthdum9 |  -.1160611   .1120459    -1.04   0.300     -.335667    .1035449
birthmonthdum10 |   .0693383   .1168224     0.59   0.553    -.1596293     .298306
birthmonthdum11 |  -.0054402   .1178618    -0.05   0.963    -.2364451    .2255647
birthmonthdum12 |   .1023397   .1198366     0.85   0.393    -.1325357    .3372151
          _cons |   11.53326   2.005779     5.75   0.000     7.602005    15.46451
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .000142  (p = 0.9905)
  Wu-Hausman F(1,732)             =  .000139  (p = 0.9906)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .461303  (p = 0.7940)
  Basmann chi2(2)        =  .451097  (p = 0.7981)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  13.870  Chi-sq(16) P-value = 0.6084

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0601604    .2379429          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748    .0909091    .2876721          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748    .0828877    .2758969          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu  = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyea
> rning, 200, 16667) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    748
                                                        F(30, 717)    =  28.57
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5445
                                                        Adj R-squared = 0.5254
                                                        Root MSE      = 0.1799

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.3764884   .0318215   -11.83   0.000    -.4389629    -.314014
         expsqr |   .0065198   .0007305     8.92   0.000     .0050856     .007954
 birthmonthdum2 |  -.0281822   .0338055    -0.83   0.405    -.0945518    .0381874
 birthmonthdum3 |   .0053497   .0371881     0.14   0.886     -.067661    .0783604
 birthmonthdum4 |   .0226496    .035918     0.63   0.529    -.0478675    .0931666
 birthmonthdum5 |   .0152297   .0343641     0.44   0.658    -.0522367    .0826961
 birthmonthdum6 |  -.0095915   .0343182    -0.28   0.780    -.0769677    .0577847
 birthmonthdum7 |  -.0088972   .0353841    -0.25   0.802     -.078366    .0605716
 birthmonthdum8 |   .0231676   .0343055     0.68   0.500    -.0441837    .0905188
 birthmonthdum9 |   .0463144   .0324264     1.43   0.154    -.0173476    .1099763
birthmonthdum10 |   .0413811   .0338554     1.22   0.222    -.0250865    .1078487
birthmonthdum11 |   .0294558   .0343241     0.86   0.391    -.0379319    .0968435
birthmonthdum12 |   .0425571   .0347909     1.22   0.222    -.0257472    .1108614
   provincedum2 |   .0781477   .0582457     1.34   0.180    -.0362048    .1925003
   provincedum3 |   .1226871   .0664103     1.85   0.065    -.0076948     .253069
   provincedum4 |   .0686481   .0562711     1.22   0.223    -.0418276    .1791239
   provincedum5 |   .0914814   .0449143     2.04   0.042     .0033022    .1796606
   provincedum6 |   .1492551   .0472998     3.16   0.002     .0563924    .2421177
   provincedum7 |   .0817448   .0450174     1.82   0.070    -.0066368    .1701264
   provincedum8 |   .1266204   .0444623     2.85   0.005     .0393285    .2139123
   provincedum9 |   .0377928   .0453655     0.83   0.405    -.0512724     .126858
  provincedum10 |   .0441531   .0463496     0.95   0.341    -.0468442    .1351503
  provincedum11 |   .0651077   .0460722     1.41   0.158    -.0253449    .1555602
  provincedum12 |   .0962054    .054273     1.77   0.077    -.0103475    .2027583
  provincedum13 |   .0315249   .0484405     0.65   0.515    -.0635773    .1266271
  provincedum14 |   .0657647   .0477124     1.38   0.169    -.0279081    .1594374
  provincedum15 |   .1134843   .0501434     2.26   0.024      .015039    .2119297
              t |  -.0052157   .0010002    -5.21   0.000    -.0071793   -.0032521
              d |   .0191701   .0277818     0.69   0.490    -.0353733    .0737135
             td |  -.0024622     .00135    -1.82   0.069    -.0051127    .0001883
          _cons |   5.170363   .3468433    14.91   0.000     4.489413    5.851313
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        748
                                                  Wald chi2(28)   =      61.88
                                                  Prob > chi2     =     0.0002
                                                  R-squared       =     0.0765
                                                  Root MSE        =     .61362

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.2782951   .2597974    -1.07   0.284    -.7874886    .2308984
            exp |  -.2992873   .1607712    -1.86   0.063    -.6143931    .0158185
         expsqr |   .0062835   .0033542     1.87   0.061    -.0002905    .0128576
 birthmonthdum2 |   .1274206   .1151151     1.11   0.268    -.0982008    .3530421
 birthmonthdum3 |   .0788935   .1266155     0.62   0.533    -.1692683    .3270553
 birthmonthdum4 |   .0638551    .122366     0.52   0.602    -.1759777     .303688
 birthmonthdum5 |  -.0296574   .1168654    -0.25   0.800    -.2587094    .1993947
 birthmonthdum6 |   .1999073   .1161955     1.72   0.085    -.0278317    .4276464
 birthmonthdum7 |  -.0662192   .1203715    -0.55   0.582     -.302143    .1697047
 birthmonthdum8 |   .0678607   .1160641     0.58   0.559    -.1596208    .2953423
 birthmonthdum9 |  -.1356607   .1100607    -1.23   0.218    -.3513757    .0800544
birthmonthdum10 |   .0202588      .1149     0.18   0.860     -.204941    .2454586
birthmonthdum11 |  -.0551444   .1166512    -0.47   0.636    -.2837765    .1734877
birthmonthdum12 |   .0813658   .1179086     0.69   0.490     -.149731    .3124625
   provincedum2 |  -.2181158   .1981684    -1.10   0.271    -.6065188    .1702872
   provincedum3 |  -.0779889   .2270746    -0.34   0.731    -.5230469    .3670691
   provincedum4 |  -.3144665   .1916349    -1.64   0.101    -.6900641    .0611311
   provincedum5 |  -.0072006   .1531054    -0.05   0.962    -.3072817    .2928806
   provincedum6 |   .0357006   .1618266     0.22   0.825    -.2814737     .352875
   provincedum7 |  -.1203455   .1524079    -0.79   0.430    -.4190596    .1783685
   provincedum8 |  -.2081402   .1515169    -1.37   0.170    -.5051078    .0888274
   provincedum9 |   .0207228   .1541274     0.13   0.893    -.2813614    .3228071
  provincedum10 |  -.0308125   .1587256    -0.19   0.846     -.341909    .2802839
  provincedum11 |  -.1355765    .156566    -0.87   0.387    -.4424402    .1712873
  provincedum12 |  -.3580812   .1848961    -1.94   0.053    -.7204709    .0043085
  provincedum13 |  -.2477808   .1647506    -1.50   0.133    -.5706859    .0751244
  provincedum14 |  -.3315478   .1623881    -2.04   0.041    -.6498226    -.013273
  provincedum15 |  -.4450413   .1702749    -2.61   0.009     -.778774   -.1113086
          _cons |    11.9533   1.915132     6.24   0.000     8.199711    15.70689
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .222959  (p = 0.6368)
  Wu-Hausman F(1,718)             =  .214081  (p = 0.6437)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .992478  (p = 0.6088)
  Basmann chi2(2)        =   .95261  (p = 0.6211)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  25.971  Chi-sq(30) P-value = 0.6766

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        748    8.302069    .6389602   5.298317   9.721166
         exp |        748    23.20989    2.671694         13         29
      expsqr |        748    545.8275    120.0459        169        841
birthmont~m2 |        748    .0935829    .2914424          0          1
birthmonth~3 |        748    .0601604    .2379429          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        748    .0681818    .2522263          0          1
birthmonth~5 |        748    .0842246    .2779102          0          1
birthmonth~6 |        748    .0909091    .2876721          0          1
birthmonth~7 |        748    .0748663    .2633516          0          1
birthmonth~8 |        748    .0855615    .2799026          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        748    .1136364    .3175814          0          1
birthmont~10 |        748    .0909091    .2876721          0          1
birthmont~11 |        748    .0868984    .2818746          0          1
birthmont~12 |        748    .0828877    .2758969          0          1
        male |        748           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 (higheredu  = t
>  d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyearning, 200, 16667) & male =
> = 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(16, 426)    =  46.76
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6372
                                                        Adj R-squared = 0.6236
                                                        Root MSE      = 0.1363

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4927082   .0335671   -14.68   0.000    -.5586859   -.4267305
         expsqr |   .0095955   .0007759    12.37   0.000     .0080705    .0111206
 birthmonthdum2 |  -.0315701   .0349607    -0.90   0.367    -.1002871    .0371469
 birthmonthdum3 |  -.0885733   .0382969    -2.31   0.021    -.1638477   -.0132989
 birthmonthdum4 |  -.1202148   .0386818    -3.11   0.002    -.1962458   -.0441839
 birthmonthdum5 |  -.0667532   .0363178    -1.84   0.067    -.1381376    .0046313
 birthmonthdum6 |  -.0799919   .0352248    -2.27   0.024    -.1492279   -.0107559
 birthmonthdum7 |  -.0467656   .0367249    -1.27   0.204    -.1189501     .025419
 birthmonthdum8 |  -.0683448   .0355591    -1.92   0.055    -.1382379    .0015484
 birthmonthdum9 |  -.0397896   .0353165    -1.13   0.261    -.1092058    .0296266
birthmonthdum10 |   -.050001   .0335935    -1.49   0.137    -.1160307    .0160286
birthmonthdum11 |  -.0361658   .0360236    -1.00   0.316    -.1069718    .0346402
birthmonthdum12 |  -.0566579   .0356384    -1.59   0.113    -.1267069     .013391
              t |  -.0016794   .0010896    -1.54   0.124     -.003821    .0004622
              d |  -.0015566   .0274651    -0.06   0.955    -.0555407    .0524274
             td |  -.0029379   .0013413    -2.19   0.029    -.0055744   -.0003015
          _cons |   6.341695   .3619551    17.52   0.000     5.630255    7.053136
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(14)   =      14.04
                                                  Prob > chi2     =     0.4471
                                                  R-squared       =     0.0164
                                                  Root MSE        =     .62072

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |   .5505949   .6327795     0.87   0.384    -.6896302     1.79082
            exp |  -.0052198    .366916    -0.01   0.989    -.7243619    .7139222
         expsqr |   .0006076   .0076093     0.08   0.936    -.0143064    .0155216
 birthmonthdum2 |   .1716786   .1582517     1.08   0.278     -.138489    .4818461
 birthmonthdum3 |   .1352841   .1803127     0.75   0.453    -.2181224    .4886906
 birthmonthdum4 |   .1466954   .1906286     0.77   0.442    -.2269298    .5203205
 birthmonthdum5 |   .0902967   .1684731     0.54   0.592    -.2399045    .4204979
 birthmonthdum6 |    .249675   .1667332     1.50   0.134     -.077116    .5764661
 birthmonthdum7 |    .099224   .1691292     0.59   0.557    -.2322631     .430711
 birthmonthdum8 |   .1425779   .1671885     0.85   0.394    -.1851054    .4702613
 birthmonthdum9 |   .0813036   .1588393     0.51   0.609    -.2300157    .3926228
birthmonthdum10 |   .1185432   .1568348     0.76   0.450    -.1888474    .4259338
birthmonthdum11 |   .1073738     .16662     0.64   0.519    -.2191953     .433943
birthmonthdum12 |  -.1047553   .1672768    -0.63   0.531    -.4326118    .2231012
          _cons |   7.481482   4.436566     1.69   0.092    -1.214027    16.17699
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12 t d
            td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .730807  (p = 0.3926)
  Wu-Hausman F(1,427)             =  .705576  (p = 0.4014)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  3.07029  (p = 0.2154)
  Basmann chi2(2)        =  2.97307  (p = 0.2262)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  13.413  Chi-sq(16) P-value = 0.6424

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
birthmont~m2 |        443    .0948081    .2932809          0          1
birthmonth~3 |        443    .0654628    .2476203          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        443    .0609481    .2395055          0          1
birthmonth~5 |        443    .0812641    .2735492          0          1
birthmonth~6 |        443    .0902935    .2869257          0          1
birthmonth~7 |        443    .0744921    .2628669          0          1
birthmonth~8 |        443    .0948081    .2932809          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        443    .0970655    .2963816          0          1
birthmont~10 |        443    .1173815    .3222382          0          1
birthmont~11 |        443    .0812641    .2735492          0          1
birthmont~12 |        443    .0857788    .2803537          0          1
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 provincedum2-pr
> ovincedum15 (higheredu = t d td ) if inrange(t, -`months', `months'-1) & inrange(monthlyear
> ning, 200, 16667) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =    443
                                                        F(30, 412)    =  26.12
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6554
                                                        Adj R-squared = 0.6304
                                                        Root MSE      = 0.1350

---------------------------------------------------------------------------------
      higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            exp |  -.4949005   .0345194   -14.34   0.000    -.5627567   -.4270443
         expsqr |   .0095319   .0007976    11.95   0.000      .007964    .0110997
 birthmonthdum2 |  -.0174578   .0356927    -0.49   0.625    -.0876202    .0527047
 birthmonthdum3 |  -.0675315   .0392887    -1.72   0.086    -.1447629    .0096999
 birthmonthdum4 |  -.1138887   .0393045    -2.90   0.004     -.191151   -.0366263
 birthmonthdum5 |  -.0575525   .0369154    -1.56   0.120    -.1301186    .0150135
 birthmonthdum6 |  -.0676118   .0360681    -1.87   0.062    -.1385122    .0032887
 birthmonthdum7 |  -.0343947      .0371    -0.93   0.354    -.1073237    .0385343
 birthmonthdum8 |  -.0442274    .037162    -1.19   0.235    -.1172782    .0288233
 birthmonthdum9 |  -.0289846   .0365587    -0.79   0.428    -.1008494    .0428802
birthmonthdum10 |   -.033405   .0348817    -0.96   0.339    -.1019733    .0351632
birthmonthdum11 |  -.0217604   .0365594    -0.60   0.552    -.0936267    .0501059
birthmonthdum12 |  -.0427544   .0368956    -1.16   0.247    -.1152814    .0297727
   provincedum2 |   .1297945   .0578523     2.24   0.025      .016072    .2435169
   provincedum3 |   .1226651   .0732846     1.67   0.095    -.0213932    .2667234
   provincedum4 |   .1200876   .0616524     1.95   0.052     -.001105    .2412801
   provincedum5 |   .1248739   .0488696     2.56   0.011      .028809    .2209389
   provincedum6 |   .1790987   .0526248     3.40   0.001     .0756521    .2825453
   provincedum7 |   .1516125    .051056     2.97   0.003     .0512497    .2519753
   provincedum8 |   .1656194   .0494492     3.35   0.001     .0684152    .2628236
   provincedum9 |   .1099743   .0506426     2.17   0.030     .0104241    .2095244
  provincedum10 |   .1426888    .050207     2.84   0.005      .043995    .2413825
  provincedum11 |   .0979581   .0513621     1.91   0.057    -.0030063    .1989226
  provincedum12 |   .0853564   .0577701     1.48   0.140    -.0282046    .1989173
  provincedum13 |   .1392433   .0526681     2.64   0.009     .0357115    .2427751
  provincedum14 |   .1371482   .0518324     2.65   0.008     .0352593    .2390371
  provincedum15 |   .1578813   .0579273     2.73   0.007     .0440114    .2717511
              t |  -.0017668   .0011092    -1.59   0.112    -.0039472    .0004136
              d |  -.0081094   .0280651    -0.29   0.773    -.0632781    .0470592
             td |  -.0033494   .0013431    -2.49   0.013    -.0059897   -.0007092
          _cons |   6.287843   .3703746    16.98   0.000     5.559783    7.015903
---------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        443
                                                  Wald chi2(28)   =      40.83
                                                  Prob > chi2     =     0.0556
                                                  R-squared       =     0.0833
                                                  Root MSE        =     .59924

---------------------------------------------------------------------------------
log_monthlyea~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
      higheredu |  -.1170123    .572928    -0.20   0.838    -1.239931    1.005906
            exp |  -.2846292   .3388373    -0.84   0.401    -.9487382    .3794798
         expsqr |   .0064498   .0070354     0.92   0.359    -.0073393    .0202388
 birthmonthdum2 |   .0275147   .1570551     0.18   0.861    -.2803076    .3353371
 birthmonthdum3 |  -.0778058   .1767686    -0.44   0.660    -.4242659    .2686544
 birthmonthdum4 |  -.0310368   .1845914    -0.17   0.866    -.3928293    .3307557
 birthmonthdum5 |  -.0548806   .1646225    -0.33   0.739    -.3775349    .2677736
 birthmonthdum6 |   .0842928   .1635582     0.52   0.606    -.2362753    .4048609
 birthmonthdum7 |  -.0259088   .1645946    -0.16   0.875    -.3485082    .2966906
 birthmonthdum8 |  -.0316223   .1653763    -0.19   0.848    -.3557539    .2925092
 birthmonthdum9 |  -.0721605    .159709    -0.45   0.651    -.3851844    .2408635
birthmonthdum10 |  -.0107721   .1566259    -0.07   0.945    -.3177533     .296209
birthmonthdum11 |  -.0382421   .1634269    -0.23   0.815     -.358553    .2820689
birthmonthdum12 |  -.2822992   .1667489    -1.69   0.090    -.6091209    .0445226
   provincedum2 |   -.555405   .2534895    -2.19   0.028    -1.052235   -.0585746
   provincedum3 |  -.8801325   .3220043    -2.73   0.006    -1.511249   -.2490156
   provincedum4 |  -.6729561   .2711813    -2.48   0.013    -1.204462   -.1414505
   provincedum5 |  -.3418396   .2128902    -1.61   0.108    -.7590968    .0754175
   provincedum6 |  -.3123455   .2330093    -1.34   0.180    -.7690353    .1443444
   provincedum7 |  -.6080838    .219793    -2.77   0.006     -1.03887   -.1772975
   provincedum8 |  -.5617232   .2169167    -2.59   0.010    -.9868722   -.1365743
   provincedum9 |  -.3545553   .2216924    -1.60   0.110    -.7890644    .0799539
  provincedum10 |  -.3092159   .2273724    -1.36   0.174    -.7548576    .1364258
  provincedum11 |  -.4797305   .2219825    -2.16   0.031    -.9148082   -.0446528
  provincedum12 |  -.5868677   .2503638    -2.34   0.019    -1.077572   -.0961637
  provincedum13 |  -.3587192   .2293265    -1.56   0.118    -.8081909    .0907524
  provincedum14 |  -.6336706   .2270609    -2.79   0.005    -1.078702   -.1886394
  provincedum15 |  -.6849863   .2550943    -2.69   0.007    -1.184962   -.1850106
          _cons |   11.42916   4.048454     2.82   0.005     3.494341    19.36399
---------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr birthmonthdum2 birthmonthdum3 birthmonthdum4
            birthmonthdum5 birthmonthdum6 birthmonthdum7 birthmonthdum8
            birthmonthdum9 birthmonthdum10 birthmonthdum11 birthmonthdum12
            provincedum2 provincedum3 provincedum4 provincedum5 provincedum6
            provincedum7 provincedum8 provincedum9 provincedum10 provincedum11
            provincedum12 provincedum13 provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  .083885  (p = 0.7721)
  Wu-Hausman F(1,413)             =  .078219  (p = 0.7799)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =   4.4922  (p = 0.1058)
  Basmann chi2(2)        =  4.22065  (p = 0.1212)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  29.354  Chi-sq(30) P-value = 0.4991

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr birthmonthdum2-birthmonthdum12 male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |        443    7.826012    .6265817   5.298317   9.472705
         exp |        443    23.17381    2.631009         15         29
      expsqr |        443    543.9323    117.8535        225        841
birthmont~m2 |        443    .0948081    .2932809          0          1
birthmonth~3 |        443    .0654628    .2476203          0          1
-------------+---------------------------------------------------------
birthmonth~4 |        443    .0609481    .2395055          0          1
birthmonth~5 |        443    .0812641    .2735492          0          1
birthmonth~6 |        443    .0902935    .2869257          0          1
birthmonth~7 |        443    .0744921    .2628669          0          1
birthmonth~8 |        443    .0948081    .2932809          0          1
-------------+---------------------------------------------------------
birthmonth~9 |        443    .0970655    .2963816          0          1
birthmont~10 |        443    .1173815    .3222382          0          1
birthmont~11 |        443    .0812641    .2735492          0          1
birthmont~12 |        443    .0857788    .2803537          0          1
        male |        443           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth Dummies/Exp/R
> ural/IV Rural ATF&Birth Exp 1979 3years.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/ATF + Birthmonth 
> Dummies/Exp/Rural/IV Rural ATF&Birth Exp 1979 3years.log
  log type:  text
 closed on:   8 Aug 2024, 12:36:22
---------------------------------------------------------------------------------------------
