---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/
> Selmlog Job-types & Unemployment/Rural/Selmlog Rural (1) Unemployment A20=5 (2) Unemploymen
> t A20=5|9 (3) High occupation (4) Long-term contract.log
  log type:  text
 opened on:   8 Aug 2024, 12:17:09

. use "`datapath'", clear

. ****Because the selmlog identifying variables take too much time to run, I combine the unem
> ployment, high occupation, and long-term contract dependent variables into this one .do fil
> e. If you wish to run one seperately, simply delete or nullify the other two parts of regre
> ssions. Search *1) Unemployment A20=5, *2) Unemployment A20=5|9, *3) High occupation, or *4
> ) Long-term contract in this file to jump to the regressions!
. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. 
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *6) Instrument
. 
. gen yearat15 = birthyear+15
(7 missing values generated)

. local obsnum = _N

. 
. forval i =  1/`obsnum' {
  2.         
.         *extract the observation's year at age 15
.         qui sum yearat15  in `i'
  3.         local yearvalue = round(mod(r(mean),100))
  4.         
.         *get the variables' names for this observation
.         *graduates of mid and sec schools
.         if inrange(`yearvalue', 0, 9) {
  5.                 local czgrad_year = "czgrad0`yearvalue'"
  6.                 local gzgrad_year = "gzgrad0`yearvalue'"
  7.         }
  8.         else {
  9.                 local czgrad_year = "czgrad`yearvalue'"
 10.                 local gzgrad_year = "gzgrad`yearvalue'"
 11.         }
 12.         *entrants of sec and universities
.         if inrange(`yearvalue'+1, 0, 9) {
 13.                 local gzentrant_year = "gzentrant0`=`yearvalue'+1'"
 14.                 local gxentrant_year = "gxentrant0`=`yearvalue'+1'"
 15.                 local vsentrant_year = "vsentrant0`=`yearvalue'+1'"
 16.                 local tsentrant_year = "tsentrant0`=`yearvalue'+1'"
 17.         }
 18.         else{
 19.                 if `yearvalue' == 99 {
 20.                 local gzentrant_year = "gzentrant00"
 21.                 local gxentrant_year = "gxentrant00"
 22.                 local vsentrant_year = "vsentrant00"
 23.                 local tsentrant_year = "tsentrant00"
 24.                 }
 25.         else {
 26.                 local gzentrant_year = "gzentrant`=`yearvalue'+1'"
 27.                 local gxentrant_year = "gxentrant`=`yearvalue'+1'"
 28.                 local vsentrant_year = "vsentrant`=`yearvalue'+1'"
 29.                 local tsentrant_year = "tsentrant`=`yearvalue'+1'"
 30.         }
 31.         }
 32.         
.         
.         *For Ins 1 & 2: check whether the variable names exist (whether we have those years
> ' or not)
.         capture ds `czgrad_year' `gzgrad_year' `gzentrant_year' `gxentrant_year'
 33.         if _rc == 0 {
 34.                 *generate/replace the instrument
.                 capture ds ins1_secgen_entrant_relative ins2_highedu_entrant_relative
 35.                 if _rc!=0 {
 36.                         qui gen ins1_secgen_entrant_relative = `gzentrant_year'/`czgrad_
> year' if _n == `i'
 37.                         qui gen ins2_highedu_entrant_relative = `gxentrant_year'/`gzgrad
> _year' if _n == `i'
 38.                 
.                 }
 39.                 else {
 40.                         qui replace ins1_secgen_entrant_relative = `gzentrant_year'/`czg
> rad_year' if _n == `i'
 41.                         qui replace ins2_highedu_entrant_relative = `gxentrant_year'/`gz
> grad_year' if _n == `i'
 42.                 }
 43.         }
 44.         
.         *For Ins 3
.         capture ds `czgrad_year' `vsentrant_year'
 45.         if _rc == 0 {
 46.                 *generate/replace the instrument
.                 capture ds ins3_vs_entrant_relative
 47.                 if _rc!=0 {
 48.                         qui gen ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_year
> ' if _n == `i'
 49.                 }
 50.                 else {
 51.                         qui replace ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_
> year' if _n == `i'
 52.                 }
 53.         }
 54. }

. 
. 
. sum ins1_secgen_entrant_relative, d

                ins1_secgen_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%       .15625       .0699308
 5%     .1682079       .0699308
10%     .1885442       .0699308       Obs              12,056
25%     .2211083       .0699308       Sum of wgt.      12,056

50%     .3033619                      Mean           .3236294
                        Largest       Std. dev.      .1151896
75%     .4300829       .6448125
90%     .4801857       .6448125       Variance       .0132686
95%     .5088161       .6448125       Skewness       .3696383
99%     .5762522       .6448125       Kurtosis       1.967837

. sum ins2_highedu_entrant_relative, d

                ins2_highedu_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1447144       .1281053
 5%     .1651736       .1380375
10%        .2112       .1380375       Obs              12,056
25%     .2949015       .1380375       Sum of wgt.      12,056

50%     .5866208                      Mean           .5873466
                        Largest       Std. dev.      .3496799
75%     .8063707       2.985416
90%       .96183       2.985416       Variance        .122276
95%     1.052114       2.985416       Skewness       1.750181
99%     2.036869       2.985416       Kurtosis       10.40442

. sum ins3_vs_entrant_relative, d

                  ins3_vs_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1185751       .0852398
 5%     .1373378       .0852398
10%     .1486554       .0852398       Obs              12,419
25%      .184019       .0852398       Sum of wgt.      12,419

50%      .234389                      Mean           .2488276
                        Largest       Std. dev.      .0852013
75%     .3009205       .6566039
90%     .3645212       .6566039       Variance       .0072593
95%     .4095488       .6566039       Skewness       .8011841
99%     .4754733       .6566039       Kurtosis         3.4377

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,408 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. *9) Tenure
. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. replace tenure = 0 if tenure == -1
(22 real changes made)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. *10) Dependent variables: job-types specifications
. 
. gen unemp_A20_5 = 1 if A20 == 5
(34,625 missing values generated)

. replace unemp_A20_5 = 0 if inrange(A20, 1, 4) | inrange(A20, 6, 9)
(33,965 real changes made)

. gen voc_unemp_A20_5 = unemp_A20_5 if educat == 1
(33,656 missing values generated)

. gen gen_unemp_A20_5 = unemp_A20_5 if educat == 2
(31,162 missing values generated)

. 
. gen unemp_A20_59 = unemp_A20_5
(660 missing values generated)

. replace unemp_A20_59 = 1 if A20 == 9
(3,867 real changes made)

. gen voc_unemp_A20_59 = unemp_A20_59 if educat == 1
(33,656 missing values generated)

. gen gen_unemp_A20_59 = unemp_A20_59 if educat == 2
(31,162 missing values generated)

. 
. gen highocc = 1 if C03_4 == 1 | C03_4 == 2
(33,090 missing values generated)

. replace highocc = 0 if inrange(C03_4, 3, 8)
(13,145 real changes made)

. gen voc_highocc = highocc if educat == 1
(33,956 missing values generated)

. gen gen_highocc = highocc if educat == 2
(32,578 missing values generated)

. 
. gen longtermcontract = 1 if C07_1 == 1 | C07_1 == 2
(33,392 missing values generated)

. replace longtermcontract = 0 if inrange(C07_1, 3, 5)
(10,891 real changes made)

. gen voc_longtermcontract= longtermcontract if educat == 1
(34,072 missing values generated)

. gen gen_longtermcontract = longtermcontract if educat == 2
(32,837 missing values generated)

. 
. sum unemp_A20_5, d

                         unemp_A20_5
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              34,347
25%            0              0       Sum of wgt.      34,347

50%            0                      Mean           .0111218
                        Largest       Std. dev.      .1048733
75%            0              1
90%            0              1       Variance       .0109984
95%            0              1       Skewness        9.32335
99%            1              1       Kurtosis       87.92486

. sum unemp_A20_59, d

                        unemp_A20_59
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              34,347
25%            0              0       Sum of wgt.      34,347

50%            0                      Mean            .123708
                        Largest       Std. dev.       .329253
75%            0              1
90%            1              1       Variance       .1084075
95%            1              1       Skewness       2.285765
99%            1              1       Kurtosis       6.224721

. sum highocc, d

                           highocc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              15,062
25%            0              0       Sum of wgt.      15,062

50%            0                      Mean           .1272739
                        Largest       Std. dev.      .3332906
75%            0              1
90%            1              1       Variance       .1110827
95%            1              1       Skewness       2.236717
99%            1              1       Kurtosis       6.002903

. sum longtermcontract, d

                      longtermcontract
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              12,506
25%            0              0       Sum of wgt.      12,506

50%            0                      Mean            .129138
                        Largest       Std. dev.       .335366
75%            0              1
90%            1              1       Variance       .1124704
95%            1              1       Skewness       2.211773
99%            1              1       Kurtosis       5.891941

. 
. 
. *Step Two: Regressions
. 
. *1) Unemployment A20=5
. 
. selmlog voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear
> , 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant
> _relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(9, 740)       =      0.93
       Model |  .163695411         9  .018188379   Prob > F        =    0.5017
    Residual |  14.5363046       740  .019643655   R-squared       =    0.0111
-------------+----------------------------------   Adj R-squared   =   -0.0009
       Total |        14.7       749  .019626168   Root MSE        =    .14016

------------------------------------------------------------------------------
voc_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0134382   .0105561     1.27   0.203    -.0072853    .0341616
         exp |  -.0047663   .0066086    -0.72   0.471    -.0177402    .0082076
      expsqr |   .0001609   .0001771     0.91   0.364    -.0001867    .0005085
  highvocedu |   -.000069    .019738    -0.00   0.997    -.0388182    .0386802
  highgenedu |  -.0184086   .0450427    -0.41   0.683    -.1068352    .0700181
    adultedu |   .0516535   .0274657     1.88   0.060    -.0022665    .1055734
         _m1 |  -.0321396   .0235722    -1.36   0.173    -.0784159    .0141367
         _m2 |   .0180654   .0562114     0.32   0.748    -.0922875    .1284182
         _m3 |  -.0097591   .0326186    -0.30   0.765    -.0737952     .054277
       _cons |   .0847448   .0746933     1.13   0.257    -.0618912    .2313808
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0200953          .        .       .            .           .
        rho1 |  -.2267214          .        .       .            .           .
        rho2 |    .127438          .        .       .            .           .
        rho3 |  -.0688433          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(
> birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(9, 740)       =      0.93
       Model |  .163695411         9  .018188379   Prob > F        =    0.5017
    Residual |  14.5363046       740  .019643655   R-squared       =    0.0111
-------------+----------------------------------   Adj R-squared   =   -0.0009
       Total |        14.7       749  .019626168   Root MSE        =    .14016

------------------------------------------------------------------------------
voc_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0134382   .0105561     1.27   0.203    -.0072853    .0341616
         exp |  -.0047663   .0066086    -0.72   0.471    -.0177402    .0082076
      expsqr |   .0001609   .0001771     0.91   0.364    -.0001867    .0005085
  highvocedu |   -.000069    .019738    -0.00   0.997    -.0388182    .0386802
  highgenedu |  -.0184086   .0450427    -0.41   0.683    -.1068352    .0700181
    adultedu |   .0516535   .0274657     1.88   0.060    -.0022665    .1055734
          m1 |  -.0321396   .0235722    -1.36   0.173    -.0784159    .0141367
          m2 |   .0180654   .0562114     0.32   0.748    -.0922875    .1284182
          m3 |  -.0097591   .0326186    -0.30   0.765    -.0737952     .054277
       _cons |   .0847448   .0746933     1.13   0.257    -.0618912    .2313808
------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_re
> lative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(23, 726)      =      1.74
       Model |  .767791651        23  .033382246   Prob > F        =    0.0175
    Residual |  13.9322083       726   .01919037   R-squared       =    0.0522
-------------+----------------------------------   Adj R-squared   =    0.0222
       Total |        14.7       749  .019626168   Root MSE        =    .13853

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0115046   .0106152     1.08   0.279    -.0093356    .0323448
          exp |   -.013274   .0090699    -1.46   0.144    -.0310804    .0045324
       expsqr |   .0003818   .0002432     1.57   0.117    -.0000956    .0008593
   highvocedu |   .0079277   .0200478     0.40   0.693    -.0314309    .0472862
   highgenedu |  -.0075579   .0454105    -0.17   0.868    -.0967095    .0815937
     adultedu |   .0425615   .0274346     1.55   0.121     -.011299    .0964221
 provincedum2 |   .0835936   .0520268     1.61   0.109    -.0185474    .1857346
 provincedum3 |   .0320931   .0546458     0.59   0.557    -.0751895    .1393757
 provincedum4 |   .2380795   .0583929     4.08   0.000     .1234404    .3527185
 provincedum5 |   .0342805   .0396202     0.87   0.387    -.0435033    .1120642
 provincedum6 |   .0525694   .0460677     1.14   0.254    -.0378724    .1430111
 provincedum7 |   .0328057   .0476041     0.69   0.491    -.0606524    .1262639
 provincedum8 |   .0502102   .0482351     1.04   0.298    -.0444867    .1449071
 provincedum9 |   .0427784   .0428831     1.00   0.319    -.0414113    .1269681
provincedum10 |   .0320357   .0444099     0.72   0.471    -.0551515    .1192229
provincedum11 |   .0899183   .0456143     1.97   0.049     .0003665      .17947
provincedum12 |    .017739   .0460124     0.39   0.700    -.0725943    .1080724
provincedum13 |   .0451401   .0443236     1.02   0.309    -.0418775    .1321578
provincedum14 |   .0389464   .0500021     0.78   0.436    -.0592195    .1371123
provincedum15 |   .0358109   .0518474     0.69   0.490    -.0659779    .1375997
          _m1 |  -.0668033   .0459823    -1.45   0.147    -.1570775    .0234708
          _m2 |   .1295513   .1043294     1.24   0.215     -.075272    .3343747
          _m3 |  -.0050161    .034862    -0.14   0.886    -.0734586    .0634264
        _cons |   .1991617   .1201845     1.66   0.098    -.0367889    .4351123
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0245524          .        .       .            .           .
        rho1 |  -.4263349          .        .       .            .           .
        rho2 |   .8267888          .        .       .            .           .
        rho3 |  -.0320125          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(23, 726)      =      1.74
       Model |  .767791651        23  .033382246   Prob > F        =    0.0175
    Residual |  13.9322083       726   .01919037   R-squared       =    0.0522
-------------+----------------------------------   Adj R-squared   =    0.0222
       Total |        14.7       749  .019626168   Root MSE        =    .13853

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0115046   .0106152     1.08   0.279    -.0093356    .0323448
          exp |   -.013274   .0090699    -1.46   0.144    -.0310804    .0045324
       expsqr |   .0003818   .0002432     1.57   0.117    -.0000956    .0008593
   highvocedu |   .0079277   .0200478     0.40   0.693    -.0314309    .0472862
   highgenedu |  -.0075579   .0454105    -0.17   0.868    -.0967095    .0815937
     adultedu |   .0425615   .0274346     1.55   0.121     -.011299    .0964221
 provincedum2 |   .0835936   .0520268     1.61   0.109    -.0185474    .1857346
 provincedum3 |   .0320931   .0546458     0.59   0.557    -.0751895    .1393757
 provincedum4 |   .2380795   .0583929     4.08   0.000     .1234404    .3527185
 provincedum5 |   .0342805   .0396202     0.87   0.387    -.0435033    .1120642
 provincedum6 |   .0525694   .0460677     1.14   0.254    -.0378724    .1430111
 provincedum7 |   .0328057   .0476041     0.69   0.491    -.0606524    .1262639
 provincedum8 |   .0502102   .0482351     1.04   0.298    -.0444867    .1449071
 provincedum9 |   .0427784   .0428831     1.00   0.319    -.0414113    .1269681
provincedum10 |   .0320357   .0444099     0.72   0.471    -.0551515    .1192229
provincedum11 |   .0899183   .0456143     1.97   0.049     .0003665      .17947
provincedum12 |    .017739   .0460124     0.39   0.700    -.0725943    .1080724
provincedum13 |   .0451401   .0443236     1.02   0.309    -.0418775    .1321578
provincedum14 |   .0389464   .0500021     0.78   0.436    -.0592195    .1371123
provincedum15 |   .0358109   .0518474     0.69   0.490    -.0659779    .1375997
           m1 |  -.0668033   .0459823    -1.45   0.147    -.1570775    .0234708
           m2 |   .1295513   .1043294     1.24   0.215     -.075272    .3343747
           m3 |  -.0050161    .034862    -0.14   0.886    -.0734586    .0634264
        _cons |   .1991617   .1201845     1.66   0.098    -.0367889    .4351123
-------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_5 male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(ed
> ucat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_ent
> rant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(7, 742)       =      0.75
       Model |  .103688207         7  .014812601   Prob > F        =    0.6271
    Residual |  14.5963118       742  .019671579   R-squared       =    0.0071
-------------+----------------------------------   Adj R-squared   =   -0.0023
       Total |        14.7       749  .019626168   Root MSE        =    .14026

------------------------------------------------------------------------------
voc_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0120053   .0105312     1.14   0.255    -.0086692    .0326799
         exp |  -.0049313   .0066105    -0.75   0.456    -.0179089    .0080462
      expsqr |   .0001688    .000177     0.95   0.340    -.0001786    .0005163
   higheredu |   .0133768     .01582     0.85   0.398    -.0176804     .044434
         _m1 |  -.0366632   .0234354    -1.56   0.118    -.0826708    .0093445
         _m2 |   .0250624    .056097     0.45   0.655    -.0850653    .1351901
         _m3 |   -.008745   .0326198    -0.27   0.789    -.0727831     .055293
       _cons |   .0951025   .0744613     1.28   0.202    -.0510774    .2412825
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0204306          .        .       .            .           .
        rho1 |  -.2565013          .        .       .            .           .
        rho2 |   .1753405          .        .       .            .           .
        rho3 |  -.0611817          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992
> )

      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(7, 742)       =      0.75
       Model |  .103688207         7  .014812601   Prob > F        =    0.6271
    Residual |  14.5963118       742  .019671579   R-squared       =    0.0071
-------------+----------------------------------   Adj R-squared   =   -0.0023
       Total |        14.7       749  .019626168   Root MSE        =    .14026

------------------------------------------------------------------------------
voc_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0120053   .0105312     1.14   0.255    -.0086692    .0326799
         exp |  -.0049313   .0066105    -0.75   0.456    -.0179089    .0080462
      expsqr |   .0001688    .000177     0.95   0.340    -.0001786    .0005163
   higheredu |   .0133768     .01582     0.85   0.398    -.0176804     .044434
          m1 |  -.0366632   .0234354    -1.56   0.118    -.0826708    .0093445
          m2 |   .0250624    .056097     0.45   0.655    -.0850653    .1351901
          m3 |   -.008745   .0326198    -0.27   0.789    -.0727831     .055293
       _cons |   .0951025   .0744613     1.28   0.202    -.0510774    .2412825
------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bir
> thyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_e
> ntrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(21, 728)      =      1.84
       Model |  .740320282        21  .035253347   Prob > F        =    0.0125
    Residual |  13.9596797       728  .019175384   R-squared       =    0.0504
-------------+----------------------------------   Adj R-squared   =    0.0230
       Total |        14.7       749  .019626168   Root MSE        =    .13848

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0104376   .0105731     0.99   0.324    -.0103199     .031195
          exp |  -.0134256   .0090435    -1.48   0.138    -.0311801    .0043289
       expsqr |   .0003884   .0002425     1.60   0.110    -.0000877    .0008646
    higheredu |   .0167835   .0158947     1.06   0.291    -.0144214    .0479884
 provincedum2 |   .0862648   .0519583     1.66   0.097    -.0157412    .1882708
 provincedum3 |   .0305556   .0545933     0.56   0.576    -.0766235    .1377346
 provincedum4 |    .240973   .0583168     4.13   0.000     .1264838    .3554622
 provincedum5 |   .0330458   .0395321     0.84   0.403    -.0445647    .1106564
 provincedum6 |   .0517481   .0460322     1.12   0.261    -.0386236    .1421199
 provincedum7 |   .0323722   .0475624     0.68   0.496    -.0610037     .125748
 provincedum8 |   .0499596   .0481741     1.04   0.300    -.0446171    .1445363
 provincedum9 |   .0429513   .0428649     1.00   0.317    -.0412023    .1271049
provincedum10 |    .032761   .0443875     0.74   0.461    -.0543818    .1199039
provincedum11 |   .0918362   .0455684     2.02   0.044     .0023751    .1812972
provincedum12 |   .0195146   .0459704     0.42   0.671    -.0707358     .109765
provincedum13 |   .0455826   .0443014     1.03   0.304    -.0413912    .1325563
provincedum14 |   .0376178   .0499021     0.75   0.451    -.0603514    .1355869
provincedum15 |   .0361824   .0518125     0.70   0.485    -.0655374    .1379021
          _m1 |  -.0701945   .0458761    -1.53   0.126    -.1602597    .0198707
          _m2 |   .1343436   .1040961     1.29   0.197    -.0700208    .3387079
          _m3 |  -.0046296   .0348469    -0.13   0.894     -.073042    .0637828
        _cons |   .2065783   .1197444     1.73   0.085    -.0285072    .4416639
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0251212          .        .       .            .           .
        rho1 |  -.4428763          .        .       .            .           .
        rho2 |   .8476106          .        .       .            .           .
        rho3 |  -.0292094          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if in
> range(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(21, 728)      =      1.84
       Model |  .740320282        21  .035253347   Prob > F        =    0.0125
    Residual |  13.9596797       728  .019175384   R-squared       =    0.0504
-------------+----------------------------------   Adj R-squared   =    0.0230
       Total |        14.7       749  .019626168   Root MSE        =    .13848

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0104376   .0105731     0.99   0.324    -.0103199     .031195
          exp |  -.0134256   .0090435    -1.48   0.138    -.0311801    .0043289
       expsqr |   .0003884   .0002425     1.60   0.110    -.0000877    .0008646
    higheredu |   .0167835   .0158947     1.06   0.291    -.0144214    .0479884
 provincedum2 |   .0862648   .0519583     1.66   0.097    -.0157412    .1882708
 provincedum3 |   .0305556   .0545933     0.56   0.576    -.0766235    .1377346
 provincedum4 |    .240973   .0583168     4.13   0.000     .1264838    .3554622
 provincedum5 |   .0330458   .0395321     0.84   0.403    -.0445647    .1106564
 provincedum6 |   .0517481   .0460322     1.12   0.261    -.0386236    .1421199
 provincedum7 |   .0323722   .0475624     0.68   0.496    -.0610037     .125748
 provincedum8 |   .0499596   .0481741     1.04   0.300    -.0446171    .1445363
 provincedum9 |   .0429513   .0428649     1.00   0.317    -.0412023    .1271049
provincedum10 |    .032761   .0443875     0.74   0.461    -.0543818    .1199039
provincedum11 |   .0918362   .0455684     2.02   0.044     .0023751    .1812972
provincedum12 |   .0195146   .0459704     0.42   0.671    -.0707358     .109765
provincedum13 |   .0455826   .0443014     1.03   0.304    -.0413912    .1325563
provincedum14 |   .0376178   .0499021     0.75   0.451    -.0603514    .1355869
provincedum15 |   .0361824   .0518125     0.70   0.485    -.0655374    .1379021
           m1 |  -.0701945   .0458761    -1.53   0.126    -.1602597    .0198707
           m2 |   .1343436   .1040961     1.29   0.197    -.0700208    .3387079
           m3 |  -.0046296   .0348469    -0.13   0.894     -.073042    .0637828
        _cons |   .2065783   .1197444     1.73   0.085    -.0285072    .4416639
-------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear
> , 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant
> _relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(9, 1431)      =      1.27
       Model |  .218150122         9  .024238902   Prob > F        =    0.2465
    Residual |  27.2377833     1,431   .01903409   R-squared       =    0.0079
-------------+----------------------------------   Adj R-squared   =    0.0017
       Total |  27.4559334     1,440   .01906662   Root MSE        =    .13796

------------------------------------------------------------------------------
gen_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0009926   .0074427    -0.13   0.894    -.0155925    .0136072
         exp |  -.0040425   .0045698    -0.88   0.377    -.0130068    .0049218
      expsqr |   .0000619   .0001296     0.48   0.633    -.0001923    .0003161
  highvocedu |  -.0120369   .0101721    -1.18   0.237    -.0319907    .0079168
  highgenedu |   -.017205   .0118396    -1.45   0.146    -.0404298    .0060199
    adultedu |   .0353616   .0174286     2.03   0.043     .0011733    .0695498
         _m1 |  -.0166865    .058335    -0.29   0.775    -.1311178    .0977448
         _m2 |   .0037572   .0184488     0.20   0.839    -.0324323    .0399468
         _m3 |  -.0180485   .0410744    -0.44   0.660     -.098621     .062524
       _cons |   .0500122   .0241999     2.07   0.039      .002541    .0974833
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0189614          .        .       .            .           .
        rho1 |  -.1211798          .        .       .            .           .
        rho2 |   .0272855          .        .       .            .           .
        rho3 |  -.1310706          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(
> birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(9, 1431)      =      1.27
       Model |  .218150122         9  .024238902   Prob > F        =    0.2465
    Residual |  27.2377833     1,431   .01903409   R-squared       =    0.0079
-------------+----------------------------------   Adj R-squared   =    0.0017
       Total |  27.4559334     1,440   .01906662   Root MSE        =    .13796

------------------------------------------------------------------------------
gen_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0009926   .0074427    -0.13   0.894    -.0155925    .0136072
         exp |  -.0040425   .0045698    -0.88   0.377    -.0130068    .0049218
      expsqr |   .0000619   .0001296     0.48   0.633    -.0001923    .0003161
  highvocedu |  -.0120369   .0101721    -1.18   0.237    -.0319907    .0079168
  highgenedu |   -.017205   .0118396    -1.45   0.146    -.0404298    .0060199
    adultedu |   .0353616   .0174286     2.03   0.043     .0011733    .0695498
          m1 |  -.0166865    .058335    -0.29   0.775    -.1311178    .0977448
          m2 |   .0037572   .0184488     0.20   0.839    -.0324323    .0399468
          m3 |  -.0180485   .0410744    -0.44   0.660     -.098621     .062524
       _cons |   .0500122   .0241999     2.07   0.039      .002541    .0974833
------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_re
> lative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(23, 1417)     =      0.96
       Model |    .4222459        23  .018358517   Prob > F        =    0.5128
    Residual |  27.0336875     1,417  .019078114   R-squared       =    0.0154
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |  27.4559334     1,440   .01906662   Root MSE        =    .13812

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0015687   .0074943    -0.21   0.834    -.0162697    .0131323
          exp |  -.0039105   .0053512    -0.73   0.465    -.0144075    .0065866
       expsqr |   .0000679   .0001446     0.47   0.639    -.0002158    .0003516
   highvocedu |  -.0123132   .0105204    -1.17   0.242    -.0329504    .0083241
   highgenedu |  -.0173432   .0123089    -1.41   0.159    -.0414887    .0068024
     adultedu |   .0362201   .0176714     2.05   0.041     .0015551    .0708851
 provincedum2 |   .0108008   .0322128     0.34   0.737     -.052389    .0739907
 provincedum3 |   .0165116   .0311058     0.53   0.596    -.0445067    .0775298
 provincedum4 |  -.0078248   .0423198    -0.18   0.853     -.090841    .0751914
 provincedum5 |   .0084104   .0261126     0.32   0.747    -.0428132    .0596339
 provincedum6 |  -.0048138   .0287684    -0.17   0.867    -.0612471    .0516195
 provincedum7 |   .0356906   .0298686     1.19   0.232    -.0229008     .094282
 provincedum8 |   .0056742   .0290852     0.20   0.845    -.0513805     .062729
 provincedum9 |   .0344876   .0268138     1.29   0.199    -.0181115    .0870867
provincedum10 |   .0124904   .0271192     0.46   0.645    -.0407077    .0656885
provincedum11 |   .0151235   .0290459     0.52   0.603     -.041854     .072101
provincedum12 |  -.0160393   .0323522    -0.50   0.620    -.0795026     .047424
provincedum13 |   .0162272   .0289885     0.56   0.576    -.0406377    .0730922
provincedum14 |   .0095758   .0315359     0.30   0.761    -.0522862    .0714379
provincedum15 |   .0135576   .0295181     0.46   0.646    -.0443463    .0714615
          _m1 |  -.0533711   .0802736    -0.66   0.506     -.210839    .1040968
          _m2 |   .0071694   .0237931     0.30   0.763    -.0395041    .0538429
          _m3 |  -.0086439   .0435232    -0.20   0.843    -.0940208    .0767329
        _cons |   .0270165   .0414393     0.65   0.515    -.0542725    .1083054
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0194259          .        .       .            .           .
        rho1 |  -.3829266          .        .       .            .           .
        rho2 |   .0514392          .        .       .            .           .
        rho3 |  -.0620186          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(23, 1417)     =      0.96
       Model |    .4222459        23  .018358517   Prob > F        =    0.5128
    Residual |  27.0336875     1,417  .019078114   R-squared       =    0.0154
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |  27.4559334     1,440   .01906662   Root MSE        =    .13812

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0015687   .0074943    -0.21   0.834    -.0162697    .0131323
          exp |  -.0039105   .0053512    -0.73   0.465    -.0144075    .0065866
       expsqr |   .0000679   .0001446     0.47   0.639    -.0002158    .0003516
   highvocedu |  -.0123132   .0105204    -1.17   0.242    -.0329504    .0083241
   highgenedu |  -.0173432   .0123089    -1.41   0.159    -.0414887    .0068024
     adultedu |   .0362201   .0176714     2.05   0.041     .0015551    .0708851
 provincedum2 |   .0108008   .0322128     0.34   0.737     -.052389    .0739907
 provincedum3 |   .0165116   .0311058     0.53   0.596    -.0445067    .0775298
 provincedum4 |  -.0078248   .0423198    -0.18   0.853     -.090841    .0751914
 provincedum5 |   .0084104   .0261126     0.32   0.747    -.0428132    .0596339
 provincedum6 |  -.0048138   .0287684    -0.17   0.867    -.0612471    .0516195
 provincedum7 |   .0356906   .0298686     1.19   0.232    -.0229008     .094282
 provincedum8 |   .0056742   .0290852     0.20   0.845    -.0513805     .062729
 provincedum9 |   .0344876   .0268138     1.29   0.199    -.0181115    .0870867
provincedum10 |   .0124904   .0271192     0.46   0.645    -.0407077    .0656885
provincedum11 |   .0151235   .0290459     0.52   0.603     -.041854     .072101
provincedum12 |  -.0160393   .0323522    -0.50   0.620    -.0795026     .047424
provincedum13 |   .0162272   .0289885     0.56   0.576    -.0406377    .0730922
provincedum14 |   .0095758   .0315359     0.30   0.761    -.0522862    .0714379
provincedum15 |   .0135576   .0295181     0.46   0.646    -.0443463    .0714615
           m1 |  -.0533711   .0802736    -0.66   0.506     -.210839    .1040968
           m2 |   .0071694   .0237931     0.30   0.763    -.0395041    .0538429
           m3 |  -.0086439   .0435232    -0.20   0.843    -.0940208    .0767329
        _cons |   .0270165   .0414393     0.65   0.515    -.0542725    .1083054
-------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(ed
> ucat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_ent
> rant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(7, 1433)      =      0.51
       Model |  .067725441         7  .009675063   Prob > F        =    0.8304
    Residual |  27.3882079     1,433  .019112497   R-squared       =    0.0025
-------------+----------------------------------   Adj R-squared   =   -0.0024
       Total |  27.4559334     1,440   .01906662   Root MSE        =    .13825

------------------------------------------------------------------------------
gen_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0020011   .0074493    -0.27   0.788    -.0166138    .0126116
         exp |  -.0029343   .0045459    -0.65   0.519    -.0118517    .0059831
      expsqr |   .0000453   .0001294     0.35   0.726    -.0002085    .0002991
   higheredu |  -.0058872   .0090299    -0.65   0.515    -.0236004     .011826
         _m1 |  -.0265974   .0580576    -0.46   0.647    -.1404843    .0872896
         _m2 |   .0017962   .0184636     0.10   0.923    -.0344223    .0380148
         _m3 |  -.0226601   .0411222    -0.55   0.582    -.1033263     .058006
       _cons |    .035208   .0230055     1.53   0.126    -.0099201     .080336
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0191525          .        .       .            .           .
        rho1 |  -.1921881          .        .       .            .           .
        rho2 |   .0129793          .        .       .            .           .
        rho3 |  -.1637382          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992
> )

      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(7, 1433)      =      0.51
       Model |  .067725441         7  .009675063   Prob > F        =    0.8304
    Residual |  27.3882079     1,433  .019112497   R-squared       =    0.0025
-------------+----------------------------------   Adj R-squared   =   -0.0024
       Total |  27.4559334     1,440   .01906662   Root MSE        =    .13825

------------------------------------------------------------------------------
gen_unemp_~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0020011   .0074493    -0.27   0.788    -.0166138    .0126116
         exp |  -.0029343   .0045459    -0.65   0.519    -.0118517    .0059831
      expsqr |   .0000453   .0001294     0.35   0.726    -.0002085    .0002991
   higheredu |  -.0058872   .0090299    -0.65   0.515    -.0236004     .011826
          m1 |  -.0265974   .0580576    -0.46   0.647    -.1404843    .0872896
          m2 |   .0017962   .0184636     0.10   0.923    -.0344223    .0380148
          m3 |  -.0226601   .0411222    -0.55   0.582    -.1033263     .058006
       _cons |    .035208   .0230055     1.53   0.126    -.0099201     .080336
------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bir
> thyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_e
> ntrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(21, 1419)     =      0.67
       Model |  .269072248        21  .012812964   Prob > F        =    0.8666
    Residual |  27.1868611     1,419  .019159169   R-squared       =    0.0098
-------------+----------------------------------   Adj R-squared   =   -0.0049
       Total |  27.4559334     1,440   .01906662   Root MSE        =    .13842

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0025805   .0075012    -0.34   0.731    -.0172952    .0121342
          exp |  -.0031663   .0053501    -0.59   0.554    -.0136612    .0073286
       expsqr |   .0000592   .0001448     0.41   0.683    -.0002248    .0003433
    higheredu |  -.0054876   .0094107    -0.58   0.560     -.023948    .0129728
 provincedum2 |   .0172175   .0321667     0.54   0.593     -.045882     .080317
 provincedum3 |   .0176055   .0311009     0.57   0.571    -.0434032    .0786142
 provincedum4 |  -.0054937   .0423776    -0.13   0.897    -.0886233    .0776358
 provincedum5 |   .0109706   .0261461     0.42   0.675    -.0403186    .0622598
 provincedum6 |  -.0030196    .028806    -0.10   0.917    -.0595266    .0534874
 provincedum7 |   .0390831   .0298874     1.31   0.191    -.0195452    .0977114
 provincedum8 |   .0097655   .0290711     0.34   0.737    -.0472616    .0667925
 provincedum9 |   .0372088   .0268296     1.39   0.166    -.0154212    .0898387
provincedum10 |   .0161585   .0270832     0.60   0.551    -.0369689    .0692859
provincedum11 |   .0203022   .0290355     0.70   0.485     -.036655    .0772593
provincedum12 |  -.0076232   .0322798    -0.24   0.813    -.0709445    .0556981
provincedum13 |   .0226324   .0289474     0.78   0.434     -.034152    .0794168
provincedum14 |   .0147503   .0315003     0.47   0.640    -.0470418    .0765424
provincedum15 |   .0175286   .0294429     0.60   0.552    -.0402276    .0752848
          _m1 |  -.0700863   .0795522    -0.88   0.378    -.2261388    .0859662
          _m2 |   .0076611   .0238266     0.32   0.748    -.0390782    .0544003
          _m3 |  -.0136144   .0435634    -0.31   0.755      -.09907    .0718412
        _cons |   .0074777   .0402188     0.19   0.853     -.071417    .0863723
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0199994          .        .       .            .           .
        rho1 |  -.4955926          .        .       .            .           .
        rho2 |   .0541727          .        .       .            .           .
        rho3 |    -.09627          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if in
> range(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(21, 1419)     =      0.67
       Model |  .269072248        21  .012812964   Prob > F        =    0.8666
    Residual |  27.1868611     1,419  .019159169   R-squared       =    0.0098
-------------+----------------------------------   Adj R-squared   =   -0.0049
       Total |  27.4559334     1,440   .01906662   Root MSE        =    .13842

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0025805   .0075012    -0.34   0.731    -.0172952    .0121342
          exp |  -.0031663   .0053501    -0.59   0.554    -.0136612    .0073286
       expsqr |   .0000592   .0001448     0.41   0.683    -.0002248    .0003433
    higheredu |  -.0054876   .0094107    -0.58   0.560     -.023948    .0129728
 provincedum2 |   .0172175   .0321667     0.54   0.593     -.045882     .080317
 provincedum3 |   .0176055   .0311009     0.57   0.571    -.0434032    .0786142
 provincedum4 |  -.0054937   .0423776    -0.13   0.897    -.0886233    .0776358
 provincedum5 |   .0109706   .0261461     0.42   0.675    -.0403186    .0622598
 provincedum6 |  -.0030196    .028806    -0.10   0.917    -.0595266    .0534874
 provincedum7 |   .0390831   .0298874     1.31   0.191    -.0195452    .0977114
 provincedum8 |   .0097655   .0290711     0.34   0.737    -.0472616    .0667925
 provincedum9 |   .0372088   .0268296     1.39   0.166    -.0154212    .0898387
provincedum10 |   .0161585   .0270832     0.60   0.551    -.0369689    .0692859
provincedum11 |   .0203022   .0290355     0.70   0.485     -.036655    .0772593
provincedum12 |  -.0076232   .0322798    -0.24   0.813    -.0709445    .0556981
provincedum13 |   .0226324   .0289474     0.78   0.434     -.034152    .0794168
provincedum14 |   .0147503   .0315003     0.47   0.640    -.0470418    .0765424
provincedum15 |   .0175286   .0294429     0.60   0.552    -.0402276    .0752848
           m1 |  -.0700863   .0795522    -0.88   0.378    -.2261388    .0859662
           m2 |   .0076611   .0238266     0.32   0.748    -.0390782    .0544003
           m3 |  -.0136144   .0435634    -0.31   0.755      -.09907    .0718412
        _cons |   .0074777   .0402188     0.19   0.853     -.071417    .0863723
-------------------------------------------------------------------------------

. outreg2 using "`xlspath1'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5.xls
dir : seeout

. drop m1 m2 m3

. 
. *2) Unemployment A20=5|9
. 
. selmlog voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu if inrange(birthyea
> r, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(9, 740)       =      1.02
       Model |  .385367112         9  .042818568   Prob > F        =    0.4246
    Residual |  31.1626329       740  .042111666   R-squared       =    0.0122
-------------+----------------------------------   Adj R-squared   =    0.0002
       Total |      31.548       749   .04212016   Root MSE        =    .20521

------------------------------------------------------------------------------
voc_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0216432   .0154559    -1.40   0.162    -.0519858    .0086994
         exp |   .0031544   .0096761     0.33   0.745    -.0158416    .0221503
      expsqr |  -.0000184   .0002592    -0.07   0.943    -.0005274    .0004905
  highvocedu |  -.0348259   .0288998    -1.21   0.229    -.0915611    .0219094
  highgenedu |  -.0490488   .0659499    -0.74   0.457    -.1785201    .0804224
    adultedu |   .0520414   .0402143     1.29   0.196    -.0269063     .130989
         _m1 |  -.0299522   .0345136    -0.87   0.386    -.0977084    .0378039
         _m2 |  -.0894826   .0823028    -1.09   0.277    -.2510575    .0720922
         _m3 |  -.0111911   .0477591    -0.23   0.815    -.1049505    .0825683
       _cons |   .0183341   .1093633     0.17   0.867    -.1963652    .2330334
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0436127          .        .       .            .           .
        rho1 |  -.1434242          .        .       .            .           .
        rho2 |  -.4284817          .        .       .            .           .
        rho3 |  -.0535877          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange
> (birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(9, 740)       =      1.02
       Model |  .385367112         9  .042818568   Prob > F        =    0.4246
    Residual |  31.1626329       740  .042111666   R-squared       =    0.0122
-------------+----------------------------------   Adj R-squared   =    0.0002
       Total |      31.548       749   .04212016   Root MSE        =    .20521

------------------------------------------------------------------------------
voc_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0216432   .0154559    -1.40   0.162    -.0519858    .0086994
         exp |   .0031544   .0096761     0.33   0.745    -.0158416    .0221503
      expsqr |  -.0000184   .0002592    -0.07   0.943    -.0005274    .0004905
  highvocedu |  -.0348259   .0288998    -1.21   0.229    -.0915611    .0219094
  highgenedu |  -.0490488   .0659499    -0.74   0.457    -.1785201    .0804224
    adultedu |   .0520414   .0402143     1.29   0.196    -.0269063     .130989
          m1 |  -.0299522   .0345136    -0.87   0.386    -.0977084    .0378039
          m2 |  -.0894826   .0823028    -1.09   0.277    -.2510575    .0720922
          m3 |  -.0111911   .0477591    -0.23   0.815    -.1049505    .0825683
       _cons |   .0183341   .1093633     0.17   0.867    -.1963652    .2330334
------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_r
> elative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(23, 726)      =      1.83
       Model |  1.73218228        23  .075312273   Prob > F        =    0.0101
    Residual |  29.8158177       726  .041068619   R-squared       =    0.0549
-------------+----------------------------------   Adj R-squared   =    0.0250
       Total |      31.548       749   .04212016   Root MSE        =    .20265

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.024125    .015529    -1.55   0.121    -.0546121     .006362
          exp |   -.001269   .0132683    -0.10   0.924    -.0273179    .0247799
       expsqr |   .0001738   .0003558     0.49   0.625    -.0005246    .0008723
   highvocedu |  -.0238661   .0293278    -0.81   0.416    -.0814436    .0337114
   highgenedu |  -.0364055   .0664309    -0.55   0.584     -.166825     .094014
     adultedu |   .0406057   .0401339     1.01   0.312    -.0381867    .1193981
 provincedum2 |   .1070887   .0761098     1.41   0.160    -.0423329    .2565104
 provincedum3 |    .092741    .079941     1.16   0.246    -.0642023    .2496842
 provincedum4 |   .3287596   .0854227     3.85   0.000     .1610547    .4964646
 provincedum5 |   .0366442   .0579602     0.63   0.527    -.0771454    .1504337
 provincedum6 |   .0168725   .0673922     0.25   0.802    -.1154344    .1491793
 provincedum7 |   .0095666   .0696398     0.14   0.891    -.1271529    .1462861
 provincedum8 |   .0172781   .0705629     0.24   0.807    -.1212536    .1558099
 provincedum9 |   .0395057   .0627335     0.63   0.529    -.0836551    .1626665
provincedum10 |   .0811601   .0649671     1.25   0.212    -.0463857    .2087058
provincedum11 |   .0709484    .066729     1.06   0.288    -.0600565    .2019532
provincedum12 |  -.0058537   .0673114    -0.09   0.931    -.1380019    .1262946
provincedum13 |   .0830003   .0648407     1.28   0.201    -.0442974    .2102981
provincedum14 |   .0446819   .0731478     0.61   0.541    -.0989245    .1882884
provincedum15 |   .0278643   .0758474     0.37   0.713    -.1210421    .1767707
          _m1 |  -.0864639   .0672673    -1.29   0.199    -.2185256    .0455977
          _m2 |  -.0656814    .152623    -0.43   0.667    -.3653165    .2339538
          _m3 |  -.0102305   .0509995    -0.20   0.841    -.1103547    .0898936
        _cons |   .0746256   .1758173     0.42   0.671    -.2705455    .4197967
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .045311          .        .       .            .           .
        rho1 |  -.4061938          .        .       .            .           .
        rho2 |  -.3085606          .        .       .            .           .
        rho3 |  -.0480615          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(23, 726)      =      1.83
       Model |  1.73218228        23  .075312273   Prob > F        =    0.0101
    Residual |  29.8158177       726  .041068619   R-squared       =    0.0549
-------------+----------------------------------   Adj R-squared   =    0.0250
       Total |      31.548       749   .04212016   Root MSE        =    .20265

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.024125    .015529    -1.55   0.121    -.0546121     .006362
          exp |   -.001269   .0132683    -0.10   0.924    -.0273179    .0247799
       expsqr |   .0001738   .0003558     0.49   0.625    -.0005246    .0008723
   highvocedu |  -.0238661   .0293278    -0.81   0.416    -.0814436    .0337114
   highgenedu |  -.0364055   .0664309    -0.55   0.584     -.166825     .094014
     adultedu |   .0406057   .0401339     1.01   0.312    -.0381867    .1193981
 provincedum2 |   .1070887   .0761098     1.41   0.160    -.0423329    .2565104
 provincedum3 |    .092741    .079941     1.16   0.246    -.0642023    .2496842
 provincedum4 |   .3287596   .0854227     3.85   0.000     .1610547    .4964646
 provincedum5 |   .0366442   .0579602     0.63   0.527    -.0771454    .1504337
 provincedum6 |   .0168725   .0673922     0.25   0.802    -.1154344    .1491793
 provincedum7 |   .0095666   .0696398     0.14   0.891    -.1271529    .1462861
 provincedum8 |   .0172781   .0705629     0.24   0.807    -.1212536    .1558099
 provincedum9 |   .0395057   .0627335     0.63   0.529    -.0836551    .1626665
provincedum10 |   .0811601   .0649671     1.25   0.212    -.0463857    .2087058
provincedum11 |   .0709484    .066729     1.06   0.288    -.0600565    .2019532
provincedum12 |  -.0058537   .0673114    -0.09   0.931    -.1380019    .1262946
provincedum13 |   .0830003   .0648407     1.28   0.201    -.0442974    .2102981
provincedum14 |   .0446819   .0731478     0.61   0.541    -.0989245    .1882884
provincedum15 |   .0278643   .0758474     0.37   0.713    -.1210421    .1767707
           m1 |  -.0864639   .0672673    -1.29   0.199    -.2185256    .0455977
           m2 |  -.0656814    .152623    -0.43   0.667    -.3653165    .2339538
           m3 |  -.0102305   .0509995    -0.20   0.841    -.1103547    .0898936
        _cons |   .0746256   .1758173     0.42   0.671    -.2705455    .4197967
-------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_59 male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(7, 742)       =      0.78
       Model |  .231009837         7  .033001405   Prob > F        =    0.6026
    Residual |  31.3169902       742  .042206186   R-squared       =    0.0073
-------------+----------------------------------   Adj R-squared   =   -0.0020
       Total |      31.548       749   .04212016   Root MSE        =    .20544

------------------------------------------------------------------------------
voc_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0239583   .0154258    -1.55   0.121    -.0542417    .0063251
         exp |   .0028378   .0096829     0.29   0.770    -.0161713    .0218469
      expsqr |  -3.67e-06   .0002593    -0.01   0.989    -.0005126    .0005053
   higheredu |  -.0105393   .0231725    -0.45   0.649    -.0560309    .0349522
         _m1 |  -.0373877   .0343274    -1.09   0.276    -.1047782    .0300027
         _m2 |  -.0779707    .082169    -0.95   0.343    -.2392821    .0833408
         _m3 |  -.0092409   .0477804    -0.19   0.847    -.1030417    .0845599
       _cons |   .0357031   .1090685     0.33   0.743    -.1784165    .2498226
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0437782          .        .       .            .           .
        rho1 |    -.17869          .        .       .            .           .
        rho2 |  -.3726511          .        .       .            .           .
        rho3 |  -.0441656          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 199
> 2)

      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(7, 742)       =      0.78
       Model |  .231009837         7  .033001405   Prob > F        =    0.6026
    Residual |  31.3169902       742  .042206186   R-squared       =    0.0073
-------------+----------------------------------   Adj R-squared   =   -0.0020
       Total |      31.548       749   .04212016   Root MSE        =    .20544

------------------------------------------------------------------------------
voc_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0239583   .0154258    -1.55   0.121    -.0542417    .0063251
         exp |   .0028378   .0096829     0.29   0.770    -.0161713    .0218469
      expsqr |  -3.67e-06   .0002593    -0.01   0.989    -.0005126    .0005053
   higheredu |  -.0105393   .0231725    -0.45   0.649    -.0560309    .0349522
          m1 |  -.0373877   .0343274    -1.09   0.276    -.1047782    .0300027
          m2 |  -.0779707    .082169    -0.95   0.343    -.2392821    .0833408
          m3 |  -.0092409   .0477804    -0.19   0.847    -.1030417    .0845599
       _cons |   .0357031   .1090685     0.33   0.743    -.1784165    .2498226
------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bi
> rthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_
> entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(21, 728)      =      1.91
       Model |  1.64868031        21  .078508586   Prob > F        =    0.0084
    Residual |  29.8993197       728  .041070494   R-squared       =    0.0523
-------------+----------------------------------   Adj R-squared   =    0.0249
       Total |      31.548       749   .04212016   Root MSE        =    .20266

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0259365   .0154738    -1.68   0.094     -.056315     .004442
          exp |  -.0017204   .0132352    -0.13   0.897    -.0277042    .0242634
       expsqr |   .0001899   .0003549     0.54   0.593    -.0005069    .0008868
    higheredu |  -.0056635   .0232619    -0.24   0.808    -.0513319    .0400048
 provincedum2 |   .1117516    .076041     1.47   0.142    -.0375342    .2610374
 provincedum3 |   .0904872   .0798973     1.13   0.258    -.0663693    .2473438
 provincedum4 |   .3339352   .0853467     3.91   0.000     .1663802    .5014902
 provincedum5 |   .0338625   .0578553     0.59   0.559    -.0797206    .1474457
 provincedum6 |   .0151345   .0673682     0.22   0.822    -.1171247    .1473936
 provincedum7 |   .0083854   .0696076     0.12   0.904    -.1282702     .145041
 provincedum8 |   .0174501   .0705028     0.25   0.805     -.120963    .1558632
 provincedum9 |   .0399018   .0627328     0.64   0.525     -.083257    .1630606
provincedum10 |   .0823275   .0649612     1.27   0.205    -.0452062    .2098611
provincedum11 |   .0742631   .0666893     1.11   0.266    -.0566632    .2051894
provincedum12 |  -.0028224   .0672777    -0.04   0.967    -.1349039    .1292592
provincedum13 |   .0836005   .0648351     1.29   0.198    -.0436856    .2108867
provincedum14 |   .0431758   .0730317     0.59   0.555    -.1002021    .1865537
provincedum15 |   .0281454   .0758276     0.37   0.711    -.1207215    .1770123
          _m1 |  -.0923982   .0671397    -1.38   0.169    -.2242087    .0394123
          _m2 |  -.0559348   .1523447    -0.37   0.714    -.3550221    .2431526
          _m3 |  -.0095444   .0509984    -0.19   0.852     -.109666    .0905771
        _cons |   .0896737    .175246     0.51   0.609    -.2543741    .4337215
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0458762          .        .       .            .           .
        rho1 |  -.4313898          .        .       .            .           .
        rho2 |  -.2611488          .        .       .            .           .
        rho3 |   -.044561          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if i
> nrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(21, 728)      =      1.91
       Model |  1.64868031        21  .078508586   Prob > F        =    0.0084
    Residual |  29.8993197       728  .041070494   R-squared       =    0.0523
-------------+----------------------------------   Adj R-squared   =    0.0249
       Total |      31.548       749   .04212016   Root MSE        =    .20266

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0259365   .0154738    -1.68   0.094     -.056315     .004442
          exp |  -.0017204   .0132352    -0.13   0.897    -.0277042    .0242634
       expsqr |   .0001899   .0003549     0.54   0.593    -.0005069    .0008868
    higheredu |  -.0056635   .0232619    -0.24   0.808    -.0513319    .0400048
 provincedum2 |   .1117516    .076041     1.47   0.142    -.0375342    .2610374
 provincedum3 |   .0904872   .0798973     1.13   0.258    -.0663693    .2473438
 provincedum4 |   .3339352   .0853467     3.91   0.000     .1663802    .5014902
 provincedum5 |   .0338625   .0578553     0.59   0.559    -.0797206    .1474457
 provincedum6 |   .0151345   .0673682     0.22   0.822    -.1171247    .1473936
 provincedum7 |   .0083854   .0696076     0.12   0.904    -.1282702     .145041
 provincedum8 |   .0174501   .0705028     0.25   0.805     -.120963    .1558632
 provincedum9 |   .0399018   .0627328     0.64   0.525     -.083257    .1630606
provincedum10 |   .0823275   .0649612     1.27   0.205    -.0452062    .2098611
provincedum11 |   .0742631   .0666893     1.11   0.266    -.0566632    .2051894
provincedum12 |  -.0028224   .0672777    -0.04   0.967    -.1349039    .1292592
provincedum13 |   .0836005   .0648351     1.29   0.198    -.0436856    .2108867
provincedum14 |   .0431758   .0730317     0.59   0.555    -.1002021    .1865537
provincedum15 |   .0281454   .0758276     0.37   0.711    -.1207215    .1770123
           m1 |  -.0923982   .0671397    -1.38   0.169    -.2242087    .0394123
           m2 |  -.0559348   .1523447    -0.37   0.714    -.3550221    .2431526
           m3 |  -.0095444   .0509984    -0.19   0.852     -.109666    .0905771
        _cons |   .0896737    .175246     0.51   0.609    -.2543741    .4337215
-------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu if inrange(birthyea
> r, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entran
> t_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(9, 1431)      =      1.84
       Model |  .606327675         9  .067369742   Prob > F        =    0.0565
    Residual |  52.2944357     1,431   .03654398   R-squared       =    0.0115
-------------+----------------------------------   Adj R-squared   =    0.0052
       Total |  52.9007634     1,440  .036736641   Root MSE        =    .19116

------------------------------------------------------------------------------
gen_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0277828   .0103127    -2.69   0.007    -.0480125   -.0075531
         exp |  -.0033827    .006332    -0.53   0.593    -.0158038    .0090383
      expsqr |   .0000533   .0001796     0.30   0.766    -.0002989    .0004056
  highvocedu |  -.0220438   .0140945    -1.56   0.118     -.049692    .0056044
  highgenedu |  -.0347524   .0164051    -2.12   0.034     -.066933   -.0025718
    adultedu |   .0097389   .0241492     0.40   0.687    -.0376328    .0571106
         _m1 |   .0130202   .0808297     0.16   0.872    -.1455373    .1715777
         _m2 |   .0012209   .0255629     0.05   0.962    -.0489238    .0513656
         _m3 |   .0262411   .0569132     0.46   0.645    -.0854012    .1378834
       _cons |   .1117967   .0335317     3.33   0.001     .0460201    .1775733
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0363086          .        .       .            .           .
        rho1 |   .0683301          .        .       .            .           .
        rho2 |   .0064072          .        .       .            .           .
        rho3 |   .1377137          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange
> (birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(9, 1431)      =      1.84
       Model |  .606327675         9  .067369742   Prob > F        =    0.0565
    Residual |  52.2944357     1,431   .03654398   R-squared       =    0.0115
-------------+----------------------------------   Adj R-squared   =    0.0052
       Total |  52.9007634     1,440  .036736641   Root MSE        =    .19116

------------------------------------------------------------------------------
gen_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0277828   .0103127    -2.69   0.007    -.0480125   -.0075531
         exp |  -.0033827    .006332    -0.53   0.593    -.0158038    .0090383
      expsqr |   .0000533   .0001796     0.30   0.766    -.0002989    .0004056
  highvocedu |  -.0220438   .0140945    -1.56   0.118     -.049692    .0056044
  highgenedu |  -.0347524   .0164051    -2.12   0.034     -.066933   -.0025718
    adultedu |   .0097389   .0241492     0.40   0.687    -.0376328    .0571106
          m1 |   .0130202   .0808297     0.16   0.872    -.1455373    .1715777
          m2 |   .0012209   .0255629     0.05   0.962    -.0489238    .0513656
          m3 |   .0262411   .0569132     0.46   0.645    -.0854012    .1378834
       _cons |   .1117967   .0335317     3.33   0.001     .0460201    .1775733
------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_r
> elative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(23, 1417)     =      1.50
       Model |  1.25854091        23   .05471917   Prob > F        =    0.0600
    Residual |  51.6422224     1,417  .036444758   R-squared       =    0.0238
-------------+----------------------------------   Adj R-squared   =    0.0079
       Total |  52.9007634     1,440  .036736641   Root MSE        =    .19091

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0298546   .0103581    -2.88   0.004    -.0501733   -.0095358
          exp |   -.001349    .007396    -0.18   0.855    -.0158573    .0131593
       expsqr |   .0000217   .0001999     0.11   0.914    -.0003705    .0004138
   highvocedu |  -.0174059   .0145406    -1.20   0.231    -.0459293    .0111176
   highgenedu |  -.0293253   .0170125    -1.72   0.085    -.0626977    .0040471
     adultedu |   .0149196   .0244243     0.61   0.541    -.0329919    .0628312
 provincedum2 |   .0235871   .0445223     0.53   0.596    -.0637496    .1109239
 provincedum3 |   .0143511   .0429923     0.33   0.739    -.0699842    .0986865
 provincedum4 |   .0483969   .0584916     0.83   0.408    -.0663425    .1631364
 provincedum5 |   .0145869   .0360911     0.40   0.686    -.0562109    .0853847
 provincedum6 |  -.0020404   .0397618    -0.05   0.959    -.0800388    .0759579
 provincedum7 |   .0268483   .0412824     0.65   0.516    -.0541329    .1078294
 provincedum8 |   .0187272   .0401996     0.47   0.641      -.06013    .0975844
 provincedum9 |   .0776671   .0370603     2.10   0.036     .0049682    .1503661
provincedum10 |   .0423397   .0374824     1.13   0.259    -.0311871    .1158666
provincedum11 |   .0122189   .0401453     0.30   0.761    -.0665316    .0909694
provincedum12 |   .0387718    .044715     0.87   0.386    -.0489429    .1264866
provincedum13 |   .0110795   .0400659     0.28   0.782    -.0675154    .0896745
provincedum14 |    .009424   .0435868     0.22   0.829    -.0760775    .0949256
provincedum15 |   .0143795   .0407979     0.35   0.725    -.0656513    .0944103
          _m1 |  -.0171521   .1109488    -0.15   0.877    -.2347937    .2004895
          _m2 |  -.0003291   .0328852    -0.01   0.992    -.0648381    .0641799
          _m3 |   .0434489   .0601549     0.72   0.470    -.0745533     .161451
        _cons |   .0677479   .0572746     1.18   0.237    -.0446043       .1801
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0358472          .        .       .            .           .
        rho1 |   -.090592          .        .       .            .           .
        rho2 |  -.0017384          .        .       .            .           .
        rho3 |   .2294832          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(23, 1417)     =      1.50
       Model |  1.25854091        23   .05471917   Prob > F        =    0.0600
    Residual |  51.6422224     1,417  .036444758   R-squared       =    0.0238
-------------+----------------------------------   Adj R-squared   =    0.0079
       Total |  52.9007634     1,440  .036736641   Root MSE        =    .19091

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0298546   .0103581    -2.88   0.004    -.0501733   -.0095358
          exp |   -.001349    .007396    -0.18   0.855    -.0158573    .0131593
       expsqr |   .0000217   .0001999     0.11   0.914    -.0003705    .0004138
   highvocedu |  -.0174059   .0145406    -1.20   0.231    -.0459293    .0111176
   highgenedu |  -.0293253   .0170125    -1.72   0.085    -.0626977    .0040471
     adultedu |   .0149196   .0244243     0.61   0.541    -.0329919    .0628312
 provincedum2 |   .0235871   .0445223     0.53   0.596    -.0637496    .1109239
 provincedum3 |   .0143511   .0429923     0.33   0.739    -.0699842    .0986865
 provincedum4 |   .0483969   .0584916     0.83   0.408    -.0663425    .1631364
 provincedum5 |   .0145869   .0360911     0.40   0.686    -.0562109    .0853847
 provincedum6 |  -.0020404   .0397618    -0.05   0.959    -.0800388    .0759579
 provincedum7 |   .0268483   .0412824     0.65   0.516    -.0541329    .1078294
 provincedum8 |   .0187272   .0401996     0.47   0.641      -.06013    .0975844
 provincedum9 |   .0776671   .0370603     2.10   0.036     .0049682    .1503661
provincedum10 |   .0423397   .0374824     1.13   0.259    -.0311871    .1158666
provincedum11 |   .0122189   .0401453     0.30   0.761    -.0665316    .0909694
provincedum12 |   .0387718    .044715     0.87   0.386    -.0489429    .1264866
provincedum13 |   .0110795   .0400659     0.28   0.782    -.0675154    .0896745
provincedum14 |    .009424   .0435868     0.22   0.829    -.0760775    .0949256
provincedum15 |   .0143795   .0407979     0.35   0.725    -.0656513    .0944103
           m1 |  -.0171521   .1109488    -0.15   0.877    -.2347937    .2004895
           m2 |  -.0003291   .0328852    -0.01   0.992    -.0648381    .0641799
           m3 |   .0434489   .0601549     0.72   0.470    -.0745533     .161451
        _cons |   .0677479   .0572746     1.18   0.237    -.0446043       .1801
-------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(e
> ducat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_en
> trant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(7, 1433)      =      1.96
       Model |  .500698241         7   .07152832   Prob > F        =    0.0577
    Residual |  52.4000651     1,433  .036566689   R-squared       =    0.0095
-------------+----------------------------------   Adj R-squared   =    0.0046
       Total |  52.9007634     1,440  .036736641   Root MSE        =    .19122

------------------------------------------------------------------------------
gen_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0286052   .0103038    -2.78   0.006    -.0488175    -.008393
         exp |  -.0022008   .0062879    -0.35   0.726    -.0145353    .0101337
      expsqr |   .0000327   .0001789     0.18   0.855    -.0003184    .0003837
   higheredu |  -.0205707   .0124901    -1.65   0.100    -.0450716    .0039301
         _m1 |   .0005386   .0803051     0.01   0.995    -.1569895    .1580668
         _m2 |   .0001642   .0255388     0.01   0.995    -.0499332    .0502616
         _m3 |   .0221551   .0568801     0.39   0.697    -.0894221    .1337323
       _cons |   .0956656   .0318211     3.01   0.003     .0332446    .1580865
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0363489          .        .       .            .           .
        rho1 |   .0028253          .        .       .            .           .
        rho2 |   .0008611          .        .       .            .           .
        rho3 |    .116206          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 199
> 2)

      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(7, 1433)      =      1.96
       Model |  .500698241         7   .07152832   Prob > F        =    0.0577
    Residual |  52.4000651     1,433  .036566689   R-squared       =    0.0095
-------------+----------------------------------   Adj R-squared   =    0.0046
       Total |  52.9007634     1,440  .036736641   Root MSE        =    .19122

------------------------------------------------------------------------------
gen_unemp~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0286052   .0103038    -2.78   0.006    -.0488175    -.008393
         exp |  -.0022008   .0062879    -0.35   0.726    -.0145353    .0101337
      expsqr |   .0000327   .0001789     0.18   0.855    -.0003184    .0003837
   higheredu |  -.0205707   .0124901    -1.65   0.100    -.0450716    .0039301
          m1 |   .0005386   .0803051     0.01   0.995    -.1569895    .1580668
          m2 |   .0001642   .0255388     0.01   0.995    -.0499332    .0502616
          m3 |   .0221551   .0568801     0.39   0.697    -.0894221    .1337323
       _cons |   .0956656   .0318211     3.01   0.003     .0332446    .1580865
------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bi
> rthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_
> entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(21, 1419)     =      1.51
       Model |  1.15722158        21  .055105789   Prob > F        =    0.0643
    Residual |  51.7435418     1,419  .036464793   R-squared       =    0.0219
-------------+----------------------------------   Adj R-squared   =    0.0074
       Total |  52.9007634     1,440  .036736641   Root MSE        =    .19096

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    -.03069   .0103486    -2.97   0.003    -.0509902   -.0103898
          exp |  -.0005888   .0073809    -0.08   0.936    -.0150674    .0138898
       expsqr |   .0000113   .0001998     0.06   0.955    -.0003806    .0004032
    higheredu |   -.015178   .0129829    -1.17   0.243    -.0406457    .0102897
 provincedum2 |    .029631   .0443768     0.67   0.504    -.0574201    .1166821
 provincedum3 |    .016721   .0429063     0.39   0.697    -.0674456    .1008877
 provincedum4 |   .0512463   .0584636     0.88   0.381     -.063438    .1659306
 provincedum5 |   .0169816   .0360708     0.47   0.638    -.0537762    .0877394
 provincedum6 |    .000062   .0397404     0.00   0.999    -.0778942    .0780182
 provincedum7 |   .0302796   .0412323     0.73   0.463    -.0506031    .1111623
 provincedum8 |   .0230042   .0401061     0.57   0.566    -.0556695    .1016779
 provincedum9 |   .0806006   .0370137     2.18   0.030     .0079931    .1532081
provincedum10 |   .0465272   .0373636     1.25   0.213    -.0267666     .119821
provincedum11 |   .0168816   .0400569     0.42   0.673    -.0616956    .0954588
provincedum12 |   .0456326   .0445328     1.02   0.306    -.0417245    .1329898
provincedum13 |   .0166805   .0399355     0.42   0.676    -.0616584    .0950194
provincedum14 |   .0147158   .0434573     0.34   0.735    -.0705317    .0999632
provincedum15 |   .0192742   .0406189     0.47   0.635    -.0604055    .0989538
          _m1 |  -.0377021    .109749    -0.34   0.731    -.2529899    .1775857
          _m2 |   .0007021   .0328709     0.02   0.983    -.0637786    .0651829
          _m3 |   .0387285   .0600994     0.64   0.519    -.0791648    .1566218
        _cons |   .0470095   .0554852     0.85   0.397    -.0618324    .1558514
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0361847          .        .       .            .           .
        rho1 |  -.1981995          .        .       .            .           .
        rho2 |   .0036912          .        .       .            .           .
        rho3 |   .2035953          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if i
> nrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(21, 1419)     =      1.51
       Model |  1.15722158        21  .055105789   Prob > F        =    0.0643
    Residual |  51.7435418     1,419  .036464793   R-squared       =    0.0219
-------------+----------------------------------   Adj R-squared   =    0.0074
       Total |  52.9007634     1,440  .036736641   Root MSE        =    .19096

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    -.03069   .0103486    -2.97   0.003    -.0509902   -.0103898
          exp |  -.0005888   .0073809    -0.08   0.936    -.0150674    .0138898
       expsqr |   .0000113   .0001998     0.06   0.955    -.0003806    .0004032
    higheredu |   -.015178   .0129829    -1.17   0.243    -.0406457    .0102897
 provincedum2 |    .029631   .0443768     0.67   0.504    -.0574201    .1166821
 provincedum3 |    .016721   .0429063     0.39   0.697    -.0674456    .1008877
 provincedum4 |   .0512463   .0584636     0.88   0.381     -.063438    .1659306
 provincedum5 |   .0169816   .0360708     0.47   0.638    -.0537762    .0877394
 provincedum6 |    .000062   .0397404     0.00   0.999    -.0778942    .0780182
 provincedum7 |   .0302796   .0412323     0.73   0.463    -.0506031    .1111623
 provincedum8 |   .0230042   .0401061     0.57   0.566    -.0556695    .1016779
 provincedum9 |   .0806006   .0370137     2.18   0.030     .0079931    .1532081
provincedum10 |   .0465272   .0373636     1.25   0.213    -.0267666     .119821
provincedum11 |   .0168816   .0400569     0.42   0.673    -.0616956    .0954588
provincedum12 |   .0456326   .0445328     1.02   0.306    -.0417245    .1329898
provincedum13 |   .0166805   .0399355     0.42   0.676    -.0616584    .0950194
provincedum14 |   .0147158   .0434573     0.34   0.735    -.0705317    .0999632
provincedum15 |   .0192742   .0406189     0.47   0.635    -.0604055    .0989538
           m1 |  -.0377021    .109749    -0.34   0.731    -.2529899    .1775857
           m2 |   .0007021   .0328709     0.02   0.983    -.0637786    .0651829
           m3 |   .0387285   .0600994     0.64   0.519    -.0791648    .1566218
        _cons |   .0470095   .0554852     0.85   0.397    -.0618324    .1558514
-------------------------------------------------------------------------------

. outreg2 using "`xlspath2'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Unemployment A20=5|9.xls
dir : seeout

. drop m1 m2 m3

. 
. *3) High occupation
. 
. selmlog voc_highocc male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear, 19
> 71, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_rel
> ative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       648
-------------+----------------------------------   F(9, 638)       =      5.94
       Model |  9.23265359         9   1.0258504   Prob > F        =    0.0000
    Residual |  110.242655       638   .17279413   R-squared       =    0.0773
-------------+----------------------------------   Adj R-squared   =    0.0643
       Total |  119.475309       647  .184660446   Root MSE        =    .41569

------------------------------------------------------------------------------
 voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0783028   .0344551     2.27   0.023     .0106437    .1459619
         exp |  -.0688782   .0207347    -3.32   0.001    -.1095947   -.0281618
      expsqr |   .0019247   .0005538     3.48   0.001     .0008373    .0030122
  highvocedu |   .1028035   .0615096     1.67   0.095    -.0179822    .2235892
  highgenedu |   .4490094   .1339125     3.35   0.001     .1860468     .711972
    adultedu |    .400646   .0917066     4.37   0.000     .2205628    .5807292
         _m1 |   .0292608   .0731545     0.40   0.689    -.1143919    .1729135
         _m2 |   .0266961   .1769821     0.15   0.880    -.3208417    .3742339
         _m3 |  -.1614799   .0980309    -1.65   0.100    -.3539821    .0310224
       _cons |    .581065   .2343562     2.48   0.013     .1208622    1.041268
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1697126          .        .       .            .           .
        rho1 |   .0710279          .        .       .            .           .
        rho2 |   .0648024          .        .       .            .           .
        rho3 |  -.3919777          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(birt
> hyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       648
-------------+----------------------------------   F(9, 638)       =      5.94
       Model |  9.23265359         9   1.0258504   Prob > F        =    0.0000
    Residual |  110.242655       638   .17279413   R-squared       =    0.0773
-------------+----------------------------------   Adj R-squared   =    0.0643
       Total |  119.475309       647  .184660446   Root MSE        =    .41569

------------------------------------------------------------------------------
 voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0783028   .0344551     2.27   0.023     .0106437    .1459619
         exp |  -.0688782   .0207347    -3.32   0.001    -.1095947   -.0281618
      expsqr |   .0019247   .0005538     3.48   0.001     .0008373    .0030122
  highvocedu |   .1028035   .0615096     1.67   0.095    -.0179822    .2235892
  highgenedu |   .4490094   .1339125     3.35   0.001     .1860468     .711972
    adultedu |    .400646   .0917066     4.37   0.000     .2205628    .5807292
          m1 |   .0292608   .0731545     0.40   0.689    -.1143919    .1729135
          m2 |   .0266961   .1769821     0.15   0.880    -.3208417    .3742339
          m3 |  -.1614799   .0980309    -1.65   0.100    -.3539821    .0310224
       _cons |    .581065   .2343562     2.48   0.013     .1208622    1.041268
------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relati
> ve ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       648
-------------+----------------------------------   F(23, 624)      =      3.23
       Model |  12.7145013        23  .552804405   Prob > F        =    0.0000
    Residual |  106.760807       624  .171091037   R-squared       =    0.1064
-------------+----------------------------------   Adj R-squared   =    0.0735
       Total |  119.475309       647  .184660446   Root MSE        =    .41363

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0738016   .0351613     2.10   0.036     .0047528    .1428503
          exp |  -.0600837    .028561    -2.10   0.036     -.116171   -.0039965
       expsqr |   .0017453   .0007674     2.27   0.023     .0002383    .0032524
   highvocedu |   .1020632   .0629637     1.62   0.106    -.0215833    .2257096
   highgenedu |     .46889   .1366203     3.43   0.001     .2005987    .7371813
     adultedu |   .4148408   .0920517     4.51   0.000     .2340721    .5956096
 provincedum2 |   .0101711    .165209     0.06   0.951    -.3142619     .334604
 provincedum3 |  -.1853898   .1909461    -0.97   0.332    -.5603645    .1895849
 provincedum4 |  -.1662642   .2005657    -0.83   0.407    -.5601297    .2276013
 provincedum5 |  -.1085526   .1218949    -0.89   0.374    -.3479265    .1308213
 provincedum6 |   .0816293   .1416699     0.58   0.565    -.1965783    .3598369
 provincedum7 |  -.1336973   .1473301    -0.91   0.365    -.4230201    .1556255
 provincedum8 |  -.1016556   .1481222    -0.69   0.493    -.3925339    .1892228
 provincedum9 |  -.1456341   .1323614    -1.10   0.272    -.4055619    .1142936
provincedum10 |  -.0714433   .1380663    -0.52   0.605    -.3425743    .1996876
provincedum11 |   -.118438   .1405696    -0.84   0.400    -.3944847    .1576087
provincedum12 |  -.0114865   .1392129    -0.08   0.934    -.2848692    .2618961
provincedum13 |   .0305421   .1379628     0.22   0.825    -.2403855    .3014697
provincedum14 |  -.0291519   .1537133    -0.19   0.850    -.3310099    .2727062
provincedum15 |   .0758737   .1596681     0.48   0.635    -.2376782    .3894255
          _m1 |   .0610936   .1451546     0.42   0.674    -.2239571    .3461443
          _m2 |  -.1221197   .3249996    -0.38   0.707    -.7603451    .5161057
          _m3 |  -.1879002   .1054272    -1.78   0.075    -.3949352    .0191349
        _cons |   .4473957   .3777349     1.18   0.237    -.2943898    1.189181
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1684142          .        .       .            .           .
        rho1 |   .1488697          .        .       .            .           .
        rho2 |  -.2975751          .        .       .            .           .
        rho3 |  -.4578654          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       648
-------------+----------------------------------   F(23, 624)      =      3.23
       Model |  12.7145013        23  .552804405   Prob > F        =    0.0000
    Residual |  106.760807       624  .171091037   R-squared       =    0.1064
-------------+----------------------------------   Adj R-squared   =    0.0735
       Total |  119.475309       647  .184660446   Root MSE        =    .41363

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0738016   .0351613     2.10   0.036     .0047528    .1428503
          exp |  -.0600837    .028561    -2.10   0.036     -.116171   -.0039965
       expsqr |   .0017453   .0007674     2.27   0.023     .0002383    .0032524
   highvocedu |   .1020632   .0629637     1.62   0.106    -.0215833    .2257096
   highgenedu |     .46889   .1366203     3.43   0.001     .2005987    .7371813
     adultedu |   .4148408   .0920517     4.51   0.000     .2340721    .5956096
 provincedum2 |   .0101711    .165209     0.06   0.951    -.3142619     .334604
 provincedum3 |  -.1853898   .1909461    -0.97   0.332    -.5603645    .1895849
 provincedum4 |  -.1662642   .2005657    -0.83   0.407    -.5601297    .2276013
 provincedum5 |  -.1085526   .1218949    -0.89   0.374    -.3479265    .1308213
 provincedum6 |   .0816293   .1416699     0.58   0.565    -.1965783    .3598369
 provincedum7 |  -.1336973   .1473301    -0.91   0.365    -.4230201    .1556255
 provincedum8 |  -.1016556   .1481222    -0.69   0.493    -.3925339    .1892228
 provincedum9 |  -.1456341   .1323614    -1.10   0.272    -.4055619    .1142936
provincedum10 |  -.0714433   .1380663    -0.52   0.605    -.3425743    .1996876
provincedum11 |   -.118438   .1405696    -0.84   0.400    -.3944847    .1576087
provincedum12 |  -.0114865   .1392129    -0.08   0.934    -.2848692    .2618961
provincedum13 |   .0305421   .1379628     0.22   0.825    -.2403855    .3014697
provincedum14 |  -.0291519   .1537133    -0.19   0.850    -.3310099    .2727062
provincedum15 |   .0758737   .1596681     0.48   0.635    -.2376782    .3894255
           m1 |   .0610936   .1451546     0.42   0.674    -.2239571    .3461443
           m2 |  -.1221197   .3249996    -0.38   0.707    -.7603451    .5161057
           m3 |  -.1879002   .1054272    -1.78   0.075    -.3949352    .0191349
        _cons |   .4473957   .3777349     1.18   0.237    -.2943898    1.189181
-------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_highocc male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(educat
> =male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant
> _relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       648
-------------+----------------------------------   F(7, 640)       =      5.96
       Model |  7.30997005         7  1.04428144   Prob > F        =    0.0000
    Residual |  112.165339       640  .175258342   R-squared       =    0.0612
-------------+----------------------------------   Adj R-squared   =    0.0509
       Total |  119.475309       647  .184660446   Root MSE        =    .41864

------------------------------------------------------------------------------
 voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0711539   .0345691     2.06   0.040     .0032713    .1390364
         exp |  -.0704714   .0208751    -3.38   0.001    -.1114632   -.0294795
      expsqr |   .0019985   .0005572     3.59   0.000     .0009042    .0030927
   higheredu |   .2218402   .0502816     4.41   0.000     .1231034    .3205771
         _m1 |   .0063987   .0731322     0.09   0.930    -.1372094    .1500067
         _m2 |   .0605694   .1777132     0.34   0.733     -.288402    .4095408
         _m3 |  -.1461348   .0986182    -1.48   0.139    -.3397892    .0475195
       _cons |   .6407044   .2351096     2.73   0.007      .179025    1.102384
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1729088          .        .       .            .           .
        rho1 |    .015388          .        .       .            .           .
        rho2 |   .1456615          .        .       .            .           .
        rho3 |  -.3514352          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       648
-------------+----------------------------------   F(7, 640)       =      5.96
       Model |  7.30997005         7  1.04428144   Prob > F        =    0.0000
    Residual |  112.165339       640  .175258342   R-squared       =    0.0612
-------------+----------------------------------   Adj R-squared   =    0.0509
       Total |  119.475309       647  .184660446   Root MSE        =    .41864

------------------------------------------------------------------------------
 voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0711539   .0345691     2.06   0.040     .0032713    .1390364
         exp |  -.0704714   .0208751    -3.38   0.001    -.1114632   -.0294795
      expsqr |   .0019985   .0005572     3.59   0.000     .0009042    .0030927
   higheredu |   .2218402   .0502816     4.41   0.000     .1231034    .3205771
          m1 |   .0063987   .0731322     0.09   0.930    -.1372094    .1500067
          m2 |   .0605694   .1777132     0.34   0.733     -.288402    .4095408
          m3 |  -.1461348   .0986182    -1.48   0.139    -.3397892    .0475195
       _cons |   .6407044   .2351096     2.73   0.007      .179025    1.102384
------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_highocc male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entra
> nt_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       648
-------------+----------------------------------   F(21, 626)      =      2.93
       Model |  10.6802385        21  .508582787   Prob > F        =    0.0000
    Residual |   108.79507       626  .173794042   R-squared       =    0.0894
-------------+----------------------------------   Adj R-squared   =    0.0588
       Total |  119.475309       647  .184660446   Root MSE        =    .41689

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0681879   .0352976     1.93   0.054     -.001128    .1375039
          exp |  -.0668759   .0287088    -2.33   0.020    -.1232531   -.0104986
       expsqr |   .0019315   .0007715     2.50   0.013     .0004165    .0034465
    higheredu |    .229959   .0511118     4.50   0.000     .1295877    .3303303
 provincedum2 |   .0179999   .1664128     0.11   0.914     -.308795    .3447948
 provincedum3 |  -.1693464   .1922227    -0.88   0.379    -.5468258    .2081329
 provincedum4 |  -.1341769   .2016634    -0.67   0.506    -.5301957    .2618419
 provincedum5 |  -.1311393   .1226652    -1.07   0.285    -.3720245    .1097458
 provincedum6 |   .0725843   .1427572     0.51   0.611    -.2077567    .3529252
 provincedum7 |  -.1470416    .148409    -0.99   0.322    -.4384814    .1443981
 provincedum8 |  -.0766422   .1490827    -0.51   0.607    -.3694049    .2161205
 provincedum9 |  -.1379311   .1333809    -1.03   0.301    -.3998593     .123997
provincedum10 |  -.0668042   .1390959    -0.48   0.631    -.3399552    .2063468
provincedum11 |  -.1097579   .1415772    -0.78   0.438    -.3877817    .1682658
provincedum12 |  -.0160431   .1402977    -0.11   0.909    -.2915542     .259468
provincedum13 |    .030434   .1390063     0.22   0.827    -.2425411    .3034091
provincedum14 |  -.0063653   .1546429    -0.04   0.967     -.310047    .2973164
provincedum15 |   .0694371   .1608622     0.43   0.666    -.2464577    .3853319
          _m1 |   .0370285   .1458655     0.25   0.800    -.2494165    .3234734
          _m2 |  -.0462837   .3267706    -0.14   0.887    -.6879831    .5954157
          _m3 |  -.1807316   .1062275    -1.70   0.089    -.3893369    .0278738
        _cons |   .5637108   .3791276     1.49   0.138    -.1808051    1.308227
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1677952          .        .       .            .           .
        rho1 |   .0903953          .        .       .            .           .
        rho2 |  -.1129896          .        .       .            .           .
        rho3 |  -.4412089          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inrang
> e(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       648
-------------+----------------------------------   F(21, 626)      =      2.93
       Model |  10.6802385        21  .508582787   Prob > F        =    0.0000
    Residual |   108.79507       626  .173794042   R-squared       =    0.0894
-------------+----------------------------------   Adj R-squared   =    0.0588
       Total |  119.475309       647  .184660446   Root MSE        =    .41689

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0681879   .0352976     1.93   0.054     -.001128    .1375039
          exp |  -.0668759   .0287088    -2.33   0.020    -.1232531   -.0104986
       expsqr |   .0019315   .0007715     2.50   0.013     .0004165    .0034465
    higheredu |    .229959   .0511118     4.50   0.000     .1295877    .3303303
 provincedum2 |   .0179999   .1664128     0.11   0.914     -.308795    .3447948
 provincedum3 |  -.1693464   .1922227    -0.88   0.379    -.5468258    .2081329
 provincedum4 |  -.1341769   .2016634    -0.67   0.506    -.5301957    .2618419
 provincedum5 |  -.1311393   .1226652    -1.07   0.285    -.3720245    .1097458
 provincedum6 |   .0725843   .1427572     0.51   0.611    -.2077567    .3529252
 provincedum7 |  -.1470416    .148409    -0.99   0.322    -.4384814    .1443981
 provincedum8 |  -.0766422   .1490827    -0.51   0.607    -.3694049    .2161205
 provincedum9 |  -.1379311   .1333809    -1.03   0.301    -.3998593     .123997
provincedum10 |  -.0668042   .1390959    -0.48   0.631    -.3399552    .2063468
provincedum11 |  -.1097579   .1415772    -0.78   0.438    -.3877817    .1682658
provincedum12 |  -.0160431   .1402977    -0.11   0.909    -.2915542     .259468
provincedum13 |    .030434   .1390063     0.22   0.827    -.2425411    .3034091
provincedum14 |  -.0063653   .1546429    -0.04   0.967     -.310047    .2973164
provincedum15 |   .0694371   .1608622     0.43   0.666    -.2464577    .3853319
           m1 |   .0370285   .1458655     0.25   0.800    -.2494165    .3234734
           m2 |  -.0462837   .3267706    -0.14   0.887    -.6879831    .5954157
           m3 |  -.1807316   .1062275    -1.70   0.089    -.3893369    .0278738
        _cons |   .5637108   .3791276     1.49   0.138    -.1808051    1.308227
-------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr highvocedu highgenedu adultedu if inrange(birthyear, 19
> 71, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_rel
> ative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,236
-------------+----------------------------------   F(9, 1226)      =     10.06
       Model |  15.3724555         9  1.70805061   Prob > F        =    0.0000
    Residual |  208.170425     1,226  .169796431   R-squared       =    0.0688
-------------+----------------------------------   Adj R-squared   =    0.0619
       Total |   223.54288     1,235  .181006381   Root MSE        =    .41206

------------------------------------------------------------------------------
 gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0639311   .0244874     2.61   0.009     .0158892     .111973
         exp |  -.0236085   .0149171    -1.58   0.114    -.0528745    .0056574
      expsqr |    .000659   .0004196     1.57   0.117    -.0001642    .0014822
  highvocedu |   .1253766   .0327451     3.83   0.000      .061134    .1896191
  highgenedu |   .2523875   .0375959     6.71   0.000      .178628    .3261469
    adultedu |    .218321   .0558092     3.91   0.000     .1088289     .327813
         _m1 |   .2188169   .1849084     1.18   0.237    -.1439551    .5815889
         _m2 |   -.028583   .0597936    -0.48   0.633     -.145892     .088726
         _m3 |  -.1754113   .1347374    -1.30   0.193    -.4397527    .0889302
       _cons |   .2601458   .0807035     3.22   0.001     .1018136     .418478
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1793308          .        .       .            .           .
        rho1 |   .5167179          .        .       .            .           .
        rho2 |  -.0674964          .        .       .            .           .
        rho3 |  -.4142191          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inrange(birt
> hyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,236
-------------+----------------------------------   F(9, 1226)      =     10.06
       Model |  15.3724555         9  1.70805061   Prob > F        =    0.0000
    Residual |  208.170425     1,226  .169796431   R-squared       =    0.0688
-------------+----------------------------------   Adj R-squared   =    0.0619
       Total |   223.54288     1,235  .181006381   Root MSE        =    .41206

------------------------------------------------------------------------------
 gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0639311   .0244874     2.61   0.009     .0158892     .111973
         exp |  -.0236085   .0149171    -1.58   0.114    -.0528745    .0056574
      expsqr |    .000659   .0004196     1.57   0.117    -.0001642    .0014822
  highvocedu |   .1253766   .0327451     3.83   0.000      .061134    .1896191
  highgenedu |   .2523875   .0375959     6.71   0.000      .178628    .3261469
    adultedu |    .218321   .0558092     3.91   0.000     .1088289     .327813
          m1 |   .2188169   .1849084     1.18   0.237    -.1439551    .5815889
          m2 |   -.028583   .0597936    -0.48   0.633     -.145892     .088726
          m3 |  -.1754113   .1347374    -1.30   0.193    -.4397527    .0889302
       _cons |   .2601458   .0807035     3.22   0.001     .1018136     .418478
------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relati
> ve ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,236
-------------+----------------------------------   F(23, 1212)     =      4.68
       Model |  18.2465731        23  .793329264   Prob > F        =    0.0000
    Residual |  205.296307     1,212  .169386392   R-squared       =    0.0816
-------------+----------------------------------   Adj R-squared   =    0.0642
       Total |   223.54288     1,235  .181006381   Root MSE        =    .41157

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0630755   .0246422     2.56   0.011     .0147295    .1114215
          exp |  -.0173987   .0175282    -0.99   0.321    -.0517876    .0169902
       expsqr |   .0004791   .0004682     1.02   0.306    -.0004394    .0013976
   highvocedu |   .1256959   .0336922     3.73   0.000     .0595944    .1917974
   highgenedu |   .2547179   .0389634     6.54   0.000     .1782747    .3311611
     adultedu |   .2161196   .0565659     3.82   0.000     .1051417    .3270976
 provincedum2 |   -.001909   .1025987    -0.02   0.985    -.2031998    .1993818
 provincedum3 |  -.1252913   .1143279    -1.10   0.273    -.3495938    .0990112
 provincedum4 |  -.1365791   .1350655    -1.01   0.312    -.4015673     .128409
 provincedum5 |  -.1212647    .082512    -1.47   0.142     -.283147    .0406176
 provincedum6 |  -.1245008   .0909237    -1.37   0.171    -.3028861    .0538844
 provincedum7 |  -.0702865    .096111    -0.73   0.465     -.258849     .118276
 provincedum8 |  -.0320095   .0926033    -0.35   0.730    -.2136902    .1496711
 provincedum9 |  -.0078831   .0848158    -0.09   0.926    -.1742852    .1585191
provincedum10 |  -.0693035   .0855656    -0.81   0.418    -.2371767    .0985697
provincedum11 |  -.1476716   .0917976    -1.61   0.108    -.3277714    .0324281
provincedum12 |  -.0329961   .1068437    -0.31   0.758    -.2426153    .1766231
provincedum13 |  -.0204903   .0924372    -0.22   0.825    -.2018451    .1608644
provincedum14 |  -.0866286   .1003055    -0.86   0.388    -.2834202    .1101631
provincedum15 |  -.1049589   .0946703    -1.11   0.268    -.2906948     .080777
          _m1 |   .3722708   .2529093     1.47   0.141    -.1239179    .8684595
          _m2 |   -.059663   .0773297    -0.77   0.441    -.2113779     .092052
          _m3 |  -.1850094   .1448337    -1.28   0.202    -.4691619    .0991432
        _cons |   .3470388   .1353353     2.56   0.010     .0815213    .6125563
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1988969          .        .       .            .           .
        rho1 |    .834728          .        .       .            .           .
        rho2 |  -.1337799          .        .       .            .           .
        rho3 |  -.4148391          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,236
-------------+----------------------------------   F(23, 1212)     =      4.68
       Model |  18.2465731        23  .793329264   Prob > F        =    0.0000
    Residual |  205.296307     1,212  .169386392   R-squared       =    0.0816
-------------+----------------------------------   Adj R-squared   =    0.0642
       Total |   223.54288     1,235  .181006381   Root MSE        =    .41157

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0630755   .0246422     2.56   0.011     .0147295    .1114215
          exp |  -.0173987   .0175282    -0.99   0.321    -.0517876    .0169902
       expsqr |   .0004791   .0004682     1.02   0.306    -.0004394    .0013976
   highvocedu |   .1256959   .0336922     3.73   0.000     .0595944    .1917974
   highgenedu |   .2547179   .0389634     6.54   0.000     .1782747    .3311611
     adultedu |   .2161196   .0565659     3.82   0.000     .1051417    .3270976
 provincedum2 |   -.001909   .1025987    -0.02   0.985    -.2031998    .1993818
 provincedum3 |  -.1252913   .1143279    -1.10   0.273    -.3495938    .0990112
 provincedum4 |  -.1365791   .1350655    -1.01   0.312    -.4015673     .128409
 provincedum5 |  -.1212647    .082512    -1.47   0.142     -.283147    .0406176
 provincedum6 |  -.1245008   .0909237    -1.37   0.171    -.3028861    .0538844
 provincedum7 |  -.0702865    .096111    -0.73   0.465     -.258849     .118276
 provincedum8 |  -.0320095   .0926033    -0.35   0.730    -.2136902    .1496711
 provincedum9 |  -.0078831   .0848158    -0.09   0.926    -.1742852    .1585191
provincedum10 |  -.0693035   .0855656    -0.81   0.418    -.2371767    .0985697
provincedum11 |  -.1476716   .0917976    -1.61   0.108    -.3277714    .0324281
provincedum12 |  -.0329961   .1068437    -0.31   0.758    -.2426153    .1766231
provincedum13 |  -.0204903   .0924372    -0.22   0.825    -.2018451    .1608644
provincedum14 |  -.0866286   .1003055    -0.86   0.388    -.2834202    .1101631
provincedum15 |  -.1049589   .0946703    -1.11   0.268    -.2906948     .080777
           m1 |   .3722708   .2529093     1.47   0.141    -.1239179    .8684595
           m2 |   -.059663   .0773297    -0.77   0.441    -.2113779     .092052
           m3 |  -.1850094   .1448337    -1.28   0.202    -.4691619    .0991432
        _cons |   .3470388   .1353353     2.56   0.010     .0815213    .6125563
-------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr higheredu if inrange(birthyear, 1971, 1992), sel(educat
> =male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant
> _relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,236
-------------+----------------------------------   F(7, 1228)      =     10.77
       Model |  12.9335121         7  1.84764458   Prob > F        =    0.0000
    Residual |  210.609368     1,228     .171506   R-squared       =    0.0579
-------------+----------------------------------   Adj R-squared   =    0.0525
       Total |   223.54288     1,235  .181006381   Root MSE        =    .41413

------------------------------------------------------------------------------
 gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0620483   .0245855     2.52   0.012      .013814    .1102826
         exp |  -.0272464   .0148961    -1.83   0.068     -.056471    .0019781
      expsqr |   .0007458   .0004204     1.77   0.076    -.0000789    .0015705
   higheredu |   .1776568   .0291747     6.09   0.000      .120419    .2348946
         _m1 |   .2943199   .1845313     1.59   0.111    -.0677115    .6563514
         _m2 |  -.0359595   .0600481    -0.60   0.549    -.1537677    .0818486
         _m3 |   -.165347    .135318    -1.22   0.222    -.4308271    .1001332
       _cons |   .3239336   .0773823     4.19   0.000     .1721174    .4757497
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1904145          .        .       .            .           .
        rho1 |    .674481          .        .       .            .           .
        rho2 |   -.082407          .        .       .            .           .
        rho3 |  -.3789189          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,236
-------------+----------------------------------   F(7, 1228)      =     10.77
       Model |  12.9335121         7  1.84764458   Prob > F        =    0.0000
    Residual |  210.609368     1,228     .171506   R-squared       =    0.0579
-------------+----------------------------------   Adj R-squared   =    0.0525
       Total |   223.54288     1,235  .181006381   Root MSE        =    .41413

------------------------------------------------------------------------------
 gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0620483   .0245855     2.52   0.012      .013814    .1102826
         exp |  -.0272464   .0148961    -1.83   0.068     -.056471    .0019781
      expsqr |   .0007458   .0004204     1.77   0.076    -.0000789    .0015705
   higheredu |   .1776568   .0291747     6.09   0.000      .120419    .2348946
          m1 |   .2943199   .1845313     1.59   0.111    -.0677115    .6563514
          m2 |  -.0359595   .0600481    -0.60   0.549    -.1537677    .0818486
          m3 |   -.165347    .135318    -1.22   0.222    -.4308271    .1001332
       _cons |   .3239336   .0773823     4.19   0.000     .1721174    .4757497
------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entra
> nt_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,236
-------------+----------------------------------   F(21, 1214)     =      4.40
       Model |  15.7991862        21  .752342201   Prob > F        =    0.0000
    Residual |  207.743694     1,214  .171123306   R-squared       =    0.0707
-------------+----------------------------------   Adj R-squared   =    0.0546
       Total |   223.54288     1,235  .181006381   Root MSE        =    .41367

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0619593   .0247475     2.50   0.012     .0134066     .110512
          exp |  -.0192249   .0175757    -1.09   0.274     -.053707    .0152572
       expsqr |   .0005109   .0004701     1.09   0.277    -.0004114    .0014333
    higheredu |   .1766194   .0302536     5.84   0.000     .1172642    .2359746
 provincedum2 |  -.0296167   .1026737    -0.29   0.773    -.2310542    .1718209
 provincedum3 |  -.1500093   .1147204    -1.31   0.191    -.3750815    .0750629
 provincedum4 |  -.1589803   .1355908    -1.17   0.241    -.4249985     .107038
 provincedum5 |  -.1312517   .0828309    -1.58   0.113    -.2937593    .0312559
 provincedum6 |  -.1408953   .0912554    -1.54   0.123    -.3199311    .0381404
 provincedum7 |   -.093468   .0963294    -0.97   0.332    -.2824586    .0955226
 provincedum8 |   -.054702   .0927892    -0.59   0.556    -.2367469     .127343
 provincedum9 |  -.0271827   .0850224    -0.32   0.749    -.1939899    .1396244
provincedum10 |  -.0955339   .0856121    -1.12   0.265    -.2634981    .0724302
provincedum11 |  -.1649277   .0919604    -1.79   0.073    -.3453466    .0154912
provincedum12 |  -.0387811    .106659    -0.36   0.716    -.2480376    .1704754
provincedum13 |  -.0370082   .0924606    -0.40   0.689    -.2184085     .144392
provincedum14 |  -.1126496   .1003717    -1.12   0.262    -.3095709    .0842717
provincedum15 |  -.1393258   .0945981    -1.47   0.141    -.3249197     .046268
          _m1 |   .5110787   .2510078     2.04   0.042     .0186214    1.003536
          _m2 |  -.0759091   .0775978    -0.98   0.328    -.2281498    .0763316
          _m3 |   -.171425   .1454828    -1.18   0.239    -.4568506    .1140006
        _cons |   .4433067   .1315656     3.37   0.001     .1851856    .7014278
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2299361          .        .       .            .           .
        rho1 |   1.065821          .        .       .            .           .
        rho2 |  -.1583035          .        .       .            .           .
        rho3 |  -.3574956          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inrang
> e(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,236
-------------+----------------------------------   F(21, 1214)     =      4.40
       Model |  15.7991862        21  .752342201   Prob > F        =    0.0000
    Residual |  207.743694     1,214  .171123306   R-squared       =    0.0707
-------------+----------------------------------   Adj R-squared   =    0.0546
       Total |   223.54288     1,235  .181006381   Root MSE        =    .41367

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0619593   .0247475     2.50   0.012     .0134066     .110512
          exp |  -.0192249   .0175757    -1.09   0.274     -.053707    .0152572
       expsqr |   .0005109   .0004701     1.09   0.277    -.0004114    .0014333
    higheredu |   .1766194   .0302536     5.84   0.000     .1172642    .2359746
 provincedum2 |  -.0296167   .1026737    -0.29   0.773    -.2310542    .1718209
 provincedum3 |  -.1500093   .1147204    -1.31   0.191    -.3750815    .0750629
 provincedum4 |  -.1589803   .1355908    -1.17   0.241    -.4249985     .107038
 provincedum5 |  -.1312517   .0828309    -1.58   0.113    -.2937593    .0312559
 provincedum6 |  -.1408953   .0912554    -1.54   0.123    -.3199311    .0381404
 provincedum7 |   -.093468   .0963294    -0.97   0.332    -.2824586    .0955226
 provincedum8 |   -.054702   .0927892    -0.59   0.556    -.2367469     .127343
 provincedum9 |  -.0271827   .0850224    -0.32   0.749    -.1939899    .1396244
provincedum10 |  -.0955339   .0856121    -1.12   0.265    -.2634981    .0724302
provincedum11 |  -.1649277   .0919604    -1.79   0.073    -.3453466    .0154912
provincedum12 |  -.0387811    .106659    -0.36   0.716    -.2480376    .1704754
provincedum13 |  -.0370082   .0924606    -0.40   0.689    -.2184085     .144392
provincedum14 |  -.1126496   .1003717    -1.12   0.262    -.3095709    .0842717
provincedum15 |  -.1393258   .0945981    -1.47   0.141    -.3249197     .046268
           m1 |   .5110787   .2510078     2.04   0.042     .0186214    1.003536
           m2 |  -.0759091   .0775978    -0.98   0.328    -.2281498    .0763316
           m3 |   -.171425   .1454828    -1.18   0.239    -.4568506    .1140006
        _cons |   .4433067   .1315656     3.37   0.001     .1851856    .7014278
-------------------------------------------------------------------------------

. outreg2 using "`xlspath3'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural High occupation.xls
dir : seeout

. drop m1 m2 m3

. 
. *4) Long-term contract
. 
. selmlog voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu if inrange(birt
> hyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_en
> trant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       561
-------------+----------------------------------   F(9, 551)       =      3.92
       Model |  7.10711789         9  .789679766   Prob > F        =    0.0001
    Residual |  110.982009       551  .201419253   R-squared       =    0.0602
-------------+----------------------------------   Adj R-squared   =    0.0448
       Total |  118.089127       560   .21087344   Root MSE        =     .4488

------------------------------------------------------------------------------
voc_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0655404   .0396614    -1.65   0.099    -.1434465    .0123657
         exp |   .0230875   .0279737     0.83   0.410    -.0318607    .0780357
      expsqr |  -.0006501     .00076    -0.86   0.393    -.0021429    .0008427
  highvocedu |   .1942624   .0708852     2.74   0.006     .0550242    .3335006
  highgenedu |   .4974771   .1461774     3.40   0.001      .210344    .7846103
    adultedu |   .2119249   .1023028     2.07   0.039     .0109737    .4128762
         _m1 |   .0105668   .0849802     0.12   0.901    -.1563581    .1774917
         _m2 |   .5400494   .2482951     2.18   0.030     .0523286     1.02777
         _m3 |   .5846496   .2551536     2.29   0.022     .0834567    1.085842
       _cons |   .6079563   .2723428     2.23   0.026     .0729992    1.142913
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .252552          .        .       .            .           .
        rho1 |   .0210266          .        .       .            .           .
        rho2 |   1.074628          .        .       .            .           .
        rho3 |   1.163376          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inr
> ange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       561
-------------+----------------------------------   F(9, 551)       =      3.92
       Model |  7.10711789         9  .789679766   Prob > F        =    0.0001
    Residual |  110.982009       551  .201419253   R-squared       =    0.0602
-------------+----------------------------------   Adj R-squared   =    0.0448
       Total |  118.089127       560   .21087344   Root MSE        =     .4488

------------------------------------------------------------------------------
voc_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0655404   .0396614    -1.65   0.099    -.1434465    .0123657
         exp |   .0230875   .0279737     0.83   0.410    -.0318607    .0780357
      expsqr |  -.0006501     .00076    -0.86   0.393    -.0021429    .0008427
  highvocedu |   .1942624   .0708852     2.74   0.006     .0550242    .3335006
  highgenedu |   .4974771   .1461774     3.40   0.001      .210344    .7846103
    adultedu |   .2119249   .1023028     2.07   0.039     .0109737    .4128762
          m1 |   .0105668   .0849802     0.12   0.901    -.1563581    .1774917
          m2 |   .5400494   .2482951     2.18   0.030     .0523286     1.02777
          m3 |   .5846496   .2551536     2.29   0.022     .0834567    1.085842
       _cons |   .6079563   .2723428     2.23   0.026     .0729992    1.142913
------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", replace ctitle(Sec Voc, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entra
> nt_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       561
-------------+----------------------------------   F(23, 537)      =      2.36
       Model |  10.8378789        23  .471212126   Prob > F        =    0.0004
    Residual |  107.251248       537  .199722994   R-squared       =    0.0918
-------------+----------------------------------   Adj R-squared   =    0.0529
       Total |  118.089127       560   .21087344   Root MSE        =     .4469

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.061452   .0407397    -1.51   0.132    -.1414807    .0185767
          exp |   .0472743    .033975     1.39   0.165    -.0194659    .1140146
       expsqr |  -.0012439   .0009152    -1.36   0.175    -.0030417    .0005538
   highvocedu |    .160123   .0724077     2.21   0.027     .0178859      .30236
   highgenedu |   .5146997    .149358     3.45   0.001     .2213022    .8080972
     adultedu |   .2255103   .1023716     2.20   0.028     .0244124    .4266083
 provincedum2 |  -.1969607   .2183183    -0.90   0.367    -.6258233    .2319018
 provincedum3 |  -.3693419   .2424015    -1.52   0.128    -.8455134    .1068295
 provincedum4 |   .2274842   .2516105     0.90   0.366    -.2667774    .7217458
 provincedum5 |   .0321045   .1624909     0.20   0.843    -.2870912    .3513002
 provincedum6 |  -.1549589   .1869189    -0.83   0.407    -.5221407     .212223
 provincedum7 |  -.1278113   .1982681    -0.64   0.519    -.5172875     .261665
 provincedum8 |  -.1590653   .1949475    -0.82   0.415    -.5420186     .223888
 provincedum9 |  -.2185978   .1783102    -1.23   0.221    -.5688689    .1316732
provincedum10 |  -.0994096   .1832635    -0.54   0.588    -.4594109    .2605917
provincedum11 |  -.2508471   .1874843    -1.34   0.181    -.6191397    .1174455
provincedum12 |  -.2202027   .1794608    -1.23   0.220    -.5727339    .1323285
provincedum13 |  -.1292393   .1817986    -0.71   0.477    -.4863629    .2278844
provincedum14 |  -.1383478   .1994115    -0.69   0.488    -.5300701    .2533746
provincedum15 |  -.1144421   .2130848    -0.54   0.591     -.533024    .3041397
          _m1 |   .1400969   .1802831     0.78   0.437    -.2140497    .4942435
          _m2 |   .0868825   .4999956     0.17   0.862    -.8953045     1.06907
          _m3 |   .4745176   .3147023     1.51   0.132     -.143681    1.092716
        _cons |    .141544   .4881061     0.29   0.772    -.8172876    1.100375
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2055053          .        .       .            .           .
        rho1 |   .3090417          .        .       .            .           .
        rho2 |   .1916554          .        .       .            .           .
        rho3 |   1.046745          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       561
-------------+----------------------------------   F(23, 537)      =      2.36
       Model |  10.8378789        23  .471212126   Prob > F        =    0.0004
    Residual |  107.251248       537  .199722994   R-squared       =    0.0918
-------------+----------------------------------   Adj R-squared   =    0.0529
       Total |  118.089127       560   .21087344   Root MSE        =     .4469

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.061452   .0407397    -1.51   0.132    -.1414807    .0185767
          exp |   .0472743    .033975     1.39   0.165    -.0194659    .1140146
       expsqr |  -.0012439   .0009152    -1.36   0.175    -.0030417    .0005538
   highvocedu |    .160123   .0724077     2.21   0.027     .0178859      .30236
   highgenedu |   .5146997    .149358     3.45   0.001     .2213022    .8080972
     adultedu |   .2255103   .1023716     2.20   0.028     .0244124    .4266083
 provincedum2 |  -.1969607   .2183183    -0.90   0.367    -.6258233    .2319018
 provincedum3 |  -.3693419   .2424015    -1.52   0.128    -.8455134    .1068295
 provincedum4 |   .2274842   .2516105     0.90   0.366    -.2667774    .7217458
 provincedum5 |   .0321045   .1624909     0.20   0.843    -.2870912    .3513002
 provincedum6 |  -.1549589   .1869189    -0.83   0.407    -.5221407     .212223
 provincedum7 |  -.1278113   .1982681    -0.64   0.519    -.5172875     .261665
 provincedum8 |  -.1590653   .1949475    -0.82   0.415    -.5420186     .223888
 provincedum9 |  -.2185978   .1783102    -1.23   0.221    -.5688689    .1316732
provincedum10 |  -.0994096   .1832635    -0.54   0.588    -.4594109    .2605917
provincedum11 |  -.2508471   .1874843    -1.34   0.181    -.6191397    .1174455
provincedum12 |  -.2202027   .1794608    -1.23   0.220    -.5727339    .1323285
provincedum13 |  -.1292393   .1817986    -0.71   0.477    -.4863629    .2278844
provincedum14 |  -.1383478   .1994115    -0.69   0.488    -.5300701    .2533746
provincedum15 |  -.1144421   .2130848    -0.54   0.591     -.533024    .3041397
           m1 |   .1400969   .1802831     0.78   0.437    -.2140497    .4942435
           m2 |   .0868825   .4999956     0.17   0.862    -.8953045     1.06907
           m3 |   .4745176   .3147023     1.51   0.132     -.143681    1.092716
        _cons |    .141544   .4881061     0.29   0.772    -.8172876    1.100375
-------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_longtermcontract male exp expsqr higheredu if inrange(birthyear, 1971, 1992), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       561
-------------+----------------------------------   F(7, 553)       =      4.48
       Model |  6.34336578         7  .906195112   Prob > F        =    0.0001
    Residual |  111.745761       553    .2020719   R-squared       =    0.0537
-------------+----------------------------------   Adj R-squared   =    0.0417
       Total |  118.089127       560   .21087344   Root MSE        =    .44952

------------------------------------------------------------------------------
voc_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0641704   .0395614    -1.62   0.105    -.1418795    .0135387
         exp |   .0247547   .0280039     0.88   0.377    -.0302523    .0797617
      expsqr |  -.0006797   .0007611    -0.89   0.372    -.0021746    .0008152
   higheredu |   .2362214   .0572743     4.12   0.000     .1237196    .3487232
         _m1 |   .0139821   .0845885     0.17   0.869     -.152172    .1801362
         _m2 |    .559815   .2473329     2.26   0.024     .0739882    1.045642
         _m3 |   .6305152   .2538983     2.48   0.013     .1317922    1.129238
       _cons |   .6160378   .2714034     2.27   0.024     .0829302    1.149145
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2581205          .        .       .            .           .
        rho1 |   .0275208          .        .       .            .           .
        rho2 |   1.101877          .        .       .            .           .
        rho3 |   1.241036          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971,
>  1992)

      Source |       SS           df       MS      Number of obs   =       561
-------------+----------------------------------   F(7, 553)       =      4.48
       Model |  6.34336578         7  .906195112   Prob > F        =    0.0001
    Residual |  111.745761       553    .2020719   R-squared       =    0.0537
-------------+----------------------------------   Adj R-squared   =    0.0417
       Total |  118.089127       560   .21087344   Root MSE        =    .44952

------------------------------------------------------------------------------
voc_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |  -.0641704   .0395614    -1.62   0.105    -.1418795    .0135387
         exp |   .0247547   .0280039     0.88   0.377    -.0302523    .0797617
      expsqr |  -.0006797   .0007611    -0.89   0.372    -.0021746    .0008152
   higheredu |   .2362214   .0572743     4.12   0.000     .1237196    .3487232
          m1 |   .0139821   .0845885     0.17   0.869     -.152172    .1801362
          m2 |    .559815   .2473329     2.26   0.024     .0739882    1.045642
          m3 |   .6305152   .2538983     2.48   0.013     .1317922    1.129238
       _cons |   .6160378   .2714034     2.27   0.024     .0829302    1.149145
------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Voc, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 if inrang
> e(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       561
-------------+----------------------------------   F(21, 539)      =      2.34
       Model |  9.88105005        21  .470526193   Prob > F        =    0.0007
    Residual |  108.208077       539  .200757099   R-squared       =    0.0837
-------------+----------------------------------   Adj R-squared   =    0.0480
       Total |  118.089127       560   .21087344   Root MSE        =    .44806

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0595918   .0406718    -1.47   0.143    -.1394864    .0203028
          exp |   .0436488   .0340032     1.28   0.200    -.0231462    .1104439
       expsqr |  -.0011498   .0009158    -1.26   0.210    -.0029487    .0006492
    higheredu |   .2220315   .0579593     3.83   0.000     .1081777    .3358854
 provincedum2 |  -.1868678   .2184478    -0.86   0.393    -.6159812    .2422457
 provincedum3 |  -.3308383   .2423874    -1.36   0.173    -.8069781    .1453015
 provincedum4 |   .2374586   .2521246     0.94   0.347    -.2578087    .7327258
 provincedum5 |   .0289615   .1629002     0.18   0.859    -.2910356    .3489586
 provincedum6 |  -.1500223   .1873419    -0.80   0.424    -.5180321    .2179874
 provincedum7 |  -.1253142   .1986504    -0.63   0.528    -.5155381    .2649098
 provincedum8 |  -.1287889   .1947181    -0.66   0.509    -.5112883    .2537105
 provincedum9 |  -.2029093   .1784539    -1.14   0.256    -.5534596     .147641
provincedum10 |  -.0903681   .1834065    -0.49   0.622    -.4506471     .269911
provincedum11 |  -.2416675   .1875495    -1.29   0.198     -.610085      .12675
provincedum12 |  -.2140222   .1796874    -1.19   0.234    -.5669957    .1389512
provincedum13 |  -.1254595   .1821934    -0.69   0.491    -.4833556    .2324365
provincedum14 |     -.0984   .1990024    -0.49   0.621    -.4893154    .2925154
provincedum15 |  -.1102206   .2134803    -0.52   0.606    -.5295759    .3091347
          _m1 |   .1320168   .1799581     0.73   0.464    -.2214884    .4855219
          _m2 |   .1628724   .4980258     0.33   0.744    -.8154371    1.141182
          _m3 |   .5183816   .3142958     1.65   0.100    -.0990131    1.135776
        _cons |   .2199691   .4854101     0.45   0.651    -.7335582    1.173497
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2094422          .        .       .            .           .
        rho1 |   .2884675          .        .       .            .           .
        rho2 |   .3558896          .        .       .            .           .
        rho3 |   1.132707          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 
> if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =       561
-------------+----------------------------------   F(21, 539)      =      2.34
       Model |  9.88105005        21  .470526193   Prob > F        =    0.0007
    Residual |  108.208077       539  .200757099   R-squared       =    0.0837
-------------+----------------------------------   Adj R-squared   =    0.0480
       Total |  118.089127       560   .21087344   Root MSE        =    .44806

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0595918   .0406718    -1.47   0.143    -.1394864    .0203028
          exp |   .0436488   .0340032     1.28   0.200    -.0231462    .1104439
       expsqr |  -.0011498   .0009158    -1.26   0.210    -.0029487    .0006492
    higheredu |   .2220315   .0579593     3.83   0.000     .1081777    .3358854
 provincedum2 |  -.1868678   .2184478    -0.86   0.393    -.6159812    .2422457
 provincedum3 |  -.3308383   .2423874    -1.36   0.173    -.8069781    .1453015
 provincedum4 |   .2374586   .2521246     0.94   0.347    -.2578087    .7327258
 provincedum5 |   .0289615   .1629002     0.18   0.859    -.2910356    .3489586
 provincedum6 |  -.1500223   .1873419    -0.80   0.424    -.5180321    .2179874
 provincedum7 |  -.1253142   .1986504    -0.63   0.528    -.5155381    .2649098
 provincedum8 |  -.1287889   .1947181    -0.66   0.509    -.5112883    .2537105
 provincedum9 |  -.2029093   .1784539    -1.14   0.256    -.5534596     .147641
provincedum10 |  -.0903681   .1834065    -0.49   0.622    -.4506471     .269911
provincedum11 |  -.2416675   .1875495    -1.29   0.198     -.610085      .12675
provincedum12 |  -.2140222   .1796874    -1.19   0.234    -.5669957    .1389512
provincedum13 |  -.1254595   .1821934    -0.69   0.491    -.4833556    .2324365
provincedum14 |     -.0984   .1990024    -0.49   0.621    -.4893154    .2925154
provincedum15 |  -.1102206   .2134803    -0.52   0.606    -.5295759    .3091347
           m1 |   .1320168   .1799581     0.73   0.464    -.2214884    .4855219
           m2 |   .1628724   .4980258     0.33   0.744    -.8154371    1.141182
           m3 |   .5183816   .3142958     1.65   0.100    -.0990131    1.135776
        _cons |   .2199691   .4854101     0.45   0.651    -.7335582    1.173497
-------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu if inrange(birt
> hyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_en
> trant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,097
-------------+----------------------------------   F(9, 1087)      =     21.23
       Model |  38.7112006         9  4.30124451   Prob > F        =    0.0000
    Residual |  220.251425     1,087  .202623206   R-squared       =    0.1495
-------------+----------------------------------   Adj R-squared   =    0.1424
       Total |  258.962625     1,096  .236279768   Root MSE        =    .45014

------------------------------------------------------------------------------
gen_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0404414   .0281931     1.43   0.152    -.0148778    .0957605
         exp |   .0384093   .0173565     2.21   0.027     .0043532    .0724654
      expsqr |  -.0009104   .0004966    -1.83   0.067    -.0018848     .000064
  highvocedu |   .2316561   .0379747     6.10   0.000      .157144    .3061682
  highgenedu |   .5005949   .0429749    11.65   0.000     .4162717    .5849181
    adultedu |   .2594961   .0659559     3.93   0.000     .1300809    .3889114
         _m1 |   .2350026   .2107626     1.12   0.265     -.178545    .6485502
         _m2 |  -.0569028   .0698671    -0.81   0.416    -.1939925    .0801868
         _m3 |   .0869325    .159854     0.54   0.587    -.2267248    .4005898
       _cons |  -.0104176   .0920443    -0.11   0.910    -.1910223    .1701871
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2148867          .        .       .            .           .
        rho1 |   .5069533          .        .       .            .           .
        rho2 |  -.1227521          .        .       .            .           .
        rho3 |   .1875329          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if inr
> ange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,097
-------------+----------------------------------   F(9, 1087)      =     21.23
       Model |  38.7112006         9  4.30124451   Prob > F        =    0.0000
    Residual |  220.251425     1,087  .202623206   R-squared       =    0.1495
-------------+----------------------------------   Adj R-squared   =    0.1424
       Total |  258.962625     1,096  .236279768   Root MSE        =    .45014

------------------------------------------------------------------------------
gen_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0404414   .0281931     1.43   0.152    -.0148778    .0957605
         exp |   .0384093   .0173565     2.21   0.027     .0043532    .0724654
      expsqr |  -.0009104   .0004966    -1.83   0.067    -.0018848     .000064
  highvocedu |   .2316561   .0379747     6.10   0.000      .157144    .3061682
  highgenedu |   .5005949   .0429749    11.65   0.000     .4162717    .5849181
    adultedu |   .2594961   .0659559     3.93   0.000     .1300809    .3889114
          m1 |   .2350026   .2107626     1.12   0.265     -.178545    .6485502
          m2 |  -.0569028   .0698671    -0.81   0.416    -.1939925    .0801868
          m3 |   .0869325    .159854     0.54   0.587    -.2267248    .4005898
       _cons |  -.0104176   .0920443    -0.11   0.910    -.1910223    .1701871
------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Gen, Higheredu Seperate,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entra
> nt_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,097
-------------+----------------------------------   F(23, 1073)     =      9.39
       Model |  43.3875773        23   1.8864164   Prob > F        =    0.0000
    Residual |  215.575048     1,073  .200908712   R-squared       =    0.1675
-------------+----------------------------------   Adj R-squared   =    0.1497
       Total |  258.962625     1,096  .236279768   Root MSE        =    .44823

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0415601   .0283512     1.47   0.143      -.01407    .0971903
          exp |   .0461245   .0200628     2.30   0.022     .0067578    .0854913
       expsqr |   -.001034   .0005449    -1.90   0.058    -.0021032    .0000353
   highvocedu |   .2217702   .0390007     5.69   0.000      .145244    .2982965
   highgenedu |   .4847681     .04428    10.95   0.000     .3978829    .5716533
     adultedu |   .2696702   .0664615     4.06   0.000     .1392609    .4000795
 provincedum2 |  -.1521985   .1154744    -1.32   0.188    -.3787798    .0743829
 provincedum3 |  -.0637853   .1280961    -0.50   0.619    -.3151326    .1875619
 provincedum4 |  -.2676176    .151597    -1.77   0.078    -.5650777    .0298425
 provincedum5 |  -.0216112   .0916934    -0.24   0.814    -.2015299    .1583076
 provincedum6 |   .0383161   .1003453     0.38   0.703    -.1585792    .2352113
 provincedum7 |  -.0643762   .1069006    -0.60   0.547     -.274134    .1453816
 provincedum8 |  -.1333447   .1022467    -1.30   0.192    -.3339708    .0672814
 provincedum9 |   -.003543   .0935046    -0.04   0.970    -.1870156    .1799295
provincedum10 |  -.0077447   .0944966    -0.08   0.935    -.1931638    .1776744
provincedum11 |  -.1011462   .1005596    -1.01   0.315     -.298462    .0961695
provincedum12 |  -.2823119   .1197105    -2.36   0.019     -.517205   -.0474187
provincedum13 |  -.0091561    .102976    -0.09   0.929    -.2112134    .1929012
provincedum14 |  -.0526063   .1132807    -0.46   0.642    -.2748831    .1696705
provincedum15 |  -.0826697   .1055767    -0.78   0.434      -.28983    .1244905
          _m1 |   .3575352   .2834378     1.26   0.207    -.1986201    .9136905
          _m2 |    -.12531   .0888101    -1.41   0.159    -.2995712    .0489511
          _m3 |   .1031898    .172463     0.60   0.550    -.2352132    .4415927
        _cons |   .0705712   .1523501     0.46   0.643    -.2283667    .3695092
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .232682          .        .       .            .           .
        rho1 |   .7412034          .        .       .            .           .
        rho2 |  -.2597793          .        .       .            .           .
        rho3 |   .2139219          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,097
-------------+----------------------------------   F(23, 1073)     =      9.39
       Model |  43.3875773        23   1.8864164   Prob > F        =    0.0000
    Residual |  215.575048     1,073  .200908712   R-squared       =    0.1675
-------------+----------------------------------   Adj R-squared   =    0.1497
       Total |  258.962625     1,096  .236279768   Root MSE        =    .44823

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0415601   .0283512     1.47   0.143      -.01407    .0971903
          exp |   .0461245   .0200628     2.30   0.022     .0067578    .0854913
       expsqr |   -.001034   .0005449    -1.90   0.058    -.0021032    .0000353
   highvocedu |   .2217702   .0390007     5.69   0.000      .145244    .2982965
   highgenedu |   .4847681     .04428    10.95   0.000     .3978829    .5716533
     adultedu |   .2696702   .0664615     4.06   0.000     .1392609    .4000795
 provincedum2 |  -.1521985   .1154744    -1.32   0.188    -.3787798    .0743829
 provincedum3 |  -.0637853   .1280961    -0.50   0.619    -.3151326    .1875619
 provincedum4 |  -.2676176    .151597    -1.77   0.078    -.5650777    .0298425
 provincedum5 |  -.0216112   .0916934    -0.24   0.814    -.2015299    .1583076
 provincedum6 |   .0383161   .1003453     0.38   0.703    -.1585792    .2352113
 provincedum7 |  -.0643762   .1069006    -0.60   0.547     -.274134    .1453816
 provincedum8 |  -.1333447   .1022467    -1.30   0.192    -.3339708    .0672814
 provincedum9 |   -.003543   .0935046    -0.04   0.970    -.1870156    .1799295
provincedum10 |  -.0077447   .0944966    -0.08   0.935    -.1931638    .1776744
provincedum11 |  -.1011462   .1005596    -1.01   0.315     -.298462    .0961695
provincedum12 |  -.2823119   .1197105    -2.36   0.019     -.517205   -.0474187
provincedum13 |  -.0091561    .102976    -0.09   0.929    -.2112134    .1929012
provincedum14 |  -.0526063   .1132807    -0.46   0.642    -.2748831    .1696705
provincedum15 |  -.0826697   .1055767    -0.78   0.434      -.28983    .1244905
           m1 |   .3575352   .2834378     1.26   0.207    -.1986201    .9136905
           m2 |    -.12531   .0888101    -1.41   0.159    -.2995712    .0489511
           m3 |   .1031898    .172463     0.60   0.550    -.2352132    .4415927
        _cons |   .0705712   .1523501     0.46   0.643    -.2283667    .3695092
-------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr higheredu if inrange(birthyear, 1971, 1992), s
> el(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_v
> s_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,097
-------------+----------------------------------   F(7, 1089)      =     19.56
       Model |  28.9236887         7  4.13195552   Prob > F        =    0.0000
    Residual |  230.038937     1,089  .211238693   R-squared       =    0.1117
-------------+----------------------------------   Adj R-squared   =    0.1060
       Total |  258.962625     1,096  .236279768   Root MSE        =    .45961

------------------------------------------------------------------------------
gen_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0380025   .0287337     1.32   0.186    -.0183772    .0943822
         exp |   .0261044   .0175818     1.48   0.138    -.0083936    .0606024
      expsqr |  -.0006469   .0005051    -1.28   0.201    -.0016379    .0003442
   higheredu |   .3192827    .034319     9.30   0.000     .2519439    .3866216
         _m1 |   .4079048   .2136923     1.91   0.057    -.0113904       .8272
         _m2 |   -.061978    .071303    -0.87   0.385    -.2018848    .0779288
         _m3 |    .119825   .1631351     0.73   0.463    -.2002697    .4399197
       _cons |   .1706607   .0893443     1.91   0.056    -.0046457    .3459672
------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2496812          .        .       .            .           .
        rho1 |   .8163303          .        .       .            .           .
        rho2 |  -.1240351          .        .       .            .           .
        rho3 |   .2398029          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr higheredu m1 m2 m3 if inrange(birthyear, 1971,
>  1992)

      Source |       SS           df       MS      Number of obs   =     1,097
-------------+----------------------------------   F(7, 1089)      =     19.56
       Model |  28.9236887         7  4.13195552   Prob > F        =    0.0000
    Residual |  230.038937     1,089  .211238693   R-squared       =    0.1117
-------------+----------------------------------   Adj R-squared   =    0.1060
       Total |  258.962625     1,096  .236279768   Root MSE        =    .45961

------------------------------------------------------------------------------
gen_longte~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        male |   .0380025   .0287337     1.32   0.186    -.0183772    .0943822
         exp |   .0261044   .0175818     1.48   0.138    -.0083936    .0606024
      expsqr |  -.0006469   .0005051    -1.28   0.201    -.0016379    .0003442
   higheredu |   .3192827    .034319     9.30   0.000     .2519439    .3866216
          m1 |   .4079048   .2136923     1.91   0.057    -.0113904       .8272
          m2 |   -.061978    .071303    -0.87   0.385    -.2018848    .0779288
          m3 |    .119825   .1631351     0.73   0.463    -.2002697    .4399197
       _cons |   .1706607   .0893443     1.91   0.056    -.0046457    .3459672
------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Gen, Higheredu Together,) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 if inrang
> e(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,097
-------------+----------------------------------   F(21, 1075)     =      7.83
       Model |  34.3382918        21  1.63515675   Prob > F        =    0.0000
    Residual |  224.624334     1,075  .208952868   R-squared       =    0.1326
-------------+----------------------------------   Adj R-squared   =    0.1157
       Total |  258.962625     1,096  .236279768   Root MSE        =    .45711

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0406166     .02887     1.41   0.160    -.0160314    .0972645
          exp |   .0377436    .020391     1.85   0.064     -.002267    .0777542
       expsqr |  -.0008718   .0005549    -1.57   0.116    -.0019606    .0002171
    higheredu |   .3079179   .0354292     8.69   0.000     .2383998    .3774361
 provincedum2 |  -.2103166   .1172788    -1.79   0.073    -.4404378    .0198046
 provincedum3 |   -.105098   .1304844    -0.81   0.421    -.3611309     .150935
 provincedum4 |  -.3059262   .1544639    -1.98   0.048    -.6090112   -.0028412
 provincedum5 |  -.0358949   .0934334    -0.38   0.701    -.2192273    .1474376
 provincedum6 |   .0047605   .1021879     0.05   0.963    -.1957498    .2052708
 provincedum7 |  -.1165266   .1087068    -1.07   0.284    -.3298281    .0967748
 provincedum8 |  -.1785745   .1040138    -1.72   0.086    -.3826675    .0255185
 provincedum9 |  -.0409546   .0951389    -0.43   0.667    -.2276336    .1457245
provincedum10 |  -.0542839   .0960573    -0.57   0.572     -.242765    .1341972
provincedum11 |  -.1347738    .102257    -1.32   0.188    -.3354198    .0658722
provincedum12 |  -.3220778   .1214215    -2.65   0.008    -.5603278   -.0838279
provincedum13 |   -.044671   .1047494    -0.43   0.670    -.2502075    .1608656
provincedum14 |  -.1071829   .1150217    -0.93   0.352    -.3328754    .1185096
provincedum15 |  -.1526341   .1070976    -1.43   0.154    -.3627782    .0575099
          _m1 |   .6391225   .2857997     2.24   0.026      .078334    1.199911
          _m2 |  -.1535651   .0904686    -1.70   0.090    -.3310801    .0239499
          _m3 |   .1323741   .1758153     0.75   0.452    -.2126059    .4773541
        _cons |   .3046099   .1502041     2.03   0.043     .0098835    .5993363
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3089664          .        .       .            .           .
        rho1 |   1.149816          .        .       .            .           .
        rho2 |  -.2762721          .        .       .            .           .
        rho3 |   .2381482          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 
> if inrange(birthyear, 1971, 1992)

      Source |       SS           df       MS      Number of obs   =     1,097
-------------+----------------------------------   F(21, 1075)     =      7.83
       Model |  34.3382918        21  1.63515675   Prob > F        =    0.0000
    Residual |  224.624334     1,075  .208952868   R-squared       =    0.1326
-------------+----------------------------------   Adj R-squared   =    0.1157
       Total |  258.962625     1,096  .236279768   Root MSE        =    .45711

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0406166     .02887     1.41   0.160    -.0160314    .0972645
          exp |   .0377436    .020391     1.85   0.064     -.002267    .0777542
       expsqr |  -.0008718   .0005549    -1.57   0.116    -.0019606    .0002171
    higheredu |   .3079179   .0354292     8.69   0.000     .2383998    .3774361
 provincedum2 |  -.2103166   .1172788    -1.79   0.073    -.4404378    .0198046
 provincedum3 |   -.105098   .1304844    -0.81   0.421    -.3611309     .150935
 provincedum4 |  -.3059262   .1544639    -1.98   0.048    -.6090112   -.0028412
 provincedum5 |  -.0358949   .0934334    -0.38   0.701    -.2192273    .1474376
 provincedum6 |   .0047605   .1021879     0.05   0.963    -.1957498    .2052708
 provincedum7 |  -.1165266   .1087068    -1.07   0.284    -.3298281    .0967748
 provincedum8 |  -.1785745   .1040138    -1.72   0.086    -.3826675    .0255185
 provincedum9 |  -.0409546   .0951389    -0.43   0.667    -.2276336    .1457245
provincedum10 |  -.0542839   .0960573    -0.57   0.572     -.242765    .1341972
provincedum11 |  -.1347738    .102257    -1.32   0.188    -.3354198    .0658722
provincedum12 |  -.3220778   .1214215    -2.65   0.008    -.5603278   -.0838279
provincedum13 |   -.044671   .1047494    -0.43   0.670    -.2502075    .1608656
provincedum14 |  -.1071829   .1150217    -0.93   0.352    -.3328754    .1185096
provincedum15 |  -.1526341   .1070976    -1.43   0.154    -.3627782    .0575099
           m1 |   .6391225   .2857997     2.24   0.026      .078334    1.199911
           m2 |  -.1535651   .0904686    -1.70   0.090    -.3310801    .0239499
           m3 |   .1323741   .1758153     0.75   0.452    -.2126059    .4773541
        _cons |   .3046099   .1502041     2.03   0.043     .0098835    .5993363
-------------------------------------------------------------------------------

. outreg2 using "`xlspath4'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/Selmlog Job-t
> ypes & Unemployment/Rural/Selmlog Rural Long-term contract.xls
dir : seeout

. drop m1 m2 m3

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/Alternative Dependent Variables/
> Selmlog Job-types & Unemployment/Rural/Selmlog Rural (1) Unemployment A20=5 (2) Unemploymen
> t A20=5|9 (3) High occupation (4) Long-term contract.log
  log type:  text
 closed on:   8 Aug 2024, 12:18:41
---------------------------------------------------------------------------------------------
