---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Fra
> me/Exp/IV Urban ATF Exp 1979 1971-1992.log
  log type:  text
 opened on:   6 Aug 2024, 17:32:54

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,362 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. *1)
. ivregress 2sls log_monthlyearning exp expsqr male (higheredu secgenhighedu secgenedu = t d 
> td) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & educat != ., 
> first

First-stage regressions
-----------------------

                                                       Number of obs =  10,621
                                                       F(6, 10614)   = 3524.40
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6658
                                                       Adj R-squared =  0.6656
                                                       Root MSE      =  0.2874

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1501127   .0026937   -55.73   0.000    -.1553928   -.1448327
      expsqr |   .0004701   .0000702     6.69   0.000     .0003325    .0006078
        male |  -.0104075   .0055951    -1.86   0.063     -.021375      .00056
           t |  -.0109106   .0002013   -54.20   0.000    -.0113052   -.0105159
           d |   .0180214   .0117332     1.54   0.125    -.0049779    .0410206
          td |  -.0004809    .000232    -2.07   0.038    -.0009357   -.0000261
       _cons |   3.296922    .031311   105.30   0.000     3.235546    3.358297
------------------------------------------------------------------------------

                                                       Number of obs =  10,621
                                                       F(6, 10614)   = 2472.12
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5829
                                                       Adj R-squared =  0.5827
                                                       Root MSE      =  0.3144

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1523933   .0029464   -51.72   0.000    -.1581689   -.1466177
      expsqr |   .0008848   .0000768    11.52   0.000     .0007342    .0010354
        male |   .0038782   .0061202     0.63   0.526    -.0081185     .015875
           t |   -.009335   .0002202   -42.39   0.000    -.0097667   -.0089034
           d |   .0265223   .0128344     2.07   0.039     .0013646      .05168
          td |  -.0010454   .0002538    -4.12   0.000    -.0015429   -.0005479
       _cons |   3.089084   .0342495    90.19   0.000     3.021948    3.156219
------------------------------------------------------------------------------

                                                       Number of obs =  10,621
                                                       F(6, 10614)   = 1581.05
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4719
                                                       Adj R-squared =  0.4716
                                                       Root MSE      =  0.3634

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1035804    .003406   -30.41   0.000    -.1102569   -.0969039
      expsqr |  -.0002668   .0000888    -3.00   0.003    -.0004408   -.0000927
        male |   .0150167   .0070749     2.12   0.034     .0011487    .0288848
           t |  -.0108676   .0002546   -42.69   0.000    -.0113666   -.0103686
           d |   .0034474   .0148363     0.23   0.816    -.0256345    .0325294
          td |   .0020381   .0002934     6.95   0.000      .001463    .0026132
       _cons |    2.66944   .0395919    67.42   0.000     2.591832    2.747048
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(6)    =     275.73
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     1.4776

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -4.559965   9.159274    -0.50   0.619    -22.51181    13.39188
secgenhighedu |   4.872829   8.196691     0.59   0.552    -11.19239    20.93805
    secgenedu |   .8630478   2.242713     0.38   0.700    -3.532589    5.258685
          exp |   .0934109   .1028277     0.91   0.364    -.1081276    .2949494
       expsqr |  -.0021608   .0023667    -0.91   0.361    -.0067995    .0024779
         male |   .2137738   .1629076     1.31   0.189    -.1055193    .5330669
        _cons |   7.105755   1.047007     6.79   0.000     5.053659    9.157851
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  140.278  (p = 0.0000)
  Wu-Hausman F(3,10611)           =  47.3406  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.755  Chi-sq(6) P-value = 0.9932

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr male provincedum2-provincedum15 (higheredu sec
> genhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning,
>  250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                       Number of obs =  10,621
                                                       F(20, 10600)  = 1082.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6712
                                                       Adj R-squared =  0.6706
                                                       Root MSE      =  0.2853

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1509755   .0026819   -56.29   0.000    -.1562326   -.1457184
       expsqr |   .0004799   .0000698     6.88   0.000     .0003431    .0006167
         male |  -.0109575   .0055575    -1.97   0.049    -.0218512   -.0000639
 provincedum2 |   .0808483   .0151773     5.33   0.000     .0510979    .1105986
 provincedum3 |   .0809459   .0157361     5.14   0.000     .0501001    .1117917
 provincedum4 |   -.013498    .015202    -0.89   0.375    -.0432968    .0163009
 provincedum5 |   .0030138   .0139904     0.22   0.829    -.0244101    .0304377
 provincedum6 |   .0711015   .0154877     4.59   0.000     .0407428    .1014602
 provincedum7 |   .0392844   .0146188     2.69   0.007     .0106288    .0679399
 provincedum8 |   .0432969   .0143329     3.02   0.003     .0152018     .071392
 provincedum9 |  -.0153636   .0146959    -1.05   0.296    -.0441702    .0134431
provincedum10 |   -.010238   .0150568    -0.68   0.497    -.0397521    .0192762
provincedum11 |  -.0177849   .0127423    -1.40   0.163    -.0427622    .0071925
provincedum12 |  -.0125351   .0156945    -0.80   0.424    -.0432991     .018229
provincedum13 |   .0062463   .0145197     0.43   0.667     -.022215    .0347076
provincedum14 |   .0311984    .018513     1.69   0.092    -.0050905    .0674873
provincedum15 |    .092296   .0186688     4.94   0.000     .0557016    .1288904
            t |    -.01092    .000201   -54.34   0.000     -.011314   -.0105261
            d |    .018446   .0116654     1.58   0.114    -.0044204    .0413124
           td |  -.0005301   .0002306    -2.30   0.022    -.0009821   -.0000781
        _cons |   3.292846   .0318202   103.48   0.000     3.230473     3.35522
-------------------------------------------------------------------------------

                                                        Number of obs = 10,621
                                                        F(20, 10600)  = 752.51
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5867
                                                        Adj R-squared = 0.5860
                                                        Root MSE      = 0.3132

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1532501    .002944   -52.05   0.000     -.159021   -.1474793
       expsqr |   .0008931   .0000766    11.66   0.000      .000743    .0010433
         male |   .0030732   .0061006     0.50   0.614    -.0088851    .0150314
 provincedum2 |   .0466646   .0166605     2.80   0.005     .0140069    .0793222
 provincedum3 |    .073641   .0172739     4.26   0.000     .0397808    .1075012
 provincedum4 |  -.0217648   .0166876    -1.30   0.192    -.0544756    .0109461
 provincedum5 |  -.0062214   .0153576    -0.41   0.685    -.0363252    .0238825
 provincedum6 |   .0735923   .0170012     4.33   0.000     .0402668    .1069177
 provincedum7 |   .0305728   .0160474     1.91   0.057    -.0008831    .0620286
 provincedum8 |   .0402683   .0157335     2.56   0.010     .0094276     .071109
 provincedum9 |   .0021997    .016132     0.14   0.892    -.0294221    .0338214
provincedum10 |  -.0095714   .0165282    -0.58   0.563    -.0419697     .022827
provincedum11 |  -.0034374   .0139876    -0.25   0.806    -.0308557    .0239808
provincedum12 |  -.0183074   .0172282    -1.06   0.288    -.0520778    .0154631
provincedum13 |   .0046462   .0159386     0.29   0.771    -.0265965    .0358888
provincedum14 |   -.001614   .0203221    -0.08   0.937    -.0414491    .0382212
provincedum15 |   .0704459   .0204932     3.44   0.001     .0302753    .1106165
            t |   -.009344   .0002206   -42.36   0.000    -.0097764   -.0089116
            d |   .0263259   .0128054     2.06   0.040     .0012249    .0514269
           td |  -.0011072   .0002531    -4.37   0.000    -.0016034   -.0006111
        _cons |   3.090009   .0349298    88.46   0.000      3.02154    3.158478
-------------------------------------------------------------------------------

                                                        Number of obs = 10,621
                                                        F(20, 10600)  = 481.94
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4763
                                                        Adj R-squared = 0.4753
                                                        Root MSE      = 0.3622

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1048705   .0034051   -30.80   0.000    -.1115452   -.0981958
       expsqr |   -.000256   .0000886    -2.89   0.004    -.0004297   -.0000823
         male |   .0135565    .007056     1.92   0.055    -.0002746    .0273876
 provincedum2 |   .0440442   .0192698     2.29   0.022     .0062717    .0818166
 provincedum3 |   .0848574   .0199793     4.25   0.000     .0456942    .1240207
 provincedum4 |  -.0400382   .0193012    -2.07   0.038    -.0778722   -.0022043
 provincedum5 |  -.0000972   .0177629    -0.01   0.996    -.0349159    .0347214
 provincedum6 |   .0678597   .0196638     3.45   0.001     .0293149    .1064046
 provincedum7 |   .0156452   .0185607     0.84   0.399    -.0207371    .0520276
 provincedum8 |   .0676935   .0181977     3.72   0.000     .0320226    .1033644
 provincedum9 |   .0290789   .0186586     1.56   0.119    -.0074954    .0656532
provincedum10 |   .0000374   .0191168     0.00   0.998    -.0374352    .0375099
provincedum11 |   .0402042   .0161782     2.49   0.013     .0084918    .0719166
provincedum12 |    .017043   .0199264     0.86   0.392    -.0220165    .0561025
provincedum13 |    .018794   .0184349     1.02   0.308    -.0173418    .0549298
provincedum14 |  -.0434831   .0235049    -1.85   0.064    -.0895572    .0025909
provincedum15 |   .0589298   .0237028     2.49   0.013     .0124678    .1053918
            t |  -.0108984   .0002552   -42.71   0.000    -.0113986   -.0103983
            d |   .0025485   .0148109     0.17   0.863    -.0264837    .0315807
           td |   .0019425   .0002928     6.64   0.000     .0013686    .0025163
        _cons |   2.670069   .0404004    66.09   0.000     2.590877    2.749261
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(20)   =     479.79
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     1.3054

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -3.866235   9.652459    -0.40   0.689    -22.78471    15.05224
secgenhighedu |   4.177021   8.544155     0.49   0.625    -12.56922    20.92326
    secgenedu |   .7470756   2.418898     0.31   0.757    -3.993877    5.488028
          exp |   .0851581   .1030861     0.83   0.409     -.116887    .2872033
       expsqr |  -.0019655   .0023949    -0.82   0.412    -.0066595    .0027285
         male |   .2287067   .1664812     1.37   0.170    -.0975905    .5550039
 provincedum2 |   -.388794   .2863522    -1.36   0.175    -.9500341    .1724461
 provincedum3 |  -.2543994   .0872876    -2.91   0.004    -.4254798   -.0833189
 provincedum4 |  -.3450885   .1687496    -2.04   0.041    -.6758316   -.0143454
 provincedum5 |   .0157762   .1063135     0.15   0.882    -.1925944    .2241468
 provincedum6 |  -.2261121   .1244269    -1.82   0.069    -.4699843    .0177601
 provincedum7 |  -.2179412   .1058215    -2.06   0.039    -.4253476   -.0105348
 provincedum8 |  -.4680306   .1085631    -4.31   0.000    -.6808104   -.2552508
 provincedum9 |  -.2215245   .2449165    -0.90   0.366    -.7015521    .2585031
provincedum10 |  -.1809646   .0703564    -2.57   0.010    -.3188606   -.0430686
provincedum11 |  -.1492634   .2449339    -0.61   0.542    -.6293251    .3307982
provincedum12 |  -.2146877   .0729875    -2.94   0.003    -.3577407   -.0716348
provincedum13 |  -.1623393   .0703272    -2.31   0.021    -.3001781   -.0245005
provincedum14 |  -.1053206   .4304653    -0.24   0.807     -.949017    .7383759
provincedum15 |  -.2881776   .1723374    -1.67   0.094    -.6259527    .0495975
        _cons |   7.393619   1.038466     7.12   0.000     5.358264    9.428974
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  109.923  (p = 0.0000)
  Wu-Hausman F(3,10597)           =  36.9405  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   3.440  Chi-sq(20) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu secgenhighedu secgenedu = t d td ) 
> if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 1 & educa
> t != ., first

First-stage regressions
-----------------------

                                                       Number of obs =   5,674
                                                       F(5, 5668)    = 2300.15
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6699
                                                       Adj R-squared =  0.6696
                                                       Root MSE      =  0.2850

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |    -.15467   .0036815   -42.01   0.000     -.161887   -.1474529
      expsqr |   .0005867   .0000951     6.17   0.000     .0004002    .0007731
           t |  -.0105992   .0002695   -39.33   0.000    -.0111276   -.0100708
           d |   .0201685   .0158881     1.27   0.204    -.0109783    .0513152
          td |  -.0009893   .0003109    -3.18   0.001    -.0015988   -.0003798
       _cons |   3.338794   .0427716    78.06   0.000     3.254945    3.422643
------------------------------------------------------------------------------

                                                       Number of obs =   5,674
                                                       F(5, 5668)    = 1658.79
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5940
                                                       Adj R-squared =  0.5937
                                                       Root MSE      =  0.3096

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1551877   .0039993   -38.80   0.000    -.1630279   -.1473475
      expsqr |   .0009098   .0001033     8.81   0.000     .0007072    .0011123
           t |  -.0094208   .0002928   -32.18   0.000    -.0099948   -.0088468
           d |   .0390341   .0172599     2.26   0.024     .0051981    .0728701
          td |  -.0013508   .0003377    -4.00   0.000    -.0020129   -.0006887
       _cons |   3.143263   .0464645    67.65   0.000     3.052175    3.234352
------------------------------------------------------------------------------

                                                       Number of obs =   5,674
                                                       F(5, 5668)    = 1053.31
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4816
                                                       Adj R-squared =  0.4812
                                                       Root MSE      =  0.3602

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |   -.105199   .0046521   -22.61   0.000    -.1143188   -.0960792
      expsqr |  -.0002594   .0001202    -2.16   0.031     -.000495   -.0000238
           t |  -.0108865   .0003406   -31.96   0.000    -.0115542   -.0102189
           d |   .0174534   .0200769     0.87   0.385    -.0219051    .0568118
          td |   .0017492   .0003929     4.45   0.000      .000979    .0025193
       _cons |   2.716794   .0540481    50.27   0.000      2.61084    2.822749
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(5)    =     197.33
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .84556

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -1.796525   2.472965    -0.73   0.468    -6.643447    3.050397
secgenhighedu |    2.60504   2.272021     1.15   0.252     -1.84804     7.05812
    secgenedu |  -.1418899   .5740388    -0.25   0.805    -1.266985    .9832056
          exp |   .0605678   .0216492     2.80   0.005     .0181361    .1029996
       expsqr |  -.0013338   .0005268    -2.53   0.011    -.0023662   -.0003013
        _cons |   7.766428   .2201914    35.27   0.000     7.334861    8.197995
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  77.6694  (p = 0.0000)
  Wu-Hausman F(3,5665)            =  26.2075  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.733  Chi-sq(5) P-value = 0.8847

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu secgenhi
> ghedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250,
>  25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,674
                                                        F(19, 5654)   = 622.71
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6766
                                                        Adj R-squared = 0.6756
                                                        Root MSE      = 0.2824

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1559154   .0036634   -42.56   0.000    -.1630971   -.1487338
       expsqr |   .0005992   .0000944     6.35   0.000     .0004142    .0007842
 provincedum2 |   .0946721   .0205322     4.61   0.000      .054421    .1349231
 provincedum3 |    .094548   .0214945     4.40   0.000     .0524106    .1366854
 provincedum4 |  -.0101997   .0209191    -0.49   0.626    -.0512091    .0308098
 provincedum5 |   .0053339    .019148     0.28   0.781    -.0322036    .0428714
 provincedum6 |   .0776578   .0208932     3.72   0.000      .036699    .1186165
 provincedum7 |   .0372192    .020256     1.84   0.066    -.0024904    .0769287
 provincedum8 |   .0577317   .0195631     2.95   0.003     .0193805    .0960828
 provincedum9 |  -.0009141   .0199029    -0.05   0.963    -.0399315    .0381032
provincedum10 |  -.0047243   .0207582    -0.23   0.820    -.0454184    .0359698
provincedum11 |  -.0198635    .017473    -1.14   0.256    -.0541173    .0143903
provincedum12 |  -.0178107   .0216764    -0.82   0.411    -.0603047    .0246834
provincedum13 |   .0104213   .0200463     0.52   0.603     -.028877    .0497197
provincedum14 |   .0326164   .0259004     1.26   0.208    -.0181584    .0833912
provincedum15 |   .1035899   .0257811     4.02   0.000     .0530491    .1541307
            t |  -.0106422   .0002682   -39.67   0.000    -.0111681   -.0101164
            d |   .0210735   .0157815     1.34   0.182    -.0098643    .0520113
           td |  -.0010393   .0003086    -3.37   0.001    -.0016442   -.0004343
        _cons |    3.33576   .0434393    76.79   0.000     3.250602    3.420917
-------------------------------------------------------------------------------

                                                        Number of obs =  5,674
                                                        F(19, 5654)   = 444.57
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5990
                                                        Adj R-squared = 0.5977
                                                        Root MSE      = 0.3081

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1562682   .0039964   -39.10   0.000    -.1641027   -.1484337
       expsqr |   .0009184    .000103     8.92   0.000     .0007165    .0011202
 provincedum2 |   .0545218   .0223987     2.43   0.015     .0106116    .0984319
 provincedum3 |   .0724998   .0234484     3.09   0.002     .0265319    .1184677
 provincedum4 |  -.0285892   .0228208    -1.25   0.210    -.0733267    .0161482
 provincedum5 |   -.005954   .0208887    -0.29   0.776    -.0469039    .0349959
 provincedum6 |   .0819013   .0227926     3.59   0.000     .0372192    .1265835
 provincedum7 |   .0371684   .0220974     1.68   0.093    -.0061509    .0804878
 provincedum8 |   .0573136   .0213415     2.69   0.007     .0154761    .0991511
 provincedum9 |   .0084566   .0217122     0.39   0.697    -.0341076    .0510209
provincedum10 |   .0014371   .0226453     0.06   0.949    -.0429564    .0458305
provincedum11 |  -.0100313   .0190614    -0.53   0.599    -.0473989    .0273364
provincedum12 |  -.0196166   .0236469    -0.83   0.407    -.0659736    .0267404
provincedum13 |   .0001421   .0218686     0.01   0.995    -.0427287    .0430129
provincedum14 |   .0139664   .0282549     0.49   0.621    -.0414242    .0693569
provincedum15 |   .0776094   .0281248     2.76   0.006     .0224741    .1327447
            t |  -.0094572   .0002926   -32.32   0.000    -.0100308   -.0088835
            d |   .0394925   .0172162     2.29   0.022     .0057422    .0732428
           td |    -.00141   .0003366    -4.19   0.000    -.0020699   -.0007501
        _cons |   3.144687   .0473882    66.36   0.000     3.051788    3.237586
-------------------------------------------------------------------------------

                                                        Number of obs =  5,674
                                                        F(19, 5654)   = 281.96
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4865
                                                        Adj R-squared = 0.4848
                                                        Root MSE      = 0.3589

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1066228   .0046554   -22.90   0.000    -.1157492   -.0974964
       expsqr |  -.0002547   .0001199    -2.12   0.034    -.0004899   -.0000196
 provincedum2 |   .0478437   .0260923     1.83   0.067    -.0033072    .0989947
 provincedum3 |   .0812753   .0273151     2.98   0.003     .0277272    .1348234
 provincedum4 |  -.0403521   .0265839    -1.52   0.129    -.0924668    .0117626
 provincedum5 |   .0209211   .0243333     0.86   0.390    -.0267815    .0686237
 provincedum6 |   .0945701   .0265511     3.56   0.000     .0425198    .1466204
 provincedum7 |   .0260893   .0257413     1.01   0.311    -.0243735    .0765521
 provincedum8 |   .0864532   .0248607     3.48   0.001     .0377166    .1351897
 provincedum9 |   .0301377   .0252926     1.19   0.233    -.0194455    .0797209
provincedum10 |   .0331593   .0263795     1.26   0.209    -.0185547    .0848733
provincedum11 |   .0491611   .0222047     2.21   0.027     .0056315    .0926907
provincedum12 |   .0021168   .0275463     0.08   0.939    -.0518845    .0561181
provincedum13 |   .0426448   .0254747     1.67   0.094    -.0072954    .0925851
provincedum14 |  -.0350252   .0329142    -1.06   0.287    -.0995497    .0294993
provincedum15 |   .0419789   .0327626     1.28   0.200    -.0222482    .1062061
            t |  -.0109558   .0003409   -32.14   0.000    -.0116241   -.0102876
            d |   .0176875   .0200551     0.88   0.378    -.0216282    .0570033
           td |   .0016521   .0003922     4.21   0.000     .0008833    .0024209
        _cons |   2.711494   .0552026    49.12   0.000     2.603276    2.819712
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(19)   =     417.34
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .77894

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   -1.41528   2.362826    -0.60   0.549    -6.046333    3.215774
secgenhighedu |    2.18476   2.151895     1.02   0.310    -2.032876    6.402396
    secgenedu |  -.1611325   .5572796    -0.29   0.772     -1.25338    .9311154
          exp |   .0582571   .0194347     3.00   0.003     .0201658    .0963485
       expsqr |  -.0012713   .0004755    -2.67   0.008    -.0022033   -.0003393
 provincedum2 |  -.3754048   .1023983    -3.67   0.000    -.5761019   -.1747078
 provincedum3 |  -.1268123   .0663893    -1.91   0.056    -.2569328    .0033083
 provincedum4 |  -.3200035   .0823822    -3.88   0.000    -.4814696   -.1585374
 provincedum5 |   .0494346   .0560327     0.88   0.378    -.0603874    .1592566
 provincedum6 |  -.1357713   .0675703    -2.01   0.045    -.2682066    -.003336
 provincedum7 |  -.2076154   .0558739    -3.72   0.000    -.3171262   -.0981047
 provincedum8 |  -.4249292   .0607807    -6.99   0.000    -.5440571   -.3058013
 provincedum9 |  -.0936571   .0642268    -1.46   0.145    -.2195394    .0322252
provincedum10 |  -.1577442   .0643077    -2.45   0.014     -.283785   -.0317034
provincedum11 |  -.0324668   .0703521    -0.46   0.644    -.1703544    .1054209
provincedum12 |  -.1771549   .0602608    -2.94   0.003    -.2952639    -.059046
provincedum13 |  -.1108065   .0569882    -1.94   0.052    -.2225014    .0008883
provincedum14 |  -.2925524   .0985449    -2.97   0.003    -.4856969    -.099408
provincedum15 |  -.3292395   .0936642    -3.52   0.000     -.512818   -.1456611
        _cons |   7.947207   .2029317    39.16   0.000     7.549468    8.344946
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =   60.196  (p = 0.0000)
  Wu-Hausman F(3,5651)            =  20.1983  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  19.878  Chi-sq(19) P-value = 0.4020

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu secgenhighedu secgenedu = t d td ) 
> if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 0 & educa
> t != ., first

First-stage regressions
-----------------------

                                                       Number of obs =   4,947
                                                       F(5, 4941)    = 1929.32
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6613
                                                       Adj R-squared =  0.6609
                                                       Root MSE      =  0.2901

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1448364   .0039572   -36.60   0.000    -.1525943   -.1370784
      expsqr |   .0003317   .0001042     3.18   0.001     .0001273    .0005361
           t |  -.0112991   .0003027   -37.33   0.000    -.0118925   -.0107057
           d |   .0152442   .0173955     0.88   0.381    -.0188587    .0493471
          td |   .0001361   .0003483     0.39   0.696    -.0005467     .000819
       _cons |   3.237801   .0458351    70.64   0.000     3.147944    3.327658
------------------------------------------------------------------------------

                                                       Number of obs =   4,947
                                                       F(5, 4941)    = 1315.32
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5710
                                                       Adj R-squared =  0.5706
                                                       Root MSE      =  0.3196

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1490293   .0043598   -34.18   0.000    -.1575764   -.1404822
      expsqr |   .0008553   .0001149     7.45   0.000     .0006301    .0010805
           t |  -.0092295   .0003335   -27.68   0.000    -.0098833   -.0085757
           d |   .0125368   .0191651     0.65   0.513    -.0250352    .0501088
          td |  -.0006819   .0003838    -1.78   0.076    -.0014342    .0000704
       _cons |   3.027959   .0504977    59.96   0.000     2.928961    3.126957
------------------------------------------------------------------------------

                                                        Number of obs =  4,947
                                                        F(5, 4941)    = 846.66
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4614
                                                        Adj R-squared = 0.4609
                                                        Root MSE      = 0.3672

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1015729   .0050078   -20.28   0.000    -.1113904   -.0917554
      expsqr |   -.000278   .0001319    -2.11   0.035    -.0005366   -.0000193
           t |  -.0108532   .0003831   -28.33   0.000    -.0116042   -.0101023
           d |  -.0122708   .0220136    -0.56   0.577    -.0554272    .0308856
          td |   .0023889   .0004408     5.42   0.000     .0015248    .0032531
       _cons |   2.629961   .0580033    45.34   0.000     2.516249    2.743673
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(5)    =     288.01
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .96784

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   2.971161   7.381677     0.40   0.687    -11.49666    17.43898
secgenhighedu |  -2.032462   6.490936    -0.31   0.754    -14.75446    10.68954
    secgenedu |  -.7655939   2.155787    -0.36   0.722     -4.99086    3.459672
          exp |  -.0044523    .113042    -0.04   0.969    -.2260106     .217106
       expsqr |  -.0000525   .0025217    -0.02   0.983    -.0049949    .0048899
        _cons |   8.116919   1.276232     6.36   0.000      5.61555    10.61829
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  66.4517  (p = 0.0000)
  Wu-Hausman F(3,4938)            =  22.4113  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   2.804  Chi-sq(5) P-value = 0.7302

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu secgenhi
> ghedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250,
>  25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,947
                                                        F(19, 4927)   = 516.19
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6656
                                                        Adj R-squared = 0.6643
                                                        Root MSE      = 0.2887

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1452014   .0039492   -36.77   0.000    -.1529437   -.1374592
       expsqr |    .000334    .000104     3.21   0.001     .0001302    .0005379
 provincedum2 |   .0655521   .0226091     2.90   0.004     .0212281     .109876
 provincedum3 |   .0660354   .0231369     2.85   0.004     .0206768     .111394
 provincedum4 |  -.0156695   .0221614    -0.71   0.480    -.0591158    .0277767
 provincedum5 |   .0021108   .0205349     0.10   0.918    -.0381468    .0423683
 provincedum6 |   .0654874   .0231518     2.83   0.005     .0200997    .1108752
 provincedum7 |   .0432893   .0211603     2.05   0.041     .0018058    .0847729
 provincedum8 |   .0283703   .0211062     1.34   0.179    -.0130072    .0697479
 provincedum9 |  -.0322975   .0218641    -1.48   0.140    -.0751609    .0105659
provincedum10 |  -.0146631   .0219194    -0.67   0.504    -.0576349    .0283086
provincedum11 |  -.0127618   .0186735    -0.68   0.494    -.0493702    .0238466
provincedum12 |  -.0049278   .0228051    -0.22   0.829     -.049636    .0397803
provincedum13 |   .0031029   .0210991     0.15   0.883    -.0382606    .0444665
provincedum14 |   .0306742   .0265236     1.16   0.248    -.0213239    .0826723
provincedum15 |   .0818605   .0271201     3.02   0.003     .0286929     .135028
            t |  -.0112976   .0003042   -37.14   0.000     -.011894   -.0107013
            d |   .0158436   .0173473     0.91   0.361    -.0181649    .0498521
           td |   .0001086   .0003474     0.31   0.755    -.0005725    .0007898
        _cons |   3.230053   .0467184    69.14   0.000     3.138464    3.321642
-------------------------------------------------------------------------------

                                                        Number of obs =  4,947
                                                        F(19, 4927)   = 349.70
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5742
                                                        Adj R-squared = 0.5726
                                                        Root MSE      = 0.3189

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |    -.14962   .0043627   -34.30   0.000    -.1581728   -.1410673
       expsqr |   .0008646   .0001149     7.53   0.000     .0006394    .0010898
 provincedum2 |   .0387075    .024976     1.55   0.121    -.0102567    .0876717
 provincedum3 |   .0750979   .0255591     2.94   0.003     .0249908    .1252051
 provincedum4 |  -.0132622   .0244815    -0.54   0.588    -.0612568    .0347324
 provincedum5 |   -.006998   .0226847    -0.31   0.758      -.05147    .0374741
 provincedum6 |   .0638472   .0255755     2.50   0.013     .0137078    .1139865
 provincedum7 |   .0232769   .0233755     1.00   0.319    -.0225495    .0691033
 provincedum8 |   .0203664   .0233158     0.87   0.382    -.0253429    .0660758
 provincedum9 |  -.0059094   .0241531    -0.24   0.807    -.0532601    .0414413
provincedum10 |  -.0225681   .0242141    -0.93   0.351    -.0700385    .0249024
provincedum11 |   .0045437   .0206284     0.22   0.826    -.0358972    .0449846
provincedum12 |  -.0178088   .0251925    -0.71   0.480    -.0671974    .0315798
provincedum13 |   .0089466   .0233079     0.38   0.701    -.0367473    .0546405
provincedum14 |  -.0173006   .0293004    -0.59   0.555    -.0747423    .0401412
provincedum15 |   .0628491   .0299593     2.10   0.036     .0041156    .1215827
            t |  -.0091993    .000336   -27.38   0.000     -.009858   -.0085405
            d |   .0117959   .0191634     0.62   0.538    -.0257729    .0493647
           td |  -.0007548   .0003838    -1.97   0.049    -.0015072   -2.34e-06
        _cons |   3.026734   .0516093    58.65   0.000     2.925557    3.127912
-------------------------------------------------------------------------------

                                                        Number of obs =  4,947
                                                        F(19, 4927)   = 226.94
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.4667
                                                        Adj R-squared = 0.4647
                                                        Root MSE      = 0.3659

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1025846   .0050051   -20.50   0.000     -.112397   -.0927723
       expsqr |  -.0002604   .0001318    -1.98   0.048    -.0005188   -2.07e-06
 provincedum2 |   .0428593   .0286543     1.50   0.135    -.0133158    .0990345
 provincedum3 |   .0903066   .0293232     3.08   0.002     .0328201    .1477931
 provincedum4 |  -.0384116   .0280869    -1.37   0.172    -.0934744    .0166512
 provincedum5 |  -.0238023   .0260255    -0.91   0.360    -.0748238    .0272193
 provincedum6 |   .0363485    .029342     1.24   0.215    -.0211749    .0938719
 provincedum7 |   .0046271    .026818     0.17   0.863    -.0479482    .0572024
 provincedum8 |   .0469103   .0267495     1.75   0.080    -.0055307    .0993513
 provincedum9 |    .029833   .0277101     1.08   0.282    -.0244911    .0841572
provincedum10 |  -.0358358   .0277801    -1.29   0.197    -.0902972    .0186256
provincedum11 |   .0309963   .0236664     1.31   0.190    -.0154004    .0773929
provincedum12 |    .032935   .0289027     1.14   0.255    -.0237272    .0895971
provincedum13 |  -.0064967   .0267405    -0.24   0.808      -.05892    .0459266
provincedum14 |  -.0521491   .0336155    -1.55   0.121    -.1180504    .0137522
provincedum15 |   .0777081   .0343714     2.26   0.024     .0103248    .1450914
            t |  -.0108078   .0003855   -28.03   0.000    -.0115636    -.010052
            d |  -.0149484   .0219856    -0.68   0.497      -.05805    .0281532
           td |   .0022745   .0004403     5.17   0.000     .0014112    .0031378
        _cons |   2.632814   .0592099    44.47   0.000     2.516736    2.748891
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(19)   =     820.19
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .68215

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   1.453766   3.943282     0.37   0.712    -6.274925    9.182458
secgenhighedu |  -.6944581   3.400505    -0.20   0.838    -7.359326     5.97041
    secgenedu |  -.3378968   1.228061    -0.28   0.783    -2.744853    2.069059
          exp |   .0210611   .0583495     0.36   0.718    -.0933018    .1354241
       expsqr |  -.0005904   .0013161    -0.45   0.654    -.0031699    .0019891
 provincedum2 |  -.6185898   .0920941    -6.72   0.000    -.7990908   -.4380887
 provincedum3 |  -.3033263   .1177761    -2.58   0.010    -.5341632   -.0724894
 provincedum4 |  -.4665467   .0598518    -7.80   0.000     -.583854   -.3492393
 provincedum5 |  -.0841675   .0765595    -1.10   0.272    -.2342213    .0658863
 provincedum6 |  -.2453001   .0549501    -4.46   0.000    -.3530003   -.1375999
 provincedum7 |  -.3179805   .0987682    -3.22   0.001    -.5115627   -.1243984
 provincedum8 |  -.4407383   .0524329    -8.41   0.000    -.5435048   -.3379718
 provincedum9 |  -.1315514   .1524583    -0.86   0.388    -.4303642    .1672615
provincedum10 |  -.2090999     .07884    -2.65   0.008    -.3636235   -.0545763
provincedum11 |  -.0590417   .1129185    -0.52   0.601    -.2803579    .1622746
provincedum12 |  -.2501916   .0552567    -4.53   0.000    -.3584927   -.1418905
provincedum13 |  -.1718031   .0512978    -3.35   0.001    -.2723449   -.0712612
provincedum14 |  -.2965364   .2486273    -1.19   0.233    -.7838368    .1907641
provincedum15 |    -.33614   .0660908    -5.09   0.000    -.4656756   -.2066045
        _cons |   8.058843   .6617628    12.18   0.000     6.761812    9.355874
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  55.1816  (p = 0.0000)
  Wu-Hausman F(3,4924)            =  18.5149  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  23.618  Chi-sq(19) P-value = 0.2112

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning exp expsqr male (higheredu secgenhighedu = t d td ) if in
> range(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                       Number of obs =  10,621
                                                       F(6, 10614)   = 3524.40
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6658
                                                       Adj R-squared =  0.6656
                                                       Root MSE      =  0.2874

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1501127   .0026937   -55.73   0.000    -.1553928   -.1448327
      expsqr |   .0004701   .0000702     6.69   0.000     .0003325    .0006078
        male |  -.0104075   .0055951    -1.86   0.063     -.021375      .00056
           t |  -.0109106   .0002013   -54.20   0.000    -.0113052   -.0105159
           d |   .0180214   .0117332     1.54   0.125    -.0049779    .0410206
          td |  -.0004809    .000232    -2.07   0.038    -.0009357   -.0000261
       _cons |   3.296922    .031311   105.30   0.000     3.235546    3.358297
------------------------------------------------------------------------------

                                                       Number of obs =  10,621
                                                       F(6, 10614)   = 2472.12
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5829
                                                       Adj R-squared =  0.5827
                                                       Root MSE      =  0.3144

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1523933   .0029464   -51.72   0.000    -.1581689   -.1466177
      expsqr |   .0008848   .0000768    11.52   0.000     .0007342    .0010354
        male |   .0038782   .0061202     0.63   0.526    -.0081185     .015875
           t |   -.009335   .0002202   -42.39   0.000    -.0097667   -.0089034
           d |   .0265223   .0128344     2.07   0.039     .0013646      .05168
          td |  -.0010454   .0002538    -4.12   0.000    -.0015429   -.0005479
       _cons |   3.089084   .0342495    90.19   0.000     3.021948    3.156219
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(5)    =    1018.95
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .76842

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   -1.08507   .7979272    -1.36   0.174    -2.648979    .4788382
secgenhighedu |   1.789143   .8967745     2.00   0.046     .0314971    3.546788
          exp |   .0550886   .0133254     4.13   0.000     .0289713    .0812059
       expsqr |  -.0012803   .0003146    -4.07   0.000     -.001897   -.0006636
         male |   .2749023   .0187948    14.63   0.000     .2380651    .3117396
        _cons |   7.500507   .1090309    68.79   0.000      7.28681    7.714204
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  131.106  (p = 0.0000)
  Wu-Hausman F(2,10613)           =  66.3223  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .547545  (p = 0.4593)
  Basmann chi2(1)        =  .547212  (p = 0.4595)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   7.913  Chi-sq(6) P-value = 0.2445

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr male provincedum2-provincedum15 (higheredu sec
> genhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 2500
> 0) & educat != ., first

First-stage regressions
-----------------------

                                                       Number of obs =  10,621
                                                       F(20, 10600)  = 1082.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6712
                                                       Adj R-squared =  0.6706
                                                       Root MSE      =  0.2853

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1509755   .0026819   -56.29   0.000    -.1562326   -.1457184
       expsqr |   .0004799   .0000698     6.88   0.000     .0003431    .0006167
         male |  -.0109575   .0055575    -1.97   0.049    -.0218512   -.0000639
 provincedum2 |   .0808483   .0151773     5.33   0.000     .0510979    .1105986
 provincedum3 |   .0809459   .0157361     5.14   0.000     .0501001    .1117917
 provincedum4 |   -.013498    .015202    -0.89   0.375    -.0432968    .0163009
 provincedum5 |   .0030138   .0139904     0.22   0.829    -.0244101    .0304377
 provincedum6 |   .0711015   .0154877     4.59   0.000     .0407428    .1014602
 provincedum7 |   .0392844   .0146188     2.69   0.007     .0106288    .0679399
 provincedum8 |   .0432969   .0143329     3.02   0.003     .0152018     .071392
 provincedum9 |  -.0153636   .0146959    -1.05   0.296    -.0441702    .0134431
provincedum10 |   -.010238   .0150568    -0.68   0.497    -.0397521    .0192762
provincedum11 |  -.0177849   .0127423    -1.40   0.163    -.0427622    .0071925
provincedum12 |  -.0125351   .0156945    -0.80   0.424    -.0432991     .018229
provincedum13 |   .0062463   .0145197     0.43   0.667     -.022215    .0347076
provincedum14 |   .0311984    .018513     1.69   0.092    -.0050905    .0674873
provincedum15 |    .092296   .0186688     4.94   0.000     .0557016    .1288904
            t |    -.01092    .000201   -54.34   0.000     -.011314   -.0105261
            d |    .018446   .0116654     1.58   0.114    -.0044204    .0413124
           td |  -.0005301   .0002306    -2.30   0.022    -.0009821   -.0000781
        _cons |   3.292846   .0318202   103.48   0.000     3.230473     3.35522
-------------------------------------------------------------------------------

                                                        Number of obs = 10,621
                                                        F(20, 10600)  = 752.51
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5867
                                                        Adj R-squared = 0.5860
                                                        Root MSE      = 0.3132

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1532501    .002944   -52.05   0.000     -.159021   -.1474793
       expsqr |   .0008931   .0000766    11.66   0.000      .000743    .0010433
         male |   .0030732   .0061006     0.50   0.614    -.0088851    .0150314
 provincedum2 |   .0466646   .0166605     2.80   0.005     .0140069    .0793222
 provincedum3 |    .073641   .0172739     4.26   0.000     .0397808    .1075012
 provincedum4 |  -.0217648   .0166876    -1.30   0.192    -.0544756    .0109461
 provincedum5 |  -.0062214   .0153576    -0.41   0.685    -.0363252    .0238825
 provincedum6 |   .0735923   .0170012     4.33   0.000     .0402668    .1069177
 provincedum7 |   .0305728   .0160474     1.91   0.057    -.0008831    .0620286
 provincedum8 |   .0402683   .0157335     2.56   0.010     .0094276     .071109
 provincedum9 |   .0021997    .016132     0.14   0.892    -.0294221    .0338214
provincedum10 |  -.0095714   .0165282    -0.58   0.563    -.0419697     .022827
provincedum11 |  -.0034374   .0139876    -0.25   0.806    -.0308557    .0239808
provincedum12 |  -.0183074   .0172282    -1.06   0.288    -.0520778    .0154631
provincedum13 |   .0046462   .0159386     0.29   0.771    -.0265965    .0358888
provincedum14 |   -.001614   .0203221    -0.08   0.937    -.0414491    .0382212
provincedum15 |   .0704459   .0204932     3.44   0.001     .0302753    .1106165
            t |   -.009344   .0002206   -42.36   0.000    -.0097764   -.0089116
            d |   .0263259   .0128054     2.06   0.040     .0012249    .0514269
           td |  -.0011072   .0002531    -4.37   0.000    -.0016034   -.0006111
        _cons |   3.090009   .0349298    88.46   0.000      3.02154    3.158478
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(19)   =    1529.90
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .73097

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -.9138247   .7487962    -1.22   0.222    -2.381438    .5537889
secgenhighedu |   1.579172   .8401891     1.88   0.060     -.067568    3.225913
          exp |    .054056   .0123398     4.38   0.000     .0298705    .0782416
       expsqr |  -.0012437   .0002927    -4.25   0.000    -.0018174   -.0006699
         male |   .2791959   .0176358    15.83   0.000     .2446304    .3137614
 provincedum2 |     -.4738   .0442456   -10.71   0.000    -.5605198   -.3870802
 provincedum3 |  -.2390617   .0401955    -5.95   0.000    -.3178435     -.16028
 provincedum4 |  -.3923543   .0398145    -9.85   0.000    -.4703892   -.3143194
 provincedum5 |  -.0101409   .0365508    -0.28   0.781    -.0817791    .0614972
 provincedum6 |  -.1947595   .0402889    -4.83   0.000    -.2737244   -.1157947
 provincedum7 |  -.2432361   .0375229    -6.48   0.000    -.3167796   -.1696926
 provincedum8 |  -.4412614   .0366056   -12.05   0.000    -.5130071   -.3695158
 provincedum9 |  -.1491456    .039848    -3.74   0.000    -.2272462    -.071045
provincedum10 |  -.1765383   .0385701    -4.58   0.000    -.2521343   -.1009423
provincedum11 |  -.0760135   .0342574    -2.22   0.026    -.1431569   -.0088702
provincedum12 |  -.2129841   .0407525    -5.23   0.000    -.2928576   -.1331107
provincedum13 |  -.1552108   .0371985    -4.17   0.000    -.2281185    -.082303
provincedum14 |   -.234953   .0535029    -4.39   0.000    -.3398167   -.1300893
provincedum15 |  -.3340563   .0489243    -6.83   0.000     -.429946   -.2381665
        _cons |   7.709063   .1051391    73.32   0.000     7.502994    7.915131
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  101.511  (p = 0.0000)
  Wu-Hausman F(2,10599)           =  51.1391  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .304225  (p = 0.5812)
  Basmann chi2(1)        =  .303632  (p = 0.5816)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  35.958  Chi-sq(20) P-value = 0.0156

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu secgenhighedu = t d td ) if inrange
> (birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 1 & educat != ., fi
> rst

First-stage regressions
-----------------------

                                                       Number of obs =   5,674
                                                       F(5, 5668)    = 2300.15
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6699
                                                       Adj R-squared =  0.6696
                                                       Root MSE      =  0.2850

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |    -.15467   .0036815   -42.01   0.000     -.161887   -.1474529
      expsqr |   .0005867   .0000951     6.17   0.000     .0004002    .0007731
           t |  -.0105992   .0002695   -39.33   0.000    -.0111276   -.0100708
           d |   .0201685   .0158881     1.27   0.204    -.0109783    .0513152
          td |  -.0009893   .0003109    -3.18   0.001    -.0015988   -.0003798
       _cons |   3.338794   .0427716    78.06   0.000     3.254945    3.422643
------------------------------------------------------------------------------

                                                       Number of obs =   5,674
                                                       F(5, 5668)    = 1658.79
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5940
                                                       Adj R-squared =  0.5937
                                                       Root MSE      =  0.3096

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1551877   .0039993   -38.80   0.000    -.1630279   -.1473475
      expsqr |   .0009098   .0001033     8.81   0.000     .0007072    .0011123
           t |  -.0094208   .0002928   -32.18   0.000    -.0099948   -.0088468
           d |   .0390341   .0172599     2.26   0.024     .0051981    .0728701
          td |  -.0013508   .0003377    -4.00   0.000    -.0020129   -.0006887
       _cons |   3.143263   .0464645    67.65   0.000     3.052175    3.234352
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(4)    =     164.20
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =      .9268

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -2.322946   1.377681    -1.69   0.092    -5.023151    .3772585
secgenhighedu |   3.050501   1.516488     2.01   0.044     .0782385    6.022763
          exp |   .0640817   .0178968     3.58   0.000     .0290047    .0991587
       expsqr |   -.001418   .0004402    -3.22   0.001    -.0022808   -.0005552
        _cons |   7.722662   .1434708    53.83   0.000     7.441465     8.00386
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  76.0495  (p = 0.0000)
  Wu-Hausman F(2,5667)            =  38.4938  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .050855  (p = 0.8216)
  Basmann chi2(1)        =  .050802  (p = 0.8217)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   2.591  Chi-sq(5) P-value = 0.7627

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu secgenhi
> ghedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & 
> male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,674
                                                        F(19, 5654)   = 622.71
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6766
                                                        Adj R-squared = 0.6756
                                                        Root MSE      = 0.2824

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1559154   .0036634   -42.56   0.000    -.1630971   -.1487338
       expsqr |   .0005992   .0000944     6.35   0.000     .0004142    .0007842
 provincedum2 |   .0946721   .0205322     4.61   0.000      .054421    .1349231
 provincedum3 |    .094548   .0214945     4.40   0.000     .0524106    .1366854
 provincedum4 |  -.0101997   .0209191    -0.49   0.626    -.0512091    .0308098
 provincedum5 |   .0053339    .019148     0.28   0.781    -.0322036    .0428714
 provincedum6 |   .0776578   .0208932     3.72   0.000      .036699    .1186165
 provincedum7 |   .0372192    .020256     1.84   0.066    -.0024904    .0769287
 provincedum8 |   .0577317   .0195631     2.95   0.003     .0193805    .0960828
 provincedum9 |  -.0009141   .0199029    -0.05   0.963    -.0399315    .0381032
provincedum10 |  -.0047243   .0207582    -0.23   0.820    -.0454184    .0359698
provincedum11 |  -.0198635    .017473    -1.14   0.256    -.0541173    .0143903
provincedum12 |  -.0178107   .0216764    -0.82   0.411    -.0603047    .0246834
provincedum13 |   .0104213   .0200463     0.52   0.603     -.028877    .0497197
provincedum14 |   .0326164   .0259004     1.26   0.208    -.0181584    .0833912
provincedum15 |   .1035899   .0257811     4.02   0.000     .0530491    .1541307
            t |  -.0106422   .0002682   -39.67   0.000    -.0111681   -.0101164
            d |   .0210735   .0157815     1.34   0.182    -.0098643    .0520113
           td |  -.0010393   .0003086    -3.37   0.001    -.0016442   -.0004343
        _cons |    3.33576   .0434393    76.79   0.000     3.250602    3.420917
-------------------------------------------------------------------------------

                                                        Number of obs =  5,674
                                                        F(19, 5654)   = 444.57
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5990
                                                        Adj R-squared = 0.5977
                                                        Root MSE      = 0.3081

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1562682   .0039964   -39.10   0.000    -.1641027   -.1484337
       expsqr |   .0009184    .000103     8.92   0.000     .0007165    .0011202
 provincedum2 |   .0545218   .0223987     2.43   0.015     .0106116    .0984319
 provincedum3 |   .0724998   .0234484     3.09   0.002     .0265319    .1184677
 provincedum4 |  -.0285892   .0228208    -1.25   0.210    -.0733267    .0161482
 provincedum5 |   -.005954   .0208887    -0.29   0.776    -.0469039    .0349959
 provincedum6 |   .0819013   .0227926     3.59   0.000     .0372192    .1265835
 provincedum7 |   .0371684   .0220974     1.68   0.093    -.0061509    .0804878
 provincedum8 |   .0573136   .0213415     2.69   0.007     .0154761    .0991511
 provincedum9 |   .0084566   .0217122     0.39   0.697    -.0341076    .0510209
provincedum10 |   .0014371   .0226453     0.06   0.949    -.0429564    .0458305
provincedum11 |  -.0100313   .0190614    -0.53   0.599    -.0473989    .0273364
provincedum12 |  -.0196166   .0236469    -0.83   0.407    -.0659736    .0267404
provincedum13 |   .0001421   .0218686     0.01   0.995    -.0427287    .0430129
provincedum14 |   .0139664   .0282549     0.49   0.621    -.0414242    .0693569
provincedum15 |   .0776094   .0281248     2.76   0.006     .0224741    .1327447
            t |  -.0094572   .0002926   -32.32   0.000    -.0100308   -.0088835
            d |   .0394925   .0172162     2.29   0.022     .0057422    .0732428
           td |    -.00141   .0003366    -4.19   0.000    -.0020699   -.0007501
        _cons |   3.144687   .0473882    66.36   0.000     3.051788    3.237586
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(18)   =     339.63
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .86339

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -2.011701   1.277364    -1.57   0.115    -4.515289    .4918867
secgenhighedu |   2.687561    1.40499     1.91   0.056    -.0661694    5.441291
          exp |   .0619288   .0163073     3.80   0.000     .0299671    .0938906
       expsqr |  -.0013602   .0004021    -3.38   0.001    -.0021483   -.0005721
 provincedum2 |  -.3537305   .0773215    -4.57   0.000    -.5052778   -.2021832
 provincedum3 |  -.1199664   .0687482    -1.75   0.081    -.2547104    .0147776
 provincedum4 |  -.3047287   .0700674    -4.35   0.000    -.4420582   -.1673991
 provincedum5 |   .0528047    .060749     0.87   0.385    -.0662612    .1718705
 provincedum6 |  -.1455241   .0648969    -2.24   0.025    -.2727197   -.0183284
 provincedum7 |  -.2081504   .0618975    -3.36   0.001    -.3294673   -.0868334
 provincedum8 |  -.4330642   .0597179    -7.25   0.000    -.5501091   -.3160193
 provincedum9 |  -.1028649   .0618229    -1.66   0.096    -.2240357    .0183058
provincedum10 |  -.1661397   .0636003    -2.61   0.009     -.290794   -.0414853
provincedum11 |  -.0470566   .0543383    -0.87   0.386    -.1535578    .0594446
provincedum12 |  -.1782004   .0666737    -2.67   0.008    -.3088784   -.0475224
provincedum13 |  -.1113074   .0631375    -1.76   0.078    -.2350546    .0124398
provincedum14 |  -.2739228   .0826477    -3.31   0.001    -.4359094   -.1119363
provincedum15 |  -.3129793   .0830236    -3.77   0.000    -.4757026   -.1502559
        _cons |    7.90178    .142368    55.50   0.000     7.622744    8.180816
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =    57.24  (p = 0.0000)
  Wu-Hausman F(2,5653)            =  28.8047  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .068048  (p = 0.7942)
  Basmann chi2(1)        =  .067809  (p = 0.7946)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  13.747  Chi-sq(19) P-value = 0.7982

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu secgenhighedu = t d td ) if inrange
> (birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 0 & educat != ., fi
> rst

First-stage regressions
-----------------------

                                                       Number of obs =   4,947
                                                       F(5, 4941)    = 1929.32
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6613
                                                       Adj R-squared =  0.6609
                                                       Root MSE      =  0.2901

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1448364   .0039572   -36.60   0.000    -.1525943   -.1370784
      expsqr |   .0003317   .0001042     3.18   0.001     .0001273    .0005361
           t |  -.0112991   .0003027   -37.33   0.000    -.0118925   -.0107057
           d |   .0152442   .0173955     0.88   0.381    -.0188587    .0493471
          td |   .0001361   .0003483     0.39   0.696    -.0005467     .000819
       _cons |   3.237801   .0458351    70.64   0.000     3.147944    3.327658
------------------------------------------------------------------------------

                                                       Number of obs =   4,947
                                                       F(5, 4941)    = 1315.32
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5710
                                                       Adj R-squared =  0.5706
                                                       Root MSE      =  0.3196

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1490293   .0043598   -34.18   0.000    -.1575764   -.1404822
      expsqr |   .0008553   .0001149     7.45   0.000     .0006301    .0010805
           t |  -.0092295   .0003335   -27.68   0.000    -.0098833   -.0085757
           d |   .0125368   .0191651     0.65   0.513    -.0250352    .0501088
          td |  -.0006819   .0003838    -1.78   0.076    -.0014342    .0000704
       _cons |   3.027959   .0504977    59.96   0.000     2.928961    3.126957
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(4)    =     647.73
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1053
                                                  Root MSE        =     .64523

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .3873197   .8309899     0.47   0.641    -1.241391     2.01603
secgenhighedu |     .21527   .9598504     0.22   0.823    -1.666002    2.096542
          exp |   .0345237   .0180548     1.91   0.056     -.000863    .0699104
       expsqr |  -.0009206   .0004126    -2.23   0.026    -.0017294   -.0001119
        _cons |   7.672335   .1654332    46.38   0.000     7.348092    7.996578
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =   58.231  (p = 0.0000)
  Wu-Hausman F(2,4940)            =  29.4206  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .283763  (p = 0.5942)
  Basmann chi2(1)        =  .283435  (p = 0.5945)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.485  Chi-sq(5) P-value = 0.0912

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu secgenhi
> ghedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & 
> male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,947
                                                        F(19, 4927)   = 516.19
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6656
                                                        Adj R-squared = 0.6643
                                                        Root MSE      = 0.2887

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1452014   .0039492   -36.77   0.000    -.1529437   -.1374592
       expsqr |    .000334    .000104     3.21   0.001     .0001302    .0005379
 provincedum2 |   .0655521   .0226091     2.90   0.004     .0212281     .109876
 provincedum3 |   .0660354   .0231369     2.85   0.004     .0206768     .111394
 provincedum4 |  -.0156695   .0221614    -0.71   0.480    -.0591158    .0277767
 provincedum5 |   .0021108   .0205349     0.10   0.918    -.0381468    .0423683
 provincedum6 |   .0654874   .0231518     2.83   0.005     .0200997    .1108752
 provincedum7 |   .0432893   .0211603     2.05   0.041     .0018058    .0847729
 provincedum8 |   .0283703   .0211062     1.34   0.179    -.0130072    .0697479
 provincedum9 |  -.0322975   .0218641    -1.48   0.140    -.0751609    .0105659
provincedum10 |  -.0146631   .0219194    -0.67   0.504    -.0576349    .0283086
provincedum11 |  -.0127618   .0186735    -0.68   0.494    -.0493702    .0238466
provincedum12 |  -.0049278   .0228051    -0.22   0.829     -.049636    .0397803
provincedum13 |   .0031029   .0210991     0.15   0.883    -.0382606    .0444665
provincedum14 |   .0306742   .0265236     1.16   0.248    -.0213239    .0826723
provincedum15 |   .0818605   .0271201     3.02   0.003     .0286929     .135028
            t |  -.0112976   .0003042   -37.14   0.000     -.011894   -.0107013
            d |   .0158436   .0173473     0.91   0.361    -.0181649    .0498521
           td |   .0001086   .0003474     0.31   0.755    -.0005725    .0007898
        _cons |   3.230053   .0467184    69.14   0.000     3.138464    3.321642
-------------------------------------------------------------------------------

                                                        Number of obs =  4,947
                                                        F(19, 4927)   = 349.70
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.5742
                                                        Adj R-squared = 0.5726
                                                        Root MSE      = 0.3189

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |    -.14962   .0043627   -34.30   0.000    -.1581728   -.1410673
       expsqr |   .0008646   .0001149     7.53   0.000     .0006394    .0010898
 provincedum2 |   .0387075    .024976     1.55   0.121    -.0102567    .0876717
 provincedum3 |   .0750979   .0255591     2.94   0.003     .0249908    .1252051
 provincedum4 |  -.0132622   .0244815    -0.54   0.588    -.0612568    .0347324
 provincedum5 |   -.006998   .0226847    -0.31   0.758      -.05147    .0374741
 provincedum6 |   .0638472   .0255755     2.50   0.013     .0137078    .1139865
 provincedum7 |   .0232769   .0233755     1.00   0.319    -.0225495    .0691033
 provincedum8 |   .0203664   .0233158     0.87   0.382    -.0253429    .0660758
 provincedum9 |  -.0059094   .0241531    -0.24   0.807    -.0532601    .0414413
provincedum10 |  -.0225681   .0242141    -0.93   0.351    -.0700385    .0249024
provincedum11 |   .0045437   .0206284     0.22   0.826    -.0358972    .0449846
provincedum12 |  -.0178088   .0251925    -0.71   0.480    -.0671974    .0315798
provincedum13 |   .0089466   .0233079     0.38   0.701    -.0367473    .0546405
provincedum14 |  -.0173006   .0293004    -0.59   0.555    -.0747423    .0401412
provincedum15 |   .0628491   .0299593     2.10   0.036     .0041156    .1215827
            t |  -.0091993    .000336   -27.38   0.000     -.009858   -.0085405
            d |   .0117959   .0191634     0.62   0.538    -.0257729    .0493647
           td |  -.0007548   .0003838    -1.97   0.049    -.0015072   -2.34e-06
        _cons |   3.026734   .0516093    58.65   0.000     2.925557    3.127912
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(18)   =     976.88
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1604
                                                  Root MSE        =     .62503

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .3933143    .763917     0.51   0.607    -1.103936    1.890564
secgenhighedu |   .2029876   .8811077     0.23   0.818    -1.523952    1.929927
          exp |   .0363292   .0165296     2.20   0.028     .0039318    .0687266
       expsqr |  -.0009341   .0003804    -2.46   0.014    -.0016796   -.0001885
 provincedum2 |  -.5984403   .0511669   -11.70   0.000    -.6987255   -.4981552
 provincedum3 |  -.3317121   .0520571    -6.37   0.000    -.4337421   -.2296821
 provincedum4 |  -.4585843   .0480035    -9.55   0.000    -.5526695   -.3644991
 provincedum5 |   -.067979   .0448844    -1.51   0.130    -.1559508    .0199928
 provincedum6 |  -.2457108   .0503299    -4.88   0.000    -.3443557   -.1470659
 provincedum7 |  -.2947483   .0469511    -6.28   0.000    -.3867708   -.2027258
 provincedum8 |  -.4452183    .045667    -9.75   0.000     -.534724   -.3557125
 provincedum9 |  -.1705771   .0512286    -3.33   0.001    -.2709833   -.0701709
provincedum10 |  -.1929146   .0480965    -4.01   0.000    -.2871819   -.0986472
provincedum11 |  -.0872959   .0430327    -2.03   0.042    -.1716386   -.0029533
provincedum12 |  -.2508946   .0505753    -4.96   0.000    -.3500204   -.1517688
provincedum13 |  -.1747039   .0459987    -3.80   0.000    -.2648597   -.0845482
provincedum14 |  -.2312992   .0685616    -3.37   0.001    -.3656775   -.0969209
provincedum15 |  -.3320166    .058979    -5.63   0.000    -.4476132     -.21642
        _cons |   7.882781   .1546235    50.98   0.000     7.579725    8.185838
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  48.8622  (p = 0.0000)
  Wu-Hausman F(2,4926)            =  24.5701  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  .090176  (p = 0.7640)
  Basmann chi2(1)        =  .089813  (p = 0.7644)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  25.588  Chi-sq(19) P-value = 0.1421

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning exp expsqr male (higheredu = t d td ) if inrange(birthyea
> r, 1971, 1992) & inrange(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                       Number of obs =  10,621
                                                       F(6, 10614)   = 3524.40
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6658
                                                       Adj R-squared =  0.6656
                                                       Root MSE      =  0.2874

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1501127   .0026937   -55.73   0.000    -.1553928   -.1448327
      expsqr |   .0004701   .0000702     6.69   0.000     .0003325    .0006078
        male |  -.0104075   .0055951    -1.86   0.063     -.021375      .00056
           t |  -.0109106   .0002013   -54.20   0.000    -.0113052   -.0105159
           d |   .0180214   .0117332     1.54   0.125    -.0049779    .0410206
          td |  -.0004809    .000232    -2.07   0.038    -.0009357   -.0000261
       _cons |   3.296922    .031311   105.30   0.000     3.235546    3.358297
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(4)    =    1374.10
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1020
                                                  Root MSE        =     .66041

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |    .506193    .019903    25.43   0.000     .4671837    .5452022
         exp |   .0304962   .0043505     7.01   0.000     .0219694     .039023
      expsqr |    -.00071    .000113    -6.28   0.000    -.0009315   -.0004885
        male |   .2976142    .012853    23.16   0.000     .2724228    .3228056
       _cons |    7.69372   .0430484   178.72   0.000     7.609347    7.778093
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  126.973  (p = 0.0000)
  Wu-Hausman F(1,10615)           =  128.436  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  6.13006  (p = 0.0467)
  Basmann chi2(2)        =  6.12956  (p = 0.0467)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  18.131  Chi-sq(6) P-value = 0.0059

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr male provincedum2-provincedum15 (higheredu  = 
> t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & educat !
> = ., first

First-stage regressions
-----------------------

                                                       Number of obs =  10,621
                                                       F(20, 10600)  = 1082.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6712
                                                       Adj R-squared =  0.6706
                                                       Root MSE      =  0.2853

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1509755   .0026819   -56.29   0.000    -.1562326   -.1457184
       expsqr |   .0004799   .0000698     6.88   0.000     .0003431    .0006167
         male |  -.0109575   .0055575    -1.97   0.049    -.0218512   -.0000639
 provincedum2 |   .0808483   .0151773     5.33   0.000     .0510979    .1105986
 provincedum3 |   .0809459   .0157361     5.14   0.000     .0501001    .1117917
 provincedum4 |   -.013498    .015202    -0.89   0.375    -.0432968    .0163009
 provincedum5 |   .0030138   .0139904     0.22   0.829    -.0244101    .0304377
 provincedum6 |   .0711015   .0154877     4.59   0.000     .0407428    .1014602
 provincedum7 |   .0392844   .0146188     2.69   0.007     .0106288    .0679399
 provincedum8 |   .0432969   .0143329     3.02   0.003     .0152018     .071392
 provincedum9 |  -.0153636   .0146959    -1.05   0.296    -.0441702    .0134431
provincedum10 |   -.010238   .0150568    -0.68   0.497    -.0397521    .0192762
provincedum11 |  -.0177849   .0127423    -1.40   0.163    -.0427622    .0071925
provincedum12 |  -.0125351   .0156945    -0.80   0.424    -.0432991     .018229
provincedum13 |   .0062463   .0145197     0.43   0.667     -.022215    .0347076
provincedum14 |   .0311984    .018513     1.69   0.092    -.0050905    .0674873
provincedum15 |    .092296   .0186688     4.94   0.000     .0557016    .1288904
            t |    -.01092    .000201   -54.34   0.000     -.011314   -.0105261
            d |    .018446   .0116654     1.58   0.114    -.0044204    .0413124
           td |  -.0005301   .0002306    -2.30   0.022    -.0009821   -.0000781
        _cons |   3.292846   .0318202   103.48   0.000     3.230473     3.35522
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,621
                                                  Wald chi2(18)   =    1978.32
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1512
                                                  Root MSE        =     .64206

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |    .492945   .0196112    25.14   0.000     .4545078    .5313822
          exp |    .032712   .0042411     7.71   0.000     .0243996    .0410244
       expsqr |  -.0007465   .0001101    -6.78   0.000    -.0009623   -.0005307
         male |     .29876   .0125049    23.89   0.000     .2742508    .3232691
 provincedum2 |  -.5140367   .0340124   -15.11   0.000    -.5806998   -.4473736
 provincedum3 |  -.2388734   .0353067    -6.77   0.000    -.3080732   -.1696736
 provincedum4 |  -.4078353   .0342156   -11.92   0.000    -.4748966   -.3407741
 provincedum5 |  -.0238927   .0314555    -0.76   0.448    -.0855444     .037759
 provincedum6 |  -.1795545   .0346681    -5.18   0.000    -.2475028   -.1116062
 provincedum7 |  -.2497922   .0328165    -7.61   0.000    -.3141113    -.185473
 provincedum8 |  -.4395602   .0321437   -13.67   0.000    -.5025606   -.3765597
 provincedum9 |  -.1247768    .033097    -3.77   0.000    -.1896458   -.0599079
provincedum10 |  -.1783488   .0338685    -5.27   0.000    -.2447299   -.1119678
provincedum11 |   -.056845   .0287266    -1.98   0.048     -.113148   -.0005419
provincedum12 |  -.2252245    .035336    -6.37   0.000    -.2944818   -.1559671
provincedum13 |   -.158056   .0326473    -4.84   0.000    -.2220435   -.0940686
provincedum14 |  -.2816991   .0416094    -6.77   0.000     -.363252   -.2001461
provincedum15 |  -.3542896   .0419207    -8.45   0.000    -.4364527   -.2721264
        _cons |   7.877547   .0482603   163.23   0.000     7.782959    7.972136
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  96.8858  (p = 0.0000)
  Wu-Hausman F(1,10601)           =  97.5936  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  4.97302  (p = 0.0832)
  Basmann chi2(2)        =  4.96551  (p = 0.0835)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  44.687  Chi-sq(20) P-value = 0.0012

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,621    8.356636    .6969598   5.521461   10.12663
         exp |     10,621    18.15516    7.631079          0         36
      expsqr |     10,621    387.8379    287.3355          0       1296
        male |     10,621    .5342246    .4988508          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu  = t d td ) if inrange(birthyear, 1
> 971, 1992) & inrange(monthlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                       Number of obs =   5,674
                                                       F(5, 5668)    = 2300.15
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6699
                                                       Adj R-squared =  0.6696
                                                       Root MSE      =  0.2850

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |    -.15467   .0036815   -42.01   0.000     -.161887   -.1474529
      expsqr |   .0005867   .0000951     6.17   0.000     .0004002    .0007731
           t |  -.0105992   .0002695   -39.33   0.000    -.0111276   -.0100708
           d |   .0201685   .0158881     1.27   0.204    -.0109783    .0513152
          td |  -.0009893   .0003109    -3.18   0.001    -.0015988   -.0003798
       _cons |   3.338794   .0427716    78.06   0.000     3.254945    3.422643
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(3)    =     306.15
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0329
                                                  Root MSE        =     .67033

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |   .4473085   .0271274    16.49   0.000     .3941398    .5004772
         exp |   .0323216   .0060947     5.30   0.000     .0203762    .0442669
      expsqr |  -.0006496   .0001582    -4.11   0.000    -.0009596   -.0003395
       _cons |    7.95983   .0591267   134.62   0.000     7.843944    8.075716
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  70.9483  (p = 0.0000)
  Wu-Hausman F(1,5669)            =  71.7834  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  7.83221  (p = 0.0199)
  Basmann chi2(2)        =  7.83474  (p = 0.0199)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   7.594  Chi-sq(5) P-value = 0.1801

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu  = t d t
> d ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 1 & e
> ducat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,674
                                                        F(19, 5654)   = 622.71
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6766
                                                        Adj R-squared = 0.6756
                                                        Root MSE      = 0.2824

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1559154   .0036634   -42.56   0.000    -.1630971   -.1487338
       expsqr |   .0005992   .0000944     6.35   0.000     .0004142    .0007842
 provincedum2 |   .0946721   .0205322     4.61   0.000      .054421    .1349231
 provincedum3 |    .094548   .0214945     4.40   0.000     .0524106    .1366854
 provincedum4 |  -.0101997   .0209191    -0.49   0.626    -.0512091    .0308098
 provincedum5 |   .0053339    .019148     0.28   0.781    -.0322036    .0428714
 provincedum6 |   .0776578   .0208932     3.72   0.000      .036699    .1186165
 provincedum7 |   .0372192    .020256     1.84   0.066    -.0024904    .0769287
 provincedum8 |   .0577317   .0195631     2.95   0.003     .0193805    .0960828
 provincedum9 |  -.0009141   .0199029    -0.05   0.963    -.0399315    .0381032
provincedum10 |  -.0047243   .0207582    -0.23   0.820    -.0454184    .0359698
provincedum11 |  -.0198635    .017473    -1.14   0.256    -.0541173    .0143903
provincedum12 |  -.0178107   .0216764    -0.82   0.411    -.0603047    .0246834
provincedum13 |   .0104213   .0200463     0.52   0.603     -.028877    .0497197
provincedum14 |   .0326164   .0259004     1.26   0.208    -.0181584    .0833912
provincedum15 |   .1035899   .0257811     4.02   0.000     .0530491    .1541307
            t |  -.0106422   .0002682   -39.67   0.000    -.0111681   -.0101164
            d |   .0210735   .0157815     1.34   0.182    -.0098643    .0520113
           td |  -.0010393   .0003086    -3.37   0.001    -.0016442   -.0004343
        _cons |    3.33576   .0434393    76.79   0.000     3.250602    3.420917
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,674
                                                  Wald chi2(17)   =     588.06
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0834
                                                  Root MSE        =      .6526

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .4307961   .0266634    16.16   0.000     .3785369    .4830553
          exp |    .034611   .0059506     5.82   0.000     .0229481     .046274
       expsqr |  -.0006977   .0001545    -4.52   0.000    -.0010005    -.000395
 provincedum2 |  -.4410356   .0471758    -9.35   0.000    -.5334984   -.3485728
 provincedum3 |  -.1599815   .0494994    -3.23   0.001    -.2569986   -.0629645
 provincedum4 |  -.3595678   .0483246    -7.44   0.000    -.4542823   -.2648534
 provincedum5 |   .0212286   .0441896     0.48   0.631    -.0653814    .1078385
 provincedum6 |  -.1198046   .0479881    -2.50   0.013    -.2138596   -.0257496
 provincedum7 |  -.2011379   .0467032    -4.31   0.000    -.2926746   -.1096013
 provincedum8 |  -.4242664   .0450038    -9.43   0.000    -.5124722   -.3360606
 provincedum9 |  -.0814146   .0459539    -1.77   0.076    -.1714825    .0086533
provincedum10 |  -.1561155    .047909    -3.26   0.001    -.2500154   -.0622156
provincedum11 |  -.0287763   .0404316    -0.71   0.477    -.1080207    .0504681
provincedum12 |  -.1921427   .0500934    -3.84   0.000    -.2903239   -.0939615
provincedum13 |   -.141042   .0462536    -3.05   0.002    -.2316974   -.0503866
provincedum14 |  -.3199324   .0597654    -5.35   0.000    -.4370705   -.2027943
provincedum15 |  -.3640861   .0594155    -6.13   0.000    -.4805383    -.247634
        _cons |   8.115634   .0666262   121.81   0.000     7.985049    8.246219
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  52.5366  (p = 0.0000)
  Wu-Hausman F(1,5655)            =    52.85  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  6.52378  (p = 0.0383)
  Basmann chi2(2)        =  6.50826  (p = 0.0386)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  25.757  Chi-sq(19) P-value = 0.1371

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,674    8.491147    .6817095   5.521461   10.12663
         exp |      5,674    18.30543    7.580343          1         35
      expsqr |      5,674    392.5402    286.7808          1       1225
        male |      5,674           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr (higheredu  = t d td ) if inrange(birthyear, 1
> 971, 1992) & inrange(monthlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                       Number of obs =   4,947
                                                       F(5, 4941)    = 1929.32
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.6613
                                                       Adj R-squared =  0.6609
                                                       Root MSE      =  0.2901

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         exp |  -.1448364   .0039572   -36.60   0.000    -.1525943   -.1370784
      expsqr |   .0003317   .0001042     3.18   0.001     .0001273    .0005361
           t |  -.0112991   .0003027   -37.33   0.000    -.0118925   -.0107057
           d |   .0152442   .0173955     0.88   0.381    -.0188587    .0493471
          td |   .0001361   .0003483     0.39   0.696    -.0005467     .000819
       _cons |   3.237801   .0458351    70.64   0.000     3.147944    3.327658
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(3)    =     650.72
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1094
                                                  Root MSE        =     .64373

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |    .573575   .0290685    19.73   0.000     .5166017    .6305483
         exp |   .0307187   .0061614     4.99   0.000     .0186427    .0427948
      expsqr |  -.0008354   .0001601    -5.22   0.000    -.0011492   -.0005215
       _cons |   7.706818    .060921   126.51   0.000     7.587415    7.826221
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  57.5404  (p = 0.0000)
  Wu-Hausman F(1,4942)            =  58.1587  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .335631  (p = 0.8455)
  Basmann chi2(2)        =  .335246  (p = 0.8457)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.683  Chi-sq(5) P-value = 0.0847

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning exp expsqr provincedum2-provincedum15 (higheredu = t d td
>  ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 0 & ed
> ucat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,947
                                                        F(19, 4927)   = 516.19
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.6656
                                                        Adj R-squared = 0.6643
                                                        Root MSE      = 0.2887

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.1452014   .0039492   -36.77   0.000    -.1529437   -.1374592
       expsqr |    .000334    .000104     3.21   0.001     .0001302    .0005379
 provincedum2 |   .0655521   .0226091     2.90   0.004     .0212281     .109876
 provincedum3 |   .0660354   .0231369     2.85   0.004     .0206768     .111394
 provincedum4 |  -.0156695   .0221614    -0.71   0.480    -.0591158    .0277767
 provincedum5 |   .0021108   .0205349     0.10   0.918    -.0381468    .0423683
 provincedum6 |   .0654874   .0231518     2.83   0.005     .0200997    .1108752
 provincedum7 |   .0432893   .0211603     2.05   0.041     .0018058    .0847729
 provincedum8 |   .0283703   .0211062     1.34   0.179    -.0130072    .0697479
 provincedum9 |  -.0322975   .0218641    -1.48   0.140    -.0751609    .0105659
provincedum10 |  -.0146631   .0219194    -0.67   0.504    -.0576349    .0283086
provincedum11 |  -.0127618   .0186735    -0.68   0.494    -.0493702    .0238466
provincedum12 |  -.0049278   .0228051    -0.22   0.829     -.049636    .0397803
provincedum13 |   .0031029   .0210991     0.15   0.883    -.0382606    .0444665
provincedum14 |   .0306742   .0265236     1.16   0.248    -.0213239    .0826723
provincedum15 |   .0818605   .0271201     3.02   0.003     .0286929     .135028
            t |  -.0112976   .0003042   -37.14   0.000     -.011894   -.0107013
            d |   .0158436   .0173473     0.91   0.361    -.0181649    .0498521
           td |   .0001086   .0003474     0.31   0.755    -.0005725    .0007898
        _cons |   3.230053   .0467184    69.14   0.000     3.138464    3.321642
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,947
                                                  Wald chi2(17)   =     981.84
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1647
                                                  Root MSE        =     .62343

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .5691787   .0287152    19.82   0.000      .512898    .6254595
          exp |   .0327809   .0059845     5.48   0.000     .0210515    .0445102
       expsqr |  -.0008541   .0001554    -5.50   0.000    -.0011587   -.0005496
 provincedum2 |  -.6019782   .0486831   -12.37   0.000    -.6973954    -.506561
 provincedum3 |  -.3283344    .049822    -6.59   0.000    -.4259836   -.2306851
 provincedum4 |  -.4583169   .0478668    -9.57   0.000    -.5521341   -.3644996
 provincedum5 |    -.06947   .0443018    -1.57   0.117    -.1562999      .01736
 provincedum6 |  -.2441434   .0497405    -4.91   0.000    -.3416329   -.1466539
 provincedum7 |  -.2972799   .0455303    -6.53   0.000    -.3865177   -.2080422
 provincedum8 |  -.4459112   .0454514    -9.81   0.000    -.5349943   -.3568282
 provincedum9 |  -.1661261   .0473244    -3.51   0.000    -.2588802   -.0733721
provincedum10 |  -.1947184   .0473336    -4.11   0.000    -.2874905   -.1019462
provincedum11 |   -.083931   .0403747    -2.08   0.038    -.1630639   -.0047981
provincedum12 |  -.2534228   .0492441    -5.15   0.000    -.3499394   -.1569062
provincedum13 |  -.1734097   .0455376    -3.81   0.000    -.2626617   -.0841576
provincedum14 |  -.2399588   .0571926    -4.20   0.000    -.3520542   -.1278634
provincedum15 |  -.3336061   .0584243    -5.71   0.000    -.4481155   -.2190966
        _cons |   7.914715    .068337   115.82   0.000     7.780777    8.048653
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  exp expsqr provincedum2 provincedum3 provincedum4 provincedum5
            provincedum6 provincedum7 provincedum8 provincedum9 provincedum10
            provincedum11 provincedum12 provincedum13 provincedum14
            provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  47.8294  (p = 0.0000)
  Wu-Hausman F(1,4928)            =  48.1109  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  .143985  (p = 0.9305)
  Basmann chi2(2)        =  .143407  (p = 0.9308)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  25.861  Chi-sq(19) P-value = 0.1341

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning exp expsqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,947    8.202358    .6822051   5.521461   10.12663
         exp |      4,947    17.98282    7.686008          0         36
      expsqr |      4,947    382.4445    287.9049          0       1296
        male |      4,947           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Frame/Exp/IV Urb
> an ATF Exp 1979 1971-1992.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1979/Adjusted Time Fra
> me/Exp/IV Urban ATF Exp 1979 1971-1992.log
  log type:  text
 closed on:   6 Aug 2024, 17:33:11
---------------------------------------------------------------------------------------------
