---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male 
> controlled/Rural/Rural 1979 Highgen ManualD Male controlled.log
  log type:  text
 opened on:   8 Aug 2024, 12:54:11

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(20,156 missing values generated)

. gen tenure = 2018 - yearstart
(20,156 missing values generated)

. gen tenuresqr = tenure * tenure
(20,156 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(27,895 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,455 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(34,426 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(2,298 real changes made)

. 
. *Step Two: Regressions (Three parts Ideally: Firstly rdrobust from birthmonth to earning; S
> econdly rdrobust from birthmonth to higheredu; Thirdly rdrobust*2 or rdrobust+OLS or ivregr
> ess from higheredu to earning. Each part has 6 sheets)
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.1494     .12851   -1.1626  0.245   -.401273       .10247
    Bias-corrected |  -.3358     .12851   -2.6131  0.009   -.587675     -.083932
            Robust |  -.3358     .21008   -1.5985  0.110   -.747554      .075946
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03454       .076   -0.4545  0.649   -.183497      .114411
    Bias-corrected | -.06412       .076   -0.8437  0.399   -.213074      .084834
            Robust | -.06412     .11374   -0.5638  0.573   -.287041        .1588
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs(ma
> le) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |      1084        1199            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.614      66.614
       BW bias (b) |   103.823     103.823
         rho (h/b) |     0.642       0.642
        Unique obs |       388         283

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02036     .05897   -0.3452  0.730    -.13593      .095218
    Bias-corrected | -.01527     .05897   -0.2590  0.796   -.130846      .100302
            Robust | -.01527     .07059   -0.2164  0.829   -.153619      .123075
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17467     .19425   0.8992   0.369   -.206045       .55539
    Bias-corrected | -.08511     .19425   -0.4382  0.661   -.465828      .295607
            Robust | -.08511     .34875   -0.2440  0.807   -.768652      .598431
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01913     .15217   -0.1257  0.900   -.317378      .279121
    Bias-corrected |  .26437     .15217   1.7373   0.082   -.033883      .562615
            Robust |  .26437     .19652   1.3452   0.179   -.120814      .649546
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       291         569            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    95.961      95.961
       BW bias (b) |   168.440     168.440
         rho (h/b) |     0.570       0.570
        Unique obs |       306         261

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00578     .09802   0.0589   0.953   -.186345      .197898
    Bias-corrected | -.02949     .09802   -0.3009  0.764   -.221615      .162628
            Robust | -.02949     .11223   -0.2628  0.793   -.249465      .190477
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.1236      .3533   -0.3498  0.726    -.81606      .568869
    Bias-corrected |  .28305      .3533   0.8012   0.423   -.409412      .975517
            Robust |  .28305     .86908   0.3257   0.745   -1.42032      1.98643
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06044     .20443   0.2956   0.768   -.340244       .46112
    Bias-corrected |  .04765     .20443   0.2331   0.816   -.353028      .448335
            Robust |  .04765     .29069   0.1639   0.870   -.522097      .617404
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(mal
> e) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |        98         155            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    81.280      81.280
       BW bias (b) |   127.685     127.685
         rho (h/b) |     0.637       0.637
        Unique obs |       132         235

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04544     .16179   0.2809   0.779   -.271655      .362535
    Bias-corrected |  .02795     .16179   0.1728   0.863   -.289143      .345047
            Robust |  .02795     .19458   0.1437   0.886   -.353426       .40933
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .46522     .25811   1.8024   0.071   -.040676      .971108
    Bias-corrected | -.27243     .25811   -1.0555  0.291   -.778326      .233457
            Robust | -.27243     .33209   -0.8204  0.412   -.923317      .378448
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.14029     .23516   -0.5966  0.551   -.601186      .320606
    Bias-corrected |  .36288     .23516   1.5431   0.123   -.098019      .823773
            Robust |  .36288     .28998   1.2514   0.211   -.205475       .93123
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(mal
> e) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |       163         273            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    83.085      83.085
       BW bias (b) |   136.878     136.878
         rho (h/b) |     0.607       0.607
        Unique obs |       286         247

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04421     .14522   -0.3044  0.761   -.328829      .240416
    Bias-corrected | -.08218     .14522   -0.5659  0.571   -.366799      .202446
            Robust | -.08218     .17107   -0.4804  0.631   -.417462      .253108
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.23545     .15507   -1.5184  0.129   -.539378      .068479
    Bias-corrected | -.39161     .15507   -2.5254  0.012   -.695537      -.08768
            Robust | -.39161     .26003   -1.5060  0.132   -.901251      .118033
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        921
-------------------+----------------------            BW type       =     Manual
     Number of obs |       422         499            Kernel        =    Uniform
Eff. Number of obs |       422         499            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03368     .08819   -0.3819  0.703   -.206529       .13917
    Bias-corrected | -.15615     .08819   -1.7707  0.077   -.329004      .016696
            Robust | -.15615     .13435   -1.1623  0.245   -.419478       .10717
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(mal
> e) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7007
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3716        3291            Kernel        = Epanechnikov
Eff. Number of obs |       838         867            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.756      63.756
       BW bias (b) |    99.985      99.985
         rho (h/b) |     0.638       0.638
        Unique obs |       381         281

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01712     .07067   -0.2423  0.809   -.155622      .121383
    Bias-corrected | -.00693     .07067   -0.0980  0.922    -.14543      .131574
            Robust | -.00693     .08429   -0.0822  0.934   -.172127       .15827
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.1494     .15506   -0.9635  0.335   -.453318      .154515
    Bias-corrected |  -.3358     .15506   -2.1656  0.030    -.63972     -.031887
            Robust |  -.3358     .24221   -1.3864  0.166   -.810517       .13891
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat != ., covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03454     .10807   -0.3196  0.749   -.246355      .177269
    Bias-corrected | -.06412     .10807   -0.5933  0.553   -.275932      .147692
            Robust | -.06412     .13798   -0.4647  0.642    -.33455       .20631
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat != ., covs(ma
> le) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |      1251        1361            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    73.245      73.245
       BW bias (b) |   106.583     106.583
         rho (h/b) |     0.687       0.687
        Unique obs |       388         283
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03224     .07645   -0.4217  0.673    -.18207      .117594
    Bias-corrected |   -.031     .07645   -0.4055  0.685   -.180831      .118833
            Robust |   -.031      .0923   -0.3359  0.737   -.211899      .149901
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17467     .23347   0.7482   0.454   -.282921      .632266
    Bias-corrected | -.08511     .23347   -0.3645  0.715   -.542704      .372483
            Robust | -.08511     .35962   -0.2367  0.813   -.789948      .619727
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01913     .15471   -0.1236  0.902   -.322349      .284092
    Bias-corrected |  .26437     .15471   1.7088   0.087   -.038855      .567587
            Robust |  .26437     .21596   1.2242   0.221   -.158902      .687634
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat=
> =2), covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       361         825            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   114.333     114.333
       BW bias (b) |   182.424     182.424
         rho (h/b) |     0.627       0.627
        Unique obs |       306         261
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02719     .07635   0.3561   0.722   -.122445      .176824
    Bias-corrected | -.00583     .07635   -0.0764  0.939   -.155466      .143803
            Robust | -.00583      .0882   -0.0661  0.947     -.1787      .167038
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.1236     .50232   -0.2461  0.806   -1.10812      .860926
    Bias-corrected |  .28305     .50232   0.5635   0.573   -.701469      1.26757
            Robust |  .28305     .79791   0.3547   0.723   -1.28082      1.84692
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==1, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06044     .19581   0.3087   0.758   -.323338      .444214
    Bias-corrected |  .04765     .19581   0.2434   0.808   -.336122       .43143
            Robust |  .04765     .36558   0.1304   0.896   -.668862       .76417
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(mal
> e) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |       102         193            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    91.394      91.394
       BW bias (b) |   149.965     149.965
         rho (h/b) |     0.609       0.609
        Unique obs |       132         235
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05886     .12557   0.4688   0.639   -.187257      .304986
    Bias-corrected |  .03861     .12557   0.3075   0.758   -.207513       .28473
            Robust |  .03861     .14314   0.2697   0.787   -.241945      .319161
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10          10

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .46522     .27599   1.6856   0.092   -.075723      1.00615
    Bias-corrected | -.27243     .27599   -0.9871  0.324   -.813373      .268504
            Robust | -.27243     .39356   -0.6922  0.489   -1.04381      .498937
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==2, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.14029     .22697   -0.6181  0.537   -.585141       .30456
    Bias-corrected |  .36288     .22697   1.5988   0.110   -.081973      .807728
            Robust |  .36288     .19399   1.8706   0.061   -.017335      .743089
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(mal
> e) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |       168         290            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    86.549      86.549
       BW bias (b) |   144.730     144.730
         rho (h/b) |     0.598       0.598
        Unique obs |       286         247
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05009     .16698   -0.3000  0.764   -.377365      .277191
    Bias-corrected | -.09779     .16698   -0.5856  0.558   -.425067       .22949
            Robust | -.09779     .19963   -0.4899  0.624   -.489052      .293475
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.23545      .1671   -1.4091  0.159   -.562952      .092053
    Bias-corrected | -.39161      .1671   -2.3436  0.019   -.719111     -.064106
            Robust | -.39161     .26229   -1.4930  0.135   -.905687      .122469
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) 
> & educat ==3, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        921
-------------------+----------------------            BW type       =     Manual
     Number of obs |       422         499            Kernel        =    Uniform
Eff. Number of obs |       422         499            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03368     .12422   -0.2711  0.786   -.277153      .209794
    Bias-corrected | -.15615     .12422   -1.2570  0.209   -.399628       .08732
            Robust | -.15615     .14947   -1.0447  0.296   -.449104      .136796
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(mal
> e) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7007
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3716        3291            Kernel        = Epanechnikov
Eff. Number of obs |       838         867            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.955      63.955
       BW bias (b) |    97.299      97.299
         rho (h/b) |     0.657       0.657
        Unique obs |       381         281
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01735     .09811   -0.1768  0.860   -.209637      .174938
    Bias-corrected | -.00098     .09811   -0.0100  0.992   -.193266      .191308
            Robust | -.00098     .11746   -0.0083  0.993   -.231192      .229235
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.16351     .15499   -1.0549  0.291   -.467281      .140269
    Bias-corrected |  -.5691     .15499   -3.6719  0.000    -.87288     -.265329
            Robust |  -.5691     .29319   -1.9411  0.052   -1.14374      .005533
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02294     .08085   -0.2837  0.777   -.181411       .13553
    Bias-corrected | -.03945     .08085   -0.4879  0.626    -.19792      .119022
            Robust | -.03945     .13134   -0.3003  0.764   -.296878       .21798
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |      1053        1160            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.706      65.706
       BW bias (b) |   104.788     104.788
         rho (h/b) |     0.627       0.627
        Unique obs |       387         282

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00981     .06172   -0.1589  0.874   -.130769      .111152
    Bias-corrected | -.00469     .06172   -0.0760  0.939   -.125651       .11627
            Robust | -.00469     .07435   -0.0631  0.950   -.150419      .141037
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .20197     .26805   0.7535   0.451   -.323389      .727331
    Bias-corrected | -.69109     .26805   -2.5783  0.010   -1.21645     -.165735
            Robust | -.69109     .73307   -0.9427  0.346   -2.12788      .745693
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05492     .17291   -0.3176  0.751   -.393819      .283989
    Bias-corrected |  .32468     .17291   1.8777   0.060   -.014227       .66358
            Robust |  .32468     .25605   1.2680   0.205   -.177177       .82653
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       262         455            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    86.820      86.820
       BW bias (b) |   154.401     154.401
         rho (h/b) |     0.562       0.562
        Unique obs |       305         260

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00452     .10865   -0.0416  0.967   -.217477      .208439
    Bias-corrected | -.04253     .10865   -0.3914  0.695   -.255485       .17043
            Robust | -.04253     .12629   -0.3367  0.736   -.290057      .205002
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.28385     .35672   -0.7957  0.426   -.983018      .415316
    Bias-corrected | -.38423     .35672   -1.0771  0.281    -1.0834      .314937
            Robust | -.38423       .981   -0.3917  0.695   -2.30694      1.53849
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02921      .2072   0.1410   0.888   -.376884      .435312
    Bias-corrected |  -.0214      .2072   -0.1033  0.918   -.427502      .384693
            Robust |  -.0214     .28905   -0.0741  0.941   -.587923      .545114
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |        91         135            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    74.749      74.749
       BW bias (b) |   121.579     121.579
         rho (h/b) |     0.615       0.615
        Unique obs |       131         234

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00961     .17052   0.0564   0.955   -.324609      .343833
    Bias-corrected | -.01975     .17052   -0.1158  0.908   -.353976      .314466
            Robust | -.01975      .2045   -0.0966  0.923   -.420565      .381055
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2842     .58376   2.1999   0.028    .140059      2.42836
    Bias-corrected | -.78787     .58376   -1.3496  0.177   -1.93202      .356283
            Robust | -.78787     1.5778   -0.4994  0.618   -3.88021      2.30448
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.18374     .29321   -0.6267  0.531   -.758424      .390939
    Bias-corrected |  .60173     .29321   2.0522   0.040     .02705      1.17641
            Robust |  .60173     .49389   1.2183   0.223   -.366277      1.56974
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       147         228            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.452      77.452
       BW bias (b) |   130.525     130.525
         rho (h/b) |     0.593       0.593
        Unique obs |       285         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04173     .16861   -0.2475  0.805   -.372206      .288752
    Bias-corrected | -.07633     .16861   -0.4527  0.651   -.406809      .254148
            Robust | -.07633     .20269   -0.3766  0.706   -.473602      .320941
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.23955     .17753   -1.3493  0.177   -.587511      .108408
    Bias-corrected | -.51088     .17753   -2.8776  0.004   -.858838     -.162919
            Robust | -.51088     .31984   -1.5973  0.110   -1.13776      .116002
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        898
-------------------+----------------------            BW type       =     Manual
     Number of obs |       415         483            Kernel        =    Uniform
Eff. Number of obs |       415         483            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01006     .09233   -0.1090  0.913   -.191028      .170899
    Bias-corrected | -.12367     .09233   -1.3395  0.180   -.304638       .05729
            Robust | -.12367     .14957   -0.8269  0.408   -.416822      .169474
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6984
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3275            Kernel        = Epanechnikov
Eff. Number of obs |       841         869            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.281      64.281
       BW bias (b) |   102.881     102.881
         rho (h/b) |     0.625       0.625
        Unique obs |       380         280

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00145     .07238   0.0200   0.984   -.140403      .143303
    Bias-corrected |   .0113     .07238   0.1562   0.876   -.130549      .153157
            Robust |   .0113     .08683   0.1302   0.896   -.158873      .181482
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) kernel(uni) p(1) h(12) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.16351     .14363   -1.1384  0.255   -.445015      .118004
    Bias-corrected |  -.5691     .14363   -3.9623  0.000   -.850614     -.287595
            Robust |  -.5691     .28957   -1.9654  0.049   -1.13664     -.001564
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) kernel(uni) p(1) h(36) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02294      .1114   -0.2059  0.837   -.241277      .195396
    Bias-corrected | -.03945      .1114   -0.3541  0.723   -.257786      .178888
            Robust | -.03945     .13878   -0.2842  0.776   -.311459      .232561
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |      1218        1305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    72.275      72.275
       BW bias (b) |   109.282     109.282
         rho (h/b) |     0.661       0.661
        Unique obs |       387         282
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02231     .07751   -0.2878  0.773   -.174225      .129606
    Bias-corrected | -.02451     .07751   -0.3162  0.752   -.176427      .127404
            Robust | -.02451     .09371   -0.2616  0.794   -.208184      .159162
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(12) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .20197     .28868   0.6996   0.484   -.363831      .767772
    Bias-corrected | -.69109     .28868   -2.3940  0.017    -1.2569     -.125293
            Robust | -.69109     .77109   -0.8963  0.370    -2.2024       .82021
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(36) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05492     .18219   -0.3014  0.763   -.412004      .302174
    Bias-corrected |  .32468     .18219   1.7821   0.075   -.032412      .681765
            Robust |  .32468     .24463   1.3272   0.184   -.154787       .80414
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provinc
> e_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       292         603            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    98.867      98.867
       BW bias (b) |   172.071     172.071
         rho (h/b) |     0.575       0.575
        Unique obs |       305         260
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0057     .10597   -0.0537  0.957   -.213387      .201997
    Bias-corrected | -.04534     .10597   -0.4279  0.669   -.253033      .162352
            Robust | -.04534     .12306   -0.3684  0.713   -.286536      .195855
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.28385      .5392   -0.5264  0.599   -1.34066      .772954
    Bias-corrected | -.38423      .5392   -0.7126  0.476   -1.44103      .672575
            Robust | -.38423     .95527   -0.4022  0.688   -2.25653      1.48807
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02921     .19367   0.1508   0.880   -.350375      .408803
    Bias-corrected |  -.0214     .19367   -0.1105  0.912   -.400993      .358184
            Robust |  -.0214     .35591   -0.0601  0.952    -.71897      .676161
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |        97         154            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    82.285      82.285
       BW bias (b) |   135.720     135.720
         rho (h/b) |     0.606       0.606
        Unique obs |       131         234
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02178     .13557   0.1607   0.872   -.243933        .2875
    Bias-corrected |    .001     .13557   0.0074   0.994   -.264712      .266722
            Robust |    .001        .16   0.0063   0.995   -.312583      .314593
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2842     .50065   2.5651   0.010    .302953      2.26547
    Bias-corrected | -.78787     .50065   -1.5737  0.116   -1.76912       .19339
            Robust | -.78787      1.473   -0.5349  0.593   -3.67488      2.09915
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.18374     .30065   -0.6112  0.541   -.772999      .405515
    Bias-corrected |  .60173     .30065   2.0015   0.045    .012474      1.19099
            Robust |  .60173     .27593   2.1807   0.029    .060919      1.14254
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       156         254            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.051      80.051
       BW bias (b) |   132.515     132.515
         rho (h/b) |     0.604       0.604
        Unique obs |       285         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04492     .20263   -0.2217  0.825   -.442061      .352224
    Bias-corrected | -.08229     .20263   -0.4061  0.685   -.479436      .314848
            Robust | -.08229     .25111   -0.3277  0.743   -.574455      .409867
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.23955     .16371   -1.4632  0.143   -.560422      .081319
    Bias-corrected | -.51088     .16371   -3.1206  0.002   -.831749     -.190008
            Robust | -.51088     .30625   -1.6682  0.095   -1.11111      .089353
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        898
-------------------+----------------------            BW type       =     Manual
     Number of obs |       415         483            Kernel        =    Uniform
Eff. Number of obs |       415         483            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01006     .12752   -0.0789  0.937   -.259994      .239864
    Bias-corrected | -.12367     .12752   -0.9699  0.332   -.373603      .126255
            Robust | -.12367     .14897   -0.8302  0.406   -.415645      .168297
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6984
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3275            Kernel        = Epanechnikov
Eff. Number of obs |       841         869            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.021      64.021
       BW bias (b) |   100.829     100.829
         rho (h/b) |     0.635       0.635
        Unique obs |       380         280
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0019     .09793   0.0194   0.985   -.190046       .19384
    Bias-corrected |  .01505     .09793   0.1537   0.878   -.176893      .206994
            Robust |  .01505     .11774   0.1278   0.898   -.215711      .245813
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.25473     .19827   -1.2848  0.199   -.643324      .133863
    Bias-corrected | -1.2361     .19827   -6.2345  0.000   -1.62469       -.8475
            Robust | -1.2361     .46655   -2.6494  0.008   -2.15052     -.321663
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03175      .0872   -0.3641  0.716   -.202667      .139165
    Bias-corrected | -.06724      .0872   -0.7710  0.441   -.238151      .103681
            Robust | -.06724     .15605   -0.4309  0.667   -.373089      .238618
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1010        1102            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.548      63.548
       BW bias (b) |   103.671     103.671
         rho (h/b) |     0.613       0.613
        Unique obs |       386         281

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01146     .06615   -0.1733  0.862   -.141121      .118193
    Bias-corrected |  -.0058     .06615   -0.0877  0.930   -.135457      .123858
            Robust |  -.0058      .0802   -0.0723  0.942   -.162988      .151389
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .32476     .30385   1.0688   0.285   -.270771       .92029
    Bias-corrected | -.63921     .30385   -2.1037  0.035   -1.23475     -.043684
            Robust | -.63921     .97993   -0.6523  0.514   -2.55983       1.2814
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04397     .17861   -0.2462  0.806   -.394041      .306096
    Bias-corrected |  .40308     .17861   2.2568   0.024    .053015      .753152
            Robust |  .40308     .27665   1.4570   0.145   -.139147      .945315
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       259         445            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    85.839      85.839
       BW bias (b) |   150.678     150.678
         rho (h/b) |     0.570       0.570
        Unique obs |       304         259

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00228     .11099   0.0205   0.984   -.215252      .219813
    Bias-corrected | -.03394     .11099   -0.3058  0.760   -.251475       .18359
            Robust | -.03394     .13013   -0.2608  0.794   -.288984      .221098
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17081     .40664   -0.4201  0.674   -.967803      .626182
    Bias-corrected |  .07184     .40664   0.1767   0.860   -.725152      .868834
            Robust |  .07184     1.3029   0.0551   0.956   -2.48185      2.62553
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06766     .21811   0.3102   0.756   -.359819      .495145
    Bias-corrected |  .08801     .21811   0.4035   0.687    -.33947      .515494
            Robust |  .08801     .32779   0.2685   0.788   -.554446      .730471
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |        90         135            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    75.484      75.484
       BW bias (b) |   123.325     123.325
         rho (h/b) |     0.612       0.612
        Unique obs |       130         233

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03202      .1757   0.1823   0.855   -.312351      .376396
    Bias-corrected |  .00764      .1757   0.0435   0.965   -.336732      .352014
            Robust |  .00764     .21209   0.0360   0.971   -.408038       .42332
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2842     .58376   2.1999   0.028    .140059      2.42836
    Bias-corrected | -.78787     .58376   -1.3496  0.177   -1.93202      .356283
            Robust | -.78787     1.5778   -0.4994  0.618   -3.88021      2.30448
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.18374     .29321   -0.6267  0.531   -.758424      .390939
    Bias-corrected |  .60173     .29321   2.0522   0.040     .02705      1.17641
            Robust |  .60173     .49389   1.2183   0.223   -.366277      1.56974
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       147         228            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    77.452      77.452
       BW bias (b) |   130.525     130.525
         rho (h/b) |     0.593       0.593
        Unique obs |       285         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04173     .16861   -0.2475  0.805   -.372206      .288752
    Bias-corrected | -.07633     .16861   -0.4527  0.651   -.406809      .254148
            Robust | -.07633     .20269   -0.3766  0.706   -.473602      .320941
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.3873     .23456   -1.6512  0.099   -.847025      .072425
    Bias-corrected | -1.2729     .23456   -5.4268  0.000   -1.73262     -.813172
            Robust | -1.2729     .51422   -2.4754  0.013   -2.28075     -.265048
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        869
-------------------+----------------------            BW type       =     Manual
     Number of obs |       400         469            Kernel        =    Uniform
Eff. Number of obs |       400         469            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02142     .10074   -0.2127  0.832   -.218881      .176031
    Bias-corrected | -.19019     .10074   -1.8878  0.059   -.387643       .00727
            Robust | -.19019     .18167   -1.0469  0.295   -.546256      .165883
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6955
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3694        3261            Kernel        = Epanechnikov
Eff. Number of obs |       790         805            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.923      61.923
       BW bias (b) |   101.547     101.547
         rho (h/b) |     0.610       0.610
        Unique obs |       379         279

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00155      .0787   -0.0197  0.984   -.155801      .152695
    Bias-corrected |  .00851      .0787   0.1082   0.914   -.145736      .162759
            Robust |  .00851     .09504   0.0896   0.929   -.177756      .194779
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) kernel(uni) p(1) h(12) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.25473     .19949   -1.2769  0.202   -.645714      .136254
    Bias-corrected | -1.2361     .19949   -6.1964  0.000   -1.62708     -.845109
            Robust | -1.2361     .49832   -2.4805  0.013   -2.21278     -.259405
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat != ., covs(male) kernel(uni) p(1) h(36) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03175     .12406   -0.2559  0.798   -.274901      .211399
    Bias-corrected | -.06724     .12406   -0.5420  0.588   -.310386      .175915
            Robust | -.06724     .17493   -0.3843  0.701   -.410097      .275627
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat != ., covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |      1129        1216            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.771      69.771
       BW bias (b) |   109.960     109.960
         rho (h/b) |     0.635       0.635
        Unique obs |       386         281
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02139     .08479   -0.2522  0.801   -.187584      .144806
    Bias-corrected | -.02613     .08479   -0.3082  0.758   -.192327      .140062
            Robust | -.02613     .10294   -0.2539  0.800   -.227884      .175619
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(12) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .32476     .26526   1.2243   0.221   -.195141      .844661
    Bias-corrected | -.63921     .26526   -2.4098  0.016   -1.15912     -.119314
            Robust | -.63921     .89053   -0.7178  0.473   -2.38461      1.10618
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(36) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04397     .18348   -0.2397  0.811   -.403593      .315647
    Bias-corrected |  .40308     .18348   2.1968   0.028    .043463      .762704
            Robust |  .40308     .24817   1.6242   0.104   -.083315      .889483
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (ed
> ucat==1 | educat==2), covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provinc
> e_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       285         560            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    95.004      95.004
       BW bias (b) |   168.004     168.004
         rho (h/b) |     0.565       0.565
        Unique obs |       304         259
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00124     .11201   -0.0111  0.991   -.220778       .21829
    Bias-corrected | -.04127     .11201   -0.3685  0.713   -.260809      .178259
            Robust | -.04127     .13008   -0.3173  0.751   -.296222      .213673
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17081     .53775   -0.3176  0.751   -1.22477      .883151
    Bias-corrected |  .07184     .53775   0.1336   0.894   -.982121       1.1258
            Robust |  .07184     1.1043   0.0651   0.948   -2.09256      2.23624
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==1, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06766     .18876   0.3585   0.720   -.302292      .437617
    Bias-corrected |  .08801     .18876   0.4663   0.641   -.281942      .457967
            Robust |  .08801     .34846   0.2526   0.801   -.594949      .770973
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==1, covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |        97         153            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    83.188      83.188
       BW bias (b) |   137.159     137.159
         rho (h/b) |     0.607       0.607
        Unique obs |       130         233
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04517     .13407   0.3369   0.736   -.217602      .307936
    Bias-corrected |   .0294     .13407   0.2193   0.826    -.23337      .292168
            Robust |   .0294     .15644   0.1879   0.851   -.277216      .336014
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2842     .50065   2.5651   0.010    .302953      2.26547
    Bias-corrected | -.78787     .50065   -1.5737  0.116   -1.76912       .19339
            Robust | -.78787      1.473   -0.5349  0.593   -3.67488      2.09915
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==2, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.18374     .30065   -0.6112  0.541   -.772999      .405515
    Bias-corrected |  .60173     .30065   2.0015   0.045    .012474      1.19099
            Robust |  .60173     .27593   2.1807   0.029    .060919      1.14254
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==2, covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       156         254            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.051      80.051
       BW bias (b) |   132.515     132.515
         rho (h/b) |     0.604       0.604
        Unique obs |       285         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04492     .20263   -0.2217  0.825   -.442061      .352224
    Bias-corrected | -.08229     .20263   -0.4061  0.685   -.479436      .314848
            Robust | -.08229     .25111   -0.3277  0.743   -.574455      .409867
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.3873     .22733   -1.7037  0.088   -.832859      .058259
    Bias-corrected | -1.2729     .22733   -5.5993  0.000   -1.71846     -.827338
            Robust | -1.2729     .50713   -2.5100  0.012   -2.26686     -.278937
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 200, 16667) & educat ==3, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        869
-------------------+----------------------            BW type       =     Manual
     Number of obs |       400         469            Kernel        =    Uniform
Eff. Number of obs |       400         469            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02142     .14321   -0.1496  0.881   -.302107      .259257
    Bias-corrected | -.19019     .14321   -1.3280  0.184   -.470869      .090496
            Robust | -.19019     .19865   -0.9574  0.338   -.579537      .199164
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & edu
> cat ==3, covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6955
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3694        3261            Kernel        = Epanechnikov
Eff. Number of obs |       804         826            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.462      62.462
       BW bias (b) |   102.031     102.031
         rho (h/b) |     0.612       0.612
        Unique obs |       379         279
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0024     .10708   -0.0224  0.982   -.212267      .207473
    Bias-corrected |  .00696     .10708   0.0650   0.948   -.202912      .216827
            Robust |  .00696     .13005   0.0535   0.957   -.247942      .261856
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Earning Sheet 6 results.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *2_2) RDD Higheredu t
. 
. *2_2_1) rdrobust on higheredu, sheet 1, no province no omitting local variables
. 
. **2_2_1_1 Pooled 
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat !=
>  ., covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01679     .01697   -0.9897  0.322   -.050047      .016463
    Bias-corrected | -.00058     .01697   -0.0342  0.973   -.033836      .032675
            Robust | -.00058     .00777   -0.0747  0.940   -.015805      .014644
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", replace ctitle(no province no 
> local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat !=
>  ., covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01323     .01184   1.1173   0.264   -.009976      .036433
    Bias-corrected | -.00336     .01184   -0.2841  0.776   -.026568      .019841
            Robust | -.00336     .01561   -0.2155  0.829    -.03395      .027222
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat != ., covs(male) kernel(
> epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |       966        1046            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.095      59.095
       BW bias (b) |   106.272     106.272
         rho (h/b) |     0.556       0.556
        Unique obs |       388         283

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00549     .00965   0.5686   0.570   -.013431       .02441
    Bias-corrected |  .00755     .00965   0.7820   0.434   -.011372       .02647
            Robust |  .00755     .01117   0.6757   0.499   -.014349      .029447
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & (educat==
> 1 | educat==2), covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06509     .07067   -0.9211  0.357   -.203605      .073419
    Bias-corrected | -.01797     .07067   -0.2542  0.799    -.15648      .120544
            Robust | -.01797      .0331   -0.5429  0.587   -.082838      .046902
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & (educat==
> 1 | educat==2), covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05897     .05003   1.1787   0.239   -.039083      .157022
    Bias-corrected | -.01627     .05003   -0.3251  0.745   -.114319      .081787
            Robust | -.01627     .06543   -0.2486  0.804   -.144512       .11198
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat==2), covs(m
> ale) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       241         359            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    75.047      75.047
       BW bias (b) |   123.711     123.711
         rho (h/b) |     0.607       0.607
        Unique obs |       306         261

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04206     .03512   1.1976   0.231   -.026777      .110904
    Bias-corrected |  .03847     .03512   1.0954   0.273   -.030366      .107315
            Robust |  .03847     .04156   0.9258   0.355   -.042976      .119925
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_3 SecVoc
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 1, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13182     .11865   -1.1110  0.267    -.36437      .100734
    Bias-corrected | -.06535     .11865   -0.5508  0.582   -.297905        .1672
            Robust | -.06535     .08206   -0.7964  0.426    -.22619      .095485
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 1, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02559     .06137   -0.4170  0.677   -.145882      .094699
    Bias-corrected | -.08128     .06137   -1.3244  0.185   -.201572      .039009
            Robust | -.08128     .09989   -0.8137  0.416   -.277065      .114502
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(male) kernel(e
> pa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |       117         279            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   111.170     111.170
       BW bias (b) |   163.465     163.465
         rho (h/b) |     0.680       0.680
        Unique obs |       132         235

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00319     .03569   0.0895   0.929   -.066752      .073137
    Bias-corrected | -.00019     .03569   -0.0053  0.996   -.070134      .069756
            Robust | -.00019     .04469   -0.0042  0.997   -.087787      .087409
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_4 SecGen
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 2, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02601     .12852   0.2024   0.840   -.225877      .277896
    Bias-corrected |  .08307     .12852   0.6463   0.518    -.16882      .334952
            Robust |  .08307     .07353   1.1296   0.259   -.061056      .227188
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 2, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17701     .09225   1.9189   0.055   -.003784      .357813
    Bias-corrected |  .10141     .09225   1.0993   0.272    -.07939      .282208
            Robust |  .10141     .11747   0.8633   0.388   -.128825      .331643
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(male) kernel(e
> pa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |       124         169            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.232      64.232
       BW bias (b) |   113.745     113.745
         rho (h/b) |     0.565       0.565
        Unique obs |       286         247

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13078     .06623   1.9745   0.048    .000965      .260595
    Bias-corrected |  .14745     .06623   2.2262   0.026    .017633      .277263
            Robust |  .14745     .07687   1.9181   0.055    -.00322      .298117
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_5 SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 3, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 3, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        921
-------------------+----------------------            BW type       =     Manual
     Number of obs |       422         499            Kernel        =    Uniform
Eff. Number of obs |       422         499            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(male) kernel(e
> pa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7007
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3716        3291            Kernel        = Epanechnikov
Eff. Number of obs |      3715        3291            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       381         281

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *2_2_2) rdrobust on higheredu, sheet 2, province-clustered no omitting local variables
. 
. **2_2_2_1 Pooled 
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat !=
>  ., covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        398
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         209            Kernel        =    Uniform
Eff. Number of obs |       189         209            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01679     .01587   -1.0582  0.290   -.047895      .014311
    Bias-corrected | -.00058     .01587   -0.0366  0.971   -.031683      .030522
            Robust | -.00058     .00796   -0.0729  0.942   -.016182      .015021
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", replace ctitle(province-cluste
> red no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat !=
>  ., covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1198
-------------------+----------------------            BW type       =     Manual
     Number of obs |       555         643            Kernel        =    Uniform
Eff. Number of obs |       555         643            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01323     .01145   1.1552   0.248   -.009215      .035672
    Bias-corrected | -.00336     .01145   -0.2937  0.769   -.025807       .01908
            Robust | -.00336     .01264   -0.2661  0.790   -.028139      .021412
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat != ., covs(male) kernel(
> epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10393
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4726        5667            Kernel        = Epanechnikov
Eff. Number of obs |       913         998            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.088      56.088
       BW bias (b) |   102.114     102.114
         rho (h/b) |     0.549       0.549
        Unique obs |       388         283
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00577     .00837   0.6893   0.491    -.01064      .022186
    Bias-corrected |  .00757     .00837   0.9037   0.366   -.008845      .023981
            Robust |  .00757     .00998   0.7582   0.448   -.011996      .027131
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & (educat==
> 1 | educat==2), covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         95
-------------------+----------------------            BW type       =     Manual
     Number of obs |        48          47            Kernel        =    Uniform
Eff. Number of obs |        48          47            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06509     .06513   -0.9994  0.318   -.192753      .062566
    Bias-corrected | -.01797     .06513   -0.2759  0.783   -.145628      .109692
            Robust | -.01797     .03144   -0.5715  0.568   -.079584      .043649
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & (educat==
> 1 | educat==2), covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        277
-------------------+----------------------            BW type       =     Manual
     Number of obs |       133         144            Kernel        =    Uniform
Eff. Number of obs |       133         144            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05897     .04879   1.2087   0.227   -.036654      .154593
    Bias-corrected | -.01627     .04879   -0.3334  0.739    -.11189      .079358
            Robust | -.01627     .05345   -0.3043  0.761   -.121033        .0885
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & (educat==1 | educat==2), covs(m
> ale) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3386
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1010        2376            Kernel        = Epanechnikov
Eff. Number of obs |       222         316            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.210      70.210
       BW bias (b) |   123.764     123.764
         rho (h/b) |     0.567       0.567
        Unique obs |       306         261
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03532     .03168   1.1149   0.265   -.026774      .097424
    Bias-corrected |  .03227     .03168   1.0186   0.308   -.029825      .094373
            Robust |  .03227     .03626   0.8900   0.373   -.038797      .103346
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_3 SecVoc
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 1, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         52
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          28            Kernel        =    Uniform
Eff. Number of obs |        24          28            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.13182     .12165   -1.0836  0.279   -.370243      .106607
    Bias-corrected | -.06535     .12165   -0.5372  0.591   -.303778      .173072
            Robust | -.06535      .0968   -0.6751  0.500   -.255083      .124378
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 1, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        123
-------------------+----------------------            BW type       =     Manual
     Number of obs |        53          70            Kernel        =    Uniform
Eff. Number of obs |        53          70            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02559     .06092   -0.4201  0.674   -.144989      .093806
    Bias-corrected | -.08128     .06092   -1.3343  0.182   -.200679      .038116
            Robust | -.08128     .09844   -0.8257  0.409   -.274229      .111666
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==1, covs(male) kernel(e
> pa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1023
-------------------+----------------------            BW type       =      mserd
     Number of obs |       199         824            Kernel        = Epanechnikov
Eff. Number of obs |       141         478            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   147.107     147.107
       BW bias (b) |   181.399     181.399
         rho (h/b) |     0.811       0.811
        Unique obs |       132         235
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00381     .02764   0.1377   0.890   -.050372      .057984
    Bias-corrected |  .00418     .02764   0.1514   0.880   -.049994      .058363
            Robust |  .00418      .0333   0.1257   0.900   -.061089      .069458
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_4 SecGen
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 2, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         43
-------------------+----------------------            BW type       =     Manual
     Number of obs |        24          19            Kernel        =    Uniform
Eff. Number of obs |        24          19            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10          10

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02601     .11216   0.2319   0.817   -.193824      .245843
    Bias-corrected |  .08307     .11216   0.7406   0.459   -.136768        .3029
            Robust |  .08307     .08248   1.0071   0.314   -.078587      .244719
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 2, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        154
-------------------+----------------------            BW type       =     Manual
     Number of obs |        80          74            Kernel        =    Uniform
Eff. Number of obs |        80          74            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17701     .07451   2.3758   0.018    .030986      .323043
    Bias-corrected |  .10141     .07451   1.3611   0.173    -.04462      .247438
            Robust |  .10141     .07344   1.3809   0.167   -.042529      .245347
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==2, covs(male) kernel(e
> pa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2363
-------------------+----------------------            BW type       =      mserd
     Number of obs |       811        1552            Kernel        = Epanechnikov
Eff. Number of obs |       126         179            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    67.910      67.910
       BW bias (b) |   119.064     119.064
         rho (h/b) |     0.570       0.570
        Unique obs |       286         247
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13211     .05109   2.5855   0.010    .031963      .232251
    Bias-corrected |  .14655     .05109   2.8682   0.004    .046408      .246696
            Robust |  .14655     .05893   2.4871   0.013     .03106      .262044
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_5 SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 200, 16667) & educat ==
> 3, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        303
-------------------+----------------------            BW type       =     Manual
     Number of obs |       141         162            Kernel        =    Uniform
Eff. Number of obs |       141         162            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 200, 16667) & educat ==
> 3, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        921
-------------------+----------------------            BW type       =     Manual
     Number of obs |       422         499            Kernel        =    Uniform
Eff. Number of obs |       422         499            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 200, 16667) & educat ==3, covs(male) kernel(e
> pa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7007
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3716        3291            Kernel        = Epanechnikov
Eff. Number of obs |      3715        3291            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       381         281
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *2_2_3) rdrobust on higheredu, sheet 3, no province no Aug-Sep
. 
. **2_2_3_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02182     .02409   -0.9058  0.365    -.06904      .025397
    Bias-corrected |   .0018     .02409   0.0747   0.940    -.04542      .049017
            Robust |   .0018     .02097   0.0858   0.932   -.039312      .042909
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", replace ctitle(no province no 
> Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01575     .01344   1.1722   0.241   -.010584      .042084
    Bias-corrected | -.00133     .01344   -0.0993  0.921   -.027669      .024999
            Robust | -.00133     .02002   -0.0667  0.947   -.040573      .037903
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat != ., c
> ovs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |       865         946            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.820      54.820
       BW bias (b) |    94.596      94.596
         rho (h/b) |     0.580       0.580
        Unique obs |       387         282

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00705     .01111   0.6344   0.526   -.014723      .028815
    Bias-corrected |  .00764     .01111   0.6879   0.492   -.014129      .029409
            Robust |  .00764     .01326   0.5762   0.564   -.018349       .03363
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.11513      .1313   -0.8769  0.381   -.372467      .142205
    Bias-corrected | -.09204      .1313   -0.7010  0.483   -.349376      .165296
            Robust | -.09204     .16098   -0.5717  0.567   -.407559      .223478
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07246     .06045   1.1987   0.231   -.046014      .190933
    Bias-corrected | -.01175     .06045   -0.1944  0.846   -.130228       .10672
            Robust | -.01175     .10084   -0.1166  0.907   -.209394      .185887
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (educat==1 | e
> ducat==2), covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       217         309            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.196      70.196
       BW bias (b) |   119.403     119.403
         rho (h/b) |     0.588       0.588
        Unique obs |       305         260

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04026     .04151   0.9701   0.332   -.041087      .121613
    Bias-corrected |  .03739     .04151   0.9009   0.368   -.043959      .118742
            Robust |  .03739      .0496   0.7539   0.451   -.059818      .134601
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17729     .14649   -1.2103  0.226     -.4644      .109816
    Bias-corrected | -.14985     .14649   -1.0230  0.306   -.436962      .137254
            Robust | -.14985      .1602   -0.9354  0.350   -.463833      .164125
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02331     .06742   -0.3458  0.730   -.155461      .108833
    Bias-corrected | -.09009     .06742   -1.3362  0.181   -.222237      .042057
            Robust | -.09009     .11629   -0.7747  0.439   -.318023      .137844
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==1, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |       114         248            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   106.920     106.920
       BW bias (b) |   159.300     159.300
         rho (h/b) |     0.671       0.671
        Unique obs |       131         234

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0008     .03808   0.0209   0.983   -.073838      .075428
    Bias-corrected | -.00321     .03808   -0.0844  0.933   -.077846       .07142
            Robust | -.00321     .04785   -0.0671  0.946   -.096994      .090568
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00993     .32738   -0.0303  0.976   -.651586      .631733
    Bias-corrected |  .64837     .32738   1.9805   0.048    .006713      1.29003
            Robust |  .64837     .95746   0.6772   0.498   -1.22821      2.52496
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21231      .1138   1.8657   0.062   -.010727      .435345
    Bias-corrected |  .16224      .1138   1.4257   0.154   -.060795      .385278
            Robust |  .16224     .21184   0.7659   0.444   -.252948      .577431
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==2, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       117         159            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.205      62.205
       BW bias (b) |   115.063     115.063
         rho (h/b) |     0.541       0.541
        Unique obs |       285         246

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14704     .07767   1.8931   0.058   -.005192      .299267
    Bias-corrected |  .16722     .07767   2.1529   0.031    .014986      .319445
            Robust |  .16722     .09056   1.8465   0.065   -.010279      .344709
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        898
-------------------+----------------------            BW type       =     Manual
     Number of obs |       415         483            Kernel        =    Uniform
Eff. Number of obs |       415         483            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==3, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6984
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3275            Kernel        = Epanechnikov
Eff. Number of obs |      3708        3275            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       380         280

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *2_2_4) rdrobust on higheredu, sheet 4, province-clustered no Aug-Sep
. 
. **2_2_4_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        363
-------------------+----------------------            BW type       =     Manual
     Number of obs |       177         186            Kernel        =    Uniform
Eff. Number of obs |       177         186            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02182     .02288   -0.9538  0.340   -.066662      .023019
    Bias-corrected |   .0018     .02288   0.0786   0.937   -.043042      .046639
            Robust |   .0018     .02226   0.0808   0.936   -.041824      .045421
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", replace ctitle(province-cluste
> red no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1163
-------------------+----------------------            BW type       =     Manual
     Number of obs |       543         620            Kernel        =    Uniform
Eff. Number of obs |       543         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01575     .01294   1.2168   0.224    -.00962      .041119
    Bias-corrected | -.00133     .01294   -0.1031  0.918   -.026704      .024035
            Robust | -.00133     .01622   -0.0823  0.934   -.033121      .030452
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat != ., c
> ovs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10358
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4714        5644            Kernel        = Epanechnikov
Eff. Number of obs |       865         946            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.617      54.617
       BW bias (b) |    93.315      93.315
         rho (h/b) |     0.585       0.585
        Unique obs |       387         282
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00708     .00941   0.7521   0.452   -.011364      .025517
    Bias-corrected |  .00735     .00941   0.7816   0.434   -.011087      .025795
            Robust |  .00735     .01149   0.6399   0.522    -.01517      .029878
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(12) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         83
-------------------+----------------------            BW type       =     Manual
     Number of obs |        43          40            Kernel        =    Uniform
Eff. Number of obs |        43          40            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.11513     .12045   -0.9559  0.339   -.351204      .120942
    Bias-corrected | -.09204     .12045   -0.7642  0.445   -.328113      .144033
            Robust | -.09204     .15468   -0.5950  0.552   -.395213      .211133
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(36) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        265
-------------------+----------------------            BW type       =     Manual
     Number of obs |       128         137            Kernel        =    Uniform
Eff. Number of obs |       128         137            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07246     .05894   1.2293   0.219   -.043066      .187986
    Bias-corrected | -.01175     .05894   -0.1994  0.842    -.12728      .103772
            Robust | -.01175     .08254   -0.1424  0.887   -.173528       .15002
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & (educat==1 | e
> ducat==2), covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3374
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1005        2369            Kernel        = Epanechnikov
Eff. Number of obs |       232         340            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    73.564      73.564
       BW bias (b) |   127.464     127.464
         rho (h/b) |     0.577       0.577
        Unique obs |       305         260
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04593      .0349   1.3161   0.188    -.02247      .114324
    Bias-corrected |  .04294      .0349   1.2304   0.219   -.025461      .111333
            Robust |  .04294     .03986   1.0772   0.281   -.035186      .121059
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         47
-------------------+----------------------            BW type       =     Manual
     Number of obs |        23          24            Kernel        =    Uniform
Eff. Number of obs |        23          24            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17729     .15058   -1.1774  0.239   -.472421      .117838
    Bias-corrected | -.14985     .15058   -0.9952  0.320   -.444983      .145276
            Robust | -.14985      .1841   -0.8140  0.416   -.510679      .210972
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        118
-------------------+----------------------            BW type       =     Manual
     Number of obs |        52          66            Kernel        =    Uniform
Eff. Number of obs |        52          66            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02331     .06701   -0.3479  0.728   -.154647      .108019
    Bias-corrected | -.09009     .06701   -1.3445  0.179   -.221423      .041244
            Robust | -.09009     .11445   -0.7872  0.431   -.314401      .134222
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==1, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1018
-------------------+----------------------            BW type       =      mserd
     Number of obs |       198         820            Kernel        = Epanechnikov
Eff. Number of obs |       134         411            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   135.669     135.669
       BW bias (b) |   173.216     173.216
         rho (h/b) |     0.783       0.783
        Unique obs |       131         234
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00599     .02938   0.2039   0.838   -.051589      .063569
    Bias-corrected |  .00452     .02938   0.1537   0.878   -.053063      .062095
            Robust |  .00452     .03607   0.1252   0.900   -.066185      .075217
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00993     .28732   -0.0345  0.972   -.573067      .553214
    Bias-corrected |  .64837     .28732   2.2566   0.024    .085233      1.21151
            Robust |  .64837     1.1931   0.5434   0.587   -1.69001      2.98675
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21231     .09406   2.2571   0.024    .027952      .396665
    Bias-corrected |  .16224     .09406   1.7249   0.085   -.022115      .346598
            Robust |  .16224     .12981   1.2498   0.211   -.092189      .416672
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==2, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       126         181            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.749      69.749
       BW bias (b) |   122.612     122.612
         rho (h/b) |     0.569       0.569
        Unique obs |       285         246
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1465     .05603   2.6145   0.009    .036679      .256329
    Bias-corrected |  .16386     .05603   2.9242   0.003    .054031      .273681
            Robust |  .16386     .06504   2.5194   0.012    .036386      .291326
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       134         146            Kernel        =    Uniform
Eff. Number of obs |       134         146            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        898
-------------------+----------------------            BW type       =     Manual
     Number of obs |       415         483            Kernel        =    Uniform
Eff. Number of obs |       415         483            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 200, 16667) & educat ==3, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6984
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3709        3275            Kernel        = Epanechnikov
Eff. Number of obs |      3708        3275            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       380         280
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *2_2_5) rdrobust on higheredu, sheet 5, no province no July-Oct
. 
. **2_2_5_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03032     .03453   -0.8779  0.380   -.098001      .037369
    Bias-corrected | -.00664     .03453   -0.1923  0.848   -.074326      .061045
            Robust | -.00664      .0495   -0.1341  0.893   -.103661      .090381
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", replace ctitle(no province no 
> July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01744     .01502   1.1614   0.245   -.011995      .046884
    Bias-corrected | -.00125     .01502   -0.0834  0.934   -.030693      .028186
            Robust | -.00125     .02576   -0.0487  0.961   -.051743      .049237
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat != ., c
> ovs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |       810         896            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.409      52.409
       BW bias (b) |    92.306      92.306
         rho (h/b) |     0.568       0.568
        Unique obs |       386         281

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00839     .01252   0.6706   0.502   -.016138      .032924
    Bias-corrected |  .00871     .01252   0.6962   0.486   -.015818      .033245
            Robust |  .00871     .01503   0.5796   0.562    -.02075      .038177
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12426     .15986   -0.7773  0.437   -.437569      .189052
    Bias-corrected | -.04628     .15986   -0.2895  0.772   -.359593      .267028
            Robust | -.04628     .30751   -0.1505  0.880   -.648992      .556428
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07806     .06368   1.2258   0.220   -.046751       .20287
    Bias-corrected | -.00087     .06368   -0.0137  0.989   -.125682      .123939
            Robust | -.00087     .11416   -0.0076  0.994   -.224629      .222885
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (educat==1 | e
> ducat==2), covs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       204         295            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.459      68.459
       BW bias (b) |   117.617     117.617
         rho (h/b) |     0.582       0.582
        Unique obs |       304         259

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04078      .0437   0.9333   0.351   -.044862      .126422
    Bias-corrected |  .03856      .0437   0.8826   0.377   -.047078      .124207
            Robust |  .03856     .05238   0.7362   0.462   -.064107      .141235
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.22112     .17963   -1.2310  0.218   -.573179      .130949
    Bias-corrected | -.31575     .17963   -1.7578  0.079   -.667819      .036309
            Robust | -.31575     .29402   -1.0739  0.283   -.892026      .260516
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02263     .07341   -0.3082  0.758   -.166509      .121254
    Bias-corrected | -.09725     .07341   -1.3248  0.185   -.241133       .04663
            Robust | -.09725     .13566   -0.7169  0.473    -.36314      .168637
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==1, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |       112         236            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   104.765     104.765
       BW bias (b) |   158.265     158.265
         rho (h/b) |     0.662       0.662
        Unique obs |       130         233

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00134     .04035   -0.0333  0.973   -.080427      .077742
    Bias-corrected | -.00557     .04035   -0.1379  0.890    -.08465      .073518
            Robust | -.00557     .05082   -0.1095  0.913   -.105169      .094037
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00993     .32738   -0.0303  0.976   -.651586      .631733
    Bias-corrected |  .64837     .32738   1.9805   0.048    .006713      1.29003
            Robust |  .64837     .95746   0.6772   0.498   -1.22821      2.52496
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21231      .1138   1.8657   0.062   -.010727      .435345
    Bias-corrected |  .16224      .1138   1.4257   0.154   -.060795      .385278
            Robust |  .16224     .21184   0.7659   0.444   -.252948      .577431
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==2, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       117         159            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.205      62.205
       BW bias (b) |   115.063     115.063
         rho (h/b) |     0.541       0.541
        Unique obs |       285         246

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14704     .07767   1.8931   0.058   -.005192      .299267
    Bias-corrected |  .16722     .07767   2.1529   0.031    .014986      .319445
            Robust |  .16722     .09056   1.8465   0.065   -.010279      .344709
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        869
-------------------+----------------------            BW type       =     Manual
     Number of obs |       400         469            Kernel        =    Uniform
Eff. Number of obs |       400         469            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==3, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6955
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3694        3261            Kernel        = Epanechnikov
Eff. Number of obs |      3693        3261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       379         279

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *2_2_6) rdrobust on higheredu, sheet 6, province-clustered no July-Oct
. 
. **2_2_6_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        331
-------------------+----------------------            BW type       =     Manual
     Number of obs |       161         170            Kernel        =    Uniform
Eff. Number of obs |       161         170            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03032     .03251   -0.9324  0.351   -.094039      .033407
    Bias-corrected | -.00664     .03251   -0.2042  0.838   -.070364      .057083
            Robust | -.00664     .04927   -0.1348  0.893   -.103206      .089926
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", replace ctitle(province-cluste
> red no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat != ., covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1131
-------------------+----------------------            BW type       =     Manual
     Number of obs |       527         604            Kernel        =    Uniform
Eff. Number of obs |       527         604            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01744     .01441   1.2109   0.226   -.010792      .045681
    Bias-corrected | -.00125     .01441   -0.0870  0.931    -.02949      .026984
            Robust | -.00125     .02086   -0.0601  0.952   -.042131      .039625
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat != ., c
> ovs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10326
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4698        5628            Kernel        = Epanechnikov
Eff. Number of obs |       826         916            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.547      53.547
       BW bias (b) |    93.289      93.289
         rho (h/b) |     0.574       0.574
        Unique obs |       386         281
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00792      .0104   0.7612   0.447   -.012471      .028311
    Bias-corrected |  .00834      .0104   0.8017   0.423   -.012051      .028731
            Robust |  .00834     .01279   0.6523   0.514   -.016719        .0334
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(12) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         80
-------------------+----------------------            BW type       =     Manual
     Number of obs |        42          38            Kernel        =    Uniform
Eff. Number of obs |        42          38            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.12426     .14819   -0.8385  0.402   -.414702      .166186
    Bias-corrected | -.04628     .14819   -0.3123  0.755   -.336726      .244162
            Robust | -.04628     .31013   -0.1492  0.881    -.65413      .561565
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & (educat==1 | educat==2), covs(male) kernel(uni) p(1) h(36) all vce(nncluster provin
> ce_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        262
-------------------+----------------------            BW type       =     Manual
     Number of obs |       127         135            Kernel        =    Uniform
Eff. Number of obs |       127         135            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07806     .06207   1.2576   0.209   -.043596      .199715
    Bias-corrected | -.00087     .06207   -0.0140  0.989   -.122527      .120784
            Robust | -.00087     .09395   -0.0093  0.993   -.185016      .183272
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & (educat==1 | e
> ducat==2), covs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       3371
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1004        2367            Kernel        = Epanechnikov
Eff. Number of obs |       216         307            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.626      70.626
       BW bias (b) |   124.736     124.736
         rho (h/b) |     0.566       0.566
        Unique obs |       304         259
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04333     .03709   1.1681   0.243   -.029373      .116031
    Bias-corrected |  .04115     .03709   1.1094   0.267   -.031549      .113856
            Robust |  .04115     .04302   0.9567   0.339   -.043157      .125464
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         44
-------------------+----------------------            BW type       =     Manual
     Number of obs |        22          22            Kernel        =    Uniform
Eff. Number of obs |        22          22            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        11          11

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.22112     .18884   -1.1709  0.242   -.591235      .149005
    Bias-corrected | -.31575     .18884   -1.6721  0.095   -.685875      .054365
            Robust | -.31575      .3367   -0.9378  0.348   -.975684      .344175
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==1, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        115
-------------------+----------------------            BW type       =     Manual
     Number of obs |        51          64            Kernel        =    Uniform
Eff. Number of obs |        51          64            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          13

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02263     .07403   -0.3057  0.760   -.167717      .122462
    Bias-corrected | -.09725     .07403   -1.3137  0.189   -.242341      .047838
            Robust | -.09725      .1361   -0.7146  0.475   -.363993      .169491
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==1, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1015
-------------------+----------------------            BW type       =      mserd
     Number of obs |       197         818            Kernel        = Epanechnikov
Eff. Number of obs |       133         389            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   132.710     132.710
       BW bias (b) |   173.269     173.269
         rho (h/b) |     0.766       0.766
        Unique obs |       130         233
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00673     .03101   0.2171   0.828    -.05405      .067518
    Bias-corrected |  .00535     .03101   0.1726   0.863   -.055432      .066136
            Robust |  .00535     .03858   0.1387   0.890   -.070259      .080963
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =         36
-------------------+----------------------            BW type       =     Manual
     Number of obs |        20          16            Kernel        =    Uniform
Eff. Number of obs |        20          16            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        10           9

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00993     .28732   -0.0345  0.972   -.573067      .553214
    Bias-corrected |  .64837     .28732   2.2566   0.024    .085233      1.21151
            Robust |  .64837     1.1931   0.5434   0.587   -1.69001      2.98675
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==2, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        147
-------------------+----------------------            BW type       =     Manual
     Number of obs |        76          71            Kernel        =    Uniform
Eff. Number of obs |        76          71            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          12

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .21231     .09406   2.2571   0.024    .027952      .396665
    Bias-corrected |  .16224     .09406   1.7249   0.085   -.022115      .346598
            Robust |  .16224     .12981   1.2498   0.211   -.092189      .416672
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==2, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2356
-------------------+----------------------            BW type       =      mserd
     Number of obs |       807        1549            Kernel        = Epanechnikov
Eff. Number of obs |       126         181            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.749      69.749
       BW bias (b) |   122.612     122.612
         rho (h/b) |     0.569       0.569
        Unique obs |       285         246
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1465     .05603   2.6145   0.009    .036679      .256329
    Bias-corrected |  .16386     .05603   2.9242   0.003    .054031      .273681
            Robust |  .16386     .06504   2.5194   0.012    .036386      .291326
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        251
-------------------+----------------------            BW type       =     Manual
     Number of obs |       119         132            Kernel        =    Uniform
Eff. Number of obs |       119         132            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 200, 1
> 6667) & educat ==3, covs(male) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        869
-------------------+----------------------            BW type       =     Manual
     Number of obs |       400         469            Kernel        =    Uniform
Eff. Number of obs |       400         469            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 200, 16667) & educat ==3, co
> vs(male) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       6955
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3694        3261            Kernel        = Epanechnikov
Eff. Number of obs |      3693        3261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   583.000     583.000
       BW bias (b) |   583.000     583.000
         rho (h/b) |     1.000       1.000
        Unique obs |       379         279
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male controlled/Ru
> ral/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male 
> controlled/Rural/Rural 1979 Highgen ManualD Male controlled.log
  log type:  text
 closed on:   8 Aug 2024, 12:55:33
---------------------------------------------------------------------------------------------
