---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9
>  11/Rural tables.log
  log type:  text
 opened on:  25 Oct 2024, 13:52:08

. use "`datapath'", clear

. 
. 
. *Step Zero: A New Dataset for Merging
. 
. gen headsecedu = .
(35,007 missing values generated)

. gen headhighedu = .
(35,007 missing values generated)

. gen spousesecedu = .
(35,007 missing values generated)

. gen spousehighedu = .
(35,007 missing values generated)

. gen headparty = .
(35,007 missing values generated)

. gen spouseparty = .
(35,007 missing values generated)

. gen spouseparentsecedu = .
(35,007 missing values generated)

. gen spouseparenthighedu = .
(35,007 missing values generated)

. gen spouseparentparty = .
(35,007 missing values generated)

. gen headparentsecedu = .
(35,007 missing values generated)

. gen headparenthighedu = .
(35,007 missing values generated)

. gen headparentparty = .
(35,007 missing values generated)

. replace headsecedu = 1 if A02 == 1 & inrange(A13_1, 4, 9)
(1,332 real changes made)

. replace headsecedu = 0 if A02 == 1 & inrange(A13_1, 1, 3)
(7,897 real changes made)

. replace headhighedu = 1 if A02 == 1 & inrange(A13_1, 7, 9)
(180 real changes made)

. replace headhighedu = 0 if A02 == 1 & inrange(A13_1, 1, 6)
(9,049 real changes made)

. replace spousesecedu = 1 if A02 == 2 & inrange(A13_1, 4, 9)
(686 real changes made)

. replace spousesecedu = 0 if A02 == 2 & inrange(A13_1, 1, 3)
(7,673 real changes made)

. replace spousehighedu = 1 if A02 == 2 & inrange(A13_1, 7, 9)
(110 real changes made)

. replace spousehighedu = 0 if A02 == 2 & inrange(A13_1, 1, 6)
(8,249 real changes made)

. replace headparty = 1 if A02 == 1 & A07_1 == 1
(1,198 real changes made)

. replace headparty = 0 if A02 == 1 & inrange(A07_1, 2, 4)
(8,040 real changes made)

. replace spouseparty = 1 if A02 == 2 & A07_1 == 1
(267 real changes made)

. replace spouseparty = 0 if A02 == 2 & inrange(A07_1, 2, 4)
(8,101 real changes made)

. replace spouseparentsecedu = 0 if A02 == 5 & inrange(A13_1, 1, 3)
(68 real changes made)

. replace spouseparentsecedu = 1 if A02 == 5 & inrange(A13_1, 4, 9)
(2 real changes made)

. replace spouseparenthighedu = 0 if A02 == 5 & inrange(A13_1, 1, 6)
(70 real changes made)

. replace spouseparenthighedu = 1 if A02 == 5 & inrange(A13_1, 7, 9)
(0 real changes made)

. replace spouseparentparty = 0 if A02 == 5 & inrange(A07_1, 2, 4)
(66 real changes made)

. replace spouseparentparty = 1 if A02 == 5 & A07_1 == 1
(5 real changes made)

. replace headparentsecedu = 0 if A02 == 4 & inrange(A13_1, 1, 3)
(1,573 real changes made)

. replace headparentsecedu = 1 if A02 == 4 & inrange(A13_1, 4, 9)
(64 real changes made)

. replace headparenthighedu = 0 if A02 == 4 & inrange(A13_1, 1, 6)
(1,632 real changes made)

. replace headparenthighedu = 1 if A02 == 4 & inrange(A13_1, 7, 9)
(5 real changes made)

. replace headparentparty = 0 if A02 == 4 & inrange(A07_1, 2, 4)
(1,544 real changes made)

. replace headparentparty = 1 if A02 == 4 & A07_1 == 1
(97 real changes made)

. collapse (max) headsecedu headhighedu spousesecedu spousehighedu headparty spouseparty spou
> separentsecedu spouseparenthighedu spouseparentparty headparentsecedu headparenthighedu hea
> dparentparty, by(hhcode)

. 
. save "`folderpath'/`filename'.dta", replace
file /Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9
    11/Rural tables.dta saved

. 
. *Step One: Variables and Data Processing (See Selmlog Rural Basics for more info)
. 
. use "`datapath'", clear

. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. gen jun_log_monthlyearning = log_monthlyearning if secjun == 1
(27,895 missing values generated)

. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. gen yearat15 = birthyear+15
(7 missing values generated)

. local obsnum = _N

. forval i =  1/`obsnum' {
  2.         qui sum yearat15  in `i'
  3.         local yearvalue = round(mod(r(mean),100))
  4.         if inrange(`yearvalue', 0, 9) {
  5.                 local czgrad_year = "czgrad0`yearvalue'"
  6.                 local gzgrad_year = "gzgrad0`yearvalue'"
  7.         }
  8.         else {
  9.                 local czgrad_year = "czgrad`yearvalue'"
 10.                 local gzgrad_year = "gzgrad`yearvalue'"
 11.         }
 12.         if inrange(`yearvalue'+1, 0, 9) {
 13.                 local gzentrant_year = "gzentrant0`=`yearvalue'+1'"
 14.                 local gxentrant_year = "gxentrant0`=`yearvalue'+1'"
 15.                 local vsentrant_year = "vsentrant0`=`yearvalue'+1'"
 16.                 local tsentrant_year = "tsentrant0`=`yearvalue'+1'"
 17.         }
 18.         else{
 19.                 if `yearvalue' == 99 {
 20.                 local gzentrant_year = "gzentrant00"
 21.                 local gxentrant_year = "gxentrant00"
 22.                 local vsentrant_year = "vsentrant00"
 23.                 local tsentrant_year = "tsentrant00"
 24.                 }
 25.         else {
 26.                 local gzentrant_year = "gzentrant`=`yearvalue'+1'"
 27.                 local gxentrant_year = "gxentrant`=`yearvalue'+1'"
 28.                 local vsentrant_year = "vsentrant`=`yearvalue'+1'"
 29.                 local tsentrant_year = "tsentrant`=`yearvalue'+1'"
 30.         }
 31.         }
 32.         capture ds `czgrad_year' `gzgrad_year' `gzentrant_year' `gxentrant_year'
 33.         if _rc == 0 {
 34.                 capture ds ins1_secgen_entrant_relative ins2_highedu_entrant_relative
 35.                 if _rc!=0 {
 36.                         qui gen ins1_secgen_entrant_relative = `gzentrant_year'/`czgrad_
> year' if _n == `i'
 37.                         qui gen ins2_highedu_entrant_relative = `gxentrant_year'/`gzgrad
> _year' if _n == `i'
 38.                 
.                 }
 39.                 else {
 40.                         qui replace ins1_secgen_entrant_relative = `gzentrant_year'/`czg
> rad_year' if _n == `i'
 41.                         qui replace ins2_highedu_entrant_relative = `gxentrant_year'/`gz
> grad_year' if _n == `i'
 42.                 }
 43.         }
 44.         capture ds `czgrad_year' `vsentrant_year'
 45.         if _rc == 0 {
 46.                 capture ds ins3_vs_entrant_relative
 47.                 if _rc!=0 {
 48.                         qui gen ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_year
> ' if _n == `i'
 49.                 }
 50.                 else {
 51.                         qui replace ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_
> year' if _n == `i'
 52.                 }
 53.         }
 54. }

. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. merge m:1 hhcode using "`folderpath'/`filename'.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            35,007  (_merge==3)
    -----------------------------------------

. gen parent_secedu = 0 if (A02==1 & (inrange(H03_R1, 1, 3) | inrange(H03_R2, 1, 3))) | (A02=
> =2 & (inrange(H03_R3, 1, 3) | inrange(H03_R4, 1, 3)))
(28,206 missing values generated)

. replace parent_secedu = 0 if A02 ==3 & (headsecedu == 0 | spousesecedu == 0)
(9,445 real changes made)

. replace parent_secedu = 0 if (A02 == 2 & spouseparentsecedu == 0) | (A02 == 1 & headparents
> ecedu == 0)
(354 real changes made)

. replace parent_secedu=1 if (A02==1 & (inrange(H03_R1, 4, 9) | inrange(H03_R2, 4, 9)))|(A02=
> =2 & (inrange(H03_R3, 4, 9) | inrange(H03_R4, 4, 9)))
(441 real changes made)

. replace parent_secedu = 1 if A02 ==3 & (headsecedu == 1 | spousesecedu == 1)
(1,775 real changes made)

. replace parent_secedu = 1 if (A02 == 2 & spouseparentsecedu == 1) | (A02 == 1 & headparents
> ecedu == 1)
(15 real changes made)

. tab parent_secedu

parent_sece |
         du |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,834       86.93       86.93
          1 |      2,231       13.07      100.00
------------+-----------------------------------
      Total |     17,065      100.00

. gen parent_highedu = 0 if (A02==1 & (inrange(H03_R1, 1, 6) | inrange(H03_R2, 1, 6))) | (A02
> ==2 & (inrange(H03_R3, 1, 6) | inrange(H03_R4, 1, 6)))
(28,161 missing values generated)

. replace parent_highedu = 0 if A02 == 3 & (headhighedu == 0 | spousehighedu == 0)
(9,786 real changes made)

. replace parent_highedu = 0 if (A02 == 2 & spouseparenthighedu == 0) | (A02 == 1 & headparen
> thighedu == 0)
(358 real changes made)

. replace parent_highedu=1 if (A02==1 & (inrange(H03_R1, 7, 9) | inrange(H03_R2, 7, 9)))|(A02
> ==2 & (inrange(H03_R3, 7, 9) | inrange(H03_R4, 7, 9)))
(16 real changes made)

. replace parent_highedu = 1 if A02 == 3 & (headhighedu == 1 | spousehighedu == 1)
(269 real changes made)

. replace parent_highedu = 1 if (A02 == 2 & spouseparenthighedu == 1) | (A02 == 1 & headparen
> thighedu == 1)
(2 real changes made)

. tab parent_highedu

parent_high |
        edu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,778       98.32       98.32
          1 |        287        1.68      100.00
------------+-----------------------------------
      Total |     17,065      100.00

. gen parent_partymember = 0 if ((A02==1 & (inrange(H07_R1, 2, 4) | inrange(H07_R2, 2, 4))) |
>  (A02==2 & (inrange(H07_R3, 2, 4) | inrange(H07_R4, 2, 4))))
(28,178 missing values generated)

. replace parent_partymember = 0 if A02 == 3 & (headparty == 0 | spouseparty == 0)
(9,759 real changes made)

. replace parent_partymember = 0 if (A02 == 2 & spouseparentparty == 0) | (A02 == 1 & headpar
> entparty == 0)
(339 real changes made)

. replace parent_partymember=1 if (A02==1 & (H07_R1 == 1 | H07_R2 == 1)) | (A02==2 & (H07_R3 
> == 1 | H07_R4 == 1))
(634 real changes made)

. replace parent_partymember = 1 if A02 == 3 & (headparty == 1 | spouseparty == 1)
(1,264 real changes made)

. replace parent_partymember = 1 if (A02 == 2 & spouseparentparty == 1) | (A02 == 1 & headpar
> entparty == 1)
(29 real changes made)

. tab parent_partymember

parent_part |
    ymember |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,165       88.73       88.73
          1 |      1,927       11.27      100.00
------------+-----------------------------------
      Total |     17,092      100.00

. gen Keyschool = 0 if A14 != .

. replace Keyschool = 1 if inrange(A14, 1, 3)
(2,217 real changes made)

. gen TakeGaoKao = 1 if A15_1 == 1
(32,059 missing values generated)

. replace TakeGaoKao = 0 if A15_1 == 2
(26,078 real changes made)

. tab TakeGaoKao

 TakeGaoKao |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,078       89.84       89.84
          1 |      2,948       10.16      100.00
------------+-----------------------------------
      Total |     29,026      100.00

. tab TakeGaoKao educat

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |       998      1,350     10,086 |    12,434 
         1 |       320      2,508         87 |     2,915 
-----------+---------------------------------+----------
     Total |     1,318      3,858     10,173 |    15,349 

. tab TakeGaoKao educat if male==1

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |       607        867      5,808 |     7,282 
         1 |       174      1,410         43 |     1,627 
-----------+---------------------------------+----------
     Total |       781      2,277      5,851 |     8,909 

. tab TakeGaoKao educat if male==0

           |              educat
TakeGaoKao |         1          2          3 |     Total
-----------+---------------------------------+----------
         0 |       391        483      4,278 |     5,152 
         1 |       146      1,098         44 |     1,288 
-----------+---------------------------------+----------
     Total |       537      1,581      4,322 |     6,440 

. gen unemp_A20_5 = 1 if A20 == 5
(34,625 missing values generated)

. replace unemp_A20_5 = 0 if inrange(A20, 1, 4) | inrange(A20, 6, 9)
(33,965 real changes made)

. gen voc_unemp_A20_5 = unemp_A20_5 if educat == 1
(33,656 missing values generated)

. gen gen_unemp_A20_5 = unemp_A20_5 if educat == 2
(31,162 missing values generated)

. gen unemp_A20_59 = unemp_A20_5
(660 missing values generated)

. replace unemp_A20_59 = 1 if A20 == 9
(3,867 real changes made)

. gen voc_unemp_A20_59 = unemp_A20_59 if educat == 1
(33,656 missing values generated)

. gen gen_unemp_A20_59 = unemp_A20_59 if educat == 2
(31,162 missing values generated)

. gen highocc = 1 if C03_4 == 1 | C03_4 == 2
(33,090 missing values generated)

. replace highocc = 0 if inrange(C03_4, 3, 8)
(13,145 real changes made)

. gen voc_highocc = highocc if educat == 1
(33,956 missing values generated)

. gen gen_highocc = highocc if educat == 2
(32,578 missing values generated)

. gen longtermcontract = 1 if C07_1 == 1 | C07_1 == 2
(33,392 missing values generated)

. replace longtermcontract = 0 if inrange(C07_1, 3, 5)
(10,891 real changes made)

. gen voc_longtermcontract= longtermcontract if educat == 1
(34,072 missing values generated)

. gen gen_longtermcontract = longtermcontract if educat == 2
(32,837 missing values generated)

. sum unemp_A20_5, d

                         unemp_A20_5
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              34,347
25%            0              0       Sum of wgt.      34,347

50%            0                      Mean           .0111218
                        Largest       Std. dev.      .1048733
75%            0              1
90%            0              1       Variance       .0109984
95%            0              1       Skewness        9.32335
99%            1              1       Kurtosis       87.92486

. sum unemp_A20_59, d

                        unemp_A20_59
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              34,347
25%            0              0       Sum of wgt.      34,347

50%            0                      Mean            .123708
                        Largest       Std. dev.       .329253
75%            0              1
90%            1              1       Variance       .1084075
95%            1              1       Skewness       2.285765
99%            1              1       Kurtosis       6.224721

. sum highocc, d

                           highocc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              15,062
25%            0              0       Sum of wgt.      15,062

50%            0                      Mean           .1272739
                        Largest       Std. dev.      .3332906
75%            0              1
90%            1              1       Variance       .1110827
95%            1              1       Skewness       2.236717
99%            1              1       Kurtosis       6.002903

. sum longtermcontract, d

                      longtermcontract
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              12,506
25%            0              0       Sum of wgt.      12,506

50%            0                      Mean            .129138
                        Largest       Std. dev.       .335366
75%            0              1
90%            1              1       Variance       .1124704
95%            1              1       Skewness       2.211773
99%            1              1       Kurtosis       5.891941

. gen bornafter79=1 if birthyear>=1980 & birthyear<=2018
(18,547 missing values generated)

. replace bornafter79=0 if birthyear<1980 & birthyear>0
(18,540 real changes made)

. gen highvocafter79=highvocedu*bornafter79
(7 missing values generated)

. gen highgenafter79=highgenedu*bornafter79
(7 missing values generated)

. gen adulteduafter79=adultedu*bornafter79
(7 missing values generated)

. gen highereduafter79=higheredu*bornafter79
(7 missing values generated)

. 
. ***To label used variables (m1 m2 m3 need to be labelled afterwords, before generating tabl
> es again, because we drop m1 m2 m3 during regressing)
. local variablenames male exp expsqr higheredu highvocedu highgenedu adultedu highereduafter
> 79 TakeGaoKao parent_secedu parent_highedu parent_partymember

. local variablelabels ""Sex (male=1)" "Experience (years)" "Experience squared (years)" "Any
>  higher ed degree (yes=1)" "Higher voc ed degree (yes=1)" "University degree (yes=1)" "Adul
> t continuing ed degree (yes=1)" "Any higher ed degree * born after 1979 birth cohort" "Univ
> ersity entrance exam (took exam=1)" "Parent with upper secondary degree (yes=1)" "Parent wi
> th higher ed degree (yes=1)" "Parent party member (yes=1)""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. 
. 
. *Step Two: Graphing Regressions & Output
. 
. ***Table 3 with sequence: Two_tracks > Higher_edu Combined/Seperated > Gender(s), 2*2*3=12 
> columns in total.
. 
. 
. local folderpath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 
> 3 5 7 9 11"

. local filename "Rural tables"

. local datapath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/20240716 Rural 
> Chip2018 and Instrumental Statistics and Inflation.dta"

. 
. 
. local xlspath "`folderpath'/`filename'.xls"

. 
. eststo clear

. 
. **Below are columns 1-3
. 
. selmlog voc_log_monthlyearning male exp expsqr higheredu provincedum2-provincedum15 if inra
> nge(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsq
> r ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(
> 2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       631
-------------+----------------------------------   F(21, 609)      =      5.01
       Model |  38.1985663        21  1.81897935   Prob > F        =    0.0000
    Residual |  220.957092       609  .362819527   R-squared       =    0.1474
-------------+----------------------------------   Adj R-squared   =    0.1180
       Total |  259.155658       630  .411358188   Root MSE        =    .60235

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .3628414   .0513599     7.06   0.000     .2619775    .4637053
          exp |   .0726393   .0413108     1.76   0.079    -.0084895    .1537682
       expsqr |  -.0014577    .001111    -1.31   0.190    -.0036396    .0007242
    higheredu |   .0670376   .0753197     0.89   0.374    -.0808802    .2149555
 provincedum2 |  -.2237951   .2447217    -0.91   0.361    -.7043959    .2568057
 provincedum3 |   .0431186   .2775984     0.16   0.877    -.5020477    .5882848
 provincedum4 |   .2144639   .2925039     0.73   0.464    -.3599749    .7889027
 provincedum5 |   .2398002   .1781089     1.35   0.179     -.109982    .5895823
 provincedum6 |   .1813995   .2070903     0.88   0.381    -.2252983    .5880972
 provincedum7 |   .0949748   .2166545     0.44   0.661    -.3305058    .5204554
 provincedum8 |  -.0321971   .2173639    -0.15   0.882     -.459071    .3946767
 provincedum9 |   .2989548   .1952896     1.53   0.126    -.0845679    .6824776
provincedum10 |  -.0506683   .2022135    -0.25   0.802    -.4477888    .3464521
provincedum11 |   .0726703   .2067576     0.35   0.725    -.3333741    .4787147
provincedum12 |  -.1674202   .2047207    -0.82   0.414    -.5694644     .234624
provincedum13 |  -.2274341   .2022827    -1.12   0.261    -.6246905    .1698223
provincedum14 |  -.1029676   .2265084    -0.45   0.650    -.5477998    .3418647
provincedum15 |  -.0771844   .2317949    -0.33   0.739    -.5323986    .3780299
          _m1 |  -.2620557   .2107621    -1.24   0.214    -.6759643     .151853
          _m2 |  -.0698402   .4651753    -0.15   0.881    -.9833827    .8437023
          _m3 |   .1119155   .1510453     0.74   0.459    -.1847173    .4085483
        _cons |   7.553936   .5471783    13.81   0.000     6.479351    8.628522
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3939125          .        .       .            .           .
        rho1 |  -.4175358          .        .       .            .           .
        rho2 |   -.111277          .        .       .            .           .
        rho3 |    .178316          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu provincedum2-provincedum15 m1 
> m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), vce(robust)

. eststo 
(est1 stored)

. sum voc_log_monthlyearning male exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        631    8.144829    .6413721   5.298317   9.721166
        male |        631     .637084    .4812224          0          1
         exp |        631    14.59746    6.097066          2         32
      expsqr |        631    250.2013    208.3249          4       1024
   higheredu |        631    .1283677    .3347641          0          1
-------------+---------------------------------------------------------
          m1 |        631    1.315553    .3959873   .4635267   3.007092
          m2 |        631   -.3710519    .2108446  -.7259973  -.0044607
          m3 |        631   -.4801928    .2630819  -.7259987   3.366965

. outreg2 using "`xlspath'", replace ctitle(Sec Voc, All Gender, Non-specified Higheredu, Pro
> vince Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 if male==1 &
>  inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp 
> expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative)
>  dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -3002.8431
Iteration 1:  Log likelihood = -2371.8317
Iteration 2:  Log likelihood = -2320.6841
Iteration 3:  Log likelihood =  -2317.968
Iteration 4:  Log likelihood = -2317.9566

Multinomial logistic regression                   Number of obs   =       3615
                                                  LR chi2(10)     =    1369.77
                                                  Prob > chi2     =     0.0000
Log likelihood = -2317.9566                       Pseudo R2       =     0.2281

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |  -.5878254    .055156   -10.66   0.000    -.6959291   -.4797217
      expsqr |   .0093985   .0013487     6.97   0.000     .0067551    .0120418
ins1_secge~e |  -8.457102    .959365    -8.82   0.000    -10.33742   -6.576782
ins2_highe~e |   1.025341   .1854248     5.53   0.000     .6619148    1.388767
ins3_vs_en~e |    .947809   .8628653     1.10   0.272     -.743376    2.638994
       _cons |   7.157938    .742203     9.64   0.000     5.703247     8.61263
-------------+----------------------------------------------------------------
2            |
         exp |  -.9416195   .0499969   -18.83   0.000    -1.039612   -.8436274
      expsqr |   .0167307   .0011581    14.45   0.000     .0144608    .0190006
ins1_secge~e |  -10.97287   .9094096   -12.07   0.000    -12.75528   -9.190464
ins2_highe~e |   .2674166   .2203803     1.21   0.225    -.1645208     .699354
ins3_vs_en~e |  -1.425867   .8301334    -1.72   0.086    -3.052899    .2011646
       _cons |   13.05947   .7042846    18.54   0.000     11.67909    14.43984
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       402
-------------+----------------------------------   F(20, 381)      =      2.92
       Model |  19.7024618        20  .985123089   Prob > F        =    0.0000
    Residual |  128.649994       381  .337664026   R-squared       =    0.1328
-------------+----------------------------------   Adj R-squared   =    0.0873
       Total |  148.352456       401  .369956249   Root MSE        =    .58109

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   .0846293   .0469395     1.80   0.072    -.0076636    .1769222
       expsqr |  -.0020699   .0012813    -1.62   0.107    -.0045893    .0004495
    higheredu |   .1301688   .0979644     1.33   0.185    -.0624498    .3227874
 provincedum2 |  -.1527638   .2992326    -0.51   0.610     -.741118    .4355904
 provincedum3 |   -.033595   .3033281    -0.11   0.912    -.6300018    .5628118
 provincedum4 |   .5339666   .3416108     1.56   0.119    -.1377118    1.205645
 provincedum5 |   .4373666   .2133085     2.05   0.041     .0179574    .8567757
 provincedum6 |   .3429463   .2397618     1.43   0.153    -.1284758    .8143684
 provincedum7 |   .2948615   .2472327     1.19   0.234    -.1912497    .7809728
 provincedum8 |    .038509   .2536509     0.15   0.879    -.4602218    .5372399
 provincedum9 |   .3417396   .2303691     1.48   0.139    -.1112144    .7946936
provincedum10 |   .1975427   .2327289     0.85   0.397    -.2600511    .6551366
provincedum11 |   .3253948   .2378569     1.37   0.172    -.1422819    .7930714
provincedum12 |  -.0420018   .2387313    -0.18   0.860    -.5113977    .4273942
provincedum13 |  -.0961812   .2305197    -0.42   0.677    -.5494313    .3570689
provincedum14 |  -.0921738   .2725758    -0.34   0.735    -.6281151    .4437675
provincedum15 |   .0003633   .2660965     0.00   0.999    -.5228383    .5235648
          _m1 |  -.2662261   .2538101    -1.05   0.295      -.76527    .2328177
          _m2 |   .3521856   .5040334     0.70   0.485    -.6388498    1.343221
          _m3 |   .1423691   .1625567     0.88   0.382    -.1772516    .4619897
        _cons |   7.931307    .604434    13.12   0.000     6.742863    9.119751
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .387595          .        .       .            .           .
        rho1 |  -.4276236          .        .       .            .           .
        rho2 |   .5656952          .        .       .            .           .
        rho3 |   .2286792          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3
>  if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), vce(rob
> ust)

. eststo 
(est2 stored)

. sum voc_log_monthlyearning exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        402    8.274411    .6082403   5.521461   9.721166
         exp |        402    15.01244    6.137034          2         32
      expsqr |        402    262.9428    212.9925          4       1024
   higheredu |        402    .1094527    .3125954          0          1
          m1 |        402    1.326876    .3822241   .4716527   2.969703
-------------+---------------------------------------------------------
          m2 |        402   -.3543799    .2037099  -.7259973  -.0041069
          m3 |        402   -.5020887    .2697532  -.7260022   3.191875

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Male, Non-specified Higheredu, Province D
> um) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 if male==0 &
>  inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp 
> expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative)
>  dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -1800.0063
Iteration 1:  Log likelihood =  -1323.665
Iteration 2:  Log likelihood = -1277.2402
Iteration 3:  Log likelihood = -1274.1234
Iteration 4:  Log likelihood = -1274.1088
Iteration 5:  Log likelihood = -1274.1088

Multinomial logistic regression                   Number of obs   =       2185
                                                  LR chi2(10)     =    1051.80
                                                  Prob > chi2     =     0.0000
Log likelihood = -1274.1088                       Pseudo R2       =     0.2922

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |  -.7832928   .0770318   -10.17   0.000    -.9342724   -.6323133
      expsqr |   .0131372   .0019339     6.79   0.000     .0093469    .0169276
ins1_secge~e |  -9.805594   1.291489    -7.59   0.000    -12.33687   -7.274322
ins2_highe~e |   .9693154   .2415959     4.01   0.000     .4957962    1.442835
ins3_vs_en~e |   2.593672   1.159384     2.24   0.025     .3213208    4.866023
       _cons |   9.202749   .9935313     9.26   0.000     7.255463    11.15003
-------------+----------------------------------------------------------------
2            |
         exp |  -1.069852   .0701222   -15.26   0.000    -1.207289   -.9324154
      expsqr |   .0195743   .0016437    11.91   0.000     .0163527    .0227959
ins1_secge~e |  -10.56616   1.196463    -8.83   0.000    -12.91118   -8.221131
ins2_highe~e |   .4433424   .2731867     1.62   0.105    -.0920936    .9787784
ins3_vs_en~e |  -.5525823   1.094473    -0.50   0.614    -2.697711    1.592546
       _cons |   13.78027     .93856    14.68   0.000     11.94072    15.61981
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       229
-------------+----------------------------------   F(20, 208)      =      1.68
       Model |  12.8214384        20  .641071919   Prob > F        =    0.0386
    Residual |  79.3819319       208  .381643903   R-squared       =    0.1391
-------------+----------------------------------   Adj R-squared   =    0.0563
       Total |  92.2033703       228  .404400747   Root MSE        =    .61777

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   .0994552    .084185     1.18   0.239      -.06651    .2654204
       expsqr |  -.0013432   .0022297    -0.60   0.548    -.0057389    .0030525
    higheredu |   .0033949   .1195491     0.03   0.977    -.2322883    .2390781
 provincedum2 |  -.5964287   .4871809    -1.22   0.222    -1.556874    .3640166
 provincedum3 |   .7975219   .8018388     0.99   0.321    -.7832509    2.378295
 provincedum4 |  -.6868435   .5839056    -1.18   0.241    -1.837975    .4642883
 provincedum5 |  -.2725467   .3631974    -0.75   0.454    -.9885666    .4434731
 provincedum6 |  -.3772718   .4369482    -0.86   0.389    -1.238687     .484143
 provincedum7 |  -.6106078   .4961981    -1.23   0.220     -1.58883    .3676143
 provincedum8 |  -.4485097   .4587144    -0.98   0.329    -1.352835    .4558158
 provincedum9 |  -.0852731   .4009793    -0.21   0.832    -.8757776    .7052314
provincedum10 |  -.7622473   .4229051    -1.80   0.073    -1.595977    .0714824
provincedum11 |   -.649181   .4555933    -1.42   0.156    -1.547353    .2489914
provincedum12 |  -.5824815   .4110561    -1.42   0.158    -1.392852    .2278888
provincedum13 |  -.6517136   .4277766    -1.52   0.129    -1.495047      .19162
provincedum14 |  -.5073769   .4548732    -1.12   0.266     -1.40413    .3893759
provincedum15 |  -.4137833   .4999227    -0.83   0.409    -1.399348    .5717817
          _m1 |   .0049277   .3797946     0.01   0.990    -.7438125    .7536678
          _m2 |  -1.586045   1.373858    -1.15   0.250    -4.294516    1.122426
          _m3 |  -.1422677    .780838    -0.18   0.856    -1.681639    1.397103
        _cons |   6.568913   1.239745     5.30   0.000     4.124838    9.012989
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .7842097          .        .       .            .           .
        rho1 |   .0055645          .        .       .            .           .
        rho2 |  -1.791016          .        .       .            .           .
        rho3 |  -.1606535          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3
>  if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), vce(rob
> ust)

. eststo 
(est3 stored)

. sum voc_log_monthlyearning male exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        229    7.917353    .6359251   5.298317   9.721166
        male |        229           0           0          0          0
         exp |        229      13.869     5.96998          5         30
      expsqr |        229    227.8341    198.3486         25        900
   higheredu |        229    .1615721     .368864          0          1
-------------+---------------------------------------------------------
          m1 |        229    1.290658    .4210073   .4989751   2.669395
          m2 |        229   -.3998967     .220687  -.7259948  -.0354907
          m3 |        229   -.4399084    .2389392   -.725968  -.0148825

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Female, Non-specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. **Below are columns 4-6
. 
. selmlog voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu provincedum2-
> provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(
> educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_e
> ntrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       631
-------------+----------------------------------   F(23, 607)      =      4.57
       Model |  38.2513486        23  1.66310211   Prob > F        =    0.0000
    Residual |   220.90431       607  .363928023   R-squared       =    0.1476
-------------+----------------------------------   Adj R-squared   =    0.1153
       Total |  259.155658       630  .411358188   Root MSE        =    .60326

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .3632233   .0516119     7.04   0.000     .2618638    .4645829
          exp |   .0736836   .0414666     1.78   0.076    -.0077519     .155119
       expsqr |  -.0014851    .001115    -1.33   0.183    -.0036749    .0007047
   highvocedu |   .0478102   .0937161     0.51   0.610     -.136237    .2318573
   highgenedu |   .1227262   .1995783     0.61   0.539    -.2692216     .514674
     adultedu |   .0853493   .1373706     0.62   0.535    -.1844301    .3551287
 provincedum2 |  -.2231185   .2451758    -0.91   0.363    -.7046142    .2583772
 provincedum3 |   .0403846   .2783769     0.15   0.885    -.5063141    .5870833
 provincedum4 |   .2121472   .2934798     0.72   0.470    -.3642118    .7885063
 provincedum5 |    .244522   .1788426     1.37   0.172    -.1067034    .5957473
 provincedum6 |   .1840006   .2075394     0.89   0.376    -.2235818    .5915831
 provincedum7 |   .0985247   .2171863     0.45   0.650    -.3280031    .5250525
 provincedum8 |  -.0352021   .2178952    -0.16   0.872    -.4631221     .392718
 provincedum9 |   .2987445   .1955889     1.53   0.127    -.0853687    .6828577
provincedum10 |   -.049708    .202556    -0.25   0.806    -.4475036    .3480877
provincedum11 |   .0732113   .2071321     0.35   0.724    -.3335712    .4799938
provincedum12 |  -.1656377   .2050952    -0.81   0.420      -.56842    .2371446
provincedum13 |  -.2258077    .202645    -1.11   0.266    -.6237782    .1721628
provincedum14 |  -.1071813   .2272709    -0.47   0.637    -.5535141    .3391515
provincedum15 |  -.0742969   .2322747    -0.32   0.749    -.5304566    .3818628
          _m1 |  -.2608936   .2114283    -1.23   0.218    -.6761134    .1543261
          _m2 |  -.0781647   .4664937    -0.17   0.867    -.9943023     .837973
          _m3 |   .1113393   .1512928     0.74   0.462    -.1857815    .4084601
        _cons |   7.539713   .5495336    13.72   0.000     6.460495    8.618931
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3936766          .        .       .            .           .
        rho1 |  -.4158088          .        .       .            .           .
        rho2 |  -.1245778          .        .       .            .           .
        rho3 |   .1774511          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu provinced
> um2-provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200,
>  16667), vce(robust)

. eststo
(est4 stored)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sam
> ple)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        631    8.144829    .6413721   5.298317   9.721166
        male |        631     .637084    .4812224          0          1
         exp |        631    14.59746    6.097066          2         32
      expsqr |        631    250.2013    208.3249          4       1024
  highvocedu |        631    .0792393    .2703262          0          1
-------------+---------------------------------------------------------
  highgenedu |        631    .0158479    .1249858          0          1
    adultedu |        631    .0332805    .1795104          0          1
          m1 |        631    1.315553    .3959873   .4635267   3.007092
          m2 |        631   -.3710519    .2108446  -.7259973  -.0044607
          m3 |        631   -.4801928    .2630819  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Sec Voc, All Gender, Specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-provi
> ncedum15 if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667),
>  sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3
> _vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -3002.8431
Iteration 1:  Log likelihood = -2371.8317
Iteration 2:  Log likelihood = -2320.6841
Iteration 3:  Log likelihood =  -2317.968
Iteration 4:  Log likelihood = -2317.9566

Multinomial logistic regression                   Number of obs   =       3615
                                                  LR chi2(10)     =    1369.77
                                                  Prob > chi2     =     0.0000
Log likelihood = -2317.9566                       Pseudo R2       =     0.2281

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |  -.5878254    .055156   -10.66   0.000    -.6959291   -.4797217
      expsqr |   .0093985   .0013487     6.97   0.000     .0067551    .0120418
ins1_secge~e |  -8.457102    .959365    -8.82   0.000    -10.33742   -6.576782
ins2_highe~e |   1.025341   .1854248     5.53   0.000     .6619148    1.388767
ins3_vs_en~e |    .947809   .8628653     1.10   0.272     -.743376    2.638994
       _cons |   7.157938    .742203     9.64   0.000     5.703247     8.61263
-------------+----------------------------------------------------------------
2            |
         exp |  -.9416195   .0499969   -18.83   0.000    -1.039612   -.8436274
      expsqr |   .0167307   .0011581    14.45   0.000     .0144608    .0190006
ins1_secge~e |  -10.97287   .9094096   -12.07   0.000    -12.75528   -9.190464
ins2_highe~e |   .2674166   .2203803     1.21   0.225    -.1645208     .699354
ins3_vs_en~e |  -1.425867   .8301334    -1.72   0.086    -3.052899    .2011646
       _cons |   13.05947   .7042846    18.54   0.000     11.67909    14.43984
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       402
-------------+----------------------------------   F(22, 379)      =      2.68
       Model |  19.9593393        22  .907242695   Prob > F        =    0.0001
    Residual |  128.393116       379  .338768117   R-squared       =    0.1345
-------------+----------------------------------   Adj R-squared   =    0.0843
       Total |  148.352456       401  .369956249   Root MSE        =    .58204

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   .0870942    .047477     1.83   0.067    -.0062572    .1804456
       expsqr |  -.0021543   .0012964    -1.66   0.097    -.0047033    .0003948
   highvocedu |   .0785391   .1172097     0.67   0.503    -.1519236    .3090018
   highgenedu |    .176285   .2485967     0.71   0.479    -.3125165    .6650865
     adultedu |   .2778376   .2121276     1.31   0.191    -.1392568     .694932
 provincedum2 |  -.1683464   .3004409    -0.56   0.576    -.7590863    .4223934
 provincedum3 |  -.0335473   .3047749    -0.11   0.912    -.6328089    .5657143
 provincedum4 |   .5329425   .3421847     1.56   0.120    -.1398758    1.205761
 provincedum5 |   .4391119    .213736     2.05   0.041     .0188551    .8593687
 provincedum6 |   .3470602    .240208     1.44   0.149    -.1252471    .8193675
 provincedum7 |   .2976798   .2476787     1.20   0.230    -.1893166    .7846763
 provincedum8 |    .036625   .2546223     0.14   0.886    -.4640244    .5372743
 provincedum9 |   .3402518    .230934     1.47   0.141    -.1138207    .7943242
provincedum10 |   .1934421   .2331584     0.83   0.407    -.2650039    .6518881
provincedum11 |   .3227867   .2382698     1.35   0.176    -.1457095    .7912829
provincedum12 |  -.0369954   .2391919    -0.15   0.877    -.5073048     .433314
provincedum13 |  -.0988172    .230918    -0.43   0.669    -.5528581    .3552236
provincedum14 |  -.0948688   .2736109    -0.35   0.729    -.6328543    .4431168
provincedum15 |   .0023272   .2665505     0.01   0.993    -.5217758    .5264303
          _m1 |  -.2531365   .2546726    -0.99   0.321    -.7538848    .2476117
          _m2 |   .3338209   .5063371     0.66   0.510    -.6617609    1.329403
          _m3 |   .1443523   .1628396     0.89   0.376    -.1758299    .4645346
        _cons |   7.894627   .6097882    12.95   0.000     6.695635    9.093618
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3802647          .        .       .            .           .
        rho1 |  -.4104987          .        .       .            .           .
        rho2 |   .5413404          .        .       .            .           .
        rho3 |   .2340889          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-p
> rovincedum15 m1 m2 m3 if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning,
>  200, 16667), vce(robust)

. eststo
(est5 stored)

. sum voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        402    8.274411    .6082403   5.521461   9.721166
         exp |        402    15.01244    6.137034          2         32
      expsqr |        402    262.9428    212.9925          4       1024
  highvocedu |        402    .0746269    .2631158          0          1
  highgenedu |        402    .0149254    .1214054          0          1
-------------+---------------------------------------------------------
    adultedu |        402    .0199005    .1398324          0          1
          m1 |        402    1.326876    .3822241   .4716527   2.969703
          m2 |        402   -.3543799    .2037099  -.7259973  -.0041069
          m3 |        402   -.5020887    .2697532  -.7260022   3.191875

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Male, Specified Higheredu, Province Dum) 
> pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-provi
> ncedum15 if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667),
>  sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3
> _vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -1800.0063
Iteration 1:  Log likelihood =  -1323.665
Iteration 2:  Log likelihood = -1277.2402
Iteration 3:  Log likelihood = -1274.1234
Iteration 4:  Log likelihood = -1274.1088
Iteration 5:  Log likelihood = -1274.1088

Multinomial logistic regression                   Number of obs   =       2185
                                                  LR chi2(10)     =    1051.80
                                                  Prob > chi2     =     0.0000
Log likelihood = -1274.1088                       Pseudo R2       =     0.2922

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |  -.7832928   .0770318   -10.17   0.000    -.9342724   -.6323133
      expsqr |   .0131372   .0019339     6.79   0.000     .0093469    .0169276
ins1_secge~e |  -9.805594   1.291489    -7.59   0.000    -12.33687   -7.274322
ins2_highe~e |   .9693154   .2415959     4.01   0.000     .4957962    1.442835
ins3_vs_en~e |   2.593672   1.159384     2.24   0.025     .3213208    4.866023
       _cons |   9.202749   .9935313     9.26   0.000     7.255463    11.15003
-------------+----------------------------------------------------------------
2            |
         exp |  -1.069852   .0701222   -15.26   0.000    -1.207289   -.9324154
      expsqr |   .0195743   .0016437    11.91   0.000     .0163527    .0227959
ins1_secge~e |  -10.56616   1.196463    -8.83   0.000    -12.91118   -8.221131
ins2_highe~e |   .4433424   .2731867     1.62   0.105    -.0920936    .9787784
ins3_vs_en~e |  -.5525823   1.094473    -0.50   0.614    -2.697711    1.592546
       _cons |   13.78027     .93856    14.68   0.000     11.94072    15.61981
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       229
-------------+----------------------------------   F(22, 206)      =      1.53
       Model |  12.9370878        22  .588049445   Prob > F        =    0.0674
    Residual |  79.2662825       206  .384787779   R-squared       =    0.1403
-------------+----------------------------------   Adj R-squared   =    0.0485
       Total |  92.2033703       228  .404400747   Root MSE        =    .62031

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   .1014082   .0847305     1.20   0.233     -.065642    .2684584
       expsqr |  -.0014029   .0022473    -0.62   0.533    -.0058336    .0030277
   highvocedu |    .036261   .1568795     0.23   0.817    -.2730343    .3455564
   highgenedu |   .0909223   .3295391     0.28   0.783    -.5587794     .740624
     adultedu |  -.0728796   .1893135    -0.38   0.701      -.44612    .3003608
 provincedum2 |  -.6044595   .4894464    -1.23   0.218    -1.569426    .3605069
 provincedum3 |   .7940767   .8051612     0.99   0.325    -.7933363     2.38149
 provincedum4 |  -.6560021   .5893449    -1.11   0.267    -1.817923     .505919
 provincedum5 |  -.2897702   .3670948    -0.79   0.431    -1.013515    .4339743
 provincedum6 |  -.3891564   .4395581    -0.89   0.377    -1.255766    .4774529
 provincedum7 |  -.6242196   .4992812    -1.25   0.213    -1.608576    .3601365
 provincedum8 |   -.458799   .4612366    -0.99   0.321    -1.368148    .4505505
 provincedum9 |  -.0901022   .4027489    -0.22   0.823    -.8841404     .703936
provincedum10 |  -.7704405   .4250913    -1.81   0.071    -1.608528    .0676467
provincedum11 |  -.6503848   .4575125    -1.42   0.157    -1.552392    .2516223
provincedum12 |  -.5912175   .4130838    -1.43   0.154    -1.405632    .2231965
provincedum13 |  -.6630561   .4303185    -1.54   0.125    -1.511449    .1853368
provincedum14 |  -.5232591   .4580983    -1.14   0.255    -1.426421    .3799031
provincedum15 |  -.4245037   .5026436    -0.84   0.399    -1.415489    .5664817
          _m1 |   .0030382   .3815555     0.01   0.994    -.7492161    .7552926
          _m2 |  -1.566788   1.380221    -1.14   0.258    -4.287957    1.154382
          _m3 |  -.1233555   .7857526    -0.16   0.875    -1.672503    1.425792
        _cons |   6.582325   1.245108     5.29   0.000     4.127536    9.037114
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .7732859          .        .       .            .           .
        rho1 |    .003455          .        .       .            .           .
        rho2 |  -1.781723          .        .       .            .           .
        rho3 |  -.1402776          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-p
> rovincedum15 m1 m2 m3 if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning,
>  200, 16667), vce(robust)

. eststo
(est6 stored)

. sum voc_log_monthlyearning exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        229    7.917353    .6359251   5.298317   9.721166
         exp |        229      13.869     5.96998          5         30
      expsqr |        229    227.8341    198.3486         25        900
  highvocedu |        229    .0873362    .2829456          0          1
  highgenedu |        229    .0174672    .1312913          0          1
-------------+---------------------------------------------------------
    adultedu |        229    .0567686    .2319067          0          1
          m1 |        229    1.290658    .4210073   .4989751   2.669395
          m2 |        229   -.3998967     .220687  -.7259948  -.0354907
          m3 |        229   -.4399084    .2389392   -.725968  -.0148825

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Female, Specified Higheredu, Province Dum
> ) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. **Below are columns 7-9
. 
. selmlog gen_log_monthlyearning male exp expsqr higheredu provincedum2-provincedum15 if inra
> nge(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsq
> r ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(
> 2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,206
-------------+----------------------------------   F(21, 1184)     =      6.28
       Model |  48.7818097        21  2.32294332   Prob > F        =    0.0000
    Residual |  437.734066     1,184  .369707826   R-squared       =    0.1003
-------------+----------------------------------   Adj R-squared   =    0.0843
       Total |  486.515876     1,205  .403747615   Root MSE        =    .60804

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .2834092   .0365912     7.75   0.000     .2116184    .3551999
          exp |   .0062405   .0259028     0.24   0.810    -.0445799    .0570609
       expsqr |  -.0002375   .0006919    -0.34   0.732     -.001595    .0011201
    higheredu |   .1779041   .0450276     3.95   0.000     .0895614    .2662469
 provincedum2 |  -.3376694   .1492441    -2.26   0.024    -.6304818    -.044857
 provincedum3 |  -.4183816   .1666769    -2.51   0.012    -.7453966   -.0913666
 provincedum4 |  -.4899363   .1989834    -2.46   0.014    -.8803356    -.099537
 provincedum5 |  -.1295153    .120596    -1.07   0.283    -.3661211    .1070905
 provincedum6 |  -.1203543   .1325742    -0.91   0.364    -.3804609    .1397523
 provincedum7 |  -.2155319   .1400289    -1.54   0.124    -.4902644    .0592006
 provincedum8 |  -.3540944   .1353884    -2.62   0.009    -.6197223   -.0884665
 provincedum9 |  -.0100519   .1241791    -0.08   0.935    -.2536876    .2335838
provincedum10 |  -.1245392   .1251904    -0.99   0.320     -.370159    .1210805
provincedum11 |  -.1749404   .1340686    -1.30   0.192    -.4379789    .0880981
provincedum12 |  -.2789416   .1572681    -1.77   0.076    -.5874968    .0296136
provincedum13 |  -.2939573   .1345797    -2.18   0.029    -.5579985   -.0299161
provincedum14 |  -.3110927   .1472994    -2.11   0.035    -.6000896   -.0220958
provincedum15 |  -.3890675   .1367159    -2.85   0.005    -.6572999   -.1208351
          _m1 |   .2770697   .3695039     0.75   0.453    -.4478857    1.002025
          _m2 |   -.117457   .1133399    -1.04   0.300    -.3398264    .1049125
          _m3 |  -.1718191   .2172078    -0.79   0.429    -.5979741     .254336
        _cons |   8.206815   .1939272    42.32   0.000     7.826336    8.587294
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3862332          .        .       .            .           .
        rho1 |   .4458248          .        .       .            .           .
        rho2 |  -.1889966          .        .       .            .           .
        rho3 |  -.2764691          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu provincedum2-provincedum15 m1 
> m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), vce(robust)

. eststo
(est7 stored)

. sum gen_log_monthlyearning male exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      1,206    8.212894    .6354114    5.37836   9.645658
        male |      1,206    .6185738    .4859383          0          1
         exp |      1,206    12.73217    6.855503          1         32
      expsqr |      1,206    209.0672    221.2673          1       1024
   higheredu |      1,206    .5630182    .4962186          0          1
-------------+---------------------------------------------------------
          m1 |      1,206   -.2382665     .100632  -.6403428  -.0164993
          m2 |      1,206    .7942336     .608194   .0167035   2.932487
          m3 |      1,206   -.3796555     .255128  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Sec Gen, All Gender, Non-specified Higheredu, Prov
> ince Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 if male==1 &
>  inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp 
> expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative)
>  dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -3002.8431
Iteration 1:  Log likelihood = -2371.8317
Iteration 2:  Log likelihood = -2320.6841
Iteration 3:  Log likelihood =  -2317.968
Iteration 4:  Log likelihood = -2317.9566

Multinomial logistic regression                   Number of obs   =       3615
                                                  LR chi2(10)     =    1369.77
                                                  Prob > chi2     =     0.0000
Log likelihood = -2317.9566                       Pseudo R2       =     0.2281

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |  -.5878254    .055156   -10.66   0.000    -.6959291   -.4797217
      expsqr |   .0093985   .0013487     6.97   0.000     .0067551    .0120418
ins1_secge~e |  -8.457102    .959365    -8.82   0.000    -10.33742   -6.576782
ins2_highe~e |   1.025341   .1854248     5.53   0.000     .6619148    1.388767
ins3_vs_en~e |    .947809   .8628653     1.10   0.272     -.743376    2.638994
       _cons |   7.157938    .742203     9.64   0.000     5.703247     8.61263
-------------+----------------------------------------------------------------
2            |
         exp |  -.9416195   .0499969   -18.83   0.000    -1.039612   -.8436274
      expsqr |   .0167307   .0011581    14.45   0.000     .0144608    .0190006
ins1_secge~e |  -10.97287   .9094096   -12.07   0.000    -12.75528   -9.190464
ins2_highe~e |   .2674166   .2203803     1.21   0.225    -.1645208     .699354
ins3_vs_en~e |  -1.425867   .8301334    -1.72   0.086    -3.052899    .2011646
       _cons |   13.05947   .7042846    18.54   0.000     11.67909    14.43984
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       746
-------------+----------------------------------   F(20, 725)      =      2.05
       Model |  15.4521741        20  .772608703   Prob > F        =    0.0044
    Residual |  272.669446       725  .376095787   R-squared       =    0.0536
-------------+----------------------------------   Adj R-squared   =    0.0275
       Total |   288.12162       745  .386740429   Root MSE        =    .61327

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |    .032973   .0334334     0.99   0.324    -.0326647    .0986108
       expsqr |  -.0008418     .00088    -0.96   0.339    -.0025696    .0008859
    higheredu |   .1217257   .0569264     2.14   0.033     .0099654     .233486
 provincedum2 |  -.4073031   .2149962    -1.89   0.059    -.8293925    .0147863
 provincedum3 |  -.2277843   .2278758    -1.00   0.318    -.6751595     .219591
 provincedum4 |  -.3818243   .2812948    -1.36   0.175    -.9340739    .1704253
 provincedum5 |  -.0219771   .1804142    -0.12   0.903    -.3761738    .3322196
 provincedum6 |  -.1786353   .1971936    -0.91   0.365     -.565774    .2085033
 provincedum7 |  -.2467437   .2077317    -1.19   0.235    -.6545711    .1610837
 provincedum8 |  -.4001589   .2028303    -1.97   0.049    -.7983638   -.0019539
 provincedum9 |  -.0228486   .1842397    -0.12   0.901    -.3845557    .3388585
provincedum10 |  -.1004088   .1883523    -0.53   0.594    -.4701898    .2693722
provincedum11 |  -.2491646   .1988735    -1.25   0.211    -.6396013    .1412721
provincedum12 |  -.3893037   .2164872    -1.80   0.073    -.8143203    .0357129
provincedum13 |  -.2715665   .2021162    -1.34   0.179    -.6683694    .1252364
provincedum14 |  -.3762052    .220071    -1.71   0.088    -.8082577    .0558474
provincedum15 |  -.3562947   .2003179    -1.78   0.076    -.7495671    .0369778
          _m1 |   .3534696   .4978659     0.71   0.478    -.6239613    1.330901
          _m2 |   -.111324   .1487152    -0.75   0.454    -.4032878    .1806399
          _m3 |   .0342251   .2840483     0.12   0.904    -.5234303    .5918804
        _cons |   8.403608   .2825923    29.74   0.000     7.848811    8.958405
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3994379          .        .       .            .           .
        rho1 |   .5592776          .        .       .            .           .
        rho2 |  -.1761424          .        .       .            .           .
        rho3 |   .0541527          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3
>  if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), vce(rob
> ust)

. eststo
(est8 stored)

. sum gen_log_monthlyearning male exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        746    8.315963    .6218846    5.37836   9.645658
        male |        746           1           0          1          1
         exp |        746    13.14209    6.967127          2         32
      expsqr |        746    221.1903    228.5327          4       1024
   higheredu |        746    .5495979    .4978678          0          1
-------------+---------------------------------------------------------
          m1 |        746   -.2319765    .0975867  -.6294667  -.0194484
          m2 |        746    .8173386    .5989208   .0332688   2.969432
          m3 |        746   -.4032964    .2514602  -.7260004   .2775654

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Male, Non-specified Higheredu, Province D
> um) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 if male==0 &
>  inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp 
> expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative)
>  dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -1800.0063
Iteration 1:  Log likelihood =  -1323.665
Iteration 2:  Log likelihood = -1277.2402
Iteration 3:  Log likelihood = -1274.1234
Iteration 4:  Log likelihood = -1274.1088
Iteration 5:  Log likelihood = -1274.1088

Multinomial logistic regression                   Number of obs   =       2185
                                                  LR chi2(10)     =    1051.80
                                                  Prob > chi2     =     0.0000
Log likelihood = -1274.1088                       Pseudo R2       =     0.2922

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |  -.7832928   .0770318   -10.17   0.000    -.9342724   -.6323133
      expsqr |   .0131372   .0019339     6.79   0.000     .0093469    .0169276
ins1_secge~e |  -9.805594   1.291489    -7.59   0.000    -12.33687   -7.274322
ins2_highe~e |   .9693154   .2415959     4.01   0.000     .4957962    1.442835
ins3_vs_en~e |   2.593672   1.159384     2.24   0.025     .3213208    4.866023
       _cons |   9.202749   .9935313     9.26   0.000     7.255463    11.15003
-------------+----------------------------------------------------------------
2            |
         exp |  -1.069852   .0701222   -15.26   0.000    -1.207289   -.9324154
      expsqr |   .0195743   .0016437    11.91   0.000     .0163527    .0227959
ins1_secge~e |  -10.56616   1.196463    -8.83   0.000    -12.91118   -8.221131
ins2_highe~e |   .4433424   .2731867     1.62   0.105    -.0920936    .9787784
ins3_vs_en~e |  -.5525823   1.094473    -0.50   0.614    -2.697711    1.592546
       _cons |   13.78027     .93856    14.68   0.000     11.94072    15.61981
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       460
-------------+----------------------------------   F(20, 439)      =      3.16
       Model |  22.3566253        20  1.11783126   Prob > F        =    0.0000
    Residual |   155.26045       439  .353668451   R-squared       =    0.1259
-------------+----------------------------------   Adj R-squared   =    0.0860
       Total |  177.617075       459  .386965306   Root MSE        =     .5947

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.0157983   .0413278    -0.38   0.702    -.0970232    .0654265
       expsqr |   .0001385   .0011401     0.12   0.903    -.0021022    .0023792
    higheredu |   .2964293    .075549     3.92   0.000     .1479467    .4449119
 provincedum2 |   -.232837   .2129201    -1.09   0.275    -.6513065    .1856324
 provincedum3 |   -.860839   .2659808    -3.24   0.001    -1.383593    -.338085
 provincedum4 |  -.5808003   .2820992    -2.06   0.040    -1.135233   -.0263674
 provincedum5 |  -.3187996    .162518    -1.96   0.050    -.6382096    .0006104
 provincedum6 |  -.0327559   .1813919    -0.18   0.857    -.3892603    .3237486
 provincedum7 |  -.1946722   .1911984    -1.02   0.309    -.5704502    .1811058
 provincedum8 |   -.295615   .1810104    -1.63   0.103    -.6513697    .0601397
 provincedum9 |   .0169225   .1707367     0.10   0.921    -.3186404    .3524853
provincedum10 |  -.1560818   .1688226    -0.92   0.356    -.4878827    .1757191
provincedum11 |  -.0676443   .1821233    -0.37   0.711    -.4255862    .2902977
provincedum12 |  -.0852418    .246784    -0.35   0.730    -.5702667    .3997831
provincedum13 |  -.3219212   .1806995    -1.78   0.076    -.6770648    .0332224
provincedum14 |  -.2401128   .1957911    -1.23   0.221    -.6249172    .1446915
provincedum15 |   -.450565   .1907647    -2.36   0.019    -.8254905   -.0756394
          _m1 |   .2287996   .5696504     0.40   0.688    -.8907813     1.34838
          _m2 |  -.1152938   .1803254    -0.64   0.523    -.4697022    .2391147
          _m3 |  -.4497886   .3465912    -1.30   0.195    -1.130973    .2313957
        _cons |    8.22852   .2710441    30.36   0.000     7.695815    8.761226
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3453082          .        .       .            .           .
        rho1 |   .3893604          .        .       .            .           .
        rho2 |  -.1962016          .        .       .            .           .
        rho3 |  -.7654291          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3
>  if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), vce(rob
> ust)

. eststo
(est9 stored)

. sum gen_log_monthlyearning exp expsqr higheredu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        460    8.045742    .6220654   5.521461   9.615806
         exp |        460    12.06739    6.624197          1         31
      expsqr |        460    189.4065    207.6907          1        961
   higheredu |        460    .5847826     .493296          0          1
          m1 |        460   -.2485743     .105675  -.5962154  -.0163755
-------------+---------------------------------------------------------
          m2 |        460    .7526901    .6229017   .0322888   2.368686
          m3 |        460   -.3376128     .255796  -.7259963  -.0002685

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Female, Non-specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. **Below are columns 10-12
. 
. selmlog gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu provincedum2-
> provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(
> educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_e
> ntrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,206
-------------+----------------------------------   F(23, 1182)     =      6.11
       Model |  51.6875208        23  2.24728351   Prob > F        =    0.0000
    Residual |  434.828355     1,182  .367875089   R-squared       =    0.1062
-------------+----------------------------------   Adj R-squared   =    0.0888
       Total |  486.515876     1,205  .403747615   Root MSE        =    .60653

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .2810352    .036523     7.69   0.000      .209378    .3526924
          exp |   .0110963   .0258967     0.43   0.668    -.0397122    .0619049
       expsqr |   -.000313   .0006908    -0.45   0.650    -.0016683    .0010422
   highvocedu |   .1755901    .050212     3.50   0.000     .0770755    .2741046
   highgenedu |    .273143    .058487     4.67   0.000     .1583932    .3878928
     adultedu |   .0326413   .0840855     0.39   0.698    -.1323321    .1976147
 provincedum2 |  -.2985988   .1495893    -2.00   0.046     -.592089   -.0051085
 provincedum3 |  -.4004357   .1665434    -2.40   0.016    -.7271893   -.0736821
 provincedum4 |  -.4646577    .198761    -2.34   0.020    -.8546213    -.074694
 provincedum5 |  -.1110919   .1204781    -0.92   0.357    -.3474668     .125283
 provincedum6 |   -.100982   .1324811    -0.76   0.446    -.3609063    .1589422
 provincedum7 |  -.1872798   .1401238    -1.34   0.182    -.4621989    .0876393
 provincedum8 |   -.324436   .1355335    -2.39   0.017    -.5903491   -.0585228
 provincedum9 |    .014082   .1242402     0.11   0.910    -.2296739    .2578379
provincedum10 |   -.091388   .1255671    -0.73   0.467    -.3377473    .1549713
provincedum11 |  -.1420332   .1342528    -1.06   0.290    -.4054336    .1213672
provincedum12 |  -.2284947    .158077    -1.45   0.149    -.5386375    .0816481
provincedum13 |  -.2547755   .1349692    -1.89   0.059    -.5195813    .0100304
provincedum14 |  -.2700248   .1477135    -1.83   0.068    -.5598348    .0197851
provincedum15 |  -.3516575   .1372447    -2.56   0.011     -.620928    -.082387
          _m1 |   .1339941   .3737185     0.36   0.720    -.5992316    .8672197
          _m2 |  -.1048714   .1132175    -0.93   0.354    -.3270012    .1172584
          _m3 |  -.1949228   .2168274    -0.90   0.369    -.6203323    .2304867
        _cons |   8.065497   .2004254    40.24   0.000     7.672268    8.458726
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3690589          .        .       .            .           .
        rho1 |   .2205656          .        .       .            .           .
        rho2 |  -.1726272          .        .       .            .           .
        rho3 |  -.3208594          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu provinced
> um2-provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200,
>  16667), vce(robust)

. eststo
(est10 stored)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sam
> ple)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      1,206    8.212894    .6354114    5.37836   9.645658
        male |      1,206    .6185738    .4859383          0          1
         exp |      1,206    12.73217    6.855503          1         32
      expsqr |      1,206    209.0672    221.2673          1       1024
  highvocedu |      1,206    .2669983     .442575          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,206    .2454395     .430526          0          1
    adultedu |      1,206    .0505804    .2192303          0          1
          m1 |      1,206   -.2382665     .100632  -.6403428  -.0164993
          m2 |      1,206    .7942336     .608194   .0167035   2.932487
          m3 |      1,206   -.3796555     .255128  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Sec Gen, All Gender, Specified Higheredu, Province
>  Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-provi
> ncedum15 if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667),
>  sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3
> _vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -3002.8431
Iteration 1:  Log likelihood = -2371.8317
Iteration 2:  Log likelihood = -2320.6841
Iteration 3:  Log likelihood =  -2317.968
Iteration 4:  Log likelihood = -2317.9566

Multinomial logistic regression                   Number of obs   =       3615
                                                  LR chi2(10)     =    1369.77
                                                  Prob > chi2     =     0.0000
Log likelihood = -2317.9566                       Pseudo R2       =     0.2281

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |  -.5878254    .055156   -10.66   0.000    -.6959291   -.4797217
      expsqr |   .0093985   .0013487     6.97   0.000     .0067551    .0120418
ins1_secge~e |  -8.457102    .959365    -8.82   0.000    -10.33742   -6.576782
ins2_highe~e |   1.025341   .1854248     5.53   0.000     .6619148    1.388767
ins3_vs_en~e |    .947809   .8628653     1.10   0.272     -.743376    2.638994
       _cons |   7.157938    .742203     9.64   0.000     5.703247     8.61263
-------------+----------------------------------------------------------------
2            |
         exp |  -.9416195   .0499969   -18.83   0.000    -1.039612   -.8436274
      expsqr |   .0167307   .0011581    14.45   0.000     .0144608    .0190006
ins1_secge~e |  -10.97287   .9094096   -12.07   0.000    -12.75528   -9.190464
ins2_highe~e |   .2674166   .2203803     1.21   0.225    -.1645208     .699354
ins3_vs_en~e |  -1.425867   .8301334    -1.72   0.086    -3.052899    .2011646
       _cons |   13.05947   .7042846    18.54   0.000     11.67909    14.43984
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       746
-------------+----------------------------------   F(22, 723)      =      2.02
       Model |  16.7226964        22  .760122563   Prob > F        =    0.0037
    Residual |  271.398923       723  .375378871   R-squared       =    0.0580
-------------+----------------------------------   Adj R-squared   =    0.0294
       Total |   288.12162       745  .386740429   Root MSE        =    .61268

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |   .0343168   .0334095     1.03   0.305    -.0312745    .0999081
       expsqr |  -.0008397   .0008792    -0.96   0.340    -.0025659    .0008865
   highvocedu |   .1250201   .0638444     1.96   0.051    -.0003225    .2503627
   highgenedu |   .1960226   .0742221     2.64   0.008      .050306    .3417393
     adultedu |  -.0208638   .1118757    -0.19   0.852    -.2405039    .1987762
 provincedum2 |  -.3665945   .2161554    -1.70   0.090    -.7909616    .0577727
 provincedum3 |  -.1998526   .2290022    -0.87   0.383    -.6494413     .249736
 provincedum4 |  -.3600797   .2813863    -1.28   0.201    -.9125114     .192352
 provincedum5 |   .0003906   .1807441     0.00   0.998    -.3544553    .3552365
 provincedum6 |  -.1516463   .1976966    -0.77   0.443    -.5397742    .2364817
 provincedum7 |  -.2120683   .2085541    -1.02   0.310    -.6215122    .1973756
 provincedum8 |   -.368303   .2035995    -1.81   0.071    -.7680199    .0314139
 provincedum9 |   .0036527    .184894     0.02   0.984    -.3593405     .366646
provincedum10 |  -.0654041   .1894807    -0.35   0.730    -.4374021    .3065939
provincedum11 |  -.2169066   .1995032    -1.09   0.277    -.6085813    .1747681
provincedum12 |  -.3338727   .2185886    -1.53   0.127    -.7630168    .0952713
provincedum13 |  -.2317897   .2030777    -1.14   0.254    -.6304821    .1669027
provincedum14 |  -.3226267   .2219429    -1.45   0.146    -.7583562    .1131028
provincedum15 |  -.3188089   .2016118    -1.58   0.114    -.7146233    .0770056
          _m1 |   .2254866   .5050909     0.45   0.655    -.7661335    1.217107
          _m2 |  -.0984052   .1487863    -0.66   0.509    -.3905099    .1936995
          _m3 |    .007039   .2841632     0.02   0.980    -.5508446    .5649226
        _cons |   8.291349   .2898785    28.60   0.000     7.722245    8.860453
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3796647          .        .       .            .           .
        rho1 |    .365949          .        .       .            .           .
        rho2 |  -.1597047          .        .       .            .           .
        rho3 |   .0114239          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-p
> rovincedum15 m1 m2 m3 if male==1 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning,
>  200, 16667), vce(robust)

. eststo
(est11 stored)

. sum gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        746    8.315963    .6218846    5.37836   9.645658
         exp |        746    13.14209    6.967127          2         32
      expsqr |        746    221.1903    228.5327          4       1024
  highvocedu |        746     .272118    .4453489          0          1
  highgenedu |        746     .230563    .4214758          0          1
-------------+---------------------------------------------------------
    adultedu |        746    .0469169    .2116027          0          1
          m1 |        746   -.2319765    .0975867  -.6294667  -.0194484
          m2 |        746    .8173386    .5989208   .0332688   2.969432
          m3 |        746   -.4032964    .2514602  -.7260004   .2775654

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Male, Specified Higheredu, Province Dum) 
> pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-provi
> ncedum15 if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667),
>  sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3
> _vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

note: male omitted because of collinearity.
Iteration 0:  Log likelihood = -1800.0063
Iteration 1:  Log likelihood =  -1323.665
Iteration 2:  Log likelihood = -1277.2402
Iteration 3:  Log likelihood = -1274.1234
Iteration 4:  Log likelihood = -1274.1088
Iteration 5:  Log likelihood = -1274.1088

Multinomial logistic regression                   Number of obs   =       2185
                                                  LR chi2(10)     =    1051.80
                                                  Prob > chi2     =     0.0000
Log likelihood = -1274.1088                       Pseudo R2       =     0.2922

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
         exp |  -.7832928   .0770318   -10.17   0.000    -.9342724   -.6323133
      expsqr |   .0131372   .0019339     6.79   0.000     .0093469    .0169276
ins1_secge~e |  -9.805594   1.291489    -7.59   0.000    -12.33687   -7.274322
ins2_highe~e |   .9693154   .2415959     4.01   0.000     .4957962    1.442835
ins3_vs_en~e |   2.593672   1.159384     2.24   0.025     .3213208    4.866023
       _cons |   9.202749   .9935313     9.26   0.000     7.255463    11.15003
-------------+----------------------------------------------------------------
2            |
         exp |  -1.069852   .0701222   -15.26   0.000    -1.207289   -.9324154
      expsqr |   .0195743   .0016437    11.91   0.000     .0163527    .0227959
ins1_secge~e |  -10.56616   1.196463    -8.83   0.000    -12.91118   -8.221131
ins2_highe~e |   .4433424   .2731867     1.62   0.105    -.0920936    .9787784
ins3_vs_en~e |  -.5525823   1.094473    -0.50   0.614    -2.697711    1.592546
       _cons |   13.78027     .93856    14.68   0.000     11.94072    15.61981
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       460
-------------+----------------------------------   F(22, 437)      =      3.18
       Model |  24.5258529        22  1.11481149   Prob > F        =    0.0000
    Residual |  153.091223       437  .350323164   R-squared       =    0.1381
-------------+----------------------------------   Adj R-squared   =    0.0947
       Total |  177.617075       459  .386965306   Root MSE        =    .59188

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
          exp |  -.0049171   .0413945    -0.12   0.905    -.0862742      .07644
       expsqr |  -.0000643   .0011378    -0.06   0.955    -.0023006     .002172
   highvocedu |    .276703   .0830523     3.33   0.001     .1134714    .4399347
   highgenedu |   .4497257   .0979225     4.59   0.000     .2572681    .6421833
     adultedu |    .159826   .1286744     1.24   0.215    -.0930715    .4127236
 provincedum2 |  -.1847204   .2127913    -0.87   0.386     -.602942    .2335011
 provincedum3 |  -.8943016   .2652363    -3.37   0.001    -1.415599   -.3730043
 provincedum4 |  -.5360412   .2813651    -1.91   0.057    -1.089038    .0169558
 provincedum5 |  -.3059614   .1619385    -1.89   0.060    -.6242364    .0123137
 provincedum6 |  -.0195292   .1806368    -0.11   0.914     -.374554    .3354957
 provincedum7 |  -.1662173   .1907259    -0.87   0.384    -.5410713    .2086367
 provincedum8 |  -.2592947   .1807429    -1.43   0.152    -.6145282    .0959387
 provincedum9 |   .0422134   .1702413     0.25   0.804    -.2923802    .3768069
provincedum10 |  -.1158645   .1688253    -0.69   0.493     -.447675    .2159459
provincedum11 |  -.0209937   .1822672    -0.12   0.908     -.379223    .3372357
provincedum12 |  -.0263336   .2468085    -0.11   0.915    -.5114129    .4587457
provincedum13 |  -.2703593   .1810727    -1.49   0.136    -.6262409    .0855224
provincedum14 |  -.2063478   .1953616    -1.06   0.291     -.590313    .1776173
provincedum15 |  -.4006599   .1910643    -2.10   0.037     -.776179   -.0251408
          _m1 |   .0100274     .57502     0.02   0.986    -1.120121    1.140176
          _m2 |  -.0981745   .1797223    -0.55   0.585     -.451402     .255053
          _m3 |  -.4848963   .3455013    -1.40   0.161    -1.163947    .1941546
        _cons |   7.996262   .2854705    28.01   0.000     7.435197    8.557328
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3254001          .        .       .            .           .
        rho1 |   .0175784          .        .       .            .           .
        rho2 |  -.1721036          .        .       .            .           .
        rho3 |  -.8500413          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu provincedum2-p
> rovincedum15 m1 m2 m3 if male==0 & inrange(birthyear, 1971, 1992) & inrange(monthlyearning,
>  200, 16667), vce(robust)

. eststo
(est12 stored)

. sum gen_log_monthlyearning exp expsqr highvocedu highgenedu adultedu m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        460    8.045742    .6220654   5.521461   9.615806
         exp |        460    12.06739    6.624197          1         31
      expsqr |        460    189.4065    207.6907          1        961
  highvocedu |        460    .2586957    .4383948          0          1
  highgenedu |        460    .2695652     .444217          0          1
-------------+---------------------------------------------------------
    adultedu |        460    .0565217    .2311779          0          1
          m1 |        460   -.2485743     .105675  -.5962154  -.0163755
          m2 |        460    .7526901    .6229017   .0322888   2.368686
          m3 |        460   -.3376128     .255796  -.7259963  -.0002685

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Female, Specified Higheredu, Province Dum
> ) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. 
. ***Table 3 Generation
. 
. local variablenames m1 m2 m3

. local variablelabels ""Upper secondary vocational track selection correction" "Upper second
> ary general track selection correction" "No upper secondary degree selection correction""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. local estlist est1 est2 est3 est4 est5 est6 est7 est8 est9 est10 est11 est12

. 
. outreg2 [`estlist'] using "Table 3/Table3.xls", excel replace pvalue adjr2 drop(provincedum
> *) dec(3) sortvar(male exp expsqr higheredu) title("Table 3 (Sec Voc 1-6, Sec Gen 7-10; Non
> -specified 1-3 & 7-9, Specified 4-6 & 10-12; Genders repeat under for every 3 columns)") ct
> itle(" ") addnote("More notes") label
Table 3/Table3.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. ***Table 5 with sequence: Gaokao indicator / Parent indicator > Two_tracks > Higher_edu Com
> bined/Seperated, 2*2*2=8 columns in total.
. 
. *Prepare
. 
. drop m1 m2 m3

. local folderpath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 
> 3 5 7 9 11"

. local filename "Rural tables"

. local datapath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/20240716 Rural 
> Chip2018 and Instrumental Statistics and Inflation.dta"

. 
. 
. local xlspath "`folderpath'/`filename'.xls"

. 
. eststo clear

. 
. *columns 1-4
. 
. selmlog voc_log_monthlyearning  male exp expsqr higheredu TakeGaoKao provincedum2-provinced
> um15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=ma
> le exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_re
> lative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       607
-------------+----------------------------------   F(22, 584)      =      4.76
       Model |  38.2616931        22  1.73916787   Prob > F        =    0.0000
    Residual |  213.246214       584  .365147626   R-squared       =    0.1521
-------------+----------------------------------   Adj R-squared   =    0.1202
       Total |  251.507907       606  .415029549   Root MSE        =    .60427

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .3793995   .0526583     7.20   0.000     .2759768    .4828222
          exp |   .0670673   .0418684     1.60   0.110    -.0151637    .1492982
       expsqr |  -.0014004   .0011251    -1.24   0.214    -.0036102    .0008094
    higheredu |   .0889924   .0771037     1.15   0.249     -.062442    .2404267
   TakeGaoKao |  -.0647453   .0663501    -0.98   0.330    -.1950592    .0655686
 provincedum2 |  -.2356643   .2468154    -0.95   0.340    -.7204183    .2490897
 provincedum3 |   .0451877   .2794556     0.16   0.872    -.5036727    .5940481
 provincedum4 |   .2120568   .2939974     0.72   0.471    -.3653641    .7894777
 provincedum5 |   .2038595    .181243     1.12   0.261    -.1521079    .5598269
 provincedum6 |   .1742109   .2105181     0.83   0.408    -.2392539    .5876756
 provincedum7 |    .083933   .2191143     0.38   0.702    -.3464149     .514281
 provincedum8 |   -.036599   .2200836    -0.17   0.868    -.4688508    .3956528
 provincedum9 |   .2764609   .1978808     1.40   0.163    -.1121838    .6651056
provincedum10 |  -.0658977    .204528    -0.32   0.747    -.4675977    .3358023
provincedum11 |   .0330576   .2107402     0.16   0.875    -.3808434    .4469585
provincedum12 |  -.1760872   .2067944    -0.85   0.395    -.5822384    .2300641
provincedum13 |  -.2447388   .2048912    -1.19   0.233    -.6471521    .1576746
provincedum14 |  -.1019696   .2304603    -0.44   0.658    -.5546015    .3506624
provincedum15 |  -.1056531    .236615    -0.45   0.655    -.5703731     .359067
          _m1 |  -.2354614     .21382    -1.10   0.271    -.6554112    .1844885
          _m2 |  -.0731576   .4747707    -0.15   0.878    -1.005624    .8593084
          _m3 |   .1147594   .1518294     0.76   0.450    -.1834387    .4129576
        _cons |   7.595022   .5550932    13.68   0.000       6.5048    8.685244
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3867101          .        .       .            .           .
        rho1 |  -.3786404          .        .       .            .           .
        rho2 |  -.1176431          .        .       .            .           .
        rho3 |   .1845422          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu TakeGaoKao provincedum2-provin
> cedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), 
> vce(robust)

. eststo
(est1 stored)

. sum voc_log_monthlyearning male exp expsqr higheredu TakeGaoKao provincedum2-provincedum15 
> m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        607    8.137605    .6442279   5.298317   9.721166
        male |        607    .6375618    .4811009          0          1
         exp |        607    14.60956    6.132538          2         32
      expsqr |        607    250.9852    209.5954          4       1024
   higheredu |        607    .1334432    .3403335          0          1
-------------+---------------------------------------------------------
  TakeGaoKao |        607    .2108731    .4082649          0          1
provincedum2 |        607    .0230643    .1502314          0          1
provincedum3 |        607     .014827    .1209598          0          1
provincedum4 |        607    .0098847    .0990107          0          1
provincedum5 |        607    .0856672    .2801028          0          1
-------------+---------------------------------------------------------
provincedum6 |        607    .0658979    .2483081          0          1
provincedum7 |        607    .0691928    .2539909          0          1
provincedum8 |        607    .1054366    .3073684          0          1
provincedum9 |        607    .0823723    .2751579          0          1
provinced~10 |        607    .1169687     .321648          0          1
-------------+---------------------------------------------------------
provinced~11 |        607    .1054366    .3073684          0          1
provinced~12 |        607    .0378913    .1910908          0          1
provinced~13 |        607    .0691928    .2539909          0          1
provinced~14 |        607    .0527183    .2236548          0          1
provinced~15 |        607    .0560132    .2301368          0          1
-------------+---------------------------------------------------------
          m1 |        607    1.315722     .399849   .4635267   3.007092
          m2 |        607   -.3698805    .2118464  -.7259973  -.0044607
          m3 |        607   -.4793044    .2654595  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu TakeGaoKao p
> rovincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 
> 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relati
> ve ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       607
-------------+----------------------------------   F(24, 582)      =      4.36
       Model |   38.305332        24   1.5960555   Prob > F        =    0.0000
    Residual |  213.202575       582  .366327448   R-squared       =    0.1523
-------------+----------------------------------   Adj R-squared   =    0.1173
       Total |  251.507907       606  .415029549   Root MSE        =    .60525

-------------------------------------------------------------------------------
voc_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .3797215   .0529401     7.17   0.000     .2757446    .4836983
          exp |    .067992   .0420236     1.62   0.106    -.0145445    .1505284
       expsqr |  -.0014247   .0011291    -1.26   0.208    -.0036424     .000793
   highvocedu |   .0714332   .0954226     0.75   0.454    -.1159813    .2588478
   highgenedu |   .1392148   .2017529     0.69   0.490    -.2570377    .5354672
     adultedu |   .1061563   .1382808     0.77   0.443    -.1654339    .3777464
   TakeGaoKao |  -.0649112   .0665563    -0.98   0.330    -.1956309    .0658086
 provincedum2 |  -.2349549   .2472864    -0.95   0.342    -.7206373    .2507275
 provincedum3 |   .0428931   .2802309     0.15   0.878    -.5074938    .5932801
 provincedum4 |   .2099845   .2950018     0.71   0.477    -.3694132    .7893823
 provincedum5 |   .2083464    .182042     1.14   0.253    -.1491929    .5658857
 provincedum6 |   .1767615    .211014     0.84   0.403    -.2376801    .5912031
 provincedum7 |   .0872813   .2196844     0.40   0.691    -.3441896    .5187521
 provincedum8 |   -.039212   .2206438    -0.18   0.859     -.472567     .394143
 provincedum9 |   .2763296   .1982019     1.39   0.164    -.1129485    .6656076
provincedum10 |  -.0649453   .2048878    -0.32   0.751    -.4673548    .3374642
provincedum11 |   .0337442   .2111487     0.16   0.873    -.3809621    .4484505
provincedum12 |   -.174384   .2072012    -0.84   0.400    -.5813372    .2325692
provincedum13 |  -.2430922   .2052872    -1.18   0.237    -.6462862    .1601018
provincedum14 |  -.1059465   .2313265    -0.46   0.647    -.5602829    .3483899
provincedum15 |  -.1027355   .2371503    -0.43   0.665    -.5685102    .3630392
          _m1 |  -.2344441   .2144544    -1.09   0.275    -.6556429    .1867547
          _m2 |  -.0805282   .4760734    -0.17   0.866    -1.015559    .8545031
          _m3 |   .1141774   .1520904     0.75   0.453    -.1845355    .4128902
        _cons |   7.582343   .5574276    13.60   0.000     6.487528    8.677157
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3865487          .        .       .            .           .
        rho1 |  -.3770832          .        .       .            .           .
        rho2 |  -.1295227          .        .       .            .           .
        rho3 |   .1836445          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu TakeGaoKa
> o provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlye
> arning, 200, 16667), vce(robust)

. eststo
(est2 stored)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu TakeGaoKao provin
> cedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        607    8.137605    .6442279   5.298317   9.721166
        male |        607    .6375618    .4811009          0          1
         exp |        607    14.60956    6.132538          2         32
      expsqr |        607    250.9852    209.5954          4       1024
  highvocedu |        607    .0823723    .2751579          0          1
-------------+---------------------------------------------------------
  highgenedu |        607    .0164745    .1273962          0          1
    adultedu |        607    .0345964    .1829059          0          1
  TakeGaoKao |        607    .2108731    .4082649          0          1
provincedum2 |        607    .0230643    .1502314          0          1
provincedum3 |        607     .014827    .1209598          0          1
-------------+---------------------------------------------------------
provincedum4 |        607    .0098847    .0990107          0          1
provincedum5 |        607    .0856672    .2801028          0          1
provincedum6 |        607    .0658979    .2483081          0          1
provincedum7 |        607    .0691928    .2539909          0          1
provincedum8 |        607    .1054366    .3073684          0          1
-------------+---------------------------------------------------------
provincedum9 |        607    .0823723    .2751579          0          1
provinced~10 |        607    .1169687     .321648          0          1
provinced~11 |        607    .1054366    .3073684          0          1
provinced~12 |        607    .0378913    .1910908          0          1
provinced~13 |        607    .0691928    .2539909          0          1
-------------+---------------------------------------------------------
provinced~14 |        607    .0527183    .2236548          0          1
provinced~15 |        607    .0560132    .2301368          0          1
          m1 |        607    1.315722     .399849   .4635267   3.007092
          m2 |        607   -.3698805    .2118464  -.7259973  -.0044607
          m3 |        607   -.4793044    .2654595  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning  male exp expsqr higheredu TakeGaoKao provincedum2-provinced
> um15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educat=ma
> le exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_re
> lative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,200
-------------+----------------------------------   F(22, 1177)     =      5.98
       Model |  48.7958735        22  2.21799425   Prob > F        =    0.0000
    Residual |  436.753404     1,177  .371073411   R-squared       =    0.1005
-------------+----------------------------------   Adj R-squared   =    0.0837
       Total |  485.549278     1,199  .404961866   Root MSE        =    .60916

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .2817039   .0367404     7.67   0.000     .2096199     .353788
          exp |   .0065099   .0259929     0.25   0.802    -.0444876    .0575074
       expsqr |  -.0002422   .0006939    -0.35   0.727    -.0016037    .0011193
    higheredu |   .1554476   .0502883     3.09   0.002     .0567828    .2541124
   TakeGaoKao |   .0533363   .0479374     1.11   0.266     -.040716    .1473886
 provincedum2 |  -.3516737   .1502025    -2.34   0.019    -.6463682   -.0569791
 provincedum3 |  -.4202916   .1670229    -2.52   0.012    -.7479875   -.0925957
 provincedum4 |  -.4971124   .1994948    -2.49   0.013    -.8885176   -.1057072
 provincedum5 |  -.1309898    .120872    -1.08   0.279    -.3681385    .1061589
 provincedum6 |  -.1316513   .1331396    -0.99   0.323    -.3928687    .1295661
 provincedum7 |  -.2161866   .1403391    -1.54   0.124    -.4915293    .0591562
 provincedum8 |  -.3536935   .1357023    -2.61   0.009     -.619939   -.0874481
 provincedum9 |  -.0177765    .124716    -0.14   0.887     -.262467     .226914
provincedum10 |  -.1333988   .1256596    -1.06   0.289    -.3799405     .113143
provincedum11 |  -.1759957   .1346497    -1.31   0.191     -.440176    .0881846
provincedum12 |  -.2805436   .1596466    -1.76   0.079    -.5937673    .0326801
provincedum13 |  -.2947316   .1348681    -2.19   0.029    -.5593403    -.030123
provincedum14 |  -.3209911   .1483026    -2.16   0.031    -.6119579   -.0300242
provincedum15 |  -.3958009   .1371698    -2.89   0.004    -.6649256   -.1266762
          _m1 |    .266867     .37041     0.72   0.471    -.4598707    .9936046
          _m2 |  -.1097545   .1137105    -0.97   0.335    -.3328524    .1133434
          _m3 |  -.1708767   .2177421    -0.78   0.433    -.5980827    .2563293
        _cons |   8.177305   .1963432    41.65   0.000     7.792083    8.562527
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3851648          .        .       .            .           .
        rho1 |   .4300031          .        .       .            .           .
        rho2 |  -.1768475          .        .       .            .           .
        rho3 |  -.2753338          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu TakeGaoKao provincedum2-provin
> cedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), 
> vce(robust)

. eststo
(est3 stored)

. sum gen_log_monthlyearning male exp expsqr higheredu TakeGaoKao provincedum2-provincedum15 
> m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      1,200     8.21166    .6363661    5.37836   9.645658
        male |      1,200       .6175    .4862003          0          1
         exp |      1,200     12.7425    6.866986          1         32
      expsqr |      1,200    209.4875    221.6771          1       1024
   higheredu |      1,200    .5633333    .4961795          0          1
-------------+---------------------------------------------------------
  TakeGaoKao |      1,200    .6791667    .4669915          0          1
provincedum2 |      1,200    .0366667    .1880204          0          1
provincedum3 |      1,200    .0208333    .1428857          0          1
provincedum4 |      1,200    .0108333    .1035611          0          1
provincedum5 |      1,200    .0933333    .2910203          0          1
-------------+---------------------------------------------------------
provincedum6 |      1,200    .0733333    .2607915          0          1
provincedum7 |      1,200    .0666667    .2495478          0          1
provincedum8 |      1,200    .1266667    .3327379          0          1
provincedum9 |      1,200       .1075     .309877          0          1
provinced~10 |      1,200         .11    .3130202          0          1
-------------+---------------------------------------------------------
provinced~11 |      1,200    .1041667     .305604          0          1
provinced~12 |      1,200    .0208333    .1428857          0          1
provinced~13 |      1,200    .0541667    .2264407          0          1
provinced~14 |      1,200    .0483333     .214559          0          1
provinced~15 |      1,200    .0741667    .2621512          0          1
-------------+---------------------------------------------------------
          m1 |      1,200   -.2379589    .1007717  -.6403428  -.0164993
          m2 |      1,200    .7956666    .6090618   .0167035   2.932487
          m3 |      1,200   -.3800775    .2553703  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu TakeGaoKao p
> rovincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 
> 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relati
> ve ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,200
-------------+----------------------------------   F(24, 1175)     =      5.79
       Model |  51.3692549        24  2.14038562   Prob > F        =    0.0000
    Residual |  434.180023     1,175  .369514913   R-squared       =    0.1058
-------------+----------------------------------   Adj R-squared   =    0.0875
       Total |  485.549278     1,199  .404961866   Root MSE        =    .60788

-------------------------------------------------------------------------------
gen_log_mon~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .2799991   .0366795     7.63   0.000     .2080344    .3519638
          exp |   .0107306   .0259878     0.41   0.680    -.0402571    .0617184
       expsqr |  -.0003063   .0006929    -0.44   0.659    -.0016658    .0010532
   highvocedu |   .1630673   .0562297     2.90   0.004     .0527456     .273389
   highgenedu |   .2585811   .0647567     3.99   0.000     .1315295    .3856327
     adultedu |   .0285237   .0850596     0.34   0.737    -.1383619    .1954093
   TakeGaoKao |   .0293027   .0490178     0.60   0.550    -.0668695    .1254749
 provincedum2 |  -.3072505   .1508477    -2.04   0.042    -.6032115   -.0112896
 provincedum3 |  -.4020913   .1669556    -2.41   0.016    -.7296557   -.0745269
 provincedum4 |  -.4692565   .1993961    -2.35   0.019    -.8604687   -.0780443
 provincedum5 |  -.1123728   .1208245    -0.93   0.353    -.3494287    .1246831
 provincedum6 |  -.1101168    .133143    -0.83   0.408    -.3713414    .1511078
 provincedum7 |  -.1880777   .1405109    -1.34   0.181    -.4637579    .0876025
 provincedum8 |  -.3244533   .1359221    -2.39   0.017    -.5911304   -.0577762
 provincedum9 |   .0093674    .124914     0.07   0.940     -.235712    .2544468
provincedum10 |  -.0982478    .126185    -0.78   0.436    -.3458209    .1493254
provincedum11 |  -.1434324   .1349328    -1.06   0.288    -.4081684    .1213037
provincedum12 |  -.2363448   .1603451    -1.47   0.141    -.5509394    .0782499
provincedum13 |  -.2564618    .135371    -1.89   0.058    -.5220578    .0091341
provincedum14 |  -.2763298   .1489725    -1.85   0.064    -.5686116    .0159521
provincedum15 |  -.3563991   .1378478    -2.59   0.010    -.6268544   -.0859437
          _m1 |   .1332976   .3746532     0.36   0.722    -.6017664    .8683617
          _m2 |  -.0993361     .11362    -0.87   0.382    -.3222568    .1235846
          _m3 |  -.1938573   .2174597    -0.89   0.373    -.6205099    .2327954
        _cons |   8.055022   .2019746    39.88   0.000     7.658751    8.451293
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3697526          .        .       .            .           .
        rho1 |   .2192133          .        .       .            .           .
        rho2 |  -.1633622          .        .       .            .           .
        rho3 |   -.318806          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu TakeGaoKa
> o provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlye
> arning, 200, 16667), vce(robust)

. eststo
(est4 stored)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu TakeGaoKao provin
> cedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      1,200     8.21166    .6363661    5.37836   9.645658
        male |      1,200       .6175    .4862003          0          1
         exp |      1,200     12.7425    6.866986          1         32
      expsqr |      1,200    209.4875    221.6771          1       1024
  highvocedu |      1,200       .2675    .4428399          0          1
-------------+---------------------------------------------------------
  highgenedu |      1,200    .2458333    .4307597          0          1
    adultedu |      1,200         .05    .2180358          0          1
  TakeGaoKao |      1,200    .6791667    .4669915          0          1
provincedum2 |      1,200    .0366667    .1880204          0          1
provincedum3 |      1,200    .0208333    .1428857          0          1
-------------+---------------------------------------------------------
provincedum4 |      1,200    .0108333    .1035611          0          1
provincedum5 |      1,200    .0933333    .2910203          0          1
provincedum6 |      1,200    .0733333    .2607915          0          1
provincedum7 |      1,200    .0666667    .2495478          0          1
provincedum8 |      1,200    .1266667    .3327379          0          1
-------------+---------------------------------------------------------
provincedum9 |      1,200       .1075     .309877          0          1
provinced~10 |      1,200         .11    .3130202          0          1
provinced~11 |      1,200    .1041667     .305604          0          1
provinced~12 |      1,200    .0208333    .1428857          0          1
provinced~13 |      1,200    .0541667    .2264407          0          1
-------------+---------------------------------------------------------
provinced~14 |      1,200    .0483333     .214559          0          1
provinced~15 |      1,200    .0741667    .2621512          0          1
          m1 |      1,200   -.2379589    .1007717  -.6403428  -.0164993
          m2 |      1,200    .7956666    .6090618   .0167035   2.932487
          m3 |      1,200   -.3800775    .2553703  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. *columns 5-8
. 
. selmlog voc_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(24, 500)      =      3.99
       Model |  34.3436126        24  1.43098386   Prob > F        =    0.0000
    Residual |  179.117451       500  .358234901   R-squared       =    0.1609
-------------+----------------------------------   Adj R-squared   =    0.1206
       Total |  213.461063       524  .407368441   Root MSE        =    .59853

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3724394   .0617441     6.03   0.000     .2511295    .4937493
               exp |   .0798202   .0446193     1.79   0.074    -.0078442    .1674846
            expsqr |  -.0017854   .0011897    -1.50   0.134    -.0041228    .0005519
         higheredu |   .0607223   .0826218     0.73   0.463    -.1016064     .223051
     parent_secedu |  -.0264995   .0704422    -0.38   0.707    -.1648986    .1118996
    parent_highedu |  -.0251937   .2656167    -0.09   0.924    -.5470561    .4966687
parent_partymember |   .0582671   .0753009     0.77   0.439    -.0896781    .2062122
      provincedum2 |  -.2125666   .2625274    -0.81   0.419    -.7283594    .3032262
      provincedum3 |    .074069   .2939294     0.25   0.801    -.5034198    .6515579
      provincedum4 |   .2366337   .3019986     0.78   0.434    -.3567089    .8299763
      provincedum5 |   .3332286   .2041669     1.63   0.103    -.0679022    .7343593
      provincedum6 |   .1940068   .2321105     0.84   0.404    -.2620253    .6500389
      provincedum7 |   .1160823   .2393081     0.49   0.628     -.354091    .5862556
      provincedum8 |  -.0658001   .2429786    -0.27   0.787    -.5431849    .4115847
      provincedum9 |    .294031   .2160449     1.36   0.174    -.1304368    .7184988
     provincedum10 |   .0207104   .2237419     0.09   0.926    -.4188798    .4603005
     provincedum11 |   .1561409   .2296231     0.68   0.497    -.2950042    .6072861
     provincedum12 |  -.1415097   .2251518    -0.63   0.530    -.5838699    .3008505
     provincedum13 |  -.1888511   .2235037    -0.84   0.399    -.6279733    .2502711
     provincedum14 |  -.0815866   .2536247    -0.32   0.748    -.5798881    .4167148
     provincedum15 |  -.1519409   .2559561    -0.59   0.553    -.6548231    .3509412
               _m1 |  -.2531637   .2344679    -1.08   0.281    -.7138275    .2075001
               _m2 |   .0257834   .5166618     0.05   0.960    -.9893123    1.040879
               _m3 |   .1172095   .1528497     0.77   0.444    -.1830973    .4175163
             _cons |   7.523778   .6022441    12.49   0.000     6.340537    8.707019
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3811067          .        .       .            .           .
        rho1 |   -.410089          .        .       .            .           .
        rho2 |   .0417654          .        .       .            .           .
        rho3 |   .1898626          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 200, 16667), vce(robust)

. eststo
(est5 stored)

. sum voc_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
   higheredu |        525    .1295238     .336099          0          1
-------------+---------------------------------------------------------
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
provincedum2 |        525    .0266667    .1612609          0          1
provincedum3 |        525    .0171429    .1299274          0          1
-------------+---------------------------------------------------------
provincedum4 |        525    .0114286    .1063932          0          1
provincedum5 |        525    .0704762    .2561919          0          1
provincedum6 |        525    .0628571    .2429373          0          1
provincedum7 |        525     .072381    .2593648          0          1
provincedum8 |        525    .0971429    .2964346          0          1
-------------+---------------------------------------------------------
provincedum9 |        525    .0780952    .2685773          0          1
provinced~10 |        525    .1161905    .3207588          0          1
provinced~11 |        525    .1257143    .3318433          0          1
provinced~12 |        525         .04    .1961461          0          1
provinced~13 |        525    .0761905    .2655557          0          1
-------------+---------------------------------------------------------
provinced~14 |        525     .047619     .213162          0          1
provinced~15 |        525    .0628571    .2429373          0          1
          m1 |        525    1.333378     .410071   .4635267   3.007092
          m2 |        525   -.3666274    .2108173  -.7259973  -.0044607
          m3 |        525   -.4815773    .2715142  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       525
-------------+----------------------------------   F(26, 498)      =      3.73
       Model |  34.8225569        26  1.33932911   Prob > F        =    0.0000
    Residual |  178.638506       498   .35871186   R-squared       =    0.1631
-------------+----------------------------------   Adj R-squared   =    0.1194
       Total |  213.461063       524  .407368441   Root MSE        =    .59893

------------------------------------------------------------------------------------
voc_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .3756175   .0619433     6.06   0.000     .2539152    .4973199
               exp |   .0831746   .0447818     1.86   0.064      -.00481    .1711592
            expsqr |  -.0018914   .0011948    -1.58   0.114    -.0042389    .0004561
        highvocedu |   -.004323   .1000605    -0.04   0.966    -.2009158    .1922699
        highgenedu |   .1921719   .2548849     0.75   0.451    -.3086103    .6929541
          adultedu |   .1757241    .153073     1.15   0.252    -.1250244    .4764725
     parent_secedu |  -.0252729   .0705146    -0.36   0.720    -.1638157    .1132699
    parent_highedu |   -.016193   .2659333    -0.06   0.951    -.5386825    .5062966
parent_partymember |     .06687   .0757245     0.88   0.378    -.0819089    .2156489
      provincedum2 |  -.2222382   .2628366    -0.85   0.398    -.7386434     .294167
      provincedum3 |   .0629145   .2954652     0.21   0.831    -.5175975    .6434266
      provincedum4 |   .2156469    .302828     0.71   0.477    -.3793312    .8106249
      provincedum5 |   .3448314   .2045735     1.69   0.092    -.0571022    .7467649
      provincedum6 |   .1981754   .2324084     0.85   0.394    -.2584464    .6547973
      provincedum7 |   .1180082   .2395014     0.49   0.622    -.3525495    .5885658
      provincedum8 |  -.0753948   .2440154    -0.31   0.757    -.5548213    .4040317
      provincedum9 |   .2868936   .2164494     1.33   0.186     -.138373    .7121602
     provincedum10 |   .0183779   .2239333     0.08   0.935    -.4215925    .4583483
     provincedum11 |   .1510627   .2298283     0.66   0.511    -.3004899    .6026152
     provincedum12 |  -.1388395   .2253888    -0.62   0.538    -.5816698    .3039908
     provincedum13 |  -.1910507   .2236824    -0.85   0.393    -.6305282    .2484268
     provincedum14 |  -.0939522   .2543359    -0.37   0.712    -.5936559    .4057514
     provincedum15 |  -.1523264    .256145    -0.59   0.552    -.6555845    .3509316
               _m1 |  -.2342274   .2353176    -1.00   0.320    -.6965651    .2281102
               _m2 |  -.0141233   .5181617    -0.03   0.978    -1.032176    1.003929
               _m3 |    .113055    .153006     0.74   0.460    -.1875619    .4136719
             _cons |   7.458381   .6053028    12.32   0.000     6.269119    8.647643
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3743184          .        .       .            .           .
        rho1 |  -.3828398          .        .       .            .           .
        rho2 |  -.0230842          .        .       .            .           .
        rho3 |    .184786          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), vce(robust)

. eststo
(est6 stored)

. sum voc_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        525    8.176479    .6382542   5.298317   9.721166
        male |        525    .7390476    .4395728          0          1
         exp |        525    14.87619     6.31292          2         32
      expsqr |        525    261.0781    218.0548          4       1024
  highvocedu |        525    .0857143    .2802087          0          1
-------------+---------------------------------------------------------
  highgenedu |        525    .0114286    .1063932          0          1
    adultedu |        525     .032381    .1771785          0          1
parent_sec~u |        525    .2057143    .4046081          0          1
parent_hig~u |        525    .0114286    .1063932          0          1
parent_par~r |        525    .1714286    .3772425          0          1
-------------+---------------------------------------------------------
provincedum2 |        525    .0266667    .1612609          0          1
provincedum3 |        525    .0171429    .1299274          0          1
provincedum4 |        525    .0114286    .1063932          0          1
provincedum5 |        525    .0704762    .2561919          0          1
provincedum6 |        525    .0628571    .2429373          0          1
-------------+---------------------------------------------------------
provincedum7 |        525     .072381    .2593648          0          1
provincedum8 |        525    .0971429    .2964346          0          1
provincedum9 |        525    .0780952    .2685773          0          1
provinced~10 |        525    .1161905    .3207588          0          1
provinced~11 |        525    .1257143    .3318433          0          1
-------------+---------------------------------------------------------
provinced~12 |        525         .04    .1961461          0          1
provinced~13 |        525    .0761905    .2655557          0          1
provinced~14 |        525     .047619     .213162          0          1
provinced~15 |        525    .0628571    .2429373          0          1
          m1 |        525    1.333378     .410071   .4635267   3.007092
-------------+---------------------------------------------------------
          m2 |        525   -.3666274    .2108173  -.7259973  -.0044607
          m3 |        525   -.4815773    .2715142  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning  male exp expsqr higheredu parent_secedu parent_highedu pare
> nt_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 1992) & inrange(month
> lyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highed
> u_entrant_relative ins3_vs_entrant_relative ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(24, 950)      =      4.74
       Model |    41.11095        24  1.71295625   Prob > F        =    0.0000
    Residual |  343.628058       950  .361713745   R-squared       =    0.1069
-------------+----------------------------------   Adj R-squared   =    0.0843
       Total |  384.739008       974  .395009249   Root MSE        =    .60143

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2601914   .0441167     5.90   0.000     .1736141    .3467688
               exp |   .0056008   .0290329     0.19   0.847    -.0513751    .0625768
            expsqr |  -.0003735   .0007709    -0.48   0.628    -.0018863    .0011393
         higheredu |   .1641325   .0504686     3.25   0.001     .0650898    .2631753
     parent_secedu |   .0287901   .0478729     0.60   0.548    -.0651588     .122739
    parent_highedu |   .0918905   .1514749     0.61   0.544    -.2053735    .3891545
parent_partymember |  -.0381453   .0522015    -0.73   0.465     -.140589    .0642983
      provincedum2 |  -.3273399   .1720733    -1.90   0.057    -.6650276    .0103479
      provincedum3 |  -.5060594   .1832225    -2.76   0.006    -.8656269   -.1464919
      provincedum4 |  -.4704988   .2218327    -2.12   0.034    -.9058376   -.0351601
      provincedum5 |  -.0987436   .1431652    -0.69   0.491    -.3797003    .1822131
      provincedum6 |  -.1702013   .1588676    -1.07   0.284    -.4819733    .1415707
      provincedum7 |  -.2361972   .1640702    -1.44   0.150    -.5581791    .0857847
      provincedum8 |  -.4494611   .1619737    -2.77   0.006    -.7673288   -.1315935
      provincedum9 |  -.0294999   .1468252    -0.20   0.841    -.3176392    .2586394
     provincedum10 |  -.1476134   .1491617    -0.99   0.323     -.440338    .1451112
     provincedum11 |  -.2317653   .1594413    -1.45   0.146    -.5446632    .0811326
     provincedum12 |   -.362988   .1773863    -2.05   0.041    -.7111022   -.0148737
     provincedum13 |  -.3100566   .1600648    -1.94   0.053    -.6241779    .0040648
     provincedum14 |  -.2442142   .1739073    -1.40   0.161     -.585501    .0970726
     provincedum15 |  -.4330048   .1593939    -2.72   0.007    -.7458095      -.1202
               _m1 |   .3657298   .4253848     0.86   0.390    -.4690726    1.200532
               _m2 |   -.093612   .1304111    -0.72   0.473    -.3495392    .1623152
               _m3 |  -.1652686   .2302606    -0.72   0.473    -.6171467    .2866095
             _cons |   8.299801   .2215117    37.47   0.000     7.865092     8.73451
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3857449          .        .       .            .           .
        rho1 |   .5888576          .        .       .            .           .
        rho2 |  -.1507236          .        .       .            .           .
        rho3 |  -.2660972          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu p
> arent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birthyear, 1971, 1992) & 
> inrange(monthlyearning, 200, 16667), vce(robust)

. eststo
(est7 stored)

. sum gen_log_monthlyearning male exp expsqr higheredu parent_secedu parent_highedu parent_pa
> rtymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
   higheredu |        975    .5692308     .495438          0          1
-------------+---------------------------------------------------------
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
provincedum2 |        975         .04    .1960597          0          1
provincedum3 |        975    .0246154    .1550294          0          1
-------------+---------------------------------------------------------
provincedum4 |        975    .0112821    .1056703          0          1
provincedum5 |        975    .0861538    .2807351          0          1
provincedum6 |        975    .0717949    .2582804          0          1
provincedum7 |        975    .0728205     .259975          0          1
provincedum8 |        975    .1251282     .331034          0          1
-------------+---------------------------------------------------------
provincedum9 |        975    .1076923    .3101505          0          1
provinced~10 |        975    .1035897     .304884          0          1
provinced~11 |        975    .1076923    .3101505          0          1
provinced~12 |        975    .0225641    .1485854          0          1
provinced~13 |        975    .0492308    .2164605          0          1
-------------+---------------------------------------------------------
provinced~14 |        975    .0482051    .2143094          0          1
provinced~15 |        975    .0810256    .2730145          0          1
          m1 |        975   -.2348152    .1030695  -.6403428  -.0164993
          m2 |        975    .8022729    .6214218   .0167035   2.932487
          m3 |        975   -.3778199    .2581209  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning  male exp expsqr highvocedu highgenedu adultedu parent_seced
> u parent_highedu parent_partymember provincedum2-provincedum15 if inrange(birthyear, 1971, 
> 1992) & inrange(monthlyearning, 200, 16667), sel(educat=male exp expsqr ins1_secgen_entrant
> _relative ins2_highedu_entrant_relative ins3_vs_entrant_relative ) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       975
-------------+----------------------------------   F(26, 948)      =      4.56
       Model |  42.7836964        26  1.64552678   Prob > F        =    0.0000
    Residual |  341.955312       948  .360712354   R-squared       =    0.1112
-------------+----------------------------------   Adj R-squared   =    0.0868
       Total |  384.739008       974  .395009249   Root MSE        =    .60059

------------------------------------------------------------------------------------
gen_log_monthlye~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
              male |   .2561497   .0441374     5.80   0.000     .1695314    .3427679
               exp |   .0099814   .0290826     0.34   0.732    -.0470923    .0670552
            expsqr |  -.0004535   .0007709    -0.59   0.557    -.0019664    .0010595
        highvocedu |   .1875009    .056634     3.31   0.001     .0763584    .2986435
        highgenedu |   .2236398   .0654994     3.41   0.001     .0950993    .3521803
          adultedu |   .0127074   .0896574     0.14   0.887    -.1632425    .1886574
     parent_secedu |    .025332   .0479929     0.53   0.598    -.0688527    .1195166
    parent_highedu |    .078617   .1516112     0.52   0.604    -.2189154    .3761493
parent_partymember |  -.0418092   .0521572    -0.80   0.423    -.1441661    .0605478
      provincedum2 |  -.3000185   .1726656    -1.74   0.083    -.6388694    .0388324
      provincedum3 |  -.4987818    .183384    -2.72   0.007    -.8586673   -.1388963
      provincedum4 |  -.4585986   .2218469    -2.07   0.039    -.8939664   -.0232308
      provincedum5 |  -.0885195   .1431082    -0.62   0.536    -.3693649    .1923259
      provincedum6 |  -.1586405   .1589539    -1.00   0.319    -.4705827    .1533017
      provincedum7 |   -.217621   .1644925    -1.32   0.186    -.5404326    .1051905
      provincedum8 |  -.4302211   .1623997    -2.65   0.008    -.7489255   -.1115167
      provincedum9 |  -.0131883   .1471684    -0.09   0.929    -.3020018    .2756253
     provincedum10 |  -.1265356   .1498358    -0.84   0.399    -.4205839    .1675126
     provincedum11 |  -.2097245   .1597073    -1.31   0.189    -.5231452    .1036962
     provincedum12 |  -.3106827   .1787991    -1.74   0.083    -.6615705    .0402051
     provincedum13 |  -.2775707   .1606777    -1.73   0.084    -.5928959    .0377545
     provincedum14 |  -.2150486   .1744485    -1.23   0.218    -.5573985    .1273013
     provincedum15 |  -.4122565   .1601603    -2.57   0.010    -.7265662   -.0979468
               _m1 |   .2924441   .4300208     0.68   0.497    -.5514587    1.136347
               _m2 |  -.0849917   .1304124    -0.65   0.515     -.340922    .1709385
               _m3 |  -.1782204   .2300285    -0.77   0.439    -.6296443    .2732035
             _cons |   8.204654   .2292868    35.78   0.000     7.754685    8.654622
------------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3723014          .        .       .            .           .
        rho1 |   .4792868          .        .       .            .           .
        rho2 |   -.139293          .        .       .            .           .
        rho3 |  -.2920855          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_se
> cedu parent_highedu parent_partymember provincedum2-provincedum15  m1 m2 m3 if inrange(birt
> hyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), vce(robust)

. eststo
(est8 stored)

. sum gen_log_monthlyearning male exp expsqr highvocedu highgenedu adultedu parent_secedu par
> ent_highedu parent_partymember provincedum2-provincedum15 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |        975    8.238277    .6284976    5.37836   9.645658
        male |        975    .7271795    .4456379          0          1
         exp |        975    12.89333    7.139481          1         32
      expsqr |        975    217.1579    231.3948          1       1024
  highvocedu |        975    .2615385    .4396981          0          1
-------------+---------------------------------------------------------
  highgenedu |        975    .2523077    .4345598          0          1
    adultedu |        975    .0553846    .2288468          0          1
parent_sec~u |        975    .2635897    .4408055          0          1
parent_hig~u |        975    .0184615    .1346823          0          1
parent_par~r |        975    .1897436    .3922994          0          1
-------------+---------------------------------------------------------
provincedum2 |        975         .04    .1960597          0          1
provincedum3 |        975    .0246154    .1550294          0          1
provincedum4 |        975    .0112821    .1056703          0          1
provincedum5 |        975    .0861538    .2807351          0          1
provincedum6 |        975    .0717949    .2582804          0          1
-------------+---------------------------------------------------------
provincedum7 |        975    .0728205     .259975          0          1
provincedum8 |        975    .1251282     .331034          0          1
provincedum9 |        975    .1076923    .3101505          0          1
provinced~10 |        975    .1035897     .304884          0          1
provinced~11 |        975    .1076923    .3101505          0          1
-------------+---------------------------------------------------------
provinced~12 |        975    .0225641    .1485854          0          1
provinced~13 |        975    .0492308    .2164605          0          1
provinced~14 |        975    .0482051    .2143094          0          1
provinced~15 |        975    .0810256    .2730145          0          1
          m1 |        975   -.2348152    .1030695  -.6403428  -.0164993
-------------+---------------------------------------------------------
          m2 |        975    .8022729    .6214218   .0167035   2.932487
          m3 |        975   -.3778199    .2581209  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. 
. 
. ***Table 5 Generation
. 
. local variablenames m1 m2 m3

. local variablelabels ""Upper secondary vocational track selection correction" "Upper second
> ary general track selection correction" "No upper secondary degree selection correction""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. local estlist est1 est2 est3 est4 est5 est6 est7 est8

. 
. outreg2 [`estlist'] using "Table 5/Table5.xls", excel replace pvalue adjr2 drop(provincedum
> *) dec(3) sortvar(male exp expsqr higheredu) title("Table 5 (TakeGaokao 1-4, Parent indicat
> ors 5-8; Sec Voc 1-2, Sec Gen 3-4; Non-specified 1 3 Specified 2 4)") ctitle(" ") addnote("
> More notes") label
Table 5/Table5.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. 
. 
. ***Table 7 with sequence: Unemployment types (A20=5 or A20=5|9) > Two_tracks > Higher_edu C
> ombined/Seperated, 2*2*2=8 columns in total.
. 
. *Prepare
. 
. drop m1 m2 m3

. local folderpath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 
> 3 5 7 9 11"

. local filename "Rural tables"

. local datapath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/20240716 Rural 
> Chip2018 and Instrumental Statistics and Inflation.dta"

. 
. 
. local xlspath "`folderpath'/`filename'.xls"

. 
. eststo clear

. 
. *Columns
. 
. selmlog voc_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bir
> thyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_e
> ntrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(21, 728)      =      1.84
       Model |  .740320282        21  .035253347   Prob > F        =    0.0125
    Residual |  13.9596797       728  .019175384   R-squared       =    0.0504
-------------+----------------------------------   Adj R-squared   =    0.0230
       Total |        14.7       749  .019626168   Root MSE        =    .13848

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0104376   .0105731     0.99   0.324    -.0103199     .031195
          exp |  -.0134256   .0090435    -1.48   0.138    -.0311801    .0043289
       expsqr |   .0003884   .0002425     1.60   0.110    -.0000877    .0008646
    higheredu |   .0167835   .0158947     1.06   0.291    -.0144214    .0479884
 provincedum2 |   .0862648   .0519583     1.66   0.097    -.0157412    .1882708
 provincedum3 |   .0305556   .0545933     0.56   0.576    -.0766235    .1377346
 provincedum4 |    .240973   .0583168     4.13   0.000     .1264838    .3554622
 provincedum5 |   .0330458   .0395321     0.84   0.403    -.0445647    .1106564
 provincedum6 |   .0517481   .0460322     1.12   0.261    -.0386236    .1421199
 provincedum7 |   .0323722   .0475624     0.68   0.496    -.0610037     .125748
 provincedum8 |   .0499596   .0481741     1.04   0.300    -.0446171    .1445363
 provincedum9 |   .0429513   .0428649     1.00   0.317    -.0412023    .1271049
provincedum10 |    .032761   .0443875     0.74   0.461    -.0543818    .1199039
provincedum11 |   .0918362   .0455684     2.02   0.044     .0023751    .1812972
provincedum12 |   .0195146   .0459704     0.42   0.671    -.0707358     .109765
provincedum13 |   .0455826   .0443014     1.03   0.304    -.0413912    .1325563
provincedum14 |   .0376178   .0499021     0.75   0.451    -.0603514    .1355869
provincedum15 |   .0361824   .0518125     0.70   0.485    -.0655374    .1379021
          _m1 |  -.0701945   .0458761    -1.53   0.126    -.1602597    .0198707
          _m2 |   .1343436   .1040961     1.29   0.197    -.0700208    .3387079
          _m3 |  -.0046296   .0348469    -0.13   0.894     -.073042    .0637828
        _cons |   .2065783   .1197444     1.73   0.085    -.0285072    .4416639
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0251212          .        .       .            .           .
        rho1 |  -.4428763          .        .       .            .           .
        rho2 |   .8476106          .        .       .            .           .
        rho3 |  -.0292094          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if in
> range(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =        750
                                                F(21, 728)        =       0.76
                                                Prob > F          =     0.7740
                                                R-squared         =     0.0504
                                                Root MSE          =     .13848

-------------------------------------------------------------------------------
              |               Robust
voc_unemp_A~5 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0104376   .0091383     1.14   0.254    -.0075031    .0283782
          exp |  -.0134256   .0093559    -1.43   0.152    -.0317934    .0049423
       expsqr |   .0003884   .0002524     1.54   0.124    -.0001071    .0008839
    higheredu |   .0167835   .0184759     0.91   0.364    -.0194889    .0530559
 provincedum2 |   .0862648   .0725406     1.19   0.235     -.056149    .2286786
 provincedum3 |   .0305556   .0425495     0.72   0.473    -.0529788    .1140899
 provincedum4 |    .240973   .1507694     1.60   0.110    -.0550216    .5369676
 provincedum5 |   .0330458   .0450354     0.73   0.463    -.0553689    .1214606
 provincedum6 |   .0517481   .0529329     0.98   0.329    -.0521713    .1556675
 provincedum7 |   .0323722   .0461198     0.70   0.483    -.0581716    .1229159
 provincedum8 |   .0499596   .0546679     0.91   0.361     -.057366    .1572852
 provincedum9 |   .0429513   .0466381     0.92   0.357      -.04861    .1345126
provincedum10 |    .032761   .0438626     0.75   0.455    -.0533513    .1188733
provincedum11 |   .0918362   .0530855     1.73   0.084    -.0123827     .196055
provincedum12 |   .0195146   .0391927     0.50   0.619    -.0574297    .0964589
provincedum13 |   .0455826   .0507409     0.90   0.369    -.0540334    .1451985
provincedum14 |   .0376178   .0484259     0.78   0.438    -.0574533    .1326888
provincedum15 |   .0361824   .0479591     0.75   0.451    -.0579723    .1303371
           m1 |  -.0701945   .0389686    -1.80   0.072    -.1466987    .0063098
           m2 |   .1343436   .0907423     1.48   0.139    -.0438043    .3124914
           m3 |  -.0046296   .0174793    -0.26   0.791    -.0389455    .0296863
        _cons |   .2065783   .1097953     1.88   0.060    -.0089748    .4221315
-------------------------------------------------------------------------------

. eststo
(est1 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_re
> lative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(23, 726)      =      1.74
       Model |  .767791651        23  .033382246   Prob > F        =    0.0175
    Residual |  13.9322083       726   .01919037   R-squared       =    0.0522
-------------+----------------------------------   Adj R-squared   =    0.0222
       Total |        14.7       749  .019626168   Root MSE        =    .13853

-------------------------------------------------------------------------------
voc_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0115046   .0106152     1.08   0.279    -.0093356    .0323448
          exp |   -.013274   .0090699    -1.46   0.144    -.0310804    .0045324
       expsqr |   .0003818   .0002432     1.57   0.117    -.0000956    .0008593
   highvocedu |   .0079277   .0200478     0.40   0.693    -.0314309    .0472862
   highgenedu |  -.0075579   .0454105    -0.17   0.868    -.0967095    .0815937
     adultedu |   .0425615   .0274346     1.55   0.121     -.011299    .0964221
 provincedum2 |   .0835936   .0520268     1.61   0.109    -.0185474    .1857346
 provincedum3 |   .0320931   .0546458     0.59   0.557    -.0751895    .1393757
 provincedum4 |   .2380795   .0583929     4.08   0.000     .1234404    .3527185
 provincedum5 |   .0342805   .0396202     0.87   0.387    -.0435033    .1120642
 provincedum6 |   .0525694   .0460677     1.14   0.254    -.0378724    .1430111
 provincedum7 |   .0328057   .0476041     0.69   0.491    -.0606524    .1262639
 provincedum8 |   .0502102   .0482351     1.04   0.298    -.0444867    .1449071
 provincedum9 |   .0427784   .0428831     1.00   0.319    -.0414113    .1269681
provincedum10 |   .0320357   .0444099     0.72   0.471    -.0551515    .1192229
provincedum11 |   .0899183   .0456143     1.97   0.049     .0003665      .17947
provincedum12 |    .017739   .0460124     0.39   0.700    -.0725943    .1080724
provincedum13 |   .0451401   .0443236     1.02   0.309    -.0418775    .1321578
provincedum14 |   .0389464   .0500021     0.78   0.436    -.0592195    .1371123
provincedum15 |   .0358109   .0518474     0.69   0.490    -.0659779    .1375997
          _m1 |  -.0668033   .0459823    -1.45   0.147    -.1570775    .0234708
          _m2 |   .1295513   .1043294     1.24   0.215     -.075272    .3343747
          _m3 |  -.0050161    .034862    -0.14   0.886    -.0734586    .0634264
        _cons |   .1991617   .1201845     1.66   0.098    -.0367889    .4351123
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0245524          .        .       .            .           .
        rho1 |  -.4263349          .        .       .            .           .
        rho2 |   .8267888          .        .       .            .           .
        rho3 |  -.0320125          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 m1 m2 m3 if inrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =        750
                                                F(23, 726)        =       0.69
                                                Prob > F          =     0.8587
                                                R-squared         =     0.0522
                                                Root MSE          =     .13853

-------------------------------------------------------------------------------
              |               Robust
voc_unemp_A~5 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0115046    .009747     1.18   0.238     -.007631    .0306403
          exp |   -.013274   .0092792    -1.43   0.153    -.0314913    .0049432
       expsqr |   .0003818   .0002494     1.53   0.126    -.0001078    .0008715
   highvocedu |   .0079277   .0171604     0.46   0.644    -.0257624    .0416177
   highgenedu |  -.0075579    .009382    -0.81   0.421    -.0259769    .0108612
     adultedu |   .0425615   .0495187     0.86   0.390    -.0546553    .1397784
 provincedum2 |   .0835936   .0732048     1.14   0.254    -.0601247    .2273119
 provincedum3 |   .0320931   .0421513     0.76   0.447    -.0506598    .1148461
 provincedum4 |   .2380795   .1520858     1.57   0.118     -.060501    .5366599
 provincedum5 |   .0342805   .0437527     0.78   0.434    -.0516164    .1201774
 provincedum6 |   .0525694   .0524313     1.00   0.316    -.0503658    .1555045
 provincedum7 |   .0328057   .0454838     0.72   0.471    -.0564897    .1221012
 provincedum8 |   .0502102   .0546969     0.92   0.359    -.0571729    .1575932
 provincedum9 |   .0427784    .046493     0.92   0.358    -.0484983    .1340551
provincedum10 |   .0320357   .0437135     0.73   0.464    -.0537843    .1178557
provincedum11 |   .0899183   .0527759     1.70   0.089    -.0136933    .1935299
provincedum12 |    .017739   .0395213     0.45   0.654    -.0598506    .0953287
provincedum13 |   .0451401   .0505366     0.89   0.372    -.0540753    .1443555
provincedum14 |   .0389464   .0483507     0.81   0.421    -.0559774    .1338702
provincedum15 |   .0358109   .0474934     0.75   0.451    -.0574298    .1290517
           m1 |  -.0668033   .0395304    -1.69   0.091    -.1444109    .0108042
           m2 |   .1295513   .0905475     1.43   0.153    -.0482148    .3073175
           m3 |  -.0050161   .0174622    -0.29   0.774    -.0392984    .0292662
        _cons |   .1991617   .1085254     1.84   0.067    -.0138994    .4122228
-------------------------------------------------------------------------------

. eststo
(est2 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bir
> thyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_e
> ntrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(21, 1419)     =      0.67
       Model |  .269072248        21  .012812964   Prob > F        =    0.8666
    Residual |  27.1868611     1,419  .019159169   R-squared       =    0.0098
-------------+----------------------------------   Adj R-squared   =   -0.0049
       Total |  27.4559334     1,440   .01906662   Root MSE        =    .13842

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0025805   .0075012    -0.34   0.731    -.0172952    .0121342
          exp |  -.0031663   .0053501    -0.59   0.554    -.0136612    .0073286
       expsqr |   .0000592   .0001448     0.41   0.683    -.0002248    .0003433
    higheredu |  -.0054876   .0094107    -0.58   0.560     -.023948    .0129728
 provincedum2 |   .0172175   .0321667     0.54   0.593     -.045882     .080317
 provincedum3 |   .0176055   .0311009     0.57   0.571    -.0434032    .0786142
 provincedum4 |  -.0054937   .0423776    -0.13   0.897    -.0886233    .0776358
 provincedum5 |   .0109706   .0261461     0.42   0.675    -.0403186    .0622598
 provincedum6 |  -.0030196    .028806    -0.10   0.917    -.0595266    .0534874
 provincedum7 |   .0390831   .0298874     1.31   0.191    -.0195452    .0977114
 provincedum8 |   .0097655   .0290711     0.34   0.737    -.0472616    .0667925
 provincedum9 |   .0372088   .0268296     1.39   0.166    -.0154212    .0898387
provincedum10 |   .0161585   .0270832     0.60   0.551    -.0369689    .0692859
provincedum11 |   .0203022   .0290355     0.70   0.485     -.036655    .0772593
provincedum12 |  -.0076232   .0322798    -0.24   0.813    -.0709445    .0556981
provincedum13 |   .0226324   .0289474     0.78   0.434     -.034152    .0794168
provincedum14 |   .0147503   .0315003     0.47   0.640    -.0470418    .0765424
provincedum15 |   .0175286   .0294429     0.60   0.552    -.0402276    .0752848
          _m1 |  -.0700863   .0795522    -0.88   0.378    -.2261388    .0859662
          _m2 |   .0076611   .0238266     0.32   0.748    -.0390782    .0544003
          _m3 |  -.0136144   .0435634    -0.31   0.755      -.09907    .0718412
        _cons |   .0074777   .0402188     0.19   0.853     -.071417    .0863723
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0199994          .        .       .            .           .
        rho1 |  -.4955926          .        .       .            .           .
        rho2 |   .0541727          .        .       .            .           .
        rho3 |    -.09627          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if in
> range(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =      1,441
                                                F(21, 1419)       =       1.33
                                                Prob > F          =     0.1449
                                                R-squared         =     0.0098
                                                Root MSE          =     .13842

-------------------------------------------------------------------------------
              |               Robust
gen_unemp_A~5 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0025805   .0076093    -0.34   0.735    -.0175072    .0123462
          exp |  -.0031663   .0043897    -0.72   0.471    -.0117773    .0054447
       expsqr |   .0000592   .0001054     0.56   0.574    -.0001475    .0002659
    higheredu |  -.0054876   .0097069    -0.57   0.572     -.024529    .0135539
 provincedum2 |   .0172175   .0240941     0.71   0.475    -.0300464    .0644815
 provincedum3 |   .0176055    .023347     0.75   0.451    -.0281928    .0634038
 provincedum4 |  -.0054937   .0124199    -0.44   0.658     -.029857    .0188695
 provincedum5 |   .0109706   .0175752     0.62   0.533    -.0235055    .0454467
 provincedum6 |  -.0030196   .0144928    -0.21   0.835    -.0314492      .02541
 provincedum7 |   .0390831   .0247526     1.58   0.115    -.0094726    .0876387
 provincedum8 |   .0097655   .0166104     0.59   0.557    -.0228181    .0423491
 provincedum9 |   .0372088   .0217764     1.71   0.088    -.0055086    .0799262
provincedum10 |   .0161585   .0156083     1.04   0.301    -.0144593    .0467763
provincedum11 |   .0203022   .0243517     0.83   0.405     -.027467    .0680713
provincedum12 |  -.0076232   .0133057    -0.57   0.567    -.0337241    .0184778
provincedum13 |   .0226324   .0217217     1.04   0.298    -.0199776    .0652424
provincedum14 |   .0147503   .0176252     0.84   0.403    -.0198239    .0493245
provincedum15 |   .0175286   .0184529     0.95   0.342    -.0186693    .0537266
           m1 |  -.0700863    .070612    -0.99   0.321    -.2086013    .0684288
           m2 |   .0076611   .0211837     0.36   0.718    -.0338937    .0492158
           m3 |  -.0136144    .033506    -0.41   0.685    -.0793411    .0521122
        _cons |   .0074777   .0296648     0.25   0.801    -.0507139    .0656692
-------------------------------------------------------------------------------

. eststo
(est3 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_re
> lative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(23, 1417)     =      0.96
       Model |    .4222459        23  .018358517   Prob > F        =    0.5128
    Residual |  27.0336875     1,417  .019078114   R-squared       =    0.0154
-------------+----------------------------------   Adj R-squared   =   -0.0006
       Total |  27.4559334     1,440   .01906662   Root MSE        =    .13812

-------------------------------------------------------------------------------
gen_unemp_A~5 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0015687   .0074943    -0.21   0.834    -.0162697    .0131323
          exp |  -.0039105   .0053512    -0.73   0.465    -.0144075    .0065866
       expsqr |   .0000679   .0001446     0.47   0.639    -.0002158    .0003516
   highvocedu |  -.0123132   .0105204    -1.17   0.242    -.0329504    .0083241
   highgenedu |  -.0173432   .0123089    -1.41   0.159    -.0414887    .0068024
     adultedu |   .0362201   .0176714     2.05   0.041     .0015551    .0708851
 provincedum2 |   .0108008   .0322128     0.34   0.737     -.052389    .0739907
 provincedum3 |   .0165116   .0311058     0.53   0.596    -.0445067    .0775298
 provincedum4 |  -.0078248   .0423198    -0.18   0.853     -.090841    .0751914
 provincedum5 |   .0084104   .0261126     0.32   0.747    -.0428132    .0596339
 provincedum6 |  -.0048138   .0287684    -0.17   0.867    -.0612471    .0516195
 provincedum7 |   .0356906   .0298686     1.19   0.232    -.0229008     .094282
 provincedum8 |   .0056742   .0290852     0.20   0.845    -.0513805     .062729
 provincedum9 |   .0344876   .0268138     1.29   0.199    -.0181115    .0870867
provincedum10 |   .0124904   .0271192     0.46   0.645    -.0407077    .0656885
provincedum11 |   .0151235   .0290459     0.52   0.603     -.041854     .072101
provincedum12 |  -.0160393   .0323522    -0.50   0.620    -.0795026     .047424
provincedum13 |   .0162272   .0289885     0.56   0.576    -.0406377    .0730922
provincedum14 |   .0095758   .0315359     0.30   0.761    -.0522862    .0714379
provincedum15 |   .0135576   .0295181     0.46   0.646    -.0443463    .0714615
          _m1 |  -.0533711   .0802736    -0.66   0.506     -.210839    .1040968
          _m2 |   .0071694   .0237931     0.30   0.763    -.0395041    .0538429
          _m3 |  -.0086439   .0435232    -0.20   0.843    -.0940208    .0767329
        _cons |   .0270165   .0414393     0.65   0.515    -.0542725    .1083054
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0194259          .        .       .            .           .
        rho1 |  -.3829266          .        .       .            .           .
        rho2 |   .0514392          .        .       .            .           .
        rho3 |  -.0620186          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_5 male exp expsqr highvocedu highgenedu adultedu provincedum2-provinc
> edum15 m1 m2 m3 if inrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =      1,441
                                                F(23, 1417)       =       1.19
                                                Prob > F          =     0.2451
                                                R-squared         =     0.0154
                                                Root MSE          =     .13812

-------------------------------------------------------------------------------
              |               Robust
gen_unemp_A~5 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0015687   .0076233    -0.21   0.837    -.0165228    .0133854
          exp |  -.0039105   .0043327    -0.90   0.367    -.0124097    .0045887
       expsqr |   .0000679   .0001041     0.65   0.514    -.0001363    .0002721
   highvocedu |  -.0123132    .009783    -1.26   0.208    -.0315039    .0068776
   highgenedu |  -.0173432    .010878    -1.59   0.111    -.0386819    .0039956
     adultedu |   .0362201   .0280042     1.29   0.196     -.018714    .0911542
 provincedum2 |   .0108008    .024289     0.44   0.657    -.0368454     .058447
 provincedum3 |   .0165116   .0232704     0.71   0.478    -.0291366    .0621597
 provincedum4 |  -.0078248   .0126222    -0.62   0.535    -.0325849    .0169354
 provincedum5 |   .0084104   .0178715     0.47   0.638    -.0266471    .0434678
 provincedum6 |  -.0048138   .0146358    -0.33   0.742    -.0335239    .0238963
 provincedum7 |   .0356906   .0251047     1.42   0.155    -.0135557    .0849369
 provincedum8 |   .0056742   .0165075     0.34   0.731    -.0267075    .0380559
 provincedum9 |   .0344876   .0215729     1.60   0.110    -.0078307     .076806
provincedum10 |   .0124904   .0158151     0.79   0.430    -.0185331    .0435139
provincedum11 |   .0151235    .024237     0.62   0.533    -.0324209    .0626678
provincedum12 |  -.0160393   .0150888    -1.06   0.288    -.0456381    .0135595
provincedum13 |   .0162272   .0220048     0.74   0.461    -.0269382    .0593927
provincedum14 |   .0095758     .01831     0.52   0.601    -.0263417    .0454934
provincedum15 |   .0135576   .0184535     0.73   0.463    -.0226416    .0497568
           m1 |  -.0533711   .0664234    -0.80   0.422    -.1836699    .0769278
           m2 |   .0071694   .0209801     0.34   0.733    -.0339861    .0483249
           m3 |  -.0086439   .0333736    -0.26   0.796    -.0741109     .056823
        _cons |   .0270165   .0272515     0.99   0.322    -.0264412    .0804742
-------------------------------------------------------------------------------

. eststo
(est4 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bi
> rthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_
> entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(21, 728)      =      1.91
       Model |  1.64868031        21  .078508586   Prob > F        =    0.0084
    Residual |  29.8993197       728  .041070494   R-squared       =    0.0523
-------------+----------------------------------   Adj R-squared   =    0.0249
       Total |      31.548       749   .04212016   Root MSE        =    .20266

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0259365   .0154738    -1.68   0.094     -.056315     .004442
          exp |  -.0017204   .0132352    -0.13   0.897    -.0277042    .0242634
       expsqr |   .0001899   .0003549     0.54   0.593    -.0005069    .0008868
    higheredu |  -.0056635   .0232619    -0.24   0.808    -.0513319    .0400048
 provincedum2 |   .1117516    .076041     1.47   0.142    -.0375342    .2610374
 provincedum3 |   .0904872   .0798973     1.13   0.258    -.0663693    .2473438
 provincedum4 |   .3339352   .0853467     3.91   0.000     .1663802    .5014902
 provincedum5 |   .0338625   .0578553     0.59   0.559    -.0797206    .1474457
 provincedum6 |   .0151345   .0673682     0.22   0.822    -.1171247    .1473936
 provincedum7 |   .0083854   .0696076     0.12   0.904    -.1282702     .145041
 provincedum8 |   .0174501   .0705028     0.25   0.805     -.120963    .1558632
 provincedum9 |   .0399018   .0627328     0.64   0.525     -.083257    .1630606
provincedum10 |   .0823275   .0649612     1.27   0.205    -.0452062    .2098611
provincedum11 |   .0742631   .0666893     1.11   0.266    -.0566632    .2051894
provincedum12 |  -.0028224   .0672777    -0.04   0.967    -.1349039    .1292592
provincedum13 |   .0836005   .0648351     1.29   0.198    -.0436856    .2108867
provincedum14 |   .0431758   .0730317     0.59   0.555    -.1002021    .1865537
provincedum15 |   .0281454   .0758276     0.37   0.711    -.1207215    .1770123
          _m1 |  -.0923982   .0671397    -1.38   0.169    -.2242087    .0394123
          _m2 |  -.0559348   .1523447    -0.37   0.714    -.3550221    .2431526
          _m3 |  -.0095444   .0509984    -0.19   0.852     -.109666    .0905771
        _cons |   .0896737    .175246     0.51   0.609    -.2543741    .4337215
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0458762          .        .       .            .           .
        rho1 |  -.4313898          .        .       .            .           .
        rho2 |  -.2611488          .        .       .            .           .
        rho3 |   -.044561          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if i
> nrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =        750
                                                F(21, 728)        =       1.66
                                                Prob > F          =     0.0325
                                                R-squared         =     0.0523
                                                Root MSE          =     .20266

-------------------------------------------------------------------------------
              |               Robust
voc_unemp_~59 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0259365   .0155203    -1.67   0.095    -.0564064    .0045334
          exp |  -.0017204   .0124171    -0.14   0.890    -.0260981    .0226573
       expsqr |   .0001899   .0003237     0.59   0.558    -.0004455    .0008253
    higheredu |  -.0056635   .0238869    -0.24   0.813     -.052559    .0412319
 provincedum2 |   .1117516   .0875554     1.28   0.202    -.0601396    .2836428
 provincedum3 |   .0904872    .076224     1.19   0.236    -.0591579    .2401324
 provincedum4 |   .3339352   .1678035     1.99   0.047     .0044987    .6633716
 provincedum5 |   .0338625   .0540422     0.63   0.531    -.0722346    .1399597
 provincedum6 |   .0151345   .0644217     0.23   0.814    -.1113399    .1416089
 provincedum7 |   .0083854   .0603647     0.14   0.890    -.1101243    .1268951
 provincedum8 |   .0174501   .0692043     0.25   0.801    -.1184136    .1533138
 provincedum9 |   .0399018   .0617026     0.65   0.518    -.0812344     .161038
provincedum10 |   .0823275   .0686982     1.20   0.231    -.0525428    .2171977
provincedum11 |   .0742631   .0683614     1.09   0.278    -.0599459    .2084721
provincedum12 |  -.0028224   .0508079    -0.06   0.956    -.1025699    .0969252
provincedum13 |   .0836005   .0646645     1.29   0.196    -.0433507    .2105518
provincedum14 |   .0431758   .0696147     0.62   0.535    -.0934937    .1798454
provincedum15 |   .0281454   .0631989     0.45   0.656    -.0959284    .1522192
           m1 |  -.0923982   .0568729    -1.62   0.105    -.2040526    .0192562
           m2 |  -.0559348   .1373321    -0.41   0.684     -.325549    .2136795
           m3 |  -.0095444   .0204378    -0.47   0.641    -.0496685    .0305796
        _cons |   .0896737   .1555211     0.58   0.564    -.2156496    .3949971
-------------------------------------------------------------------------------

. eststo
(est5 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_r
> elative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       750
-------------+----------------------------------   F(23, 726)      =      1.83
       Model |  1.73218228        23  .075312273   Prob > F        =    0.0101
    Residual |  29.8158177       726  .041068619   R-squared       =    0.0549
-------------+----------------------------------   Adj R-squared   =    0.0250
       Total |      31.548       749   .04212016   Root MSE        =    .20265

-------------------------------------------------------------------------------
voc_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.024125    .015529    -1.55   0.121    -.0546121     .006362
          exp |   -.001269   .0132683    -0.10   0.924    -.0273179    .0247799
       expsqr |   .0001738   .0003558     0.49   0.625    -.0005246    .0008723
   highvocedu |  -.0238661   .0293278    -0.81   0.416    -.0814436    .0337114
   highgenedu |  -.0364055   .0664309    -0.55   0.584     -.166825     .094014
     adultedu |   .0406057   .0401339     1.01   0.312    -.0381867    .1193981
 provincedum2 |   .1070887   .0761098     1.41   0.160    -.0423329    .2565104
 provincedum3 |    .092741    .079941     1.16   0.246    -.0642023    .2496842
 provincedum4 |   .3287596   .0854227     3.85   0.000     .1610547    .4964646
 provincedum5 |   .0366442   .0579602     0.63   0.527    -.0771454    .1504337
 provincedum6 |   .0168725   .0673922     0.25   0.802    -.1154344    .1491793
 provincedum7 |   .0095666   .0696398     0.14   0.891    -.1271529    .1462861
 provincedum8 |   .0172781   .0705629     0.24   0.807    -.1212536    .1558099
 provincedum9 |   .0395057   .0627335     0.63   0.529    -.0836551    .1626665
provincedum10 |   .0811601   .0649671     1.25   0.212    -.0463857    .2087058
provincedum11 |   .0709484    .066729     1.06   0.288    -.0600565    .2019532
provincedum12 |  -.0058537   .0673114    -0.09   0.931    -.1380019    .1262946
provincedum13 |   .0830003   .0648407     1.28   0.201    -.0442974    .2102981
provincedum14 |   .0446819   .0731478     0.61   0.541    -.0989245    .1882884
provincedum15 |   .0278643   .0758474     0.37   0.713    -.1210421    .1767707
          _m1 |  -.0864639   .0672673    -1.29   0.199    -.2185256    .0455977
          _m2 |  -.0656814    .152623    -0.43   0.667    -.3653165    .2339538
          _m3 |  -.0102305   .0509995    -0.20   0.841    -.1103547    .0898936
        _cons |   .0746256   .1758173     0.42   0.671    -.2705455    .4197967
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .045311          .        .       .            .           .
        rho1 |  -.4061938          .        .       .            .           .
        rho2 |  -.3085606          .        .       .            .           .
        rho3 |  -.0480615          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =        750
                                                F(23, 726)        =       1.51
                                                Prob > F          =     0.0593
                                                R-squared         =     0.0549
                                                Root MSE          =     .20265

-------------------------------------------------------------------------------
              |               Robust
voc_unemp_~59 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.024125   .0157997    -1.53   0.127    -.0551435    .0068934
          exp |   -.001269   .0123673    -0.10   0.918    -.0255489    .0230109
       expsqr |   .0001738   .0003208     0.54   0.588    -.0004561    .0008037
   highvocedu |  -.0238661   .0195999    -1.22   0.224    -.0623453    .0146131
   highgenedu |  -.0364055   .0188497    -1.93   0.054    -.0734119     .000601
     adultedu |   .0406057   .0623019     0.65   0.515    -.0817077    .1629191
 provincedum2 |   .1070887   .0881116     1.22   0.225    -.0658953    .2800727
 provincedum3 |    .092741    .076184     1.22   0.224    -.0568263    .2423082
 provincedum4 |   .3287596   .1699131     1.93   0.053      -.00482    .6623393
 provincedum5 |   .0366442   .0532515     0.69   0.492    -.0679011    .1411895
 provincedum6 |   .0168725   .0639872     0.26   0.792    -.1087495    .1424944
 provincedum7 |   .0095666   .0598749     0.16   0.873     -.107982    .1271151
 provincedum8 |   .0172781   .0690729     0.25   0.803    -.1183283    .1528846
 provincedum9 |   .0395057   .0614181     0.64   0.520    -.0810726     .160084
provincedum10 |   .0811601   .0684542     1.19   0.236    -.0532318    .2155519
provincedum11 |   .0709484   .0671156     1.06   0.291    -.0608155    .2027122
provincedum12 |  -.0058537   .0507328    -0.12   0.908    -.1054542    .0937469
provincedum13 |   .0830003   .0643645     1.29   0.198    -.0433624     .209363
provincedum14 |   .0446819   .0697185     0.64   0.522    -.0921921    .1815559
provincedum15 |   .0278643   .0627059     0.44   0.657    -.0952423    .1509709
           m1 |  -.0864639   .0569735    -1.52   0.130    -.1983164    .0253885
           m2 |  -.0656814   .1366999    -0.48   0.631    -.3340555    .2026928
           m3 |  -.0102305   .0206181    -0.50   0.620    -.0507087    .0302476
        _cons |   .0746256   .1542674     0.48   0.629    -.2282379    .3774891
-------------------------------------------------------------------------------

. eststo
(est6 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 if inrange(bi
> rthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_
> entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(21, 1419)     =      1.51
       Model |  1.15722158        21  .055105789   Prob > F        =    0.0643
    Residual |  51.7435418     1,419  .036464793   R-squared       =    0.0219
-------------+----------------------------------   Adj R-squared   =    0.0074
       Total |  52.9007634     1,440  .036736641   Root MSE        =    .19096

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    -.03069   .0103486    -2.97   0.003    -.0509902   -.0103898
          exp |  -.0005888   .0073809    -0.08   0.936    -.0150674    .0138898
       expsqr |   .0000113   .0001998     0.06   0.955    -.0003806    .0004032
    higheredu |   -.015178   .0129829    -1.17   0.243    -.0406457    .0102897
 provincedum2 |    .029631   .0443768     0.67   0.504    -.0574201    .1166821
 provincedum3 |    .016721   .0429063     0.39   0.697    -.0674456    .1008877
 provincedum4 |   .0512463   .0584636     0.88   0.381     -.063438    .1659306
 provincedum5 |   .0169816   .0360708     0.47   0.638    -.0537762    .0877394
 provincedum6 |    .000062   .0397404     0.00   0.999    -.0778942    .0780182
 provincedum7 |   .0302796   .0412323     0.73   0.463    -.0506031    .1111623
 provincedum8 |   .0230042   .0401061     0.57   0.566    -.0556695    .1016779
 provincedum9 |   .0806006   .0370137     2.18   0.030     .0079931    .1532081
provincedum10 |   .0465272   .0373636     1.25   0.213    -.0267666     .119821
provincedum11 |   .0168816   .0400569     0.42   0.673    -.0616956    .0954588
provincedum12 |   .0456326   .0445328     1.02   0.306    -.0417245    .1329898
provincedum13 |   .0166805   .0399355     0.42   0.676    -.0616584    .0950194
provincedum14 |   .0147158   .0434573     0.34   0.735    -.0705317    .0999632
provincedum15 |   .0192742   .0406189     0.47   0.635    -.0604055    .0989538
          _m1 |  -.0377021    .109749    -0.34   0.731    -.2529899    .1775857
          _m2 |   .0007021   .0328709     0.02   0.983    -.0637786    .0651829
          _m3 |   .0387285   .0600994     0.64   0.519    -.0791648    .1566218
        _cons |   .0470095   .0554852     0.85   0.397    -.0618324    .1558514
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0361847          .        .       .            .           .
        rho1 |  -.1981995          .        .       .            .           .
        rho2 |   .0036912          .        .       .            .           .
        rho3 |   .2035953          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if i
> nrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =      1,441
                                                F(21, 1419)       =       1.06
                                                Prob > F          =     0.3883
                                                R-squared         =     0.0219
                                                Root MSE          =     .19096

-------------------------------------------------------------------------------
              |               Robust
gen_unemp_~59 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |    -.03069   .0111688    -2.75   0.006    -.0525992   -.0087808
          exp |  -.0005888   .0059636    -0.10   0.921    -.0122873    .0111097
       expsqr |   .0000113   .0001414     0.08   0.937    -.0002661    .0002886
    higheredu |   -.015178   .0132693    -1.14   0.253    -.0412076    .0108516
 provincedum2 |    .029631   .0363439     0.82   0.415    -.0416625    .1009245
 provincedum3 |    .016721   .0291671     0.57   0.567    -.0404943    .0739364
 provincedum4 |   .0512463   .0670479     0.76   0.445    -.0802774      .18277
 provincedum5 |   .0169816   .0236351     0.72   0.473     -.029382    .0633452
 provincedum6 |    .000062   .0244202     0.00   0.998    -.0478415    .0479656
 provincedum7 |   .0302796   .0315693     0.96   0.338    -.0316479    .0922071
 provincedum8 |   .0230042     .02845     0.81   0.419    -.0328044    .0788128
 provincedum9 |   .0806006   .0327545     2.46   0.014     .0163482    .1448531
provincedum10 |   .0465272   .0255191     1.82   0.068     -.003532    .0965864
provincedum11 |   .0168816   .0311344     0.54   0.588    -.0441928    .0779561
provincedum12 |   .0456326     .03857     1.18   0.237    -.0300277     .121293
provincedum13 |   .0166805   .0278171     0.60   0.549    -.0378866    .0712476
provincedum14 |   .0147158   .0301754     0.49   0.626    -.0444774     .073909
provincedum15 |   .0192742   .0314689     0.61   0.540    -.0424564    .0810047
           m1 |  -.0377021   .0933634    -0.40   0.686    -.2208471     .145443
           m2 |   .0007021   .0314257     0.02   0.982    -.0609436    .0623479
           m3 |   .0387285   .0617326     0.63   0.531    -.0823685    .1598254
        _cons |   .0470095   .0496735     0.95   0.344     -.050432    .1444509
-------------------------------------------------------------------------------

. eststo
(est7 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_r
> elative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,441
-------------+----------------------------------   F(23, 1417)     =      1.50
       Model |  1.25854091        23   .05471917   Prob > F        =    0.0600
    Residual |  51.6422224     1,417  .036444758   R-squared       =    0.0238
-------------+----------------------------------   Adj R-squared   =    0.0079
       Total |  52.9007634     1,440  .036736641   Root MSE        =    .19091

-------------------------------------------------------------------------------
gen_unemp_~59 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0298546   .0103581    -2.88   0.004    -.0501733   -.0095358
          exp |   -.001349    .007396    -0.18   0.855    -.0158573    .0131593
       expsqr |   .0000217   .0001999     0.11   0.914    -.0003705    .0004138
   highvocedu |  -.0174059   .0145406    -1.20   0.231    -.0459293    .0111176
   highgenedu |  -.0293253   .0170125    -1.72   0.085    -.0626977    .0040471
     adultedu |   .0149196   .0244243     0.61   0.541    -.0329919    .0628312
 provincedum2 |   .0235871   .0445223     0.53   0.596    -.0637496    .1109239
 provincedum3 |   .0143511   .0429923     0.33   0.739    -.0699842    .0986865
 provincedum4 |   .0483969   .0584916     0.83   0.408    -.0663425    .1631364
 provincedum5 |   .0145869   .0360911     0.40   0.686    -.0562109    .0853847
 provincedum6 |  -.0020404   .0397618    -0.05   0.959    -.0800388    .0759579
 provincedum7 |   .0268483   .0412824     0.65   0.516    -.0541329    .1078294
 provincedum8 |   .0187272   .0401996     0.47   0.641      -.06013    .0975844
 provincedum9 |   .0776671   .0370603     2.10   0.036     .0049682    .1503661
provincedum10 |   .0423397   .0374824     1.13   0.259    -.0311871    .1158666
provincedum11 |   .0122189   .0401453     0.30   0.761    -.0665316    .0909694
provincedum12 |   .0387718    .044715     0.87   0.386    -.0489429    .1264866
provincedum13 |   .0110795   .0400659     0.28   0.782    -.0675154    .0896745
provincedum14 |    .009424   .0435868     0.22   0.829    -.0760775    .0949256
provincedum15 |   .0143795   .0407979     0.35   0.725    -.0656513    .0944103
          _m1 |  -.0171521   .1109488    -0.15   0.877    -.2347937    .2004895
          _m2 |  -.0003291   .0328852    -0.01   0.992    -.0648381    .0641799
          _m3 |   .0434489   .0601549     0.72   0.470    -.0745533     .161451
        _cons |   .0677479   .0572746     1.18   0.237    -.0446043       .1801
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .0358472          .        .       .            .           .
        rho1 |   -.090592          .        .       .            .           .
        rho2 |  -.0017384          .        .       .            .           .
        rho3 |   .2294832          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_unemp_A20_59 male exp expsqr highvocedu highgenedu adultedu provincedum2-provin
> cedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =      1,441
                                                F(23, 1417)       =       1.27
                                                Prob > F          =     0.1735
                                                R-squared         =     0.0238
                                                Root MSE          =     .19091

-------------------------------------------------------------------------------
              |               Robust
gen_unemp_~59 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0298546   .0112439    -2.66   0.008    -.0519111    -.007798
          exp |   -.001349   .0059574    -0.23   0.821    -.0130353    .0103373
       expsqr |   .0000217   .0001408     0.15   0.878    -.0002545    .0002979
   highvocedu |  -.0174059    .014194    -1.23   0.220    -.0452493    .0104376
   highgenedu |  -.0293253   .0171485    -1.71   0.087    -.0629645    .0043139
     adultedu |   .0149196   .0291872     0.51   0.609    -.0423351    .0721744
 provincedum2 |   .0235871   .0369611     0.64   0.523    -.0489173    .0960916
 provincedum3 |   .0143511   .0296728     0.48   0.629    -.0438562    .0725585
 provincedum4 |   .0483969   .0668303     0.72   0.469    -.0827001     .179494
 provincedum5 |   .0145869   .0239497     0.61   0.543    -.0323938    .0615676
 provincedum6 |  -.0020404   .0247529    -0.08   0.934    -.0505967    .0465159
 provincedum7 |   .0268483   .0321442     0.84   0.404    -.0362071    .0899036
 provincedum8 |   .0187272   .0288799     0.65   0.517    -.0379248    .0753791
 provincedum9 |   .0776671   .0330331     2.35   0.019     .0128682    .1424661
provincedum10 |   .0423397   .0260889     1.62   0.105    -.0088372    .0935167
provincedum11 |   .0122189   .0313653     0.39   0.697    -.0493084    .0737462
provincedum12 |   .0387718   .0400232     0.97   0.333    -.0397393     .117283
provincedum13 |   .0110795   .0283451     0.39   0.696    -.0445233    .0666823
provincedum14 |    .009424   .0312368     0.30   0.763    -.0518514    .0706994
provincedum15 |   .0143795    .032278     0.45   0.656    -.0489383    .0776973
           m1 |  -.0171521   .0945769    -0.18   0.856     -.202678    .1683738
           m2 |  -.0003291   .0314656    -0.01   0.992    -.0620533    .0613951
           m3 |   .0434489   .0619427     0.70   0.483    -.0780603    .1649581
        _cons |   .0677479   .0522637     1.30   0.195    -.0347746    .1702704
-------------------------------------------------------------------------------

. eststo
(est8 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. 
. ***Table 7 Generation
. 
. local variablenames m1 m2 m3

. local variablelabels ""Upper secondary vocational track selection correction" "Upper second
> ary general track selection correction" "No upper secondary degree selection correction""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. 
. local estlist est1 est2 est3 est4 est5 est6 est7 est8

. 
. outreg2 [`estlist'] using "Table 7/Table7.xls", excel replace pvalue adjr2 drop(provincedum
> *) dec(3) sortvar(male exp expsqr higheredu) title("Table 7 (Unemployment A20=5 1-4 A20=5|9
>  5-8; Sec Voc 1-2 5-6, Sec Gen 3-4 7-8; Non-specified 1 3 5 7 Specified 2 4 6 8)") ctitle("
>  ") addnote("More notes") label
Table 7/Table7.xls
dir : seeout

. 
. 
. 
. 
. ***Table 9 with sequence: Occupytion or Contract > Two_tracks > Higher_edu Combined/Seperat
> ed, 2*2*2=8 columns in total.
. 
. *Prepare
. 
. drop m1 m2 m3

. local folderpath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 
> 3 5 7 9 11"

. local filename "Rural tables"

. local datapath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/20240716 Rural 
> Chip2018 and Instrumental Statistics and Inflation.dta"

. 
. 
. local xlspath "`folderpath'/`filename'.xls"

. 
. eststo clear

. 
. *Columns
. 
. selmlog voc_highocc male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entra
> nt_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       648
-------------+----------------------------------   F(21, 626)      =      2.93
       Model |  10.6802385        21  .508582787   Prob > F        =    0.0000
    Residual |   108.79507       626  .173794042   R-squared       =    0.0894
-------------+----------------------------------   Adj R-squared   =    0.0588
       Total |  119.475309       647  .184660446   Root MSE        =    .41689

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0681879   .0352976     1.93   0.054     -.001128    .1375039
          exp |  -.0668759   .0287088    -2.33   0.020    -.1232531   -.0104986
       expsqr |   .0019315   .0007715     2.50   0.013     .0004165    .0034465
    higheredu |    .229959   .0511118     4.50   0.000     .1295877    .3303303
 provincedum2 |   .0179999   .1664128     0.11   0.914     -.308795    .3447948
 provincedum3 |  -.1693464   .1922227    -0.88   0.379    -.5468258    .2081329
 provincedum4 |  -.1341769   .2016634    -0.67   0.506    -.5301957    .2618419
 provincedum5 |  -.1311393   .1226652    -1.07   0.285    -.3720245    .1097458
 provincedum6 |   .0725843   .1427572     0.51   0.611    -.2077567    .3529252
 provincedum7 |  -.1470416    .148409    -0.99   0.322    -.4384814    .1443981
 provincedum8 |  -.0766422   .1490827    -0.51   0.607    -.3694049    .2161205
 provincedum9 |  -.1379311   .1333809    -1.03   0.301    -.3998593     .123997
provincedum10 |  -.0668042   .1390959    -0.48   0.631    -.3399552    .2063468
provincedum11 |  -.1097579   .1415772    -0.78   0.438    -.3877817    .1682658
provincedum12 |  -.0160431   .1402977    -0.11   0.909    -.2915542     .259468
provincedum13 |    .030434   .1390063     0.22   0.827    -.2425411    .3034091
provincedum14 |  -.0063653   .1546429    -0.04   0.967     -.310047    .2973164
provincedum15 |   .0694371   .1608622     0.43   0.666    -.2464577    .3853319
          _m1 |   .0370285   .1458655     0.25   0.800    -.2494165    .3234734
          _m2 |  -.0462837   .3267706    -0.14   0.887    -.6879831    .5954157
          _m3 |  -.1807316   .1062275    -1.70   0.089    -.3893369    .0278738
        _cons |   .5637108   .3791276     1.49   0.138    -.1808051    1.308227
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1677952          .        .       .            .           .
        rho1 |   .0903953          .        .       .            .           .
        rho2 |  -.1129896          .        .       .            .           .
        rho3 |  -.4412089          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inrang
> e(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =        648
                                                F(21, 626)        =       2.99
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0894
                                                Root MSE          =     .41689

-------------------------------------------------------------------------------
              |               Robust
  voc_highocc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0681879   .0337081     2.02   0.044     .0019932    .1343827
          exp |  -.0668759   .0291032    -2.30   0.022    -.1240275   -.0097242
       expsqr |   .0019315   .0007808     2.47   0.014     .0003982    .0034649
    higheredu |    .229959   .0579587     3.97   0.000     .1161419     .343776
 provincedum2 |   .0179999   .1678143     0.11   0.915    -.3115473    .3475471
 provincedum3 |  -.1693464   .2142639    -0.79   0.430    -.5901094    .2514165
 provincedum4 |  -.1341769   .1986246    -0.68   0.500     -.524228    .2558742
 provincedum5 |  -.1311393   .1211692    -1.08   0.280    -.3690867     .106808
 provincedum6 |   .0725843   .1462023     0.50   0.620     -.214522    .3596905
 provincedum7 |  -.1470416   .1466208    -1.00   0.316    -.4349698    .1408865
 provincedum8 |  -.0766422   .1457473    -0.53   0.599    -.3628551    .2095706
 provincedum9 |  -.1379311   .1310936    -1.05   0.293    -.3953676    .1195053
provincedum10 |  -.0668042   .1389878    -0.48   0.631     -.339743    .2061345
provincedum11 |  -.1097579   .1403549    -0.78   0.435    -.3853814    .1658655
provincedum12 |  -.0160431   .1427775    -0.11   0.911    -.2964239    .2643377
provincedum13 |    .030434   .1452717     0.21   0.834    -.2548449    .3157129
provincedum14 |  -.0063653   .1547031    -0.04   0.967    -.3101651    .2974345
provincedum15 |   .0694371   .1651247     0.42   0.674    -.2548284    .3937025
           m1 |   .0370285   .1456812     0.25   0.799    -.2490545    .3231114
           m2 |  -.0462837   .3159496    -0.15   0.884    -.6667331    .5741657
           m3 |  -.1807316   .0548968    -3.29   0.001    -.2885357   -.0729274
        _cons |   .5637108   .3801945     1.48   0.139    -.1829001    1.310322
-------------------------------------------------------------------------------

. eststo
(est1 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relati
> ve ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       648
-------------+----------------------------------   F(23, 624)      =      3.23
       Model |  12.7145013        23  .552804405   Prob > F        =    0.0000
    Residual |  106.760807       624  .171091037   R-squared       =    0.1064
-------------+----------------------------------   Adj R-squared   =    0.0735
       Total |  119.475309       647  .184660446   Root MSE        =    .41363

-------------------------------------------------------------------------------
  voc_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0738016   .0351613     2.10   0.036     .0047528    .1428503
          exp |  -.0600837    .028561    -2.10   0.036     -.116171   -.0039965
       expsqr |   .0017453   .0007674     2.27   0.023     .0002383    .0032524
   highvocedu |   .1020632   .0629637     1.62   0.106    -.0215833    .2257096
   highgenedu |     .46889   .1366203     3.43   0.001     .2005987    .7371813
     adultedu |   .4148408   .0920517     4.51   0.000     .2340721    .5956096
 provincedum2 |   .0101711    .165209     0.06   0.951    -.3142619     .334604
 provincedum3 |  -.1853898   .1909461    -0.97   0.332    -.5603645    .1895849
 provincedum4 |  -.1662642   .2005657    -0.83   0.407    -.5601297    .2276013
 provincedum5 |  -.1085526   .1218949    -0.89   0.374    -.3479265    .1308213
 provincedum6 |   .0816293   .1416699     0.58   0.565    -.1965783    .3598369
 provincedum7 |  -.1336973   .1473301    -0.91   0.365    -.4230201    .1556255
 provincedum8 |  -.1016556   .1481222    -0.69   0.493    -.3925339    .1892228
 provincedum9 |  -.1456341   .1323614    -1.10   0.272    -.4055619    .1142936
provincedum10 |  -.0714433   .1380663    -0.52   0.605    -.3425743    .1996876
provincedum11 |   -.118438   .1405696    -0.84   0.400    -.3944847    .1576087
provincedum12 |  -.0114865   .1392129    -0.08   0.934    -.2848692    .2618961
provincedum13 |   .0305421   .1379628     0.22   0.825    -.2403855    .3014697
provincedum14 |  -.0291519   .1537133    -0.19   0.850    -.3310099    .2727062
provincedum15 |   .0758737   .1596681     0.48   0.635    -.2376782    .3894255
          _m1 |   .0610936   .1451546     0.42   0.674    -.2239571    .3461443
          _m2 |  -.1221197   .3249996    -0.38   0.707    -.7603451    .5161057
          _m3 |  -.1879002   .1054272    -1.78   0.075    -.3949352    .0191349
        _cons |   .4473957   .3777349     1.18   0.237    -.2943898    1.189181
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1684142          .        .       .            .           .
        rho1 |   .1488697          .        .       .            .           .
        rho2 |  -.2975751          .        .       .            .           .
        rho3 |  -.4578654          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 m1 m2 m3 if inrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =        648
                                                F(23, 624)        =       2.96
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1064
                                                Root MSE          =     .41363

-------------------------------------------------------------------------------
              |               Robust
  voc_highocc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0738016   .0333745     2.21   0.027     .0082617    .1393415
          exp |  -.0600837   .0286344    -2.10   0.036    -.1163153   -.0038522
       expsqr |   .0017453   .0007723     2.26   0.024     .0002288    .0032619
   highvocedu |   .1020632   .0669185     1.53   0.128    -.0293496    .2334759
   highgenedu |     .46889   .1688437     2.78   0.006     .1373194    .8004606
     adultedu |   .4148408   .1089748     3.81   0.000      .200839    .6288426
 provincedum2 |   .0101711   .1648156     0.06   0.951    -.3134894    .3338316
 provincedum3 |  -.1853898   .2220634    -0.83   0.404    -.6214719    .2506923
 provincedum4 |  -.1662642   .2100378    -0.79   0.429    -.5787308    .2462024
 provincedum5 |  -.1085526   .1211862    -0.90   0.371    -.3465348    .1294296
 provincedum6 |   .0816293   .1461385     0.56   0.577    -.2053536    .3686122
 provincedum7 |  -.1336973   .1477712    -0.90   0.366    -.4238864    .1564918
 provincedum8 |  -.1016556   .1449477    -0.70   0.483       -.3863    .1829888
 provincedum9 |  -.1456341   .1313195    -1.11   0.268    -.4035158    .1122475
provincedum10 |  -.0714433   .1391226    -0.51   0.608    -.3446485    .2017618
provincedum11 |   -.118438   .1403845    -0.84   0.399    -.3941214    .1572454
provincedum12 |  -.0114865    .142476    -0.08   0.936    -.2912771     .268304
provincedum13 |   .0305421   .1463451     0.21   0.835    -.2568465    .3179307
provincedum14 |  -.0291519   .1536819    -0.19   0.850    -.3309482    .2726445
provincedum15 |   .0758737   .1651579     0.46   0.646    -.2484591    .4002064
           m1 |   .0610936   .1466824     0.42   0.677    -.2269574    .3491446
           m2 |  -.1221197   .3100758    -0.39   0.694    -.7310383    .4867988
           m3 |  -.1879002   .0565065    -3.33   0.001    -.2988661   -.0769342
        _cons |   .4473957   .3704898     1.21   0.228    -.2801621    1.174954
-------------------------------------------------------------------------------

. eststo
(est2 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr higheredu provincedum2-provincedum15 if inrange(birthye
> ar, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entra
> nt_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,236
-------------+----------------------------------   F(21, 1214)     =      4.40
       Model |  15.7991862        21  .752342201   Prob > F        =    0.0000
    Residual |  207.743694     1,214  .171123306   R-squared       =    0.0707
-------------+----------------------------------   Adj R-squared   =    0.0546
       Total |   223.54288     1,235  .181006381   Root MSE        =    .41367

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0619593   .0247475     2.50   0.012     .0134066     .110512
          exp |  -.0192249   .0175757    -1.09   0.274     -.053707    .0152572
       expsqr |   .0005109   .0004701     1.09   0.277    -.0004114    .0014333
    higheredu |   .1766194   .0302536     5.84   0.000     .1172642    .2359746
 provincedum2 |  -.0296167   .1026737    -0.29   0.773    -.2310542    .1718209
 provincedum3 |  -.1500093   .1147204    -1.31   0.191    -.3750815    .0750629
 provincedum4 |  -.1589803   .1355908    -1.17   0.241    -.4249985     .107038
 provincedum5 |  -.1312517   .0828309    -1.58   0.113    -.2937593    .0312559
 provincedum6 |  -.1408953   .0912554    -1.54   0.123    -.3199311    .0381404
 provincedum7 |   -.093468   .0963294    -0.97   0.332    -.2824586    .0955226
 provincedum8 |   -.054702   .0927892    -0.59   0.556    -.2367469     .127343
 provincedum9 |  -.0271827   .0850224    -0.32   0.749    -.1939899    .1396244
provincedum10 |  -.0955339   .0856121    -1.12   0.265    -.2634981    .0724302
provincedum11 |  -.1649277   .0919604    -1.79   0.073    -.3453466    .0154912
provincedum12 |  -.0387811    .106659    -0.36   0.716    -.2480376    .1704754
provincedum13 |  -.0370082   .0924606    -0.40   0.689    -.2184085     .144392
provincedum14 |  -.1126496   .1003717    -1.12   0.262    -.3095709    .0842717
provincedum15 |  -.1393258   .0945981    -1.47   0.141    -.3249197     .046268
          _m1 |   .5110787   .2510078     2.04   0.042     .0186214    1.003536
          _m2 |  -.0759091   .0775978    -0.98   0.328    -.2281498    .0763316
          _m3 |   -.171425   .1454828    -1.18   0.239    -.4568506    .1140006
        _cons |   .4433067   .1315656     3.37   0.001     .1851856    .7014278
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2299361          .        .       .            .           .
        rho1 |   1.065821          .        .       .            .           .
        rho2 |  -.1583035          .        .       .            .           .
        rho3 |  -.3574956          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 if inrang
> e(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =      1,236
                                                F(21, 1214)       =       4.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0707
                                                Root MSE          =     .41367

-------------------------------------------------------------------------------
              |               Robust
  gen_highocc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0619593   .0238672     2.60   0.010     .0151337    .1087849
          exp |  -.0192249   .0176369    -1.09   0.276    -.0538272    .0153774
       expsqr |   .0005109   .0004577     1.12   0.265    -.0003871     .001409
    higheredu |   .1766194   .0300471     5.88   0.000     .1176695    .2355694
 provincedum2 |  -.0296167   .1046241    -0.28   0.777    -.2348809    .1756475
 provincedum3 |  -.1500093   .1120485    -1.34   0.181    -.3698396     .069821
 provincedum4 |  -.1589803   .1231953    -1.29   0.197    -.4006796     .082719
 provincedum5 |  -.1312517   .0794665    -1.65   0.099    -.2871586    .0246551
 provincedum6 |  -.1408953   .0903142    -1.56   0.119    -.3180845    .0362938
 provincedum7 |   -.093468   .0975002    -0.96   0.338    -.2847556    .0978196
 provincedum8 |   -.054702   .0935293    -0.58   0.559    -.2381989     .128795
 provincedum9 |  -.0271827   .0862429    -0.32   0.753    -.1963845     .142019
provincedum10 |  -.0955339   .0860475    -1.11   0.267    -.2643521    .0732843
provincedum11 |  -.1649277   .0918255    -1.80   0.073     -.345082    .0152267
provincedum12 |  -.0387811    .099998    -0.39   0.698    -.2349692    .1574069
provincedum13 |  -.0370082   .0952968    -0.39   0.698     -.223973    .1499565
provincedum14 |  -.1126496    .100208    -1.12   0.261    -.3092496    .0839505
provincedum15 |  -.1393258   .0936892    -1.49   0.137    -.3231364    .0444848
           m1 |   .5110787   .2630636     1.94   0.052     -.005031    1.027188
           m2 |  -.0759091    .074054    -1.03   0.306    -.2211973     .069379
           m3 |   -.171425   .1151017    -1.49   0.137    -.3972454    .0543953
        _cons |   .4433067   .1376386     3.22   0.001     .1732707    .7133427
-------------------------------------------------------------------------------

. eststo
(est3 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relati
> ve ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,236
-------------+----------------------------------   F(23, 1212)     =      4.68
       Model |  18.2465731        23  .793329264   Prob > F        =    0.0000
    Residual |  205.296307     1,212  .169386392   R-squared       =    0.0816
-------------+----------------------------------   Adj R-squared   =    0.0642
       Total |   223.54288     1,235  .181006381   Root MSE        =    .41157

-------------------------------------------------------------------------------
  gen_highocc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0630755   .0246422     2.56   0.011     .0147295    .1114215
          exp |  -.0173987   .0175282    -0.99   0.321    -.0517876    .0169902
       expsqr |   .0004791   .0004682     1.02   0.306    -.0004394    .0013976
   highvocedu |   .1256959   .0336922     3.73   0.000     .0595944    .1917974
   highgenedu |   .2547179   .0389634     6.54   0.000     .1782747    .3311611
     adultedu |   .2161196   .0565659     3.82   0.000     .1051417    .3270976
 provincedum2 |   -.001909   .1025987    -0.02   0.985    -.2031998    .1993818
 provincedum3 |  -.1252913   .1143279    -1.10   0.273    -.3495938    .0990112
 provincedum4 |  -.1365791   .1350655    -1.01   0.312    -.4015673     .128409
 provincedum5 |  -.1212647    .082512    -1.47   0.142     -.283147    .0406176
 provincedum6 |  -.1245008   .0909237    -1.37   0.171    -.3028861    .0538844
 provincedum7 |  -.0702865    .096111    -0.73   0.465     -.258849     .118276
 provincedum8 |  -.0320095   .0926033    -0.35   0.730    -.2136902    .1496711
 provincedum9 |  -.0078831   .0848158    -0.09   0.926    -.1742852    .1585191
provincedum10 |  -.0693035   .0855656    -0.81   0.418    -.2371767    .0985697
provincedum11 |  -.1476716   .0917976    -1.61   0.108    -.3277714    .0324281
provincedum12 |  -.0329961   .1068437    -0.31   0.758    -.2426153    .1766231
provincedum13 |  -.0204903   .0924372    -0.22   0.825    -.2018451    .1608644
provincedum14 |  -.0866286   .1003055    -0.86   0.388    -.2834202    .1101631
provincedum15 |  -.1049589   .0946703    -1.11   0.268    -.2906948     .080777
          _m1 |   .3722708   .2529093     1.47   0.141    -.1239179    .8684595
          _m2 |   -.059663   .0773297    -0.77   0.441    -.2113779     .092052
          _m3 |  -.1850094   .1448337    -1.28   0.202    -.4691619    .0991432
        _cons |   .3470388   .1353353     2.56   0.010     .0815213    .6125563
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .1988969          .        .       .            .           .
        rho1 |    .834728          .        .       .            .           .
        rho2 |  -.1337799          .        .       .            .           .
        rho3 |  -.4148391          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_highocc male exp expsqr highvocedu highgenedu adultedu provincedum2-provincedum
> 15 m1 m2 m3 if inrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =      1,236
                                                F(23, 1212)       =       5.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0816
                                                Root MSE          =     .41157

-------------------------------------------------------------------------------
              |               Robust
  gen_highocc | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0630755   .0237264     2.66   0.008     .0165261    .1096248
          exp |  -.0173987    .017553    -0.99   0.322    -.0518363     .017039
       expsqr |   .0004791   .0004551     1.05   0.293    -.0004137    .0013719
   highvocedu |   .1256959   .0330819     3.80   0.000     .0607918       .1906
   highgenedu |   .2547179    .041555     6.13   0.000     .1731902    .3362455
     adultedu |   .2161196   .0629286     3.43   0.001     .0926586    .3395806
 provincedum2 |   -.001909   .1058492    -0.02   0.986    -.2095771    .2057591
 provincedum3 |  -.1252913   .1144061    -1.10   0.274    -.3497473    .0991646
 provincedum4 |  -.1365791   .1233464    -1.11   0.268    -.3785753     .105417
 provincedum5 |  -.1212647   .0797611    -1.52   0.129    -.2777498    .0352204
 provincedum6 |  -.1245008   .0911843    -1.37   0.172    -.3033974    .0543957
 provincedum7 |  -.0702865   .0977222    -0.72   0.472      -.26201     .121437
 provincedum8 |  -.0320095   .0943985    -0.34   0.735    -.2172122    .1531931
 provincedum9 |  -.0078831   .0868902    -0.09   0.928     -.178355    .1625888
provincedum10 |  -.0693035   .0867113    -0.80   0.424    -.2394245    .1008174
provincedum11 |  -.1476716   .0922003    -1.60   0.109    -.3285616    .0332184
provincedum12 |  -.0329961   .0979626    -0.34   0.736    -.2251912     .159199
provincedum13 |  -.0204903   .0958772    -0.21   0.831    -.2085941    .1676135
provincedum14 |  -.0866286   .1011014    -0.86   0.392    -.2849818    .1117246
provincedum15 |  -.1049589   .0946332    -1.11   0.268    -.2906219    .0807041
           m1 |   .3722708   .2650787     1.40   0.160    -.1477933    .8923349
           m2 |   -.059663   .0735818    -0.81   0.418    -.2040249    .0846989
           m3 |  -.1850094   .1139603    -1.62   0.105    -.4085907     .038572
        _cons |   .3470388   .1424414     2.44   0.015     .0675796     .626498
-------------------------------------------------------------------------------

. eststo
(est4 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 if inrang
> e(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       561
-------------+----------------------------------   F(21, 539)      =      2.34
       Model |  9.88105005        21  .470526193   Prob > F        =    0.0007
    Residual |  108.208077       539  .200757099   R-squared       =    0.0837
-------------+----------------------------------   Adj R-squared   =    0.0480
       Total |  118.089127       560   .21087344   Root MSE        =    .44806

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0595918   .0406718    -1.47   0.143    -.1394864    .0203028
          exp |   .0436488   .0340032     1.28   0.200    -.0231462    .1104439
       expsqr |  -.0011498   .0009158    -1.26   0.210    -.0029487    .0006492
    higheredu |   .2220315   .0579593     3.83   0.000     .1081777    .3358854
 provincedum2 |  -.1868678   .2184478    -0.86   0.393    -.6159812    .2422457
 provincedum3 |  -.3308383   .2423874    -1.36   0.173    -.8069781    .1453015
 provincedum4 |   .2374586   .2521246     0.94   0.347    -.2578087    .7327258
 provincedum5 |   .0289615   .1629002     0.18   0.859    -.2910356    .3489586
 provincedum6 |  -.1500223   .1873419    -0.80   0.424    -.5180321    .2179874
 provincedum7 |  -.1253142   .1986504    -0.63   0.528    -.5155381    .2649098
 provincedum8 |  -.1287889   .1947181    -0.66   0.509    -.5112883    .2537105
 provincedum9 |  -.2029093   .1784539    -1.14   0.256    -.5534596     .147641
provincedum10 |  -.0903681   .1834065    -0.49   0.622    -.4506471     .269911
provincedum11 |  -.2416675   .1875495    -1.29   0.198     -.610085      .12675
provincedum12 |  -.2140222   .1796874    -1.19   0.234    -.5669957    .1389512
provincedum13 |  -.1254595   .1821934    -0.69   0.491    -.4833556    .2324365
provincedum14 |     -.0984   .1990024    -0.49   0.621    -.4893154    .2925154
provincedum15 |  -.1102206   .2134803    -0.52   0.606    -.5295759    .3091347
          _m1 |   .1320168   .1799581     0.73   0.464    -.2214884    .4855219
          _m2 |   .1628724   .4980258     0.33   0.744    -.8154371    1.141182
          _m3 |   .5183816   .3142958     1.65   0.100    -.0990131    1.135776
        _cons |   .2199691   .4854101     0.45   0.651    -.7335582    1.173497
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2094422          .        .       .            .           .
        rho1 |   .2884675          .        .       .            .           .
        rho2 |   .3558896          .        .       .            .           .
        rho3 |   1.132707          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 
> if inrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =        561
                                                F(21, 539)        =       2.61
                                                Prob > F          =     0.0001
                                                R-squared         =     0.0837
                                                Root MSE          =     .44806

-------------------------------------------------------------------------------
              |               Robust
voc_longter~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |  -.0595918   .0417583    -1.43   0.154    -.1416207    .0224372
          exp |   .0436488   .0339653     1.29   0.199    -.0230717    .1103694
       expsqr |  -.0011498   .0009312    -1.23   0.217    -.0029791    .0006795
    higheredu |   .2220315   .0637819     3.48   0.001       .09674    .3473231
 provincedum2 |  -.1868678   .2156207    -0.87   0.387    -.6104277    .2366921
 provincedum3 |  -.3308383   .2016117    -1.64   0.101    -.7268792    .0652026
 provincedum4 |   .2374586   .2648346     0.90   0.370    -.2827759     .757693
 provincedum5 |   .0289615   .1640957     0.18   0.860    -.2933841     .351307
 provincedum6 |  -.1500223   .1845757    -0.81   0.417    -.5125982    .2125535
 provincedum7 |  -.1253142   .1915742    -0.65   0.513    -.5016377    .2510094
 provincedum8 |  -.1287889   .1872604    -0.69   0.492    -.4966385    .2390606
 provincedum9 |  -.2029093   .1679132    -1.21   0.227    -.5327537    .1269351
provincedum10 |  -.0903681   .1811957    -0.50   0.618    -.4463044    .2655682
provincedum11 |  -.2416675   .1786219    -1.35   0.177    -.5925479    .1092129
provincedum12 |  -.2140222   .1732338    -1.24   0.217    -.5543184     .126274
provincedum13 |  -.1254595   .1747071    -0.72   0.473    -.4686498    .2177307
provincedum14 |     -.0984   .1953002    -0.50   0.615    -.4820428    .2852427
provincedum15 |  -.1102206   .2068002    -0.53   0.594    -.5164537    .2960126
           m1 |   .1320168   .1804446     0.73   0.465     -.222444    .4864775
           m2 |   .1628724   .4477535     0.36   0.716    -.7166834    1.042428
           m3 |   .5183816   .2433971     2.13   0.034     .0402584    .9965048
        _cons |   .2199691   .4644579     0.47   0.636    -.6924004    1.132339
-------------------------------------------------------------------------------

. eststo
(est5 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entra
> nt_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       561
-------------+----------------------------------   F(23, 537)      =      2.36
       Model |  10.8378789        23  .471212126   Prob > F        =    0.0004
    Residual |  107.251248       537  .199722994   R-squared       =    0.0918
-------------+----------------------------------   Adj R-squared   =    0.0529
       Total |  118.089127       560   .21087344   Root MSE        =     .4469

-------------------------------------------------------------------------------
voc_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.061452   .0407397    -1.51   0.132    -.1414807    .0185767
          exp |   .0472743    .033975     1.39   0.165    -.0194659    .1140146
       expsqr |  -.0012439   .0009152    -1.36   0.175    -.0030417    .0005538
   highvocedu |    .160123   .0724077     2.21   0.027     .0178859      .30236
   highgenedu |   .5146997    .149358     3.45   0.001     .2213022    .8080972
     adultedu |   .2255103   .1023716     2.20   0.028     .0244124    .4266083
 provincedum2 |  -.1969607   .2183183    -0.90   0.367    -.6258233    .2319018
 provincedum3 |  -.3693419   .2424015    -1.52   0.128    -.8455134    .1068295
 provincedum4 |   .2274842   .2516105     0.90   0.366    -.2667774    .7217458
 provincedum5 |   .0321045   .1624909     0.20   0.843    -.2870912    .3513002
 provincedum6 |  -.1549589   .1869189    -0.83   0.407    -.5221407     .212223
 provincedum7 |  -.1278113   .1982681    -0.64   0.519    -.5172875     .261665
 provincedum8 |  -.1590653   .1949475    -0.82   0.415    -.5420186     .223888
 provincedum9 |  -.2185978   .1783102    -1.23   0.221    -.5688689    .1316732
provincedum10 |  -.0994096   .1832635    -0.54   0.588    -.4594109    .2605917
provincedum11 |  -.2508471   .1874843    -1.34   0.181    -.6191397    .1174455
provincedum12 |  -.2202027   .1794608    -1.23   0.220    -.5727339    .1323285
provincedum13 |  -.1292393   .1817986    -0.71   0.477    -.4863629    .2278844
provincedum14 |  -.1383478   .1994115    -0.69   0.488    -.5300701    .2533746
provincedum15 |  -.1144421   .2130848    -0.54   0.591     -.533024    .3041397
          _m1 |   .1400969   .1802831     0.78   0.437    -.2140497    .4942435
          _m2 |   .0868825   .4999956     0.17   0.862    -.8953045     1.06907
          _m3 |   .4745176   .3147023     1.51   0.132     -.143681    1.092716
        _cons |    .141544   .4881061     0.29   0.772    -.8172876    1.100375
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .2055053          .        .       .            .           .
        rho1 |   .3090417          .        .       .            .           .
        rho2 |   .1916554          .        .       .            .           .
        rho3 |   1.046745          .        .       .            .           .
------------------------------------------------------------------------------

. regress voc_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =        561
                                                F(23, 537)        =       3.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0918
                                                Root MSE          =      .4469

-------------------------------------------------------------------------------
              |               Robust
voc_longter~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   -.061452   .0418002    -1.47   0.142    -.1435639    .0206599
          exp |   .0472743   .0335664     1.41   0.160    -.0186632    .1132118
       expsqr |  -.0012439   .0009179    -1.36   0.176    -.0030471    .0005593
   highvocedu |    .160123   .0801304     2.00   0.046     .0027156    .3175304
   highgenedu |   .5146997   .1404246     3.67   0.000     .2388508    .7905486
     adultedu |   .2255103   .1125622     2.00   0.046      .004394    .4466266
 provincedum2 |  -.1969607   .2157783    -0.91   0.362    -.6208339    .2269124
 provincedum3 |  -.3693419   .1858811    -1.99   0.047    -.7344853   -.0041986
 provincedum4 |   .2274842   .2655382     0.86   0.392    -.2941368    .7491052
 provincedum5 |   .0321045   .1641928     0.20   0.845    -.2904344    .3546434
 provincedum6 |  -.1549589    .184644    -0.84   0.402     -.517672    .2077543
 provincedum7 |  -.1278113   .1919202    -0.67   0.506    -.5048177    .2491952
 provincedum8 |  -.1590653   .1880112    -0.85   0.398    -.5283929    .2102622
 provincedum9 |  -.2185978    .168918    -1.29   0.196    -.5504189    .1132233
provincedum10 |  -.0994096   .1818025    -0.55   0.585    -.4565409    .2577216
provincedum11 |  -.2508471   .1788281    -1.40   0.161    -.6021354    .1004413
provincedum12 |  -.2202027   .1736585    -1.27   0.205     -.561336    .1209306
provincedum13 |  -.1292393   .1757988    -0.74   0.463    -.4745768    .2160983
provincedum14 |  -.1383478    .196045    -0.71   0.481    -.5234568    .2467613
provincedum15 |  -.1144421   .2082861    -0.55   0.583    -.5235975    .2947132
           m1 |   .1400969   .1818818     0.77   0.441    -.2171901    .4973839
           m2 |   .0868825    .448537     0.19   0.846    -.7942197    .9679848
           m3 |   .4745176   .2440087     1.94   0.052     -.004811    .9538462
        _cons |    .141544   .4630152     0.31   0.760    -.7679992    1.051087
-------------------------------------------------------------------------------

. eststo
(est6 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Voc, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 if inrang
> e(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entrant_relative ins2_high
> edu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,097
-------------+----------------------------------   F(21, 1075)     =      7.83
       Model |  34.3382918        21  1.63515675   Prob > F        =    0.0000
    Residual |  224.624334     1,075  .208952868   R-squared       =    0.1326
-------------+----------------------------------   Adj R-squared   =    0.1157
       Total |  258.962625     1,096  .236279768   Root MSE        =    .45711

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0406166     .02887     1.41   0.160    -.0160314    .0972645
          exp |   .0377436    .020391     1.85   0.064     -.002267    .0777542
       expsqr |  -.0008718   .0005549    -1.57   0.116    -.0019606    .0002171
    higheredu |   .3079179   .0354292     8.69   0.000     .2383998    .3774361
 provincedum2 |  -.2103166   .1172788    -1.79   0.073    -.4404378    .0198046
 provincedum3 |   -.105098   .1304844    -0.81   0.421    -.3611309     .150935
 provincedum4 |  -.3059262   .1544639    -1.98   0.048    -.6090112   -.0028412
 provincedum5 |  -.0358949   .0934334    -0.38   0.701    -.2192273    .1474376
 provincedum6 |   .0047605   .1021879     0.05   0.963    -.1957498    .2052708
 provincedum7 |  -.1165266   .1087068    -1.07   0.284    -.3298281    .0967748
 provincedum8 |  -.1785745   .1040138    -1.72   0.086    -.3826675    .0255185
 provincedum9 |  -.0409546   .0951389    -0.43   0.667    -.2276336    .1457245
provincedum10 |  -.0542839   .0960573    -0.57   0.572     -.242765    .1341972
provincedum11 |  -.1347738    .102257    -1.32   0.188    -.3354198    .0658722
provincedum12 |  -.3220778   .1214215    -2.65   0.008    -.5603278   -.0838279
provincedum13 |   -.044671   .1047494    -0.43   0.670    -.2502075    .1608656
provincedum14 |  -.1071829   .1150217    -0.93   0.352    -.3328754    .1185096
provincedum15 |  -.1526341   .1070976    -1.43   0.154    -.3627782    .0575099
          _m1 |   .6391225   .2857997     2.24   0.026      .078334    1.199911
          _m2 |  -.1535651   .0904686    -1.70   0.090    -.3310801    .0239499
          _m3 |   .1323741   .1758153     0.75   0.452    -.2126059    .4773541
        _cons |   .3046099   .1502041     2.03   0.043     .0098835    .5993363
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3089664          .        .       .            .           .
        rho1 |   1.149816          .        .       .            .           .
        rho2 |  -.2762721          .        .       .            .           .
        rho3 |   .2381482          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr higheredu provincedum2-provincedum15 m1 m2 m3 
> if inrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =      1,097
                                                F(21, 1075)       =      10.19
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1326
                                                Root MSE          =     .45711

-------------------------------------------------------------------------------
              |               Robust
gen_longter~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0406166   .0287479     1.41   0.158    -.0157918     .097025
          exp |   .0377436   .0213038     1.77   0.077     -.004058    .0795453
       expsqr |  -.0008718   .0005786    -1.51   0.132    -.0020071    .0002635
    higheredu |   .3079179   .0353053     8.72   0.000     .2386428    .3771931
 provincedum2 |  -.2103166   .1204329    -1.75   0.081    -.4466268    .0259936
 provincedum3 |   -.105098   .1438868    -0.73   0.465    -.3874287    .1772328
 provincedum4 |  -.3059262   .1146837    -2.67   0.008    -.5309554   -.0808969
 provincedum5 |  -.0358949   .1009001    -0.36   0.722    -.2338784    .1620886
 provincedum6 |   .0047605    .110324     0.04   0.966    -.2117142    .2212352
 provincedum7 |  -.1165266   .1186067    -0.98   0.326    -.3492536    .1162003
 provincedum8 |  -.1785745   .1133492    -1.58   0.115    -.4009852    .0438362
 provincedum9 |  -.0409546   .1043475    -0.39   0.695    -.2457025    .1637933
provincedum10 |  -.0542839   .1033812    -0.53   0.600    -.2571357    .1485678
provincedum11 |  -.1347738   .1126917    -1.20   0.232    -.3558944    .0863468
provincedum12 |  -.3220778   .1087697    -2.96   0.003    -.5355028   -.1086529
provincedum13 |   -.044671   .1127018    -0.40   0.692    -.2658114    .1764694
provincedum14 |  -.1071829    .122681    -0.87   0.382    -.3479044    .1335385
provincedum15 |  -.1526341   .1137286    -1.34   0.180    -.3757894    .0705211
           m1 |   .6391225   .3061584     2.09   0.037     .0383867    1.239858
           m2 |  -.1535651    .095481    -1.61   0.108    -.3409155    .0337852
           m3 |   .1323741   .1644396     0.81   0.421    -.1902849    .4550331
        _cons |   .3046099   .1624973     1.87   0.061     -.014238    .6234578
-------------------------------------------------------------------------------

. eststo
(est7 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Together, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 if inrange(birthyear, 1971, 1992), sel(educat=male exp expsqr ins1_secgen_entra
> nt_relative ins2_highedu_entrant_relative ins3_vs_entrant_relative) dmf(2) showmlogit gen(m
> )
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -5960.1706
Iteration 1:  Log likelihood = -4592.0454
Iteration 2:  Log likelihood =   -4475.68
Iteration 3:  Log likelihood = -4467.5293
Iteration 4:  Log likelihood = -4467.4782
Iteration 5:  Log likelihood = -4467.4782

Multinomial logistic regression                   Number of obs   =       7481
                                                  LR chi2(12)     =    2985.38
                                                  Prob > chi2     =     0.0000
Log likelihood = -4467.4782                       Pseudo R2       =     0.2504

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .2011965   .0849927     2.37   0.018     .0346139    .3677792
         exp |  -.6480708   .0399036   -16.24   0.000    -.7262804   -.5698613
      expsqr |   .0103807   .0009905    10.48   0.000     .0084395     .012322
ins1_secge~e |  -8.942896   .6798925   -13.15   0.000    -10.27546   -7.610331
ins2_highe~e |   .9143727   .1319106     6.93   0.000     .6558326    1.172913
ins3_vs_en~e |   1.470056   .6189581     2.38   0.018     .2569206    2.683192
       _cons |   7.737714   .5263644    14.70   0.000     6.706059    8.769369
-------------+----------------------------------------------------------------
2            |
        male |   .2112209   .0748611     2.82   0.005     .0644958     .357946
         exp |  -.9660305   .0360151   -26.82   0.000    -1.036619   -.8954422
      expsqr |   .0172456   .0008412    20.50   0.000     .0155967    .0188944
ins1_secge~e |   -10.3246   .6309565   -16.36   0.000    -11.56125   -9.087946
ins2_highe~e |   .1469248   .1579929     0.93   0.352    -.1627356    .4565853
ins3_vs_en~e |  -1.060926   .5920689    -1.79   0.073     -2.22136    .0995077
       _cons |   12.87964   .4966749    25.93   0.000     11.90617     13.8531
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,097
-------------+----------------------------------   F(23, 1073)     =      9.39
       Model |  43.3875773        23   1.8864164   Prob > F        =    0.0000
    Residual |  215.575048     1,073  .200908712   R-squared       =    0.1675
-------------+----------------------------------   Adj R-squared   =    0.1497
       Total |  258.962625     1,096  .236279768   Root MSE        =    .44823

-------------------------------------------------------------------------------
gen_longter~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0415601   .0283512     1.47   0.143      -.01407    .0971903
          exp |   .0461245   .0200628     2.30   0.022     .0067578    .0854913
       expsqr |   -.001034   .0005449    -1.90   0.058    -.0021032    .0000353
   highvocedu |   .2217702   .0390007     5.69   0.000      .145244    .2982965
   highgenedu |   .4847681     .04428    10.95   0.000     .3978829    .5716533
     adultedu |   .2696702   .0664615     4.06   0.000     .1392609    .4000795
 provincedum2 |  -.1521985   .1154744    -1.32   0.188    -.3787798    .0743829
 provincedum3 |  -.0637853   .1280961    -0.50   0.619    -.3151326    .1875619
 provincedum4 |  -.2676176    .151597    -1.77   0.078    -.5650777    .0298425
 provincedum5 |  -.0216112   .0916934    -0.24   0.814    -.2015299    .1583076
 provincedum6 |   .0383161   .1003453     0.38   0.703    -.1585792    .2352113
 provincedum7 |  -.0643762   .1069006    -0.60   0.547     -.274134    .1453816
 provincedum8 |  -.1333447   .1022467    -1.30   0.192    -.3339708    .0672814
 provincedum9 |   -.003543   .0935046    -0.04   0.970    -.1870156    .1799295
provincedum10 |  -.0077447   .0944966    -0.08   0.935    -.1931638    .1776744
provincedum11 |  -.1011462   .1005596    -1.01   0.315     -.298462    .0961695
provincedum12 |  -.2823119   .1197105    -2.36   0.019     -.517205   -.0474187
provincedum13 |  -.0091561    .102976    -0.09   0.929    -.2112134    .1929012
provincedum14 |  -.0526063   .1132807    -0.46   0.642    -.2748831    .1696705
provincedum15 |  -.0826697   .1055767    -0.78   0.434      -.28983    .1244905
          _m1 |   .3575352   .2834378     1.26   0.207    -.1986201    .9136905
          _m2 |    -.12531   .0888101    -1.41   0.159    -.2995712    .0489511
          _m3 |   .1031898    .172463     0.60   0.550    -.2352132    .4415927
        _cons |   .0705712   .1523501     0.46   0.643    -.2283667    .3695092
-------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |    .232682          .        .       .            .           .
        rho1 |   .7412034          .        .       .            .           .
        rho2 |  -.2597793          .        .       .            .           .
        rho3 |   .2139219          .        .       .            .           .
------------------------------------------------------------------------------

. regress gen_longtermcontract male exp expsqr highvocedu highgenedu adultedu provincedum2-pr
> ovincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992), vce(robust)

Linear regression                               Number of obs     =      1,097
                                                F(23, 1073)       =      11.71
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1675
                                                Root MSE          =     .44823

-------------------------------------------------------------------------------
              |               Robust
gen_longter~t | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
         male |   .0415601   .0281141     1.48   0.140    -.0136047     .096725
          exp |   .0461245   .0208336     2.21   0.027     .0052453    .0870037
       expsqr |   -.001034   .0005676    -1.82   0.069    -.0021477    .0000798
   highvocedu |   .2217702   .0397967     5.57   0.000      .143682    .2998585
   highgenedu |   .4847681   .0452201    10.72   0.000     .3960383    .5734979
     adultedu |   .2696702   .0733976     3.67   0.000      .125651    .4136894
 provincedum2 |  -.1521985   .1151956    -1.32   0.187    -.3782327    .0738357
 provincedum3 |  -.0637853   .1414791    -0.45   0.652    -.3413924    .2138218
 provincedum4 |  -.2676176   .1140426    -2.35   0.019    -.4913895   -.0438458
 provincedum5 |  -.0216112   .0975125    -0.22   0.825     -.212948    .1697256
 provincedum6 |   .0383161   .1069563     0.36   0.720    -.1715512    .2481834
 provincedum7 |  -.0643762    .116439    -0.55   0.580    -.2928502    .1640978
 provincedum8 |  -.1333447   .1093966    -1.22   0.223    -.3480001    .0813107
 provincedum9 |   -.003543   .1012218    -0.04   0.972    -.2021582    .1950722
provincedum10 |  -.0077447   .1008474    -0.08   0.939    -.2056251    .1901357
provincedum11 |  -.1011462   .1090072    -0.93   0.354    -.3150376    .1127451
provincedum12 |  -.2823119   .1063715    -2.65   0.008    -.4910316   -.0735922
provincedum13 |  -.0091561    .109175    -0.08   0.933    -.2233768    .2050646
provincedum14 |  -.0526063   .1197323    -0.44   0.660    -.2875423    .1823297
provincedum15 |  -.0826697   .1096244    -0.75   0.451    -.2977722    .1324327
           m1 |   .3575352   .3017054     1.19   0.236    -.2344643    .9495347
           m2 |    -.12531   .0929164    -1.35   0.178    -.3076286    .0570085
           m3 |   .1031898   .1597739     0.65   0.519     -.210315    .4166945
        _cons |   .0705712   .1637818     0.43   0.667    -.2507976    .3919401
-------------------------------------------------------------------------------

. eststo
(est8 stored)

. outreg2 using "`xlspath'", append ctitle(Sec Gen, Higheredu Seperate, Province Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. 
. ***Table 9 Generation
. 
. local variablenames m1 m2 m3

. local variablelabels ""Upper secondary vocational track selection correction" "Upper second
> ary general track selection correction" "No upper secondary degree selection correction""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. 
. local estlist est1 est2 est3 est4 est5 est6 est7 est8

. 
. outreg2 [`estlist'] using "Table 9/Table9.xls", excel replace pvalue adjr2 drop(provincedum
> *) dec(3) sortvar(male exp expsqr higheredu) title("Table 9 (Occupation 1-4 High contract 5
> -8; Sec Voc 1-2 5-6, Sec Gen 3-4 7-8; Non-specified 1 3 5 7 Specified 2 4 6 8)") ctitle(" "
> ) addnote("More notes") label 
Table 9/Table9.xls
dir : seeout

. 
. 
. ***Table 11 with sequence: Sec Voc or Sec Gen, 2 columns.
. 
. *Prepare
. 
. drop m1 m2 m3

. local folderpath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 
> 3 5 7 9 11"

. local filename "Rural tables"

. local datapath "/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/20240716 Rural 
> Chip2018 and Instrumental Statistics and Inflation.dta"

. 
. 
. local xlspath "`folderpath'/`filename'.xls"

. 
. eststo clear

. 
. *Columns
. 
. selmlog voc_log_monthlyearning male exp expsqr higheredu highereduafter79 provincedum2-prov
> incedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educ
> at=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entra
> nt_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =       631
-------------+----------------------------------   F(22, 608)      =      4.82
       Model |  38.4711546        22  1.74868885   Prob > F        =    0.0000
    Residual |  220.684504       608  .362967934   R-squared       =    0.1484
-------------+----------------------------------   Adj R-squared   =    0.1176
       Total |  259.155658       630  .411358188   Root MSE        =    .60247

----------------------------------------------------------------------------------
voc_log_monthl~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
            male |    .361305   .0514009     7.03   0.000       .26036    .4622499
             exp |   .0730801   .0413223     1.77   0.077    -.0080717    .1542319
          expsqr |  -.0014345   .0011116    -1.29   0.197    -.0036175    .0007485
       higheredu |  -.0461276   .1507576    -0.31   0.760    -.3421965    .2499412
highereduafter79 |   .1490715   .1720185     0.87   0.387     -.188751    .4868939
    provincedum2 |  -.2137113   .2450481    -0.87   0.383    -.6949548    .2675322
    provincedum3 |   .0789525   .2807173     0.28   0.779    -.4723407    .6302457
    provincedum4 |   .2211212   .2926646     0.76   0.450     -.353635    .7958774
    provincedum5 |   .2510633   .1786188     1.41   0.160    -.0997214    .6018479
    provincedum6 |   .1960528   .2078216     0.94   0.346    -.2120826    .6041882
    provincedum7 |   .1104078   .2174294     0.51   0.612    -.3165959    .5374115
    provincedum8 |  -.0190838   .2179343    -0.09   0.930    -.4470793    .4089116
    provincedum9 |   .3135545   .1960547     1.60   0.110    -.0714721    .6985811
   provincedum10 |  -.0350631   .2030549    -0.17   0.863    -.4338373    .3637111
   provincedum11 |   .0861772   .2073864     0.42   0.678    -.3211033    .4934578
   provincedum12 |  -.1594418   .2049694    -0.78   0.437    -.5619758    .2430922
   provincedum13 |  -.2147094   .2028562    -1.06   0.290    -.6130934    .1836745
   provincedum14 |  -.0915884   .2269349    -0.40   0.687    -.5372598    .3540829
   provincedum15 |   -.063954   .2323444    -0.28   0.783     -.520249    .3923409
             _m1 |  -.2732872   .2112032    -1.29   0.196    -.6880636    .1414891
             _m2 |  -.0583107   .4654606    -0.13   0.900    -.9724165    .8557951
             _m3 |   .1076252   .1511572     0.71   0.477    -.1892285    .4044789
           _cons |   7.547102    .547347    13.79   0.000     6.472182    8.622023
----------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3970238          .        .       .            .           .
        rho1 |  -.4337216          .        .       .            .           .
        rho2 |  -.0925422          .        .       .            .           .
        rho3 |   .1708071          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress voc_log_monthlyearning male exp expsqr higheredu highereduafter79 provincedum2-
> provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 166
> 67), vce(robust)

. eststo
(est1 stored)

. sum voc_log_monthlyearning male exp expsqr higheredu highereduafter79 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
voc_log_mo~g |        631    8.144829    .6413721   5.298317   9.721166
        male |        631     .637084    .4812224          0          1
         exp |        631    14.59746    6.097066          2         32
      expsqr |        631    250.2013    208.3249          4       1024
   higheredu |        631    .1283677    .3347641          0          1
-------------+---------------------------------------------------------
higheredu~79 |        631    .0998415    .3000264          0          1
          m1 |        631    1.315553    .3959873   .4635267   3.007092
          m2 |        631   -.3710519    .2108446  -.7259973  -.0044607
          m3 |        631   -.4801928    .2630819  -.7259987   3.366965

. outreg2 using "`xlspath'", append ctitle(Sec Voc, All Gender, Non-specified Higheredu, Prov
> ince Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. drop m1 m2 m3

. 
. selmlog gen_log_monthlyearning male exp expsqr higheredu highereduafter79 provincedum2-prov
> incedum15 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educ
> at=male exp expsqr ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entra
> nt_relative) dmf(2) showmlogit gen(m)
Beware: the mlogit step uses observations that have missing values in the main equation

Iteration 0:  Log likelihood = -4803.1685
Iteration 1:  Log likelihood = -3699.4884
Iteration 2:  Log likelihood =   -3604.74
Iteration 3:  Log likelihood = -3599.2321
Iteration 4:  Log likelihood = -3599.2085

Multinomial logistic regression                   Number of obs   =       5800
                                                  LR chi2(12)     =    2407.92
                                                  Prob > chi2     =     0.0000
Log likelihood = -3599.2085                       Pseudo R2       =     0.2507

------------------------------------------------------------------------------
      educat | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
1            |
        male |   .1253306   .0967374     1.30   0.195    -.0642712    .3149325
         exp |  -.6613946   .0445203   -14.86   0.000    -.7486528   -.5741364
      expsqr |   .0108279   .0010986     9.86   0.000     .0086747    .0129811
ins1_secge~e |   -8.98315   .7697356   -11.67   0.000     -10.4918   -7.474496
ins2_highe~e |   1.004164   .1467543     6.84   0.000     .7165306    1.291797
ins3_vs_en~e |   1.527946   .6912771     2.21   0.027     .1730674    2.882824
       _cons |   7.861826   .5924417    13.27   0.000     6.700661     9.02299
-------------+----------------------------------------------------------------
2            |
        male |   .1076278   .0856453     1.26   0.209    -.0602339    .2754896
         exp |  -.9852452   .0404817   -24.34   0.000    -1.064588   -.9059026
      expsqr |   .0177142    .000942    18.80   0.000     .0158679    .0195605
ins1_secge~e |   -10.8074   .7221542   -14.97   0.000     -12.2228   -9.392005
ins2_highe~e |   .3455471   .1706877     2.02   0.043     .0110053    .6800889
ins3_vs_en~e |  -1.112543   .6599337    -1.69   0.092     -2.40599    .1809029
       _cons |   13.20418   .5606842    23.55   0.000     12.10526     14.3031
------------------------------------------------------------------------------
(educat==3 is the base outcome)


Selectivity correction based on multinomial logit
Second step regression
(Beware: standard errors below do not take account of the two-step procedure)



      Source |       SS           df       MS      Number of obs   =     1,206
-------------+----------------------------------   F(22, 1183)     =      6.07
       Model |  49.3729683        22  2.24422583   Prob > F        =    0.0000
    Residual |  437.142908     1,183  .369520632   R-squared       =    0.1015
-------------+----------------------------------   Adj R-squared   =    0.0848
       Total |  486.515876     1,205  .403747615   Root MSE        =    .60788

----------------------------------------------------------------------------------
gen_log_monthl~g | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
            male |   .2865345   .0366653     7.81   0.000     .2145983    .3584707
             exp |   .0084628   .0259557     0.33   0.744    -.0424616    .0593872
          expsqr |  -.0002787   .0006925    -0.40   0.687    -.0016374      .00108
       higheredu |   .0804815   .0892142     0.90   0.367    -.0945542    .2555173
highereduafter79 |   .1281647   .1013295     1.26   0.206    -.0706408    .3269702
    provincedum2 |  -.3396487   .1492145    -2.28   0.023    -.6324034   -.0468941
    provincedum3 |  -.4240016   .1666939    -2.54   0.011    -.7510503   -.0969529
    provincedum4 |  -.4730128   .1993824    -2.37   0.018    -.8641954   -.0818302
    provincedum5 |  -.1367867   .1207025    -1.13   0.257    -.3736015    .1000282
    provincedum6 |  -.1192781   .1325434    -0.90   0.368    -.3793244    .1407682
    provincedum7 |  -.2191383   .1400225    -1.57   0.118    -.4938584    .0555818
    provincedum8 |  -.3536241   .1353546    -2.61   0.009    -.6191859   -.0880622
    provincedum9 |  -.0116824   .1241544    -0.09   0.925    -.2552697     .231905
   provincedum10 |  -.1238134     .12516    -0.99   0.323    -.3693737     .121747
   provincedum11 |   -.176719    .134042    -1.32   0.188    -.4397056    .0862677
   provincedum12 |  -.2711744   .1573482    -1.72   0.085     -.579887    .0375381
   provincedum13 |   -.296932   .1345662    -2.21   0.028    -.5609469   -.0329171
   provincedum14 |  -.3050537   .1473395    -2.07   0.039    -.5941295   -.0159779
   provincedum15 |  -.3938157   .1367328    -2.88   0.004    -.6620815   -.1255499
             _m1 |   .3259882   .3714294     0.88   0.380    -.4027456    1.054722
             _m2 |  -.1129125   .1133682    -1.00   0.319    -.3353375    .1095126
             _m3 |  -.1952483   .2179414    -0.90   0.371     -.622843    .2323465
           _cons |    8.17422   .1955832    41.79   0.000     7.790492    8.557949
----------------------------------------------------------------------------------
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Anciliary    |
      Sigma2 |   .3919633          .        .       .            .           .
        rho1 |   .5206899          .        .       .            .           .
        rho2 |  -.1803513          .        .       .            .           .
        rho3 |  -.3118634          .        .       .            .           .
------------------------------------------------------------------------------

. 
. qui regress gen_log_monthlyearning male exp expsqr higheredu highereduafter79 provincedum2-
> provincedum15 m1 m2 m3 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 166
> 67), vce(robust)

. eststo
(est2 stored)

. sum gen_log_monthlyearning male exp expsqr higheredu highereduafter79 m1 m2 m3 if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
gen_log_mo~g |      1,206    8.212894    .6354114    5.37836   9.645658
        male |      1,206    .6185738    .4859383          0          1
         exp |      1,206    12.73217    6.855503          1         32
      expsqr |      1,206    209.0672    221.2673          1       1024
   higheredu |      1,206    .5630182    .4962186          0          1
-------------+---------------------------------------------------------
higheredu~79 |      1,206    .5157546    .4999591          0          1
          m1 |      1,206   -.2382665     .100632  -.6403428  -.0164993
          m2 |      1,206    .7942336     .608194   .0167035   2.932487
          m3 |      1,206   -.3796555     .255128  -.7259981   .3659999

. outreg2 using "`xlspath'", append ctitle(Sec Gen, All Gender, Non-specified Higheredu, Prov
> ince Dum) pvalue
/Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9 11/Rural tab
> les.xls
dir : seeout

. 
. ***Table 11 Generation
. 
. local variablenames m1 m2 m3

. local variablelabels ""Upper secondary vocational track selection correction" "Upper second
> ary general track selection correction" "No upper secondary degree selection correction""

. 
. local count 0

. foreach labels in `variablelabels' {
  2.         local count = `count' + 1
  3.         local varname : word `count' of `variablenames'
  4.         label var `varname' "`labels'"
  5. }

. 
. 
. local estlist est1 est2

. 
. outreg2 [`estlist'] using "Table 11/Table11.xls", excel replace pvalue adjr2 drop(provinced
> um*) dec(3) sortvar(male exp expsqr higheredu) title("Table 11") ctitle(" ") addnote("More 
> notes") label
Table 11/Table11.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Documents/Study - Now/Summer Research/NEW/Rural Tables 3 5 7 9
>  11/Rural tables.log
  log type:  text
 closed on:  25 Oct 2024, 13:58:15
---------------------------------------------------------------------------------------------
