---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male c
> ontrolled/Urban 1979 Higheredu FuzzyOption Male controlled.log
  log type:  text
 opened on:   6 Aug 2024, 17:13:52

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,431 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(33,372 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(5,190 real changes made)

. 
. *Step Two: Regressions
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        931
-------------------+----------------------            BW type       =     Manual
     Number of obs |       491         440            Kernel        =    Uniform
Eff. Number of obs |       491         440            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03585     .06006   0.5969   0.551    -.08187       .15357
    Bias-corrected | -.01367     .06006   -0.2276  0.820   -.131393      .104047
            Robust | -.01367     .09233   -0.1481  0.882    -.19463      .167285
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.8612     6.3301   0.6100   0.542   -8.54552       16.268
    Bias-corrected |  8.5799     6.3301   1.3554   0.175   -3.82683      20.9867
            Robust |  8.5799     9.9054   0.8662   0.386   -10.8342      27.9941
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2723
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1286        1437            Kernel        =    Uniform
Eff. Number of obs |      1286        1437            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06373     .03685   1.7295   0.084   -.008494      .135955
    Bias-corrected |  .04977     .03685   1.3506   0.177   -.022454      .121995
            Robust |  .04977     .05339   0.9323   0.351   -.054867      .154408
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3388     .96335   1.3898   0.165   -.549284      3.22698
    Bias-corrected |  2.2406     .96335   2.3258   0.020    .352459      4.12872
            Robust |  2.2406     1.4064   1.5932   0.111   -.515806      4.99699
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16190
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8396        7794            Kernel        = Epanechnikov
Eff. Number of obs |      3228        3413            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    82.874      82.874
       BW bias (b) |   128.283     128.283
         rho (h/b) |     0.646       0.646
        Unique obs |       370         261

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04178     .02594   1.6106   0.107   -.009063      .092617
    Bias-corrected |  .03754     .02594   1.4471   0.148   -.013304      .088375
            Robust |  .03754     .03113   1.2059   0.228   -.023471      .098542
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0197     .93606   1.0894   0.276   -.814943      2.85434
    Bias-corrected |  .98706     .93606   1.0545   0.292   -.847579       2.8217
            Robust |  .98706      1.124   0.8782   0.380   -1.21588      3.19001
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        625
-------------------+----------------------            BW type       =     Manual
     Number of obs |       319         306            Kernel        =    Uniform
Eff. Number of obs |       319         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01236     .07332   0.1686   0.866   -.131347      .156071
    Bias-corrected |  .09319     .07332   1.2710   0.204   -.050516      .236901
            Robust |  .09319     .10787   0.8639   0.388   -.118237      .304622
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  6.1464     35.681   0.1723   0.863   -63.7865      76.0794
    Bias-corrected | -32.301     35.681   -0.9053  0.365   -102.234      37.6321
            Robust | -32.301     53.215   -0.6070  0.544   -136.601      71.9989
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1840
-------------------+----------------------            BW type       =     Manual
     Number of obs |       832        1008            Kernel        =    Uniform
Eff. Number of obs |       832        1008            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08042     .04485   1.7929   0.073   -.007493      .168329
    Bias-corrected |  .00857     .04485   0.1910   0.849   -.079344      .096477
            Robust |  .00857     .06513   0.1315   0.895   -.119093      .136225
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6376     1.0689   1.5321   0.126   -.457368      3.73262
    Bias-corrected |  2.4393     1.0689   2.2821   0.022    .344302      4.53429
            Robust |  2.4393     1.5848   1.5391   0.124    -.66693      5.54553
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10681
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4668        6013            Kernel        = Epanechnikov
Eff. Number of obs |      1410        1752            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.316      59.316
       BW bias (b) |    91.615      91.615
         rho (h/b) |     0.647       0.647
        Unique obs |       320         248

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04459     .03757   1.1867   0.235   -.029053      .118224
    Bias-corrected |  .04187     .03757   1.1143   0.265   -.031772      .115505
            Robust |  .04187     .04476   0.9353   0.350   -.045867        .1296
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.7798     1.6934   1.0510   0.293   -1.53918      5.09884
    Bias-corrected |  2.0423     1.6934   1.2060   0.228   -1.27669      5.36132
            Robust |  2.0423     2.0203   1.0109   0.312   -1.91741      6.00205
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        206
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106         100            Kernel        =    Uniform
Eff. Number of obs |       106         100            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00165      .1051   0.0157   0.987   -.204352      .207647
    Bias-corrected |  .17894      .1051   1.7025   0.089   -.027064      .384935
            Robust |  .17894     .12806   1.3973   0.162   -.072062      .429934
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -49.347     3175.6   -0.0155  0.988   -6273.32      6174.63
    Bias-corrected |  5255.7     3175.6   1.6551   0.098   -968.261      11479.7
            Robust |  5255.7     3865.6   1.3596   0.174    -2320.8      12832.2
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        633
-------------------+----------------------            BW type       =     Manual
     Number of obs |       304         329            Kernel        =    Uniform
Eff. Number of obs |       304         329            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11353     .07169   1.5836   0.113   -.026976      .254027
    Bias-corrected |  .04655     .07169   0.6494   0.516   -.093948      .187055
            Robust |  .04655     .09851   0.4726   0.637   -.146529      .239637
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.4019     1.0936   1.2820   0.200    -.74143      3.54531
    Bias-corrected |  1.3726     1.0936   1.2551   0.209   -.770821      3.51592
            Robust |  1.3726     1.6249   0.8447   0.398   -1.81216      4.55726
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2768
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1164        1604            Kernel        = Epanechnikov
Eff. Number of obs |       525         575            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.672      64.672
       BW bias (b) |   112.396     112.396
         rho (h/b) |     0.575       0.575
        Unique obs |       236         243

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0801     .05767   1.3888   0.165    -.03294      .193135
    Bias-corrected |  .09001     .05767   1.5608   0.119   -.023024      .203051
            Robust |  .09001     .06668   1.3498   0.177   -.040685      .220713
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8122     1.4058   1.2891   0.197   -.943157      4.56764
    Bias-corrected |  1.7746     1.4058   1.2623   0.207   -.980834      4.52996
            Robust |  1.7746      1.639   1.0827   0.279   -1.43781      4.98693
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00792     .07876   0.1005   0.920   -.146455       .16229
    Bias-corrected |  .03322     .07876   0.4218   0.673   -.121152      .187593
            Robust |  .03322     .11176   0.2972   0.766   -.185831      .252272
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  17.893     176.54   0.1014   0.919   -328.114        363.9
    Bias-corrected | -34.675     176.54   -0.1964  0.844   -380.682      311.332
            Robust | -34.675     251.61   -0.1378  0.890   -527.822      458.471
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1207
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         679            Kernel        =    Uniform
Eff. Number of obs |       528         679            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05824     .04861   1.1981   0.231   -.037035      .153523
    Bias-corrected |  .00666     .04861   0.1371   0.891   -.088615      .101943
            Robust |  .00666     .07021   0.0949   0.924   -.130947      .144275
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.9981     1.9852   1.0065   0.314   -1.89286      5.88911
    Bias-corrected |  3.3452     1.9852   1.6851   0.092   -.545762      7.23621
            Robust |  3.3452     2.9294   1.1419   0.253   -2.39632      9.08677
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7913
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3504        4409            Kernel        = Epanechnikov
Eff. Number of obs |      1139        1510            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.479      71.479
       BW bias (b) |   113.566     113.566
         rho (h/b) |     0.629       0.629
        Unique obs |       315         237

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02563     .03716   0.6897   0.490   -.047203      .098463
    Bias-corrected |  .01664     .03716   0.4477   0.654   -.056195      .089471
            Robust |  .01664     .04398   0.3783   0.705    -.06957      .102847
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1295     2.7115   0.4166   0.677   -4.18501      6.44401
    Bias-corrected |  .83998     2.7115   0.3098   0.757   -4.47454      6.15449
            Robust |  .83998      3.197   0.2627   0.793   -5.42604      7.10599
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(nncluster provinc
> e_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        931
-------------------+----------------------            BW type       =     Manual
     Number of obs |       491         440            Kernel        =    Uniform
Eff. Number of obs |       491         440            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03585     .07321   0.4897   0.624   -.107643      .179342
    Bias-corrected | -.01367     .07321   -0.1868  0.852   -.157165       .12982
            Robust | -.01367     .09718   -0.1407  0.888    -.20414      .176795
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.8612     7.8562   0.4915   0.623   -11.5367      19.2591
    Bias-corrected |  8.5799     7.8562   1.0921   0.275   -6.81797      23.9778
            Robust |  8.5799     11.638   0.7373   0.461   -14.2296      31.3894
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(nncluster provinc
> e_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2723
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1286        1437            Kernel        =    Uniform
Eff. Number of obs |      1286        1437            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06373     .05666   1.1247   0.261   -.047328      .174789
    Bias-corrected |  .04977     .05666   0.8784   0.380   -.061288      .160829
            Robust |  .04977      .0674   0.7385   0.460   -.082324      .181865
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3388     1.4461   0.9259   0.355   -1.49536      4.17305
    Bias-corrected |  2.2406     1.4461   1.5495   0.121   -.593618       5.0748
            Robust |  2.2406     1.9135   1.1709   0.242   -1.50988      5.99106
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16190
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8396        7794            Kernel        = Epanechnikov
Eff. Number of obs |      3737        4009            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    94.048      94.048
       BW bias (b) |   124.288     124.288
         rho (h/b) |     0.757       0.757
        Unique obs |       370         261
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04442     .04449   0.9984   0.318   -.042783      .131625
    Bias-corrected |  .03679     .04449   0.8270   0.408    -.05041      .123997
            Robust |  .03679     .04633   0.7942   0.427   -.054013        .1276
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0105     1.6136   0.6262   0.531    -2.1521       4.1731
    Bias-corrected |  1.0234     1.6136   0.6342   0.526   -2.13919      4.18601
            Robust |  1.0234     1.6906   0.6054   0.545    -2.2901      4.33691
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(nnclu
> ster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        625
-------------------+----------------------            BW type       =     Manual
     Number of obs |       319         306            Kernel        =    Uniform
Eff. Number of obs |       319         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01236     .08395   0.1473   0.883   -.152178      .176902
    Bias-corrected |  .09319     .08395   1.1101   0.267   -.071347      .257732
            Robust |  .09319     .10873   0.8571   0.391   -.119912      .306297
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  6.1464     41.636   0.1476   0.883   -75.4588      87.7517
    Bias-corrected | -32.301     41.636   -0.7758  0.438   -113.906      49.3044
            Robust | -32.301     58.724   -0.5500  0.582   -147.399       82.797
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(nnclu
> ster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1840
-------------------+----------------------            BW type       =     Manual
     Number of obs |       832        1008            Kernel        =    Uniform
Eff. Number of obs |       832        1008            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08042      .0594   1.3538   0.176   -.036005      .196841
    Bias-corrected |  .00857      .0594   0.1442   0.885   -.107857       .12499
            Robust |  .00857     .07669   0.1117   0.911   -.141734      .158867
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6376     1.5576   1.0514   0.293   -1.41517      4.69043
    Bias-corrected |  2.4393     1.5576   1.5661   0.117     -.6135       5.4921
            Robust |  2.4393     2.0764   1.1748   0.240   -1.63041        6.509
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provinc
> e_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10681
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4668        6013            Kernel        = Epanechnikov
Eff. Number of obs |      1534        1937            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.058      64.058
       BW bias (b) |    90.680      90.680
         rho (h/b) |     0.706       0.706
        Unique obs |       320         248
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04636     .05052   0.9176   0.359   -.052664      .145388
    Bias-corrected |  .04309     .05052   0.8528   0.394   -.055939      .142114
            Robust |  .04309     .06118   0.7043   0.481   -.076814      .162989
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.5205     2.4997   0.6083   0.543   -3.37892      6.41989
    Bias-corrected |  1.8258     2.4997   0.7304   0.465   -3.07364      6.72517
            Robust |  1.8258     2.8357   0.6439   0.520   -3.73206      7.38359
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        206
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106         100            Kernel        =    Uniform
Eff. Number of obs |       106         100            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00165     .09387   0.0175   0.986   -.182327      .185622
    Bias-corrected |  .17894     .09387   1.9063   0.057   -.005039      .362911
            Robust |  .17894     .10606   1.6871   0.092   -.028939       .38681
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -49.347     2835.3   -0.0174  0.986   -5606.39      5507.69
    Bias-corrected |  5255.7     2835.3   1.8537   0.064   -301.322      10812.8
            Robust |  5255.7     3191.1   1.6470   0.100   -998.707      11510.1
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        633
-------------------+----------------------            BW type       =     Manual
     Number of obs |       304         329            Kernel        =    Uniform
Eff. Number of obs |       304         329            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11353     .07781   1.4590   0.145   -.038975      .266025
    Bias-corrected |  .04655     .07781   0.5983   0.550   -.105947      .199054
            Robust |  .04655     .08187   0.5686   0.570   -.113917      .207025
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.4019      1.236   1.1342   0.257   -1.02067      3.82455
    Bias-corrected |  1.3726      1.236   1.1104   0.267   -1.05006      3.79516
            Robust |  1.3726     1.6604   0.8267   0.408   -1.88171      4.62681
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2768
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1164        1604            Kernel        = Epanechnikov
Eff. Number of obs |       589         612            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.894      71.894
       BW bias (b) |   113.230     113.230
         rho (h/b) |     0.635       0.635
        Unique obs |       236         243
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07544     .06917   1.0906   0.275   -.060137      .211018
    Bias-corrected |  .08793     .06917   1.2711   0.204   -.047652      .223503
            Robust |  .08793     .08219   1.0698   0.285   -.073155      .249006
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6882     1.8505   0.9123   0.362   -1.93871      5.31516
    Bias-corrected |  1.6561     1.8505   0.8949   0.371   -1.97087        5.283
            Robust |  1.6561     2.0601   0.8039   0.421   -2.38175      5.69389
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00792     .09757   0.0811   0.935   -.183311      .199146
    Bias-corrected |  .03322     .09757   0.3405   0.733   -.158008      .224449
            Robust |  .03322     .12411   0.2677   0.789   -.210023      .276463
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  17.893     217.59   0.0822   0.934    -408.57      444.356
    Bias-corrected | -34.675     217.59   -0.1594  0.873   -461.138      391.788
            Robust | -34.675     281.55   -0.1232  0.902   -586.508      517.157
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1207
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         679            Kernel        =    Uniform
Eff. Number of obs |       528         679            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05824     .07018   0.8299   0.407   -.079313      .195801
    Bias-corrected |  .00666     .07018   0.0949   0.924   -.130893      .144221
            Robust |  .00666     .09696   0.0687   0.945   -.183365      .196693
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.9981     2.6452   0.7554   0.450   -3.18642      7.18267
    Bias-corrected |  3.3452     2.6452   1.2646   0.206   -1.83932      8.52977
            Robust |  3.3452      3.556   0.9407   0.347   -3.62433      10.3148
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7913
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3504        4409            Kernel        = Epanechnikov
Eff. Number of obs |      1270        1730            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    79.997      79.997
       BW bias (b) |   113.988     113.988
         rho (h/b) |     0.702       0.702
        Unique obs |       315         237
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03252     .04948   0.6573   0.511   -.064452      .129492
    Bias-corrected |  .02113     .04948   0.4271   0.669   -.075842      .118102
            Robust |  .02113     .05873   0.3598   0.719   -.093977      .136237
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0584     3.0358   0.3486   0.727   -4.89176      7.00849
    Bias-corrected |  .74782     3.0358   0.2463   0.805   -5.20231      6.69795
            Robust |  .74782     3.2381   0.2309   0.817   -5.59866       7.0943
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        828
-------------------+----------------------            BW type       =     Manual
     Number of obs |       447         381            Kernel        =    Uniform
Eff. Number of obs |       447         381            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08774     .07304   1.2013   0.230   -.055414      .230904
    Bias-corrected |  .08594     .07304   1.1766   0.239    -.05722      .229098
            Robust |  .08594     .13664   0.6290   0.529   -.181862       .35374
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .91873     1.1869   0.7741   0.439   -1.40754      3.24499
    Bias-corrected | -.75143     1.1869   -0.6331  0.527   -3.07769      1.57483
            Robust | -.75143     2.2056   -0.3407  0.733   -5.07434      3.57148
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2620
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1242        1378            Kernel        =    Uniform
Eff. Number of obs |      1242        1378            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08352     .03968   2.1050   0.035    .005755      .161294
    Bias-corrected |  .09665     .03968   2.4357   0.015    .018877      .174415
            Robust |  .09665     .06204   1.5577   0.119   -.024956      .218248
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .68837      .6572   1.0474   0.295   -.599711      1.97645
    Bias-corrected |  .78981      .6572   1.2018   0.229   -.498268       2.0779
            Robust |  .78981     1.0067   0.7846   0.433   -1.18323      2.76285
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16087
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8352        7735            Kernel        = Epanechnikov
Eff. Number of obs |      1957        2131            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.196      53.196
       BW bias (b) |    85.802      85.802
         rho (h/b) |     0.620       0.620
        Unique obs |       369         260

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0517      .0341   1.5161   0.130   -.015137       .11853
    Bias-corrected |  .05525      .0341   1.6203   0.105   -.011584      .122082
            Robust |  .05525     .04092   1.3501   0.177   -.024956      .135455
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .46845     .89204   0.5251   0.599   -1.27992      2.21682
    Bias-corrected |   .4308     .89204   0.4829   0.629   -1.31757      2.17917
            Robust |   .4308     1.0666   0.4039   0.686   -1.65978      2.52138
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05396     .09178   0.5879   0.557   -.125938       .23385
    Bias-corrected |  .28192     .09178   3.0716   0.002    .102028      .461816
            Robust |  .28192     .16653   1.6929   0.090   -.044465      .608309
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.32661     2.6103   -0.1251  0.900   -5.44267      4.78946
    Bias-corrected |  -.9923     2.6103   -0.3801  0.704   -6.10836      4.12377
            Robust |  -.9923      4.671   -0.2124  0.832   -10.1473      8.16274
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1759
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         963            Kernel        =    Uniform
Eff. Number of obs |       796         963            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10687     .04869   2.1950   0.028    .011445      .202287
    Bias-corrected |  .04132     .04869   0.8487   0.396   -.054104      .136739
            Robust |  .04132     .07748   0.5332   0.594   -.110549      .193183
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0641      .7112   1.4962   0.135   -.329796      2.45808
    Bias-corrected |  .75603      .7112   1.0630   0.288   -.637905      2.14997
            Robust |  .75603     1.1266   0.6711   0.502   -1.45205      2.96411
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10600
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4632        5968            Kernel        = Epanechnikov
Eff. Number of obs |      1877        2354            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    79.805      79.805
       BW bias (b) |   128.617     128.617
         rho (h/b) |     0.620       0.620
        Unique obs |       319         247

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05838     .03373   1.7310   0.083   -.007722      .124482
    Bias-corrected |  .05943     .03373   1.7621   0.078   -.006673       .12553
            Robust |  .05943     .04069   1.4607   0.144   -.020314      .139171
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .72706     .84256   0.8629   0.388   -.924333      2.37844
    Bias-corrected |  .47331     .84256   0.5618   0.574   -1.17808       2.1247
            Robust |  .47331     1.0149   0.4664   0.641   -1.51583      2.46245
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03233     .16735   -0.1932  0.847   -.360327      .295671
    Bias-corrected |   .1552     .16735   0.9274   0.354   -.172795      .483203
            Robust |   .1552     .31898   0.4866   0.627   -.469976      .780385
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.9732     14.611   0.2035   0.839   -25.6632      31.6097
    Bias-corrected |   22.36     14.611   1.5304   0.126   -6.27686       50.996
            Robust |   22.36     28.018   0.7980   0.425   -32.5553      77.2745
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        605
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         313            Kernel        =    Uniform
Eff. Number of obs |       292         313            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12122     .08388   1.4452   0.148   -.043181      .285614
    Bias-corrected |  .03286     .08388   0.3918   0.695   -.131538      .197258
            Robust |  .03286     .13818   0.2378   0.812   -.237966      .303686
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6296     1.2047   1.3527   0.176   -.731495      3.99067
    Bias-corrected |  2.0799     1.2047   1.7265   0.084   -.281195      4.44097
            Robust |  2.0799     1.9748   1.0532   0.292   -1.79073      5.95051
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2740
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1152        1588            Kernel        = Epanechnikov
Eff. Number of obs |       616         628            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    76.645      76.645
       BW bias (b) |   137.690     137.690
         rho (h/b) |     0.557       0.557
        Unique obs |       235         242

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0739     .05892   1.2543   0.210   -.041576      .189385
    Bias-corrected |  .08887     .05892   1.5083   0.131   -.026614      .204346
            Robust |  .08887     .06902   1.2875   0.198   -.046418       .22415
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8235     1.4893   1.2244   0.221   -1.09544      4.74241
    Bias-corrected |  1.6103     1.4893   1.0813   0.280   -1.30862      4.52922
            Robust |  1.6103     1.7524   0.9189   0.358    -1.8243       5.0449
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07461      .1011   0.7380   0.461   -.123549      .272768
    Bias-corrected |  .25952      .1011   2.5669   0.010    .061362      .457679
            Robust |  .25952     .18149   1.4299   0.153     -.0962      .615241
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   -.008     2.1708   -0.0037  0.997   -4.26269      4.24669
    Bias-corrected | -1.9998     2.1708   -0.9212  0.357   -6.25454      2.25484
            Robust | -1.9998     3.8781   -0.5157  0.606   -9.60083      5.60113
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         650            Kernel        =    Uniform
Eff. Number of obs |       504         650            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08995     .05325   1.6892   0.091    -.01442      .194318
    Bias-corrected |  .06163     .05325   1.1574   0.247   -.042737      .166002
            Robust |  .06163      .0854   0.7217   0.470   -.105741      .229006
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .74711     .99912   0.7478   0.455   -1.21113      2.70536
    Bias-corrected | -.12196     .99912   -0.1221  0.903   -2.08021      1.83628
            Robust | -.12196     1.5741   -0.0775  0.938   -3.20723      2.96331
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7860
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3480        4380            Kernel        = Epanechnikov
Eff. Number of obs |       819        1067            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.771      54.771
       BW bias (b) |    87.340      87.340
         rho (h/b) |     0.627       0.627
        Unique obs |       314         236

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03482     .04521   0.7703   0.441   -.053787      .123433
    Bias-corrected |  .03145     .04521   0.6956   0.487    -.05716       .12006
            Robust |  .03145     .05452   0.5769   0.564   -.075402      .138302
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.27404     2.2808   -0.1201  0.904   -4.74441      4.19633
    Bias-corrected | -.62744     2.2808   -0.2751  0.783   -5.09781      3.84294
            Robust | -.62744      2.723   -0.2304  0.818   -5.96439      4.70951
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(
> nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        828
-------------------+----------------------            BW type       =     Manual
     Number of obs |       447         381            Kernel        =    Uniform
Eff. Number of obs |       447         381            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08774     .08351   1.0507   0.293   -.075926      .251416
    Bias-corrected |  .08594     .08351   1.0291   0.303   -.077732       .24961
            Robust |  .08594     .14805   0.5805   0.562   -.204225      .376104
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .91873     1.2565   0.7312   0.465   -1.54398      3.38143
    Bias-corrected | -.75143     1.2565   -0.5980  0.550   -3.21413      1.71128
            Robust | -.75143     2.8936   -0.2597  0.795   -6.42281      4.91996
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(
> nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2620
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1242        1378            Kernel        =    Uniform
Eff. Number of obs |      1242        1378            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08352     .05619   1.4865   0.137   -.026604      .193653
    Bias-corrected |  .09665     .05619   1.7200   0.085   -.013482      .206775
            Robust |  .09665     .07262   1.3308   0.183   -.045692      .238985
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .68837     .88445   0.7783   0.436   -1.04512      2.42186
    Bias-corrected |  .78981     .88445   0.8930   0.372   -.943675       2.5233
            Robust |  .78981     1.2574   0.6281   0.530   -1.67474      3.25437
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pr
> ovince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16087
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8352        7735            Kernel        = Epanechnikov
Eff. Number of obs |      2347        2553            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.441      62.441
       BW bias (b) |    85.379      85.379
         rho (h/b) |     0.731       0.731
        Unique obs |       369         260
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05042     .04735   1.0648   0.287    -.04239      .143237
    Bias-corrected |  .05538     .04735   1.1695   0.242   -.037434      .148194
            Robust |  .05538     .05382   1.0289   0.304   -.050111       .16087
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .41599     1.3136   0.3167   0.751   -2.15855      2.99053
    Bias-corrected |  .37311     1.3136   0.2840   0.776   -2.20143      2.94766
            Robust |  .37311     1.4527   0.2568   0.797   -2.47422      3.22044
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05396     .09289   0.5809   0.561   -.128104      .236017
    Bias-corrected |  .28192     .09289   3.0350   0.002    .099861      .463982
            Robust |  .28192     .18495   1.5243   0.127   -.080569      .644413
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.32661     2.4044   -0.1358  0.892   -5.03914      4.38593
    Bias-corrected |  -.9923     2.4044   -0.4127  0.680   -5.70483      3.72024
            Robust |  -.9923     4.6728   -0.2124  0.832   -10.1508      8.16618
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1759
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         963            Kernel        =    Uniform
Eff. Number of obs |       796         963            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10687     .05679   1.8819   0.060   -.004433      .218165
    Bias-corrected |  .04132     .05679   0.7276   0.467   -.069982      .152617
            Robust |  .04132     .07788   0.5306   0.596   -.111317      .193952
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0641     .94779   1.1228   0.262   -.793492      2.92177
    Bias-corrected |  .75603     .94779   0.7977   0.425    -1.1016      2.61366
            Robust |  .75603     1.3417   0.5635   0.573   -1.87357      3.38563
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(
> nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10600
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4632        5968            Kernel        = Epanechnikov
Eff. Number of obs |      1877        2354            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    79.460      79.460
       BW bias (b) |   122.031     122.031
         rho (h/b) |     0.651       0.651
        Unique obs |       319         247
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05829     .04282   1.3613   0.173   -.025635      .142215
    Bias-corrected |   .0563     .04282   1.3148   0.189   -.027626      .140224
            Robust |   .0563      .0504   1.1171   0.264   -.042481      .155079
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .7251     1.4815   0.4894   0.625   -2.17866      3.62887
    Bias-corrected |  .50957     1.4815   0.3439   0.731   -2.39419      3.41334
            Robust |  .50957     1.5545   0.3278   0.743   -2.53717      3.55631
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03233     .16051   -0.2014  0.840   -.346915      .282259
    Bias-corrected |   .1552     .16051   0.9670   0.334   -.159383      .469792
            Robust |   .1552     .27609   0.5622   0.574   -.385923      .696331
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.9732     15.599   0.1906   0.849   -27.5994      33.5459
    Bias-corrected |   22.36     15.599   1.4334   0.152   -8.21309      52.9322
            Robust |   22.36     26.071   0.8576   0.391   -28.7384      73.4576
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        605
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         313            Kernel        =    Uniform
Eff. Number of obs |       292         313            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12122     .08802   1.3771   0.168   -.051302      .293734
    Bias-corrected |  .03286     .08802   0.3733   0.709   -.139658      .205378
            Robust |  .03286     .10956   0.2999   0.764   -.181873      .247593
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6296     1.2229   1.3326   0.183   -.767189      4.02636
    Bias-corrected |  2.0799     1.2229   1.7008   0.089   -.316888      4.47666
            Robust |  2.0799     1.6415   1.2671   0.205   -1.13742       5.2972
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2740
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1152        1588            Kernel        = Epanechnikov
Eff. Number of obs |       651         670            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    82.887      82.887
       BW bias (b) |   139.092     139.092
         rho (h/b) |     0.596       0.596
        Unique obs |       235         242
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07256     .06865   1.0569   0.291   -.062002      .207117
    Bias-corrected |  .09031     .06865   1.3154   0.188   -.044251      .224868
            Robust |  .09031     .08118   1.1125   0.266   -.068796      .249412
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.7101     1.9047   0.8979   0.369   -2.02292      5.44317
    Bias-corrected |  1.4644     1.9047   0.7689   0.442   -2.26866      5.19744
            Robust |  1.4644     2.1368   0.6853   0.493   -2.72364      5.65243
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07461     .10918   0.6833   0.494   -.139386      .288605
    Bias-corrected |  .25952     .10918   2.3769   0.017    .045525      .473516
            Robust |  .25952     .21959   1.1818   0.237   -.170877      .689918
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   -.008     1.9309   -0.0041  0.997   -3.79254      3.77654
    Bias-corrected | -1.9998     1.9309   -1.0357  0.300   -5.78439       1.7847
            Robust | -1.9998     4.0592   -0.4927  0.622   -9.95569        5.956
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         650            Kernel        =    Uniform
Eff. Number of obs |       504         650            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08995      .0677   1.3286   0.184   -.042744      .222642
    Bias-corrected |  .06163      .0677   0.9104   0.363   -.071061      .194325
            Robust |  .06163       .106   0.5814   0.561    -.14613      .269395
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .74711     1.2164   0.6142   0.539   -1.63708      3.13131
    Bias-corrected | -.12196     1.2164   -0.1003  0.920   -2.50616      2.26223
            Robust | -.12196     1.7048   -0.0715  0.943   -3.46325      3.21933
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7860
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3480        4380            Kernel        = Epanechnikov
Eff. Number of obs |       881        1172            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.728      58.728
       BW bias (b) |    85.417      85.417
         rho (h/b) |     0.688       0.688
        Unique obs |       314         236
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03509     .05741   0.6112   0.541   -.077436      .147613
    Bias-corrected |  .03108     .05741   0.5413   0.588   -.081449      .143601
            Robust |  .03108     .06992   0.4444   0.657    -.10597      .168122
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.25809     2.8347   -0.0910  0.927   -5.81405      5.29786
    Bias-corrected | -.54543     2.8347   -0.1924  0.847   -6.10139      5.01053
            Robust | -.54543     3.0174   -0.1808  0.857   -6.45944      5.36858
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        723
-------------------+----------------------            BW type       =     Manual
     Number of obs |       399         324            Kernel        =    Uniform
Eff. Number of obs |       399         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11389     .09246   1.2319   0.218   -.067319      .295106
    Bias-corrected |  .17899     .09246   1.9360   0.053    -.00222      .360205
            Robust |  .17899      .2132   0.8396   0.401   -.238871      .596855
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .78226     1.1644   0.6718   0.502   -1.49985      3.06436
    Bias-corrected | -2.5961     1.1644   -2.2297  0.026   -4.87824      -.31403
            Robust | -2.5961     2.7358   -0.9489  0.343   -7.95822      2.76595
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2515
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1194        1321            Kernel        =    Uniform
Eff. Number of obs |      1194        1321            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08919     .04296   2.0763   0.038    .004998      .173382
    Bias-corrected |  .12311     .04296   2.8661   0.004    .038923      .207306
            Robust |  .12311     .07328   1.6800   0.093   -.020515      .266744
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .61736     .67092   0.9202   0.357   -.697608      1.93233
    Bias-corrected |  .60124     .67092   0.8961   0.370   -.713732      1.91621
            Robust |  .60124      1.137   0.5288   0.597   -1.62721      2.82968
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15982
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8304        7678            Kernel        = Epanechnikov
Eff. Number of obs |      1642        1823            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.350      47.350
       BW bias (b) |    80.100      80.100
         rho (h/b) |     0.591       0.591
        Unique obs |       368         259

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06234     .03877   1.6081   0.108   -.013641       .13832
    Bias-corrected |  .06791     .03877   1.7518   0.080   -.008072       .14389
            Robust |  .06791     .04684   1.4498   0.147   -.023899      .159717
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .36097     .85701   0.4212   0.674   -1.31874      2.04067
    Bias-corrected |  .33545     .85701   0.3914   0.695   -1.34426      2.01516
            Robust |  .33545     1.0332   0.3247   0.745   -1.68963      2.36053
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05595     .12259   -0.4564  0.648   -.296209      .184316
    Bias-corrected |  .22038     .12259   1.7978   0.072    -.01988      .460645
            Robust |  .22038     .29715   0.7417   0.458   -.362021      .802787
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2412      3.531   0.3515   0.725   -5.67942      8.16175
    Bias-corrected |   15.43      3.531   4.3698   0.000     8.5092      22.3504
            Robust |   15.43     8.5695   1.8005   0.072   -1.36622      32.2258
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1688
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         928            Kernel        =    Uniform
Eff. Number of obs |       760         928            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09057     .05316   1.7038   0.088   -.013616      .194758
    Bias-corrected | -.02877     .05316   -0.5413  0.588   -.132961      .075413
            Robust | -.02877     .09417   -0.3055  0.760    -.21335      .155802
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   1.352     .99698   1.3561   0.175   -.602086      3.30599
    Bias-corrected |  1.6736     .99698   1.6786   0.093   -.280488      3.62759
            Robust |  1.6736     1.7561   0.9530   0.341   -1.76829      5.11539
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10529
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4596        5933            Kernel        = Epanechnikov
Eff. Number of obs |      1167        1467            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.994      52.994
       BW bias (b) |    87.933      87.933
         rho (h/b) |     0.603       0.603
        Unique obs |       318         246

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04122     .04501   0.9156   0.360    -.04701      .129443
    Bias-corrected |  .03855     .04501   0.8564   0.392   -.049676      .126777
            Robust |  .03855      .0549   0.7022   0.483   -.069058      .146159
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.4928     1.9443   0.7678   0.443   -2.31787      5.30356
    Bias-corrected |  1.6946     1.9443   0.8716   0.383   -2.11607      5.50536
            Robust |  1.6946     2.3679   0.7157   0.474   -2.94644      6.33573
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07375     .19964   -0.3694  0.712   -.465044      .317536
    Bias-corrected |  .26854     .19964   1.3451   0.179   -.122748      .659833
            Robust |  .26854     .49252   0.5452   0.586   -.696782      1.23387
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.5451      6.415   0.3967   0.692   -10.0281      15.1183
    Bias-corrected |  21.283      6.415   3.3177   0.001    8.70965       33.856
            Robust |  21.283      14.64   1.4538   0.146   -7.41041      49.9761
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        587
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         306            Kernel        =    Uniform
Eff. Number of obs |       281         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13589     .08828   1.5393   0.124   -.037131      .308904
    Bias-corrected |  .03431     .08828   0.3886   0.698   -.138712      .207323
            Robust |  .03431     .15635   0.2194   0.826   -.272141      .340752
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.5333     1.0803   1.4194   0.156   -.584004      3.65061
    Bias-corrected |  2.0517     1.0803   1.8992   0.058   -.065626      4.16899
            Robust |  2.0517     1.8588   1.1038   0.270    -1.5915      5.69486
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2722
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1141        1581            Kernel        = Epanechnikov
Eff. Number of obs |       515         556            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.389      65.389
       BW bias (b) |   117.569     117.569
         rho (h/b) |     0.556       0.556
        Unique obs |       234         241

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08731     .06586   1.3257   0.185   -.041775      .216399
    Bias-corrected |  .10029     .06586   1.5228   0.128   -.028792      .229382
            Robust |  .10029     .07816   1.2832   0.199     -.0529      .253489
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.9613     1.4702   1.3340   0.182   -.920272      4.84286
    Bias-corrected |  1.9529     1.4702   1.3283   0.184   -.928715      4.83442
            Robust |  1.9529     1.7526   1.1143   0.265   -1.48219      5.38789
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03061       .137   -0.2234  0.823   -.299122        .2379
    Bias-corrected |  .14334       .137   1.0463   0.295   -.125168      .411855
            Robust |  .14334     .32802   0.4370   0.662    -.49956      .786248
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .26232     7.3342   0.0358   0.971   -14.1125      14.6371
    Bias-corrected |  17.201     7.3342   2.3453   0.019    2.82617      31.5757
            Robust |  17.201     17.473   0.9844   0.325    -17.045      51.4469
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1101
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         622            Kernel        =    Uniform
Eff. Number of obs |       479         622            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06852     .05832   1.1749   0.240   -.045788      .182833
    Bias-corrected | -.00866     .05832   -0.1484  0.882   -.122966      .105655
            Robust | -.00866     .10455   -0.0828  0.934   -.213563      .196252
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1268     1.5615   0.7216   0.471   -1.93372       4.1874
    Bias-corrected |  .46226     1.5615   0.2960   0.767    -2.5983      3.52282
            Robust |  .46226     2.8105   0.1645   0.869   -5.04625      5.97077
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7807
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3455        4352            Kernel        = Epanechnikov
Eff. Number of obs |       807        1070            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.958      55.958
       BW bias (b) |    95.187      95.187
         rho (h/b) |     0.588       0.588
        Unique obs |       313         235

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00916      .0476   0.1924   0.847   -.084138      .102459
    Bias-corrected |  -.0018      .0476   -0.0377  0.970   -.095094      .091502
            Robust |  -.0018     .05733   -0.0313  0.975   -.114165      .110573
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.6261     13.505   -0.1204  0.904   -28.0961      24.8439
    Bias-corrected | -6.0645     13.505   -0.4490  0.653   -32.5345      20.4055
            Robust | -6.0645     16.216   -0.3740  0.708   -37.8465      25.7175
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(
> nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        723
-------------------+----------------------            BW type       =     Manual
     Number of obs |       399         324            Kernel        =    Uniform
Eff. Number of obs |       399         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11389      .0867   1.3137   0.189   -.056032       .28382
    Bias-corrected |  .17899      .0867   2.0645   0.039    .009066      .348919
            Robust |  .17899     .21429   0.8353   0.404   -.241017      .599001
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .78226     1.0376   0.7539   0.451   -1.25137      2.81589
    Bias-corrected | -2.5961     1.0376   -2.5021  0.012   -4.62977     -.562503
            Robust | -2.5961      3.019   -0.8599  0.390    -8.5133      3.32103
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(
> nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2515
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1194        1321            Kernel        =    Uniform
Eff. Number of obs |      1194        1321            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08919     .05559   1.6043   0.109   -.019774      .198153
    Bias-corrected |  .12311     .05559   2.2145   0.027    .014151      .232078
            Robust |  .12311     .07231   1.7025   0.089   -.018618      .264847
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .61736     .77438   0.7972   0.425    -.90039      2.13511
    Bias-corrected |  .60124     .77438   0.7764   0.438   -.916514      2.11899
            Robust |  .60124     1.1071   0.5431   0.587   -1.56865      2.77113
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pr
> ovince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15982
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8304        7678            Kernel        = Epanechnikov
Eff. Number of obs |      1953        2105            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.577      54.577
       BW bias (b) |    78.143      78.143
         rho (h/b) |     0.698       0.698
        Unique obs |       368         259
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05111     .04588   1.1140   0.265   -.038813      .141036
    Bias-corrected |  .05995     .04588   1.3066   0.191   -.029976      .149873
            Robust |  .05995     .05263   1.1391   0.255     -.0432      .163097
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .33935     1.3602   0.2495   0.803   -2.32654      3.00524
    Bias-corrected |  .35142     1.3602   0.2584   0.796   -2.31447      3.01731
            Robust |  .35142     1.5481   0.2270   0.820   -2.68283      3.38566
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.05595     .09665   -0.5789  0.563   -.245369      .133476
    Bias-corrected |  .22038     .09665   2.2803   0.023     .03096      .409805
            Robust |  .22038      .2812   0.7837   0.433   -.330761      .771527
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2412     3.1205   0.3977   0.691   -4.87488       7.3572
    Bias-corrected |   15.43     3.1205   4.9447   0.000    9.31374      21.5458
            Robust |   15.43     8.1461   1.8941   0.058    -.53631      31.3959
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(uni) p(1) h(
> 36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1688
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         928            Kernel        =    Uniform
Eff. Number of obs |       760         928            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09057     .05835   1.5522   0.121   -.023791      .204933
    Bias-corrected | -.02877     .05835   -0.4931  0.622   -.143136      .085588
            Robust | -.02877     .08566   -0.3359  0.737    -.19667      .139121
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   1.352     1.1235   1.2033   0.229   -.850162      3.55407
    Bias-corrected |  1.6736     1.1235   1.4895   0.136   -.528565      3.87567
            Robust |  1.6736     1.5767   1.0614   0.288   -1.41667      4.76377
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(
> nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10529
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4596        5933            Kernel        = Epanechnikov
Eff. Number of obs |      1196        1492            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.207      53.207
       BW bias (b) |    81.536      81.536
         rho (h/b) |     0.653       0.653
        Unique obs |       318         246
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04109     .04949   0.8303   0.406   -.055913      .138098
    Bias-corrected |  .03925     .04949   0.7930   0.428   -.057758      .136252
            Robust |  .03925     .06082   0.6453   0.519   -.079956       .15845
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.4981     2.7379   0.5472   0.584    -3.8681      6.86426
    Bias-corrected |  1.8854     2.7379   0.6886   0.491   -3.48078      7.25158
            Robust |  1.8854     3.0983   0.6085   0.543   -4.18725      7.95805
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07375      .2203   -0.3348  0.738   -.505536      .358028
    Bias-corrected |  .26854      .2203   1.2190   0.223    -.16324      .700325
            Robust |  .26854     .46711   0.5749   0.565   -.646967      1.18405
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.5451     7.4264   0.3427   0.732   -12.0105      17.1006
    Bias-corrected |  21.283     7.4264   2.8658   0.004    6.72729      35.8384
            Robust |  21.283     15.812   1.3460   0.178   -9.70763      52.2733
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        587
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         306            Kernel        =    Uniform
Eff. Number of obs |       281         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13589      .0949   1.4319   0.152   -.050108      .321882
    Bias-corrected |  .03431      .0949   0.3615   0.718    -.15169        .2203
            Robust |  .03431      .1324   0.2591   0.796   -.225197      .293808
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.5333     1.0431   1.4700   0.142   -.511071      3.57768
    Bias-corrected |  2.0517     1.0431   1.9670   0.049    .007307      4.09606
            Robust |  2.0517       1.39   1.4760   0.140   -.672677      4.77604
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2722
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1141        1581            Kernel        = Epanechnikov
Eff. Number of obs |       566         589            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.109      71.109
       BW bias (b) |   121.562     121.562
         rho (h/b) |     0.585       0.585
        Unique obs |       234         241
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08242     .07312   1.1272   0.260   -.060891      .225724
    Bias-corrected |   .0975     .07312   1.3335   0.182   -.045806       .24081
            Robust |   .0975     .08863   1.1001   0.271   -.076214      .271218
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8424     1.7109   1.0769   0.282    -1.5109      5.19571
    Bias-corrected |  1.8071     1.7109   1.0562   0.291   -1.54618      5.16042
            Robust |  1.8071     1.9297   0.9365   0.349   -1.97493      5.58916
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.03061     .14206   -0.2155  0.829   -.309048      .247826
    Bias-corrected |  .14334     .14206   1.0090   0.313   -.135093       .42178
            Robust |  .14334      .2515   0.5700   0.569   -.349589      .636276
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .26232     5.4776   0.0479   0.962   -10.4736      10.9983
    Bias-corrected |  17.201     5.4776   3.1402   0.002    6.46501      27.9369
            Robust |  17.201     16.944   1.0151   0.310   -16.0096      50.4115
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(n
> ncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1101
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         622            Kernel        =    Uniform
Eff. Number of obs |       479         622            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06852     .07283   0.9409   0.347   -.074221      .211266
    Bias-corrected | -.00866     .07283   -0.1188  0.905   -.151399      .134088
            Robust | -.00866     .12858   -0.0673  0.946   -.260667      .243356
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1268     1.7024   0.6619   0.508   -2.20977      4.46345
    Bias-corrected |  .46226     1.7024   0.2715   0.786   -2.87434      3.79887
            Robust |  .46226     2.5956   0.1781   0.859   -4.62504      5.54956
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster pro
> vince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7807
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3455        4352            Kernel        = Epanechnikov
Eff. Number of obs |       741         980            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    51.629      51.629
       BW bias (b) |    85.098      85.098
         rho (h/b) |     0.607       0.607
        Unique obs |       313         235
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01156     .06374   0.1813   0.856   -.113366      .136476
    Bias-corrected |  .00042     .06374   0.0066   0.995   -.124499      .125343
            Robust |  .00042     .07765   0.0054   0.996   -.151772      .152616
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.97942     11.263   -0.0870  0.931   -23.0537      21.0949
    Bias-corrected | -2.7189     11.263   -0.2414  0.809   -24.7932      19.3554
            Robust | -2.7189      12.84   -0.2118  0.832   -27.8847      22.4468
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male controlled/Ear
> ning Sheet 6 results.xls
dir : seeout

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male c
> ontrolled/Urban 1979 Higheredu FuzzyOption Male controlled.log
  log type:  text
 closed on:   6 Aug 2024, 17:14:26
---------------------------------------------------------------------------------------------
