---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male E
> xp controlled/Urban 1979 Higheredu FuzzyOption MaleExp controlled.log
  log type:  text
 opened on:   6 Aug 2024, 17:14:40

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,431 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(33,372 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(5,190 real changes made)

. 
. *Step Two: Regressions
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       486         440            Kernel        =    Uniform
Eff. Number of obs |       486         440            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03179     .03647   0.8718   0.383   -.039683      .103265
    Bias-corrected |  .04344     .03647   1.1913   0.234   -.028032      .114917
            Robust |  .04344     .05881   0.7387   0.460   -.071825       .15871
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.4991     5.7693   0.7798   0.435   -6.80844      15.8066
    Bias-corrected |  2.9815     5.7693   0.5168   0.605   -8.32608       14.289
            Robust |  2.9815     9.5022   0.3138   0.754   -15.6426      21.6055
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2714
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1280        1434            Kernel        =    Uniform
Eff. Number of obs |      1280        1434            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04083     .02173   1.8787   0.060   -.001767      .083421
    Bias-corrected |  .00597     .02173   0.2745   0.784   -.036628       .04856
            Robust |  .00597     .03221   0.1852   0.853   -.057161      .069093
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    1.75     1.4982   1.1680   0.243    -1.1865      4.68648
    Bias-corrected |  4.0456     1.4982   2.7003   0.007    1.10915      6.98212
            Robust |  4.0456     2.2205   1.8220   0.068   -.306397      8.39767
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16124
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8361        7763            Kernel        = Epanechnikov
Eff. Number of obs |      2804        2982            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    72.452      72.452
       BW bias (b) |   124.450     124.450
         rho (h/b) |     0.582       0.582
        Unique obs |       370         261

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01392      .0164   0.8492   0.396   -.018213      .046061
    Bias-corrected |  .01748      .0164   1.0661   0.286   -.014656      .049617
            Robust |  .01748     .01899   0.9206   0.357   -.019735      .054696
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.0801     3.5376   0.5880   0.557   -4.85334      9.01361
    Bias-corrected |   1.687     3.5376   0.4769   0.633   -5.24646      8.62049
            Robust |   1.687     4.0982   0.4116   0.681   -6.34528      9.71931
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12) al
> l

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        624
-------------------+----------------------            BW type       =     Manual
     Number of obs |       318         306            Kernel        =    Uniform
Eff. Number of obs |       318         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02048     .04979   0.4113   0.681   -.077115      .118071
    Bias-corrected |  .02325     .04979   0.4669   0.641   -.074344      .120842
            Robust |  .02325     .07637   0.3044   0.761   -.126442       .17294
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.9107      13.12   0.3743   0.708   -20.8033      30.6248
    Bias-corrected |   3.761      13.12   0.2867   0.774    -21.953      29.4751
            Robust |   3.761     20.619   0.1824   0.855    -36.652       44.174
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36) al
> l

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1836
-------------------+----------------------            BW type       =     Manual
     Number of obs |       831        1005            Kernel        =    Uniform
Eff. Number of obs |       831        1005            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05152     .03048   1.6904   0.091   -.008214      .111258
    Bias-corrected |  .00069     .03048   0.0225   0.982    -.05905      .060422
            Robust |  .00069     .04508   0.0152   0.988   -.087667       .08904
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.2996      1.796   1.2804   0.200   -1.22046       5.8196
    Bias-corrected |  3.9414      1.796   2.1946   0.028    .421362      7.46143
            Robust |  3.9414     2.7065   1.4563   0.145   -1.36321        9.246
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10638
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4651        5987            Kernel        = Epanechnikov
Eff. Number of obs |      1831        2265            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    75.829      75.829
       BW bias (b) |   134.533     134.533
         rho (h/b) |     0.564       0.564
        Unique obs |       320         248

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02008     .02255   0.8902   0.373   -.024125      .064278
    Bias-corrected |   .0226     .02255   1.0023   0.316   -.021598      .066805
            Robust |   .0226     .02595   0.8712   0.384   -.028249      .073456
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.5298     3.5877   0.7051   0.481   -4.50197      9.56166
    Bias-corrected |  2.0722     3.5877   0.5776   0.564   -4.95958      9.10404
            Robust |  2.0722     4.1319   0.5015   0.616   -6.02614      10.1706
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       105         100            Kernel        =    Uniform
Eff. Number of obs |       105         100            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04504     .08299   0.5427   0.587   -.117609      .207689
    Bias-corrected |  .16491     .08299   1.9872   0.047    .002264      .327562
            Robust |  .16491     .10231   1.6119   0.107   -.035605      .365431
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.98171     4.6169   -0.2126  0.832   -10.0308      8.06734
    Bias-corrected |  1.6047     4.6169   0.3476   0.728    -7.4444      10.6537
            Robust |  1.6047     6.6528   0.2412   0.809   -11.4346      14.6439
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05996     .05612   1.0684   0.285   -.050033      .169948
    Bias-corrected |  .03992     .05612   0.7113   0.477   -.070072      .149909
            Robust |  .03992     .07748   0.5152   0.606   -.111935      .191772
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.4777     2.6004   0.9528   0.341   -2.61896      7.57426
    Bias-corrected |  2.1526     2.6004   0.8278   0.408   -2.94402       7.2492
            Robust |  2.1526     3.8419   0.5603   0.575   -5.37745      9.68264
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2756
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1598            Kernel        = Epanechnikov
Eff. Number of obs |       622         632            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    75.049      75.049
       BW bias (b) |   118.319     118.319
         rho (h/b) |     0.634       0.634
        Unique obs |       236         243

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05018     .04324   1.1605   0.246   -.034567      .134918
    Bias-corrected |  .05759     .04324   1.3320   0.183   -.027151      .142334
            Robust |  .05759     .05126   1.1234   0.261   -.042883      .158066
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.2391     2.1662   1.0337   0.301   -2.00653      6.48475
    Bias-corrected |  2.3664     2.1662   1.0924   0.275   -1.87925      6.61204
            Robust |  2.3664     2.5997   0.9102   0.363   -2.72899      7.46179
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0147     .05493   -0.2676  0.789   -.122365      .092969
    Bias-corrected | -.06147     .05493   -1.1190  0.263   -.169135      .046199
            Robust | -.06147     .08445   -0.7279  0.467    -.22698      .104043
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -10.363     38.526   -0.2690  0.788   -85.8734      65.1469
    Bias-corrected |  22.969     38.526   0.5962   0.551   -52.5409      98.4794
            Robust |  22.969     58.028   0.3958   0.692   -90.7639      136.702
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         677            Kernel        =    Uniform
Eff. Number of obs |       528         677            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05093      .0338   1.5067   0.132    -.01532      .117175
    Bias-corrected | -.01462      .0338   -0.4326  0.665   -.080869      .051625
            Robust | -.01462     .05068   -0.2885  0.773   -.113958      .084714
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.1168     2.1378   0.9902   0.322   -2.07315      6.30672
    Bias-corrected |  4.5314     2.1378   2.1197   0.034     .34146      8.72133
            Robust |  4.5314     3.2072   1.4129   0.158   -1.75468      10.8175
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7882
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3493        4389            Kernel        = Epanechnikov
Eff. Number of obs |       669         909            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    45.392      45.392
       BW bias (b) |    78.965      78.965
         rho (h/b) |     0.575       0.575
        Unique obs |       315         237

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02055     .03192   0.6439   0.520   -.042009      .083119
    Bias-corrected |   .0162     .03192   0.5076   0.612   -.046362      .078766
            Robust |   .0162     .03666   0.4419   0.659   -.055658      .088063
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.2705     6.4436   0.5076   0.612   -9.35871      15.8997
    Bias-corrected |  4.7044     6.4436   0.7301   0.465   -7.92479      17.3337
            Robust |  4.7044     7.3914   0.6365   0.524   -9.78235      19.1912
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(nnclus
> ter province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       486         440            Kernel        =    Uniform
Eff. Number of obs |       486         440            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03179     .04611   0.6895   0.491   -.058584      .122167
    Bias-corrected |  .04344     .04611   0.9421   0.346   -.046933      .133818
            Robust |  .04344      .0526   0.8260   0.409   -.059646      .146531
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.4991     7.3833   0.6094   0.542   -9.97191      18.9701
    Bias-corrected |  2.9815     7.3833   0.4038   0.686   -11.4896      17.4525
            Robust |  2.9815     10.782   0.2765   0.782   -18.1516      24.1145
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(nnclus
> ter province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2714
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1280        1434            Kernel        =    Uniform
Eff. Number of obs |      1280        1434            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04083     .03202   1.2752   0.202   -.021922      .103576
    Bias-corrected |  .00597     .03202   0.1863   0.852   -.056783      .068715
            Robust |  .00597     .04082   0.1462   0.884   -.074032      .085964
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    1.75     2.3074   0.7584   0.448   -2.77236      6.27233
    Bias-corrected |  4.0456     2.3074   1.7534   0.080   -.476708      8.56798
            Robust |  4.0456     3.0938   1.3076   0.191   -2.01819      10.1095
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province
> _code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16124
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8361        7763            Kernel        = Epanechnikov
Eff. Number of obs |      3861        4149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    97.423      97.423
       BW bias (b) |   144.345     144.345
         rho (h/b) |     0.675       0.675
        Unique obs |       370         261
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01611     .02127   0.7574   0.449   -.025575      .057787
    Bias-corrected |  .02252     .02127   1.0589   0.290   -.019162      .064201
            Robust |  .02252     .02328   0.9672   0.333   -.023114      .068153
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.0689     5.4555   0.3792   0.705   -8.62362      12.7614
    Bias-corrected |  1.0308     5.4555   0.1890   0.850   -9.66167      11.7233
            Robust |  1.0308     5.7394   0.1796   0.857   -10.2182      12.2799
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12) al
> l vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        624
-------------------+----------------------            BW type       =     Manual
     Number of obs |       318         306            Kernel        =    Uniform
Eff. Number of obs |       318         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02048     .05992   0.3418   0.733   -.096962      .137918
    Bias-corrected |  .02325     .05992   0.3880   0.698   -.094191      .140689
            Robust |  .02325     .06991   0.3326   0.739   -.113769      .160268
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.9107     17.131   0.2867   0.774   -28.6646       38.486
    Bias-corrected |   3.761     17.131   0.2195   0.826   -29.8143      37.3363
            Robust |   3.761     22.238   0.1691   0.866    -39.825      47.3471
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36) al
> l vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1836
-------------------+----------------------            BW type       =     Manual
     Number of obs |       831        1005            Kernel        =    Uniform
Eff. Number of obs |       831        1005            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05152     .04022   1.2810   0.200   -.027309      .130353
    Bias-corrected |  .00069     .04022   0.0171   0.986   -.078145      .079517
            Robust |  .00069     .05306   0.0129   0.990     -.1033      .104672
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.2996     2.7095   0.8487   0.396   -3.01093      7.61007
    Bias-corrected |  3.9414     2.7095   1.4547   0.146   -1.36911       9.2519
            Robust |  3.9414     3.4764   1.1338   0.257   -2.87219       10.755
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nnclus
> ter province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10638
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4651        5987            Kernel        = Epanechnikov
Eff. Number of obs |      2360        3117            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    98.236      98.236
       BW bias (b) |   127.086     127.086
         rho (h/b) |     0.773       0.773
        Unique obs |       320         248
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02363     .02792   0.8465   0.397   -.031086      .078347
    Bias-corrected |  .03056     .02792   1.0947   0.274   -.024156      .085276
            Robust |  .03056     .03305   0.9248   0.355   -.034209      .095329
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   2.233     4.9696   0.4493   0.653   -7.50724      11.9733
    Bias-corrected |  1.4956     4.9696   0.3009   0.763   -8.24466      11.2359
            Robust |  1.4956     5.4127   0.2763   0.782   -9.11312      12.1043
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       105         100            Kernel        =    Uniform
Eff. Number of obs |       105         100            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04504     .09311   0.4837   0.629    -.13746       .22754
    Bias-corrected |  .16491     .09311   1.7711   0.077   -.017587      .347413
            Robust |  .16491     .09964   1.6552   0.098   -.030369      .360195
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.98171     4.6495   -0.2111  0.833   -10.0945      8.13109
    Bias-corrected |  1.6047     4.6495   0.3451   0.730   -7.50815      10.7175
            Robust |  1.6047     7.1635   0.2240   0.823   -12.4356      15.6449
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05996      .0678   0.8844   0.377   -.072924       .19284
    Bias-corrected |  .03992      .0678   0.5888   0.556   -.092964        .1728
            Robust |  .03992     .07612   0.5244   0.600   -.109265      .189102
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.4777     3.2983   0.7512   0.453   -3.98687      8.94218
    Bias-corrected |  2.1526     3.2983   0.6526   0.514   -4.31193      8.61712
            Robust |  2.1526     4.2905   0.5017   0.616    -6.2566      10.5618
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2756
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1598            Kernel        = Epanechnikov
Eff. Number of obs |       644         669            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.483      80.483
       BW bias (b) |   117.917     117.917
         rho (h/b) |     0.683       0.683
        Unique obs |       236         243
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0489      .0566   0.8639   0.388   -.062038       .15983
    Bias-corrected |  .05729      .0566   1.0122   0.311   -.053643      .168225
            Robust |  .05729     .06932   0.8264   0.409   -.078583      .193164
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.1715     3.2391   0.6704   0.503    -4.1771       8.5201
    Bias-corrected |  2.3236     3.2391   0.7173   0.473   -4.02504      8.67216
            Robust |  2.3236     3.7603   0.6179   0.537   -5.04644      9.69356
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0147     .06619   -0.2221  0.824   -.144434      .115037
    Bias-corrected | -.06147     .06619   -0.9286  0.353   -.191204      .068267
            Robust | -.06147      .0709   -0.8669  0.386   -.200438      .077501
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -10.363     46.328   -0.2237  0.823   -101.164      80.4372
    Bias-corrected |  22.969     46.328   0.4958   0.620   -67.8313       113.77
            Robust |  22.969     49.024   0.4685   0.639   -73.1159      119.054
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         677            Kernel        =    Uniform
Eff. Number of obs |       528         677            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05093     .04453   1.1438   0.253   -.036342      .138198
    Bias-corrected | -.01462     .04453   -0.3284  0.743   -.101892      .072648
            Robust | -.01462     .06216   -0.2352  0.814   -.136454       .10721
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.1168     2.8169   0.7515   0.452   -3.40425      7.63782
    Bias-corrected |  4.5314     2.8169   1.6086   0.108   -.989639      10.0524
            Robust |  4.5314     3.5265   1.2849   0.199   -2.38051      11.4433
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7882
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3493        4389            Kernel        = Epanechnikov
Eff. Number of obs |       804        1060            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.612      52.612
       BW bias (b) |    79.156      79.156
         rho (h/b) |     0.665       0.665
        Unique obs |       315         237
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01426     .03793   0.3759   0.707   -.060077      .088588
    Bias-corrected |  .00897     .03793   0.2365   0.813   -.065362      .083302
            Robust |  .00897     .04468   0.2008   0.841   -.078594      .096534
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.0988      12.38   0.2503   0.802   -21.1652      27.3628
    Bias-corrected |  5.6281      12.38   0.4546   0.649    -18.636      29.8921
            Robust |  5.6281     13.636   0.4127   0.680   -21.0983      32.3544
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(1
> 2) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        824
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         381            Kernel        =    Uniform
Eff. Number of obs |       443         381            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09053     .04259   2.1259   0.034    .007065      .174004
    Bias-corrected |  .22924     .04259   5.3830   0.000    .145776      .312714
            Robust |  .22924     .08033   2.8538   0.004    .071804      .386686
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .94892     1.1201   0.8472   0.397   -1.24636       3.1442
    Bias-corrected | -1.5596     1.1201   -1.3924  0.164   -3.75484      .635722
            Robust | -1.5596     2.0849   -0.7480  0.454    -5.6458      2.52668
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(3
> 6) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2612
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1237        1375            Kernel        =    Uniform
Eff. Number of obs |      1237        1375            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05984     .02308   2.5931   0.010    .014611      .105076
    Bias-corrected |  .04133     .02308   1.7908   0.073   -.003904       .08656
            Robust |  .04133     .03615   1.1431   0.253   -.029532      .112188
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .68541     .91248   0.7512   0.453   -1.10301      2.47384
    Bias-corrected |  .95128     .91248   1.0425   0.297   -.837143       2.7397
            Robust |  .95128     1.3974   0.6808   0.496   -1.78753      3.69009
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16022
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8318        7704            Kernel        = Epanechnikov
Eff. Number of obs |      1834        2013            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.927      50.927
       BW bias (b) |    87.987      87.987
         rho (h/b) |     0.579       0.579
        Unique obs |       369         260

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03724     .02035   1.8301   0.067   -.002642      .077125
    Bias-corrected |  .04247     .02035   2.0870   0.037    .002586      .082352
            Robust |  .04247     .02378   1.7859   0.074   -.004139      .089077
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .42323     1.2643   0.3348   0.738   -2.05473      2.90118
    Bias-corrected |  .36954     1.2643   0.2923   0.770   -2.10842      2.84749
            Robust |  .36954     1.4772   0.2502   0.802   -2.52577      3.26484
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(u
> ni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1053     .06115   1.7220   0.085   -.014553      .225157
    Bias-corrected |   .2858     .06115   4.6736   0.000    .165941      .405651
            Robust |   .2858     .11135   2.5665   0.010    .067545      .504047
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .26548     1.1812   0.2248   0.822   -2.04965       2.5806
    Bias-corrected | -1.3284     1.1812   -1.1246  0.261    -3.6435      .986754
            Robust | -1.3284     2.1226   -0.6258  0.531   -5.48855       2.8318
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(u
> ni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1756
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         960            Kernel        =    Uniform
Eff. Number of obs |       796         960            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08197     .03291   2.4911   0.013    .017479      .146468
    Bias-corrected |  .05849     .03291   1.7774   0.076   -.006007      .122982
            Robust |  .05849      .0527   1.1099   0.267   -.044796       .16177
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2183     .92753   1.3135   0.189    -.59962      3.03622
    Bias-corrected |  .67685     .92753   0.7297   0.466   -1.14106      2.49477
            Robust |  .67685     1.4732   0.4594   0.646    -2.2106      3.56431
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mser
> d) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10558
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4616        5942            Kernel        = Epanechnikov
Eff. Number of obs |      1202        1496            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.590      52.590
       BW bias (b) |    87.488      87.488
         rho (h/b) |     0.601       0.601
        Unique obs |       319         247

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05304     .02839   1.8682   0.062   -.002604      .108678
    Bias-corrected |  .05634     .02839   1.9845   0.047    .000697      .111979
            Robust |  .05634     .03371   1.6713   0.095   -.009731      .122406
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   1.124     1.2208   0.9207   0.357   -1.26883      3.51677
    Bias-corrected |  1.2324     1.2208   1.0095   0.313   -1.16036      3.62524
            Robust |  1.2324     1.4501   0.8499   0.395   -1.60963      4.07452
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04261     .13031   0.3270   0.744   -.212799      .298022
    Bias-corrected |  .32357     .13031   2.4830   0.013    .068157      .578978
            Robust |  .32357     .24931   1.2979   0.194   -.165063      .812197
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.6729     7.8798   -0.2123  0.832    -17.117      13.7712
    Bias-corrected |  8.4627     7.8798   1.0740   0.283   -6.98143      23.9068
            Robust |  8.4627     14.761   0.5733   0.566   -20.4687       37.394
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        604
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         312            Kernel        =    Uniform
Eff. Number of obs |       292         312            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05498     .06494   0.8467   0.397   -.072297      .182265
    Bias-corrected |  .02492     .06494   0.3837   0.701   -.102364      .152198
            Robust |  .02492     .10597   0.2351   0.814   -.182784      .232618
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.1178     3.7384   0.8340   0.404   -4.20931       10.445
    Bias-corrected |  3.5613     3.7384   0.9526   0.341   -3.76588      10.8884
            Robust |  3.5613     6.2127   0.5732   0.566   -8.61539      15.7379
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2729
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1147        1582            Kernel        = Epanechnikov
Eff. Number of obs |       566         582            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.901      70.901
       BW bias (b) |   116.124     116.124
         rho (h/b) |     0.611       0.611
        Unique obs |       235         242

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05152      .0487   1.0580   0.290   -.043924      .146961
    Bias-corrected |  .05823      .0487   1.1957   0.232   -.037215       .15367
            Robust |  .05823     .05854   0.9946   0.320   -.056513      .172968
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.6301     2.5667   1.0247   0.306   -2.40057      7.66073
    Bias-corrected |  2.8357     2.5667   1.1048   0.269   -2.19499       7.8663
            Robust |  2.8357     3.1053   0.9132   0.361   -3.25061      8.92192
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10693      .0653   1.6375   0.102    -.02106      .234916
    Bias-corrected |  .24526      .0653   3.7559   0.000    .117277      .373252
            Robust |  .24526     .11407   2.1500   0.032    .021683      .468847
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .4984     1.4867   0.3352   0.737   -2.41549      3.41229
    Bias-corrected | -1.5806     1.4867   -1.0632  0.288    -4.4945      1.33329
            Robust | -1.5806     2.6432   -0.5980  0.550   -6.76127      3.60006
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1152
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         648            Kernel        =    Uniform
Eff. Number of obs |       504         648            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09793     .03607   2.7151   0.007    .027238      .168626
    Bias-corrected |  .07514     .03607   2.0832   0.037    .004445      .145833
            Robust |  .07514     .05815   1.2922   0.196    -.03883      .189108
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .68351     .90572   0.7547   0.450   -1.09166      2.45869
    Bias-corrected |  .08997     .90572   0.0993   0.921   -1.68521      1.86514
            Robust |  .08997     1.4228   0.0632   0.950   -2.69865      2.87858
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7829
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3469        4360            Kernel        = Epanechnikov
Eff. Number of obs |       734         965            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.651      49.651
       BW bias (b) |    80.158      80.158
         rho (h/b) |     0.619       0.619
        Unique obs |       314         236

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05498     .03189   1.7240   0.085   -.007526      .117495
    Bias-corrected |  .05866     .03189   1.8393   0.066   -.003848      .121173
            Robust |  .05866     .03842   1.5269   0.127   -.016638      .133963
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .13319      1.392   0.0957   0.924   -2.59515      2.86152
    Bias-corrected |  .25611      1.392   0.1840   0.854   -2.47223      2.98444
            Robust |  .25611     1.6568   0.1546   0.877   -2.99117      3.50339
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(1
> 2) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        824
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         381            Kernel        =    Uniform
Eff. Number of obs |       443         381            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09053     .06319   1.4327   0.152   -.033318      .214387
    Bias-corrected |  .22924     .06319   3.6278   0.000    .105392      .353098
            Robust |  .22924     .10863   2.1104   0.035    .016341      .442149
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .94892     1.2596   0.7534   0.451   -1.51985      3.41769
    Bias-corrected | -1.5596     1.2596   -1.2381  0.216   -4.02833      .909212
            Robust | -1.5596     2.8045   -0.5561  0.578   -7.05635      3.93723
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(3
> 6) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2612
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1237        1375            Kernel        =    Uniform
Eff. Number of obs |      1237        1375            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05984     .03359   1.7818   0.075   -.005985      .125671
    Bias-corrected |  .04133     .03359   1.2305   0.219     -.0245      .107156
            Robust |  .04133     .04894   0.8445   0.398   -.054588      .137244
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .68541     1.2368   0.5542   0.579   -1.73867      3.10949
    Bias-corrected |  .95128     1.2368   0.7691   0.442    -1.4728      3.37536
            Robust |  .95128      1.795   0.5300   0.596   -2.56676      4.46932
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(n
> ncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16022
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8318        7704            Kernel        = Epanechnikov
Eff. Number of obs |      2450        2651            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.158      65.158
       BW bias (b) |    91.919      91.919
         rho (h/b) |     0.709       0.709
        Unique obs |       369         260
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02563     .02777   0.9227   0.356   -.028809       .08006
    Bias-corrected |  .03185     .02777   1.1466   0.252   -.022588      .086281
            Robust |  .03185     .03449   0.9234   0.356   -.035747       .09944
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .25816     2.4377   0.1059   0.916    -4.5196      5.03592
    Bias-corrected |  .11193     2.4377   0.0459   0.963   -4.66583      4.88969
            Robust |  .11193      2.656   0.0421   0.966   -5.09379      5.31766
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(u
> ni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1053     .08164   1.2899   0.197   -.054704      .265308
    Bias-corrected |   .2858     .08164   3.5008   0.000     .12579      .445802
            Robust |   .2858     .15978   1.7887   0.074   -.027358       .59895
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .26548     1.2133   0.2188   0.827   -2.11264       2.6436
    Bias-corrected | -1.3284     1.2133   -1.0948  0.274   -3.70649      1.04975
            Robust | -1.3284     2.6233   -0.5064  0.613   -6.46997      3.81323
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(u
> ni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1756
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         960            Kernel        =    Uniform
Eff. Number of obs |       796         960            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08197     .04317   1.8988   0.058   -.002639      .166585
    Bias-corrected |  .05849     .04317   1.3548   0.175   -.026125      .143099
            Robust |  .05849     .06518   0.8973   0.370   -.069262      .186237
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.2183     1.3165   0.9254   0.355   -1.36201       3.7986
    Bias-corrected |  .67685     1.3165   0.5141   0.607   -1.90345      3.25716
            Robust |  .67685     1.7974   0.3766   0.706   -2.84608      4.19979
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mser
> d) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10558
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4616        5942            Kernel        = Epanechnikov
Eff. Number of obs |      1280        1582            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.258      55.258
       BW bias (b) |    76.211      76.211
         rho (h/b) |     0.725       0.725
        Unique obs |       319         247
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04962     .03846   1.2903   0.197   -.025755      .125001
    Bias-corrected |  .06526     .03846   1.6968   0.090   -.010119      .140636
            Robust |  .06526     .04565   1.4296   0.153    -.02421      .154728
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1729      2.206   0.5317   0.595   -3.15088      5.49659
    Bias-corrected |  1.3037      2.206   0.5910   0.555   -3.02004      5.62744
            Robust |  1.3037     2.4465   0.5329   0.594   -3.49129      6.09869
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04261     .13753   0.3098   0.757   -.226949      .312172
    Bias-corrected |  .32357     .13753   2.3526   0.019    .054007      .593128
            Robust |  .32357     .25075   1.2904   0.197   -.167895       .81503
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.6729     6.6589   -0.2512  0.802   -14.7242      11.3784
    Bias-corrected |  8.4627     6.6589   1.2709   0.204   -4.58862       21.514
            Robust |  8.4627     14.575   0.5806   0.561   -20.1039      37.0292
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        604
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         312            Kernel        =    Uniform
Eff. Number of obs |       292         312            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05498     .07374   0.7457   0.456    -.08954      .199508
    Bias-corrected |  .02492     .07374   0.3379   0.735   -.119607      .169441
            Robust |  .02492     .09896   0.2518   0.801   -.169043      .218878
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.1178     4.2817   0.7282   0.467   -5.27413      11.5098
    Bias-corrected |  3.5613     4.2817   0.8317   0.406   -4.83069      11.9532
            Robust |  3.5613     5.8892   0.6047   0.545    -7.9814      15.1039
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nn
> cluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2729
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1147        1582            Kernel        = Epanechnikov
Eff. Number of obs |       593         608            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    73.796      73.796
       BW bias (b) |   113.224     113.224
         rho (h/b) |     0.652       0.652
        Unique obs |       235         242
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0489     .06291   0.7773   0.437   -.074406      .172212
    Bias-corrected |  .05744     .06291   0.9129   0.361   -.065872      .180745
            Robust |  .05744     .07794   0.7370   0.461   -.095316      .210189
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.5697     3.6742   0.6994   0.484   -4.63154      9.77094
    Bias-corrected |  2.7503     3.6742   0.7486   0.454   -4.45092      9.95156
            Robust |  2.7503     4.3203   0.6366   0.524   -5.71722      11.2179
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10693     .08465   1.2631   0.207   -.058991      .272847
    Bias-corrected |  .24526     .08465   2.8973   0.004    .079346      .411184
            Robust |  .24526     .14906   1.6454   0.100   -.046896      .537426
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .4984     1.4513   0.3434   0.731   -2.34604      3.34284
    Bias-corrected | -1.5806     1.4513   -1.0891  0.276   -4.42505      1.26384
            Robust | -1.5806     3.1534   -0.5012  0.616   -7.76125      4.60004
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1152
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         648            Kernel        =    Uniform
Eff. Number of obs |       504         648            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09793     .04716   2.0765   0.038    .005496      .190368
    Bias-corrected |  .07514     .04716   1.5932   0.111   -.017297      .167575
            Robust |  .07514     .07261   1.0348   0.301   -.067173       .21745
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .68351     1.0543   0.6483   0.517   -1.38281      2.74984
    Bias-corrected |  .08997     1.0543   0.0853   0.932   -1.97636      2.15629
            Robust |  .08997     1.5006   0.0600   0.952   -2.85113      3.03106
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nn
> cluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7829
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3469        4360            Kernel        = Epanechnikov
Eff. Number of obs |       929        1210            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.586      60.586
       BW bias (b) |    80.061      80.061
         rho (h/b) |     0.757       0.757
        Unique obs |       314         236
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03326     .03614   0.9202   0.357   -.037582      .104097
    Bias-corrected |  .04187     .03614   1.1586   0.247   -.028965      .112714
            Robust |  .04187     .04657   0.8991   0.369   -.049404      .133152
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.26825     2.4148   -0.1111  0.912   -5.00125      4.46475
    Bias-corrected |  .01919     2.4148   0.0079   0.994   -4.71382      4.75219
            Robust |  .01919     2.5715   0.0075   0.994   -5.02093       5.0593
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(1
> 2) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        720
-------------------+----------------------            BW type       =     Manual
     Number of obs |       396         324            Kernel        =    Uniform
Eff. Number of obs |       396         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01846     .05153   0.3583   0.720   -.082529      .119454
    Bias-corrected |  .16196     .05153   3.1432   0.002    .060969      .262951
            Robust |  .16196     .11594   1.3970   0.162   -.065273      .389193
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.2843     10.859   0.3024   0.762   -17.9992      24.5678
    Bias-corrected | -37.826     10.859   -3.4833  0.000   -59.1096     -16.5426
            Robust | -37.826     24.643   -1.5350  0.125   -86.1253      10.4731
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(3
> 6) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2508
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1190        1318            Kernel        =    Uniform
Eff. Number of obs |      1190        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03762     .02468   1.5243   0.127   -.010753      .085999
    Bias-corrected | -.01998     .02468   -0.8097  0.418   -.068361      .028392
            Robust | -.01998     .04132   -0.4836  0.629   -.100976      .061007
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .71195     1.5994   0.4451   0.656   -2.42285      3.84676
    Bias-corrected |  1.2307     1.5994   0.7694   0.442   -1.90413      4.36547
            Robust |  1.2307     2.7105   0.4540   0.650   -4.08173      6.54307
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15918
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8271        7647            Kernel        = Epanechnikov
Eff. Number of obs |      2445        2631            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.080      66.080
       BW bias (b) |   120.924     120.924
         rho (h/b) |     0.546       0.546
        Unique obs |       368         259

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0073     .01837   0.3972   0.691   -.028715      .043312
    Bias-corrected |   .0091     .01837   0.4952   0.620   -.026913      .045113
            Robust |   .0091     .02144   0.4244   0.671   -.032928      .051128
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.0891     6.8634   -0.1587  0.874   -14.5413       12.363
    Bias-corrected | -1.5819     6.8634   -0.2305  0.818    -15.034      11.8702
            Robust | -1.5819     8.0158   -0.1973  0.844   -17.2927      14.1288
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(u
> ni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00394     .07478   0.0527   0.958   -.142619      .150498
    Bias-corrected |  .18396     .07478   2.4601   0.014    .037397      .330514
            Robust |  .18396     .17414   1.0563   0.291   -.157359      .525269
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.7584     104.65   -0.0455  0.964   -209.875      200.358
    Bias-corrected |   95.47     104.65   0.9122   0.362   -109.647      300.586
            Robust |   95.47     252.93   0.3775   0.706   -400.263      591.203
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(u
> ni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1685
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         925            Kernel        =    Uniform
Eff. Number of obs |       760         925            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05384     .03504   1.5367   0.124    -.01483      .122514
    Bias-corrected | -.02605     .03504   -0.7434  0.457   -.094718      .042625
            Robust | -.02605     .06039   -0.4313  0.666   -.144401      .092308
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8755     1.7558   1.0682   0.285   -1.56578      5.31681
    Bias-corrected |  2.7267     1.7558   1.5530   0.120   -.714578        6.168
            Robust |  2.7267     3.0651   0.8896   0.374   -3.28077       8.7342
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mser
> d) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4580        5907            Kernel        = Epanechnikov
Eff. Number of obs |      1124        1401            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.146      50.146
       BW bias (b) |    85.173      85.173
         rho (h/b) |     0.589       0.589
        Unique obs |       318         246

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02619     .03036   0.8624   0.388   -.033326      .085698
    Bias-corrected |  .02317     .03036   0.7631   0.445   -.036341      .082684
            Robust |  .02317     .03656   0.6338   0.526   -.048485      .094828
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.2285     3.4126   0.6530   0.514   -4.46014      8.91711
    Bias-corrected |  2.9272     3.4126   0.8578   0.391   -3.76139      9.61587
            Robust |  2.9272     4.1218   0.7102   0.478   -5.15139      11.0059
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04205     .14442   -0.2912  0.771   -.325102      .241006
    Bias-corrected |   .2997     .14442   2.0752   0.038    .016649      .582757
            Robust |   .2997     .33422   0.8967   0.370   -.355355      .954761
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.1806     14.068   0.2972   0.766   -23.3926      31.7537
    Bias-corrected |  50.577     14.068   3.5952   0.000    23.0043      78.1505
            Robust |  50.577     31.096   1.6265   0.104   -10.3705      111.525
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         305            Kernel        =    Uniform
Eff. Number of obs |       281         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04559     .06715   0.6789   0.497   -.086028       .17721
    Bias-corrected | -.02046     .06715   -0.3047  0.761   -.152082      .111155
            Robust | -.02046     .11339   -0.1805  0.857   -.242711      .201784
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.7693     5.4749   0.6885   0.491   -6.96134      14.4999
    Bias-corrected |  7.5857     5.4749   1.3855   0.166   -3.14489      18.3163
            Robust |  7.5857       9.39   0.8079   0.419   -10.8183      25.9897
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1136        1575            Kernel        = Epanechnikov
Eff. Number of obs |       657         671            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    84.308      84.308
       BW bias (b) |   153.611     153.611
         rho (h/b) |     0.549       0.549
        Unique obs |       234         241

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04022     .04507   0.8925   0.372   -.048113      .128563
    Bias-corrected |  .04912     .04507   1.0899   0.276   -.039214      .137463
            Robust |  .04912     .05294   0.9278   0.353   -.054645      .152894
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.5972     3.0136   0.8618   0.389   -3.30925      8.50371
    Bias-corrected |  2.2182     3.0136   0.7361   0.462   -3.68826      8.12469
            Robust |  2.2182     3.5551   0.6240   0.533   -4.74959      9.18602
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |     .01     .08501   0.1176   0.906   -.156617      .176609
    Bias-corrected |  .12076     .08501   1.4205   0.155   -.045855      .287371
            Robust |  .12076     .19328   0.6248   0.532   -.258064      .499581
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   5.028     46.884   0.1072   0.915    -86.862      96.9179
    Bias-corrected | -95.988     46.884   -2.0474  0.041   -187.877     -4.09753
            Robust | -95.988     106.68   -0.8998  0.368   -305.073      113.098
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1099
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         620            Kernel        =    Uniform
Eff. Number of obs |       479         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06882     .03883   1.7722   0.076   -.007292      .144932
    Bias-corrected | -.01006     .03883   -0.2591  0.796   -.086173       .06605
            Robust | -.01006     .06898   -0.1459  0.884   -.145251      .125128
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .98316     1.4851   0.6620   0.508   -1.92762      3.89394
    Bias-corrected |  .49696     1.4851   0.3346   0.738   -2.41382      3.40774
            Robust |  .49696     2.6516   0.1874   0.851   -4.70016      5.69408
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7776
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3444        4332            Kernel        = Epanechnikov
Eff. Number of obs |       582         815            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    43.519      43.519
       BW bias (b) |    73.917      73.917
         rho (h/b) |     0.589       0.589
        Unique obs |       313         235

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0354     .03634   0.9740   0.330   -.035833      .106629
    Bias-corrected |   .0403     .03634   1.1088   0.268   -.030935      .111527
            Robust |   .0403     .04429   0.9099   0.363   -.046504      .127095
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .56766     2.6494   0.2143   0.830   -4.62515      5.76047
    Bias-corrected |  .80185     2.6494   0.3026   0.762   -4.39096      5.99466
            Robust |  .80185     3.2038   0.2503   0.802   -5.47757      7.08127
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(1
> 2) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        720
-------------------+----------------------            BW type       =     Manual
     Number of obs |       396         324            Kernel        =    Uniform
Eff. Number of obs |       396         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01846     .05653   0.3266   0.744   -.092336      .129261
    Bias-corrected |  .16196     .05653   2.8650   0.004    .051161      .272759
            Robust |  .16196     .11883   1.3629   0.173   -.070946      .394866
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.2843     9.6057   0.3419   0.732   -15.5426      22.1112
    Bias-corrected | -37.826     9.6057   -3.9379  0.000    -56.653     -18.9992
            Robust | -37.826     27.099   -1.3958  0.163     -90.94      15.2878
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(3
> 6) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2508
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1190        1318            Kernel        =    Uniform
Eff. Number of obs |      1190        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03762     .02942   1.2789   0.201   -.020037      .095283
    Bias-corrected | -.01998     .02942   -0.6793  0.497   -.077645      .037676
            Robust | -.01998     .04328   -0.4618  0.644   -.104812      .064843
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .71195     1.8584   0.3831   0.702   -2.93039      4.35429
    Bias-corrected |  1.2307     1.8584   0.6622   0.508   -2.41167      4.87301
            Robust |  1.2307     2.6922   0.4571   0.648   -4.04594      6.50728
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(n
> ncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15918
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8271        7647            Kernel        = Epanechnikov
Eff. Number of obs |      2955        3134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    78.159      78.159
       BW bias (b) |   125.124     125.124
         rho (h/b) |     0.625       0.625
        Unique obs |       368         259
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00746     .02199   0.3395   0.734   -.035632      .050561
    Bias-corrected |  .01053     .02199   0.4791   0.632   -.032562      .053631
            Robust |  .01053     .02536   0.4153   0.678   -.039179      .060247
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.22713     7.5008   -0.0303  0.976   -14.9285      14.4743
    Bias-corrected | -1.2422     7.5008   -0.1656  0.868   -15.9436      13.4592
            Robust | -1.2422     7.8811   -0.1576  0.875   -16.6888      14.2044
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(u
> ni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00394     .07434   0.0530   0.958   -.141773      .149651
    Bias-corrected |  .18396     .07434   2.4744   0.013    .038243      .329667
            Robust |  .18396     .16418   1.1204   0.263   -.137834      .505744
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.7584     102.13   -0.0466  0.963   -204.937      195.421
    Bias-corrected |   95.47     102.13   0.9347   0.350   -104.709      295.648
            Robust |   95.47     250.96   0.3804   0.704   -396.396      587.335
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(u
> ni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1685
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         925            Kernel        =    Uniform
Eff. Number of obs |       760         925            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05384     .03934   1.3687   0.171   -.023258      .130941
    Bias-corrected | -.02605     .03934   -0.6621  0.508   -.103146      .051053
            Robust | -.02605     .06076   -0.4287  0.668   -.145133      .093041
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8755     2.1345   0.8787   0.380   -2.30797      6.05901
    Bias-corrected |  2.7267     2.1345   1.2775   0.201   -1.45678       6.9102
            Robust |  2.7267     2.6327   1.0357   0.300   -2.43323      7.88666
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mser
> d) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4580        5907            Kernel        = Epanechnikov
Eff. Number of obs |      1195        1486            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.540      53.540
       BW bias (b) |    75.683      75.683
         rho (h/b) |     0.707       0.707
        Unique obs |       318         246
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02475     .03407   0.7262   0.468   -.042039      .091531
    Bias-corrected |  .03057     .03407   0.8971   0.370   -.036218      .097351
            Robust |  .03057      .0399   0.7661   0.444   -.047637       .10877
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.1948     5.3219   0.4124   0.680   -8.23588      12.6255
    Bias-corrected |  2.7326     5.3219   0.5135   0.608   -7.69811      13.1633
            Robust |  2.7326     5.9235   0.4613   0.645   -8.87731      14.3424
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04205     .14678   -0.2865  0.775   -.329731      .245634
    Bias-corrected |   .2997     .14678   2.0419   0.041     .01202      .587385
            Robust |   .2997     .33767   0.8876   0.375   -.362114       .96152
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.1806     14.934   0.2799   0.780     -25.09      33.4511
    Bias-corrected |  50.577     14.934   3.3867   0.001    21.3068       79.848
            Robust |  50.577     33.945   1.4900   0.136   -15.9527      117.108
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         305            Kernel        =    Uniform
Eff. Number of obs |       281         305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04559     .07391   0.6168   0.537   -.099278       .19046
    Bias-corrected | -.02046     .07391   -0.2769  0.782   -.165332      .124406
            Robust | -.02046     .10233   -0.2000  0.841   -.221021      .180095
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.7693     5.7757   0.6526   0.514   -7.55088      15.0894
    Bias-corrected |  7.5857     5.7757   1.3134   0.189   -3.73443      18.9059
            Robust |  7.5857     7.7995   0.9726   0.331   -7.70109      22.8726
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nn
> cluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1136        1575            Kernel        = Epanechnikov
Eff. Number of obs |       663         687            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    85.995      85.995
       BW bias (b) |   151.110     151.110
         rho (h/b) |     0.569       0.569
        Unique obs |       234         241
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04096     .05357   0.7645   0.445   -.064046      .145957
    Bias-corrected |  .04988     .05357   0.9311   0.352   -.055118      .154886
            Robust |  .04988     .06169   0.8086   0.419   -.071033      .170801
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.4863     3.7712   0.6593   0.510   -4.90498      9.87765
    Bias-corrected |  2.1228     3.7712   0.5629   0.574   -5.26854       9.5141
            Robust |  2.1228     4.2151   0.5036   0.615   -6.13859      10.3842
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(12
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |     .01     .10585   0.0944   0.925   -.197459      .217451
    Bias-corrected |  .12076     .10585   1.1409   0.254   -.086697      .328213
            Robust |  .12076     .16396   0.7365   0.461   -.200595      .442111
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   5.028     54.425   0.0924   0.926   -101.642      111.698
    Bias-corrected | -95.988     54.425   -1.7637  0.078   -202.658      10.6827
            Robust | -95.988     95.523   -1.0049  0.315   -283.209       91.234
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(uni) p(1) h(36
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1099
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         620            Kernel        =    Uniform
Eff. Number of obs |       479         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06882     .04212   1.6340   0.102   -.013729      .151369
    Bias-corrected | -.01006     .04212   -0.2389  0.811    -.09261      .072488
            Robust | -.01006     .07643   -0.1316  0.895    -.15986      .139737
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .98316     1.5862   0.6198   0.535   -2.12569      4.09202
    Bias-corrected |  .49696     1.5862   0.3133   0.754   -2.61189      3.60582
            Robust |  .49696     2.3207   0.2141   0.830   -4.05144      5.04537
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) fuzzy(higheredu) kernel(epa) p(1) bwselect(mserd) all vce(nn
> cluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7776
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3444        4332            Kernel        = Epanechnikov
Eff. Number of obs |       582         815            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    43.892      43.892
       BW bias (b) |    69.254      69.254
         rho (h/b) |     0.634       0.634
        Unique obs |       313         235
Number of clusters |        15          15

First-stage estimates. Outcome: higheredu. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03414     .03976   0.8585   0.391   -.043797      .112071
    Bias-corrected |  .05115     .03976   1.2864   0.198   -.026784      .129085
            Robust |  .05115      .0498   1.0272   0.304    -.04645      .148752
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: higheredu.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .54007     3.0721   0.1758   0.860   -5.48121      6.56135
    Bias-corrected |  1.0589     3.0721   0.3447   0.730   -4.96242      7.08014
            Robust |  1.0589     3.4208   0.3095   0.757   -5.64578      7.76349
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male Exp controlled
> /Earning Sheet 6 results.xls
dir : seeout

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Higheredu/FuzzyOption Male E
> xp controlled/Urban 1979 Higheredu FuzzyOption MaleExp controlled.log
  log type:  text
 closed on:   6 Aug 2024, 17:15:15
---------------------------------------------------------------------------------------------
