---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male 
> Exp controlled/Urban 1979 Highgen ManualD MaleExp controlled.log
  log type:  text
 opened on:   6 Aug 2024, 17:26:50

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,431 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(33,372 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(5,190 real changes made)

. 
. *Step Two: Regressions (Three parts Ideally: Firstly rdrobust from birthmonth to earning; S
> econdly rdrobust from birthmonth to higheredu; Thirdly rdrobust*2 or rdrobust+OLS or ivregr
> ess from higheredu to earning. Each part has 6 sheets)
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       486         440            Kernel        =    Uniform
Eff. Number of obs |       486         440            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14303     .07938   1.8018   0.072   -.012555      .298618
    Bias-corrected |  .14721     .07938   1.8544   0.064   -.008381      .302792
            Robust |  .14721     .12593   1.1690   0.242   -.099611      .394022
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2714
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1280        1434            Kernel        =    Uniform
Eff. Number of obs |      1280        1434            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07145     .04967   1.4385   0.150   -.025901      .168794
    Bias-corrected |  .10416     .04967   2.0972   0.036    .006817      .201512
            Robust |  .10416     .07071   1.4731   0.141    -.03443      .242759
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16124
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8361        7763            Kernel        = Epanechnikov
Eff. Number of obs |      1832        2027            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.396      49.396
       BW bias (b) |    80.441      80.441
         rho (h/b) |     0.614       0.614
        Unique obs |       370         261

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04867     .04502   1.0810   0.280   -.039573      .136915
    Bias-corrected |  .05897     .04502   1.3097   0.190   -.029278       .14721
            Robust |  .05897     .05256   1.1220   0.262   -.044041      .161973
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        624
-------------------+----------------------            BW type       =     Manual
     Number of obs |       318         306            Kernel        =    Uniform
Eff. Number of obs |       318         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10056     .10214   0.9845   0.325   -.099635      .300758
    Bias-corrected |  .09063     .10214   0.8873   0.375   -.109569      .290823
            Robust |  .09063     .15609   0.5806   0.562   -.215301      .396555
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1836
-------------------+----------------------            BW type       =     Manual
     Number of obs |       831        1005            Kernel        =    Uniform
Eff. Number of obs |       831        1005            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11848     .06247   1.8966   0.058    -.00396      .240916
    Bias-corrected |  .08617     .06247   1.3794   0.168    -.03627      .208605
            Robust |  .08617     .09026   0.9547   0.340    -.09074      .263075
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10638
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4651        5987            Kernel        = Epanechnikov
Eff. Number of obs |      1167        1445            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    49.117      49.117
       BW bias (b) |    81.047      81.047
         rho (h/b) |     0.606       0.606
        Unique obs |       320         248

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08741     .05728   1.5260   0.127   -.024856      .199682
    Bias-corrected |  .10455     .05728   1.8253   0.068   -.007716      .216822
            Robust |  .10455      .0665   1.5723   0.116   -.025777      .234883
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       105         100            Kernel        =    Uniform
Eff. Number of obs |       105         100            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04422     .18015   -0.2454  0.806   -.397311      .308879
    Bias-corrected | -.04541     .18015   -0.2520  0.801   -.398503      .307688
            Robust | -.04541     .27373   -0.1659  0.868   -.581902      .491087
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14855     .10364   1.4334   0.152   -.054576      .351685
    Bias-corrected |  .07941     .10364   0.7662   0.444   -.123717      .282544
            Robust |  .07941     .15466   0.5135   0.608   -.223709      .382536
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2756
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1598            Kernel        = Epanechnikov
Eff. Number of obs |       467         510            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.610      56.610
       BW bias (b) |   101.341     101.341
         rho (h/b) |     0.559       0.559
        Unique obs |       236         243

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16132     .08708   1.8525   0.064   -.009354      .331993
    Bias-corrected |  .18385     .08708   2.1113   0.035    .013178      .354525
            Robust |  .18385     .10007   1.8373   0.066   -.012277      .379979
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15232     .12454   1.2231   0.221   -.091777      .396422
    Bias-corrected |  .14708     .12454   1.1809   0.238   -.097021      .391178
            Robust |  .14708     .18977   0.7751   0.438   -.224855      .519013
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         677            Kernel        =    Uniform
Eff. Number of obs |       528         677            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1078     .07778   1.3860   0.166    -.04464      .260246
    Bias-corrected |  .09202     .07778   1.1831   0.237   -.060424      .244462
            Robust |  .09202     .11219   0.8202   0.412   -.127879      .311917
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7882
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3493        4389            Kernel        = Epanechnikov
Eff. Number of obs |       870        1148            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.720      56.720
       BW bias (b) |    85.838      85.838
         rho (h/b) |     0.661       0.661
        Unique obs |       315         237

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03647     .06736   0.5414   0.588   -.095553       .16849
    Bias-corrected |  .04811     .06736   0.7142   0.475   -.083912      .180131
            Robust |  .04811     .07985   0.6025   0.547   -.108399      .204618
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       168         134            Kernel        =    Uniform
Eff. Number of obs |       168         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2243     .11914   1.8827   0.060   -.009202      .457802
    Bias-corrected |  .24596     .11914   2.0645   0.039    .012455      .479459
            Robust |  .24596     .18688   1.3161   0.188    -.12033      .612244
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        878
-------------------+----------------------            BW type       =     Manual
     Number of obs |       449         429            Kernel        =    Uniform
Eff. Number of obs |       449         429            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04979     .08108   -0.6141  0.539   -.208713      .109132
    Bias-corrected |  .14838     .08108   1.8299   0.067   -.010544      .307302
            Robust |  .14838     .11028   1.3455   0.178   -.067768      .364527
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5486
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3710        1776            Kernel        = Epanechnikov
Eff. Number of obs |       818         678            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.969      58.969
       BW bias (b) |    90.838      90.838
         rho (h/b) |     0.649       0.649
        Unique obs |       356         245

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04443     .06646   -0.6686  0.504   -.174686       .08582
    Bias-corrected | -.04186     .06646   -0.6298  0.529   -.172109      .088396
            Robust | -.04186     .07922   -0.5283  0.597   -.197128      .113415
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code
> )

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       486         440            Kernel        =    Uniform
Eff. Number of obs |       486         440            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14303      .1087   1.3158   0.188   -.070026      .356089
    Bias-corrected |  .14721      .1087   1.3542   0.176   -.065852      .360263
            Robust |  .14721     .18049   0.8156   0.415   -.206555      .500966
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code
> )

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2714
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1280        1434            Kernel        =    Uniform
Eff. Number of obs |      1280        1434            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07145     .06341   1.1268   0.260   -.052825      .195719
    Bias-corrected |  .10416     .06341   1.6428   0.100   -.020107      .228437
            Robust |  .10416     .09478   1.0990   0.272   -.081606      .289936
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16124
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8361        7763            Kernel        = Epanechnikov
Eff. Number of obs |      2120        2316            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.637      56.637
       BW bias (b) |    76.822      76.822
         rho (h/b) |     0.737       0.737
        Unique obs |       370         261
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04231     .06443   0.6567   0.511   -.083971      .168594
    Bias-corrected |  .06091     .06443   0.9454   0.344   -.065372      .187193
            Robust |  .06091     .07249   0.8402   0.401   -.081172      .202993
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster p
> rovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        624
-------------------+----------------------            BW type       =     Manual
     Number of obs |       318         306            Kernel        =    Uniform
Eff. Number of obs |       318         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10056     .13664   0.7360   0.462   -.167244      .368367
    Bias-corrected |  .09063     .13664   0.6633   0.507   -.177179      .358433
            Robust |  .09063     .22457   0.4036   0.687   -.349519      .530773
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster p
> rovince_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1836
-------------------+----------------------            BW type       =     Manual
     Number of obs |       831        1005            Kernel        =    Uniform
Eff. Number of obs |       831        1005            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11848     .07812   1.5166   0.129   -.034632      .271588
    Bias-corrected |  .08617     .07812   1.1030   0.270   -.066943      .239278
            Robust |  .08617     .11525   0.7477   0.455    -.13972      .312055
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code
> )
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10638
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4651        5987            Kernel        = Epanechnikov
Eff. Number of obs |      1382        1718            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.208      58.208
       BW bias (b) |    78.434      78.434
         rho (h/b) |     0.742       0.742
        Unique obs |       320         248
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07528     .07891   0.9541   0.340   -.079374      .229944
    Bias-corrected |  .10316     .07891   1.3073   0.191   -.051503      .257816
            Robust |  .10316     .08705   1.1850   0.236   -.067458      .273772
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       105         100            Kernel        =    Uniform
Eff. Number of obs |       105         100            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04422     .19554   -0.2261  0.821   -.427475      .339043
    Bias-corrected | -.04541     .19554   -0.2322  0.816   -.428666      .337852
            Robust | -.04541     .30897   -0.1470  0.883   -.650979      .560164
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14855     .11087   1.3399   0.180   -.068744      .365852
    Bias-corrected |  .07941     .11087   0.7163   0.474   -.137884      .296712
            Robust |  .07941     .18057   0.4398   0.660   -.274493      .433321
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2756
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1598            Kernel        = Epanechnikov
Eff. Number of obs |       449         491            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.527      54.527
       BW bias (b) |    93.930      93.930
         rho (h/b) |     0.581       0.581
        Unique obs |       236         243
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .16401     .10611   1.5457   0.122   -.043955      .371977
    Bias-corrected |  .19174     .10611   1.8070   0.071   -.016231      .399701
            Robust |  .19174     .11907   1.6102   0.107   -.041642      .425112
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15232     .12887   1.1820   0.237   -.100263      .404909
    Bias-corrected |  .14708     .12887   1.1413   0.254   -.105507      .399665
            Robust |  .14708     .23861   0.6164   0.538   -.320588      .614746
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         677            Kernel        =    Uniform
Eff. Number of obs |       528         677            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1078     .07865   1.3707   0.170   -.046347      .261952
    Bias-corrected |  .09202     .07865   1.1700   0.242    -.06213      .246168
            Robust |  .09202     .11441   0.8043   0.421   -.132217      .316255
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7882
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3493        4389            Kernel        = Epanechnikov
Eff. Number of obs |      1097        1467            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.922      69.922
       BW bias (b) |    83.575      83.575
         rho (h/b) |     0.837       0.837
        Unique obs |       315         237
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01613     .07803   0.2067   0.836   -.136806      .169058
    Bias-corrected |  .03651     .07803   0.4679   0.640    -.11642      .189443
            Robust |  .03651     .08332   0.4382   0.661   -.126795      .199818
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       168         134            Kernel        =    Uniform
Eff. Number of obs |       168         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .2243     .11736   1.9113   0.056   -.005717      .454317
    Bias-corrected |  .24596     .11736   2.0958   0.036     .01594      .475974
            Robust |  .24596     .16274   1.5114   0.131   -.073004      .564918
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        878
-------------------+----------------------            BW type       =     Manual
     Number of obs |       449         429            Kernel        =    Uniform
Eff. Number of obs |       449         429            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.04979     .06234   -0.7987  0.424   -.171969      .072388
    Bias-corrected |  .14838     .06234   2.3803   0.017    .026201      .270558
            Robust |  .14838     .11503   1.2900   0.197   -.077066      .373824
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(mal
> e exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5486
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3710        1776            Kernel        = Epanechnikov
Eff. Number of obs |       828         691            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.856      59.856
       BW bias (b) |    89.374      89.374
         rho (h/b) |     0.670       0.670
        Unique obs |       356         245
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0434     .06376   -0.6806  0.496    -.16837      .081573
    Bias-corrected | -.04227     .06376   -0.6629  0.507   -.167238      .082704
            Robust | -.04227     .07154   -0.5908  0.555   -.182479      .097944
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        824
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         381            Kernel        =    Uniform
Eff. Number of obs |       443         381            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08591      .0941   0.9129   0.361   -.098528      .270348
    Bias-corrected | -.00957      .0941   -0.1017  0.919   -.194007      .174869
            Robust | -.00957     .17175   -0.0557  0.956   -.346189      .327052
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2612
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1237        1375            Kernel        =    Uniform
Eff. Number of obs |      1237        1375            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04102     .05334   0.7690   0.442   -.063523      .145557
    Bias-corrected |  .04424     .05334   0.8294   0.407   -.060303      .148777
            Robust |  .04424     .08064   0.5486   0.583   -.113812      .202286
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16022
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8318        7704            Kernel        = Epanechnikov
Eff. Number of obs |      1905        2095            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.882      52.882
       BW bias (b) |    83.998      83.998
         rho (h/b) |     0.630       0.630
        Unique obs |       369         260

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01454     .04601   0.3161   0.752   -.075637      .104725
    Bias-corrected |  .01674     .04601   0.3638   0.716    -.07344      .106922
            Robust |  .01674      .0553   0.3027   0.762   -.091639      .125122
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02796     .12373   0.2259   0.821   -.214558      .270468
    Bias-corrected | -.09196     .12373   -0.7432  0.457   -.334476       .15055
            Robust | -.09196     .22086   -0.4164  0.677   -.524834      .340907
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1756
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         960            Kernel        =    Uniform
Eff. Number of obs |       796         960            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09987     .06711   1.4881   0.137   -.031671      .231406
    Bias-corrected |  .02687     .06711   0.4004   0.689   -.104667      .158409
            Robust |  .02687     .10369   0.2592   0.796   -.176352      .230094
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10558
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4616        5942            Kernel        = Epanechnikov
Eff. Number of obs |      1160        1436            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.973      50.973
       BW bias (b) |    83.646      83.646
         rho (h/b) |     0.609       0.609
        Unique obs |       319         247

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06181     .05937   1.0411   0.298   -.054555      .178182
    Bias-corrected |  .07537     .05937   1.2694   0.204   -.040998       .19174
            Robust |  .07537     .07063   1.0671   0.286   -.063061      .213803
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07129     .21171   -0.3367  0.736   -.486224      .343653
    Bias-corrected | -.10941     .21171   -0.5168  0.605   -.524346      .305531
            Robust | -.10941     .39383   -0.2778  0.781   -.881301      .662487
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        604
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         312            Kernel        =    Uniform
Eff. Number of obs |       292         312            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17143     .10768   1.5921   0.111   -.039613      .382472
    Bias-corrected |  .10207     .10768   0.9479   0.343   -.108973      .313111
            Robust |  .10207     .16898   0.6040   0.546   -.229119      .433257
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2729
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1147        1582            Kernel        = Epanechnikov
Eff. Number of obs |       407         446            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.509      50.509
       BW bias (b) |    97.072      97.072
         rho (h/b) |     0.520       0.520
        Unique obs |       235         242

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17982     .09398   1.9133   0.056   -.004383      .364021
    Bias-corrected |  .20869     .09398   2.2205   0.026    .024483      .392887
            Robust |  .20869     .10761   1.9394   0.052   -.002217      .419587
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05329     .15416   0.3457   0.730   -.248857      .355443
    Bias-corrected | -.10006     .15416   -0.6491  0.516   -.402214      .202087
            Robust | -.10006     .27057   -0.3698  0.712   -.630376      .430249
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1152
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         648            Kernel        =    Uniform
Eff. Number of obs |       504         648            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06694     .08463   0.7909   0.429   -.098941      .232817
    Bias-corrected | -.00677     .08463   -0.0800  0.936   -.172648       .15911
            Robust | -.00677     .13198   -0.0513  0.959   -.265454      .251917
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7829
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3469        4360            Kernel        = Epanechnikov
Eff. Number of obs |       846        1119            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.385      56.385
       BW bias (b) |    89.311      89.311
         rho (h/b) |     0.631       0.631
        Unique obs |       314         236

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00539     .07184   -0.0751  0.940   -.146193      .135409
    Bias-corrected | -.00987     .07184   -0.1374  0.891   -.150671      .130931
            Robust | -.00987      .0858   -0.1150  0.908   -.178025      .158285
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         120            Kernel        =    Uniform
Eff. Number of obs |       160         120            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1686     .14415   1.1696   0.242   -.113927      .451131
    Bias-corrected |   .0661     .14415   0.4585   0.647   -.216434      .348625
            Robust |   .0661     .27434   0.2409   0.810   -.471594      .603785
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        856
-------------------+----------------------            BW type       =     Manual
     Number of obs |       441         415            Kernel        =    Uniform
Eff. Number of obs |       441         415            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09835     .08786   -1.1194  0.263   -.270547      .073846
    Bias-corrected |  .08873     .08786   1.0099   0.313   -.083471      .260923
            Robust |  .08873     .12828   0.6916   0.489   -.162706      .340158
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5464
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        1762            Kernel        = Epanechnikov
Eff. Number of obs |       820         677            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.928      59.928
       BW bias (b) |    95.388      95.388
         rho (h/b) |     0.628       0.628
        Unique obs |       355         244

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07919     .06993   -1.1324  0.257   -.216258      .057874
    Bias-corrected | -.08588     .06993   -1.2280  0.219   -.222942       .05119
            Robust | -.08588     .08394   -1.0230  0.306   -.250401      .078648
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        824
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         381            Kernel        =    Uniform
Eff. Number of obs |       443         381            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08591      .0948   0.9062   0.365   -.099903      .271723
    Bias-corrected | -.00957      .0948   -0.1009  0.920   -.195382      .176245
            Robust | -.00957      .1995   -0.0480  0.962   -.400577      .381439
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2612
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1237        1375            Kernel        =    Uniform
Eff. Number of obs |      1237        1375            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04102     .06291   0.6520   0.514   -.082283      .164317
    Bias-corrected |  .04424     .06291   0.7032   0.482   -.079063      .167537
            Robust |  .04424      .0938   0.4716   0.637   -.139614      .228088
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province
> _code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16022
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8318        7704            Kernel        = Epanechnikov
Eff. Number of obs |      2193        2377            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.344      59.344
       BW bias (b) |    77.558      77.558
         rho (h/b) |     0.765       0.765
        Unique obs |       369         260
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01231     .06148   0.2002   0.841   -.108185      .132807
    Bias-corrected |  .02015     .06148   0.3278   0.743   -.100347      .140646
            Robust |  .02015     .06987   0.2884   0.773   -.116789      .157089
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02796     .12132   0.2304   0.818   -.209825      .265736
    Bias-corrected | -.09196     .12132   -0.7580  0.448   -.329744      .145818
            Robust | -.09196     .27003   -0.3406  0.733   -.621216       .43729
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1756
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         960            Kernel        =    Uniform
Eff. Number of obs |       796         960            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09987     .07261   1.3754   0.169   -.042443      .242178
    Bias-corrected |  .02687     .07261   0.3701   0.711    -.11544      .169182
            Robust |  .02687     .10852   0.2476   0.804   -.185822      .239564
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nnclus
> ter province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10558
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4616        5942            Kernel        = Epanechnikov
Eff. Number of obs |      1373        1700            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.245      59.245
       BW bias (b) |    76.423      76.423
         rho (h/b) |     0.775       0.775
        Unique obs |       319         247
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0523     .07603   0.6879   0.492   -.096722      .201319
    Bias-corrected |  .07961     .07603   1.0470   0.295   -.069414      .228626
            Robust |  .07961      .0823   0.9673   0.333   -.081694      .240906
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07129     .17114   -0.4165  0.677    -.40671      .264138
    Bias-corrected | -.10941     .17114   -0.6393  0.523   -.444831      .226017
            Robust | -.10941     .38975   -0.2807  0.779   -.873296      .654482
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        604
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         312            Kernel        =    Uniform
Eff. Number of obs |       292         312            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17143     .09571   1.7911   0.073   -.016162       .35902
    Bias-corrected |  .10207     .09571   1.0664   0.286   -.085522       .28966
            Robust |  .10207     .15437   0.6612   0.508   -.200483       .40462
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2729
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1147        1582            Kernel        = Epanechnikov
Eff. Number of obs |       370         408            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.297      46.297
       BW bias (b) |    87.346      87.346
         rho (h/b) |     0.530       0.530
        Unique obs |       235         242
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17621     .09321   1.8906   0.059    -.00647        .3589
    Bias-corrected |  .20455     .09321   2.1945   0.028    .021861       .38723
            Robust |  .20455     .10622   1.9256   0.054   -.003645      .412736
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05329     .13699   0.3890   0.697   -.215195      .321781
    Bias-corrected | -.10006     .13699   -0.7305  0.465   -.368552      .168425
            Robust | -.10006     .30484   -0.3282  0.743   -.697537       .49741
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1152
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         648            Kernel        =    Uniform
Eff. Number of obs |       504         648            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06694     .08233   0.8130   0.416   -.094435      .228311
    Bias-corrected | -.00677     .08233   -0.0822  0.934   -.168142      .154604
            Robust | -.00677     .12927   -0.0524  0.958   -.260133      .246595
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7829
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3469        4360            Kernel        = Epanechnikov
Eff. Number of obs |      1127        1512            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    72.542      72.542
       BW bias (b) |    86.187      86.187
         rho (h/b) |     0.842       0.842
        Unique obs |       314         236
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01506     .08293   -0.1816  0.856   -.177606      .147481
    Bias-corrected | -.02123     .08293   -0.2560  0.798   -.183775      .141311
            Robust | -.02123     .09059   -0.2344  0.815   -.198794       .15633
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         120            Kernel        =    Uniform
Eff. Number of obs |       160         120            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .1686     .14876   1.1334   0.257   -.122958      .460163
    Bias-corrected |   .0661     .14876   0.4443   0.657   -.225465      .357656
            Robust |   .0661     .22182   0.2980   0.766   -.368669       .50086
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        856
-------------------+----------------------            BW type       =     Manual
     Number of obs |       441         415            Kernel        =    Uniform
Eff. Number of obs |       441         415            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09835     .06407   -1.5351  0.125   -.223918      .027217
    Bias-corrected |  .08873     .06407   1.3849   0.166   -.036841      .214293
            Robust |  .08873     .12397   0.7157   0.474   -.154254      .331706
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5464
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        1762            Kernel        = Epanechnikov
Eff. Number of obs |       897         724            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.094      63.094
       BW bias (b) |    97.003      97.003
         rho (h/b) |     0.650       0.650
        Unique obs |       355         244
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.07425     .06225   -1.1928  0.233    -.19625      .047752
    Bias-corrected | -.08172     .06225   -1.3129  0.189   -.203724      .040278
            Robust | -.08172     .07143   -1.1441  0.253   -.221719      .058273
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        720
-------------------+----------------------            BW type       =     Manual
     Number of obs |       396         324            Kernel        =    Uniform
Eff. Number of obs |       396         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06064     .12908   0.4698   0.639   -.192357      .313631
    Bias-corrected | -.22708     .12908   -1.7592  0.079   -.480073      .025916
            Robust | -.22708     .30714   -0.7393  0.460   -.829066      .374909
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2508
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1190        1318            Kernel        =    Uniform
Eff. Number of obs |      1190        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02679     .05935   0.4513   0.652   -.089535      .143107
    Bias-corrected |  .00529     .05935   0.0891   0.929   -.111034      .121609
            Robust |  .00529     .10039   0.0527   0.958    -.19148      .202056
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15918
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8271        7647            Kernel        = Epanechnikov
Eff. Number of obs |      1858        2038            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.202      52.202
       BW bias (b) |    85.446      85.446
         rho (h/b) |     0.611       0.611
        Unique obs |       368         259

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00183     .05044   -0.0363  0.971   -.100698      .097036
    Bias-corrected | -.00591     .05044   -0.1172  0.907   -.104779      .092955
            Robust | -.00591     .06149   -0.0961  0.923   -.126436      .114612
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01874     .17082   -0.1097  0.913   -.353537      .316048
    Bias-corrected | -.48049     .17082   -2.8129  0.005   -.815285       -.1457
            Robust | -.48049     .42279   -1.1365  0.256   -1.30914      .348157
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1685
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         925            Kernel        =    Uniform
Eff. Number of obs |       760         925            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10098     .07441   1.3570   0.175   -.044865      .246828
    Bias-corrected | -.00302     .07441   -0.0406  0.968   -.148867      .142826
            Robust | -.00302     .12934   -0.0234  0.981    -.25653      .250489
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4580        5907            Kernel        = Epanechnikov
Eff. Number of obs |      1124        1401            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.123      50.123
       BW bias (b) |    84.576      84.576
         rho (h/b) |     0.593       0.593
        Unique obs |       318         246

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05839     .06527   0.8946   0.371   -.069539      .186327
    Bias-corrected |  .07077     .06527   1.0842   0.278   -.057164      .198703
            Robust |  .07077      .0788   0.8981   0.369   -.083675      .225214
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17579     .26311   -0.6681  0.504    -.69147      .339899
    Bias-corrected | -.69797     .26311   -2.6528  0.008   -1.21366     -.182289
            Robust | -.69797     .66983   -1.0420  0.297   -2.01081      .614864
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         305            Kernel        =    Uniform
Eff. Number of obs |       281         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17184     .11537   1.4895   0.136   -.054272      .397961
    Bias-corrected |  .09686     .11537   0.8396   0.401   -.129253      .322979
            Robust |  .09686     .19245   0.5033   0.615    -.28033      .474056
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1136        1575            Kernel        = Epanechnikov
Eff. Number of obs |       396         439            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.755      50.755
       BW bias (b) |    98.822      98.822
         rho (h/b) |     0.514       0.514
        Unique obs |       234         241

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18235     .09881   1.8454   0.065   -.011323      .376016
    Bias-corrected |  .21233     .09881   2.1488   0.032     .01866      .405999
            Robust |  .21233     .11396   1.8632   0.062   -.011027      .435686
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05026     .22366   0.2247   0.822   -.388108      .488626
    Bias-corrected | -.40258     .22366   -1.7999  0.072   -.840944      .035791
            Robust | -.40258      .5402   -0.7452  0.456   -1.46136      .656206
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1099
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         620            Kernel        =    Uniform
Eff. Number of obs |       479         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06766      .0953   0.7100   0.478   -.119119      .254442
    Bias-corrected | -.04335      .0953   -0.4549  0.649   -.230133      .143429
            Robust | -.04335     .17135   -0.2530  0.800   -.379185      .292481
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7776
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3444        4332            Kernel        = Epanechnikov
Eff. Number of obs |       793        1036            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    54.029      54.029
       BW bias (b) |    89.203      89.203
         rho (h/b) |     0.606       0.606
        Unique obs |       313         235

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01268     .08039   -0.1578  0.875   -.170248      .144883
    Bias-corrected | -.02007     .08039   -0.2496  0.803   -.177635      .137496
            Robust | -.02007     .09733   -0.2062  0.837   -.210835      .170696
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        247
-------------------+----------------------            BW type       =     Manual
     Number of obs |       149          98            Kernel        =    Uniform
Eff. Number of obs |       149          98            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19786     .20791   0.9516   0.341   -.209645      .605358
    Bias-corrected |  .09042     .20791   0.4349   0.664   -.317079      .497925
            Robust |  .09042     .49763   0.1817   0.856   -.884909      1.06576
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       430         393            Kernel        =    Uniform
Eff. Number of obs |       430         393            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.14325     .10089   -1.4198  0.156   -.340996      .054494
    Bias-corrected |  .06129     .10089   0.6074   0.544   -.136459      .259031
            Robust |  .06129     .16813   0.3645   0.715   -.268235      .390807
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5431
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3691        1740            Kernel        = Epanechnikov
Eff. Number of obs |       846         682            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.611      61.611
       BW bias (b) |   102.637     102.637
         rho (h/b) |     0.600       0.600
        Unique obs |       354         243

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.10389      .0757   -1.3723  0.170   -.252258      .044487
    Bias-corrected | -.11937      .0757   -1.5769  0.115   -.267746      .028999
            Robust | -.11937     .09197   -1.2979  0.194   -.299637       .06089
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        720
-------------------+----------------------            BW type       =     Manual
     Number of obs |       396         324            Kernel        =    Uniform
Eff. Number of obs |       396         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06064     .12426   0.4880   0.626   -.182906       .30418
    Bias-corrected | -.22708     .12426   -1.8275  0.068   -.470622      .016465
            Robust | -.22708     .33008   -0.6880  0.491   -.874015      .419858
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclus
> ter province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2508
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1190        1318            Kernel        =    Uniform
Eff. Number of obs |      1190        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02679     .06601   0.4058   0.685   -.102596      .156168
    Bias-corrected |  .00529     .06601   0.0801   0.936   -.124095       .13467
            Robust |  .00529     .10761   0.0491   0.961   -.205618      .216194
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province
> _code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15918
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8271        7647            Kernel        = Epanechnikov
Eff. Number of obs |      2067        2230            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.389      57.389
       BW bias (b) |    78.815      78.815
         rho (h/b) |     0.728       0.728
        Unique obs |       368         259
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00177     .06461   -0.0274  0.978    -.12841      .124875
    Bias-corrected | -.00335     .06461   -0.0519  0.959   -.129993      .123292
            Robust | -.00335     .07519   -0.0446  0.964   -.150716      .144015
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01874      .1597   -0.1174  0.907   -.331744      .294254
    Bias-corrected | -.48049      .1597   -3.0088  0.003   -.793492     -.167494
            Robust | -.48049     .43317   -1.1093  0.267   -1.32949      .368503
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) al
> l vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1685
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         925            Kernel        =    Uniform
Eff. Number of obs |       760         925            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10098     .08015   1.2599   0.208   -.056115      .258078
    Bias-corrected | -.00302     .08015   -0.0377  0.970   -.160117      .154076
            Robust | -.00302     .14095   -0.0214  0.983   -.279274      .273234
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nnclus
> ter province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4580        5907            Kernel        = Epanechnikov
Eff. Number of obs |      1288        1599            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.762      57.762
       BW bias (b) |    79.821      79.821
         rho (h/b) |     0.724       0.724
        Unique obs |       318         246
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04978     .08303   0.5996   0.549   -.112954      .212513
    Bias-corrected |  .07061     .08303   0.8505   0.395   -.092121      .233346
            Robust |  .07061     .09453   0.7470   0.455   -.114663      .255887
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.17579     .19675   -0.8935  0.372     -.5614      .209829
    Bias-corrected | -.69797     .19675   -3.5476  0.000   -1.08359     -.312359
            Robust | -.69797     .66152   -1.0551  0.291   -1.99453      .598586
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         305            Kernel        =    Uniform
Eff. Number of obs |       281         305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17184     .11429   1.5036   0.133   -.052153      .395842
    Bias-corrected |  .09686     .11429   0.8475   0.397   -.127135      .320861
            Robust |  .09686     .19703   0.4916   0.623   -.289315      .483041
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1136        1575            Kernel        = Epanechnikov
Eff. Number of obs |       365         408            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.151      47.151
       BW bias (b) |    93.499      93.499
         rho (h/b) |     0.504       0.504
        Unique obs |       234         241
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .17964      .1081   1.6618   0.097   -.032228      .391511
    Bias-corrected |  .21091      .1081   1.9510   0.051   -.000964      .422775
            Robust |  .21091     .12268   1.7191   0.086   -.029549       .45136
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05026      .1772   0.2836   0.777   -.297055      .397573
    Bias-corrected | -.40258      .1772   -2.2718  0.023    -.74989     -.055263
            Robust | -.40258     .53488   -0.7527  0.452   -1.45092      .645766
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1099
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         620            Kernel        =    Uniform
Eff. Number of obs |       479         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06766      .0896   0.7552   0.450   -.107945      .243268
    Bias-corrected | -.04335      .0896   -0.4839  0.628   -.218959      .132255
            Robust | -.04335      .1669   -0.2598  0.795   -.370466      .283762
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7776
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3444        4332            Kernel        = Epanechnikov
Eff. Number of obs |       993        1344            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    66.972      66.972
       BW bias (b) |    88.804      88.804
         rho (h/b) |     0.754       0.754
        Unique obs |       313         235
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02955     .09011   -0.3279  0.743   -.206162       .14707
    Bias-corrected | -.04601     .09011   -0.5106  0.610   -.222625      .130607
            Robust | -.04601     .10232   -0.4497  0.653   -.246556      .154538
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_5 SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        247
-------------------+----------------------            BW type       =     Manual
     Number of obs |       149          98            Kernel        =    Uniform
Eff. Number of obs |       149          98            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19786     .22131   0.8940   0.371   -.235913      .631625
    Bias-corrected |  .09042     .22131   0.4086   0.683   -.343346      .524192
            Robust |  .09042      .4874   0.1855   0.853   -.864859      1.04571
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       430         393            Kernel        =    Uniform
Eff. Number of obs |       430         393            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.14325     .07376   -1.9422  0.052   -.287812       .00131
    Bias-corrected |  .06129     .07376   0.8309   0.406   -.083275      .205847
            Robust |  .06129     .13758   0.4454   0.656   -.208375      .330948
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==3, covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5431
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3691        1740            Kernel        = Epanechnikov
Eff. Number of obs |       912         719            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.029      65.029
       BW bias (b) |   106.672     106.672
         rho (h/b) |     0.610       0.610
        Unique obs |       354         243
Number of clusters |        15          15

Outcome: log_monthlyearning. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.09879      .0649   -1.5221  0.128   -.225999      .028418
    Bias-corrected | -.11496      .0649   -1.7712  0.077   -.242165      .012251
            Robust | -.11496     .07719   -1.4892  0.136   -.266251      .036337
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Earning Sheet 6 results.xls
dir : seeout

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *2_2) RDD Higheredu t
. 
. *2_2_1) rdrobust on higheredu, sheet 1, no province no omitting local variables
. 
. **2_2_1_1 Pooled 
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       486         440            Kernel        =    Uniform
Eff. Number of obs |       486         440            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08008     .03436   2.3302   0.020    .012722      .147428
    Bias-corrected |  .05665     .03436   1.6486   0.099     -.0107      .124005
            Robust |  .05665      .0522   1.0854   0.278   -.045651      .158956
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", replace ctitle(no province no 
> local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2714
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1280        1434            Kernel        =    Uniform
Eff. Number of obs |      1280        1434            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01208     .02221   0.5438   0.587   -.031458      .055618
    Bias-corrected |  .02656     .02221   1.1957   0.232   -.016977      .070099
            Robust |  .02656     .03169   0.8381   0.402   -.035557       .08868
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat != ., covs(male exp exps
> qr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16124
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8361        7763            Kernel        = Epanechnikov
Eff. Number of obs |      1684        1896            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.435      46.435
       BW bias (b) |    73.911      73.911
         rho (h/b) |     0.628       0.628
        Unique obs |       370         261

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00442     .02066   0.2141   0.830   -.036067      .044913
    Bias-corrected |   .0061     .02066   0.2952   0.768   -.034392      .046588
            Robust |   .0061     .02434   0.2505   0.802   -.041609      .053805
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        624
-------------------+----------------------            BW type       =     Manual
     Number of obs |       318         306            Kernel        =    Uniform
Eff. Number of obs |       318         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11761     .04906   2.3974   0.017    .021458      .213761
    Bias-corrected |  .06859     .04906   1.3982   0.162   -.027558      .164744
            Robust |  .06859      .0692   0.9912   0.322   -.067038      .204224
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1836
-------------------+----------------------            BW type       =     Manual
     Number of obs |       831        1005            Kernel        =    Uniform
Eff. Number of obs |       831        1005            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01524     .03189   0.4777   0.633   -.047273      .077747
    Bias-corrected |  .04519     .03189   1.4171   0.156   -.017315      .107705
            Robust |  .04519     .04504   1.0035   0.316   -.043077      .133466
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat==2), covs(m
> ale exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10638
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4651        5987            Kernel        = Epanechnikov
Eff. Number of obs |      1195        1481            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.154      50.154
       BW bias (b) |    87.983      87.983
         rho (h/b) |     0.570       0.570
        Unique obs |       320         248

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00676     .02872   0.2353   0.814    -.04953      .063042
    Bias-corrected |  .00325     .02872   0.1131   0.910   -.053039      .059533
            Robust |  .00325     .03284   0.0989   0.921   -.061115       .06761
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_3 SecVoc
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       105         100            Kernel        =    Uniform
Eff. Number of obs |       105         100            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01418      .0342   0.4146   0.678   -.052849      .081208
    Bias-corrected | -.02059      .0342   -0.6022  0.547   -.087622      .046435
            Robust | -.02059     .02727   -0.7552  0.450   -.074041      .032855
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01518     .02421   0.6271   0.531    -.03227      .062632
    Bias-corrected |     .02     .02421   0.8261   0.409   -.027451      .067451
            Robust |     .02     .03766   0.5310   0.595   -.053816      .093816
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2756
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1598            Kernel        = Epanechnikov
Eff. Number of obs |       381         424            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.594      46.594
       BW bias (b) |   128.546     128.546
         rho (h/b) |     0.362       0.362
        Unique obs |       236         243

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00961     .02157   0.4452   0.656   -.032679       .05189
    Bias-corrected |  .00952     .02157   0.4414   0.659   -.032762      .051808
            Robust |  .00952      .0228   0.4177   0.676   -.035159      .054206
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_4 SecGen
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14275     .06579   2.1697   0.030    .013798      .271698
    Bias-corrected |  .08723     .06579   1.3258   0.185   -.041724      .216177
            Robust |  .08723     .09537   0.9146   0.360    -.09969      .274143
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         677            Kernel        =    Uniform
Eff. Number of obs |       528         677            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02439     .04315   0.5651   0.572   -.060189       .10896
    Bias-corrected |  .06731     .04315   1.5599   0.119   -.017264      .151886
            Robust |  .06731     .06039   1.1145   0.265   -.051059      .185681
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7882
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3493        4389            Kernel        = Epanechnikov
Eff. Number of obs |      1137        1505            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.931      71.931
       BW bias (b) |   112.208     112.208
         rho (h/b) |     0.641       0.641
        Unique obs |       315         237

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01549     .03294   0.4702   0.638   -.049065      .080039
    Bias-corrected |  .01073     .03294   0.3259   0.745    -.05382      .075284
            Robust |  .01073     .03908   0.2746   0.784    -.06587      .087335
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. **2_2_1_5 SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       168         134            Kernel        =    Uniform
Eff. Number of obs |       168         134            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        878
-------------------+----------------------            BW type       =     Manual
     Number of obs |       449         429            Kernel        =    Uniform
Eff. Number of obs |       449         429            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5486
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3710        1776            Kernel        = Epanechnikov
Eff. Number of obs |      3709        1776            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       356         245

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 1 results.xls", append ctitle(no province no l
> ocal adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 1 results.xls
dir : seeout

. 
. *2_2_2) rdrobust on higheredu, sheet 2, province-clustered no omitting local variables
. 
. **2_2_2_1 Pooled 
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        926
-------------------+----------------------            BW type       =     Manual
     Number of obs |       486         440            Kernel        =    Uniform
Eff. Number of obs |       486         440            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08008     .04261   1.8794   0.060   -.003432      .163582
    Bias-corrected |  .05665     .04261   1.3297   0.184   -.026854      .140159
            Robust |  .05665     .06015   0.9418   0.346   -.061243      .174548
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", replace ctitle(province-cluste
> red no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat !=
>  ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2714
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1280        1434            Kernel        =    Uniform
Eff. Number of obs |      1280        1434            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01208     .02712   0.4455   0.656   -.041066      .065227
    Bias-corrected |  .02656     .02712   0.9795   0.327   -.026585      .079708
            Robust |  .02656     .03248   0.8177   0.414   -.037106      .090229
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat != ., covs(male exp exps
> qr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16124
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8361        7763            Kernel        = Epanechnikov
Eff. Number of obs |      1948        2154            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    52.124      52.124
       BW bias (b) |    76.834      76.834
         rho (h/b) |     0.678       0.678
        Unique obs |       370         261
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00279     .02404   0.1160   0.908   -.044321      .049899
    Bias-corrected |  .00358     .02404   0.1488   0.882   -.043534      .050687
            Robust |  .00358     .02852   0.1254   0.900   -.052315      .059468
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_cod
> e)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        624
-------------------+----------------------            BW type       =     Manual
     Number of obs |       318         306            Kernel        =    Uniform
Eff. Number of obs |       318         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11761     .06195   1.8983   0.058   -.003817      .239036
    Bias-corrected |  .06859     .06195   1.1072   0.268   -.052834       .19002
            Robust |  .06859     .08049   0.8522   0.394   -.089167      .226353
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & (educat==
> 1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_cod
> e)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1836
-------------------+----------------------            BW type       =     Manual
     Number of obs |       831        1005            Kernel        =    Uniform
Eff. Number of obs |       831        1005            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01524      .0394   0.3867   0.699   -.061987      .092461
    Bias-corrected |  .04519      .0394   1.1470   0.251   -.032029      .122419
            Robust |  .04519     .04759   0.9497   0.342   -.048075      .138464
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat==2), covs(m
> ale exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10638
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4651        5987            Kernel        = Epanechnikov
Eff. Number of obs |      1475        1838            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.561      61.561
       BW bias (b) |    95.116      95.116
         rho (h/b) |     0.647       0.647
        Unique obs |       320         248
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00607     .03252   0.1865   0.852   -.057664      .069795
    Bias-corrected |  1.9e-05    .03252   0.0006   1.000   -.063711      .063749
            Robust |  1.9e-05    .03622   0.0005   1.000   -.070965      .071003
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_3 SecVoc
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       105         100            Kernel        =    Uniform
Eff. Number of obs |       105         100            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01418     .03258   0.4352   0.663   -.049671      .078029
    Bias-corrected | -.02059     .03258   -0.6321  0.527   -.084443      .043257
            Robust | -.02059     .02896   -0.7112  0.477   -.077345      .036159
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        631
-------------------+----------------------            BW type       =     Manual
     Number of obs |       303         328            Kernel        =    Uniform
Eff. Number of obs |       303         328            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01518     .02353   0.6452   0.519   -.030939      .061301
    Bias-corrected |     .02     .02353   0.8499   0.395    -.02612       .06612
            Robust |     .02     .03486   0.5737   0.566   -.048325      .088325
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2756
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1158        1598            Kernel        = Epanechnikov
Eff. Number of obs |       381         424            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.368      46.368
       BW bias (b) |   130.359     130.359
         rho (h/b) |     0.356       0.356
        Unique obs |       236         243
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00982      .0195   0.5036   0.615   -.028402      .048044
    Bias-corrected |  .00981      .0195   0.5033   0.615   -.028409      .048037
            Robust |  .00981      .0205   0.4789   0.632   -.030355      .049984
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_4 SecGen
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .14275     .07762   1.8392   0.066   -.009375      .294871
    Bias-corrected |  .08723     .07762   1.1238   0.261   -.064897       .23935
            Robust |  .08723     .10714   0.8142   0.416   -.122755      .297208
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1205
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         677            Kernel        =    Uniform
Eff. Number of obs |       528         677            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02439     .04972   0.4905   0.624    -.07306       .12183
    Bias-corrected |  .06731     .04972   1.3539   0.176   -.030134      .164756
            Robust |  .06731     .06028   1.1167   0.264   -.050828      .185451
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7882
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3493        4389            Kernel        = Epanechnikov
Eff. Number of obs |      1318        1803            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    82.952      82.952
       BW bias (b) |   112.225     112.225
         rho (h/b) |     0.739       0.739
        Unique obs |       315         237
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02629     .03446   0.7630   0.445   -.041254      .093842
    Bias-corrected |  .01871     .03446   0.5430   0.587   -.048834      .086261
            Robust |  .01871     .04053   0.4617   0.644    -.06073      .098157
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. **2_2_2_5 SecJun
. *One year each
. rdrobust highgen t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        302
-------------------+----------------------            BW type       =     Manual
     Number of obs |       168         134            Kernel        =    Uniform
Eff. Number of obs |       168         134            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) & educat ==
> 3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        878
-------------------+----------------------            BW type       =     Manual
     Number of obs |       449         429            Kernel        =    Uniform
Eff. Number of obs |       449         429            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if inrange(monthlyearning, 250, 25000) & educat ==3, covs(male exp expsq
> r) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5486
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3710        1776            Kernel        = Epanechnikov
Eff. Number of obs |      3709        1776            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       356         245
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 2 results.xls", append ctitle(province-cluster
> ed no local adjustment, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 2 results.xls
dir : seeout

. 
. *2_2_3) rdrobust on higheredu, sheet 3, no province no Aug-Sep
. 
. **2_2_3_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        824
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         381            Kernel        =    Uniform
Eff. Number of obs |       443         381            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0987     .04191   2.3549   0.019    .016553       .18084
    Bias-corrected |  .12151     .04191   2.8992   0.004    .039362      .203649
            Robust |  .12151     .07614   1.5959   0.111   -.027717      .270728
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", replace ctitle(no province no 
> Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2612
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1237        1375            Kernel        =    Uniform
Eff. Number of obs |      1237        1375            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00654     .02399   0.2727   0.785   -.040475      .053556
    Bias-corrected |  .02137     .02399   0.8911   0.373    -.02564       .06839
            Robust |  .02137     .03683   0.5804   0.562    -.05081       .09356
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16022
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8318        7704            Kernel        = Epanechnikov
Eff. Number of obs |      1458        1710            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    42.415      42.415
       BW bias (b) |    73.233      73.233
         rho (h/b) |     0.579       0.579
        Unique obs |       369         260

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00074     .02303   0.0323   0.974   -.044399      .045887
    Bias-corrected |  .00057     .02303   0.0247   0.980   -.044573      .045713
            Robust |  .00057      .0271   0.0210   0.983   -.052541      .053681
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15784      .0648   2.4359   0.015    .030838      .284847
    Bias-corrected |  .18203      .0648   2.8091   0.005    .055024      .309033
            Robust |  .18203     .11293   1.6119   0.107   -.039306      .403362
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1756
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         960            Kernel        =    Uniform
Eff. Number of obs |       796         960            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00891     .03542   0.2517   0.801   -.060509      .078338
    Bias-corrected |  .04752     .03542   1.3417   0.180     -.0219      .116947
            Robust |  .04752      .0558   0.8516   0.394   -.061849      .156896
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10558
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4616        5942            Kernel        = Epanechnikov
Eff. Number of obs |      1067        1327            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.673      47.673
       BW bias (b) |    91.296      91.296
         rho (h/b) |     0.522       0.522
        Unique obs |       319         247

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00026     .03227   0.0082   0.993   -.062987      .063513
    Bias-corrected | -.00431     .03227   -0.1335  0.894   -.067558      .058942
            Robust | -.00431     .03669   -0.1174  0.907   -.076228      .067612
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03655     .05828   0.6272   0.531   -.077669      .150774
    Bias-corrected | -.04776     .05828   -0.8195  0.412   -.161981      .066462
            Robust | -.04776     .08102   -0.5895  0.556   -.206559      .111039
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        604
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         312            Kernel        =    Uniform
Eff. Number of obs |       292         312            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01846     .02904   0.6358   0.525   -.038449      .075374
    Bias-corrected |  .03595     .02904   1.2380   0.216   -.020964      .092859
            Robust |  .03595     .05475   0.6566   0.511   -.071361      .143256
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2729
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1147        1582            Kernel        = Epanechnikov
Eff. Number of obs |       370         408            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.367      46.367
       BW bias (b) |   136.223     136.223
         rho (h/b) |     0.340       0.340
        Unique obs |       235         242

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01254     .02594   0.4832   0.629   -.038311      .063382
    Bias-corrected |  .01273     .02594   0.4908   0.624   -.038114      .063579
            Robust |  .01273     .02731   0.4662   0.641   -.040794      .066259
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18711     .08451   2.2141   0.027    .021475      .352744
    Bias-corrected |   .2027     .08451   2.3986   0.016    .037069      .368339
            Robust |   .2027     .14715   1.3775   0.168   -.085704      .491113
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1152
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         648            Kernel        =    Uniform
Eff. Number of obs |       504         648            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01585     .04768   0.3324   0.740   -.077606       .10931
    Bias-corrected |  .06959     .04768   1.4594   0.144    -.02387      .163045
            Robust |  .06959     .07366   0.9447   0.345   -.074781      .213957
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7829
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3469        4360            Kernel        = Epanechnikov
Eff. Number of obs |      1185        1604            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    75.599      75.599
       BW bias (b) |   122.615     122.615
         rho (h/b) |     0.617       0.617
        Unique obs |       314         236

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01543     .03396   0.4543   0.650   -.051127      .081982
    Bias-corrected |  .01104     .03396   0.3252   0.745   -.055511      .077598
            Robust |  .01104      .0406   0.2720   0.786   -.068533       .09062
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. **2_2_3_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         120            Kernel        =    Uniform
Eff. Number of obs |       160         120            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        856
-------------------+----------------------            BW type       =     Manual
     Number of obs |       441         415            Kernel        =    Uniform
Eff. Number of obs |       441         415            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5464
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        1762            Kernel        = Epanechnikov
Eff. Number of obs |      3701        1762            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       355         244

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 3 results.xls", append ctitle(no province no A
> ug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 3 results.xls
dir : seeout

. 
. *2_2_4) rdrobust on higheredu, sheet 4, province-clustered no Aug-Sep
. 
. **2_2_4_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        824
-------------------+----------------------            BW type       =     Manual
     Number of obs |       443         381            Kernel        =    Uniform
Eff. Number of obs |       443         381            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0987     .04874   2.0250   0.043    .003168      .194226
    Bias-corrected |  .12151     .04874   2.4929   0.013    .025977      .217035
            Robust |  .12151     .06988   1.7388   0.082   -.015457      .258469
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", replace ctitle(province-cluste
> red no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2612
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1237        1375            Kernel        =    Uniform
Eff. Number of obs |      1237        1375            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00654     .02927   0.2235   0.823   -.050831      .063913
    Bias-corrected |  .02137     .02927   0.7302   0.465   -.035997      .078747
            Robust |  .02137     .03637   0.5877   0.557   -.049908      .092658
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16022
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8318        7704            Kernel        = Epanechnikov
Eff. Number of obs |      1684        1875            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    47.473      47.473
       BW bias (b) |    75.788      75.788
         rho (h/b) |     0.626       0.626
        Unique obs |       369         260
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00213     .02629   -0.0809  0.936   -.053657      .049403
    Bias-corrected | -.00331     .02629   -0.1258  0.900   -.054838      .048223
            Robust | -.00331     .03127   -0.1058  0.916   -.064599      .057984
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15784     .07771   2.0311   0.042    .005529      .310155
    Bias-corrected |  .18203     .07771   2.3423   0.019    .029715      .334342
            Robust |  .18203     .10207   1.7833   0.075   -.018034      .382091
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1756
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         960            Kernel        =    Uniform
Eff. Number of obs |       796         960            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00891      .0432   0.2063   0.837   -.075759      .093588
    Bias-corrected |  .04752      .0432   1.1000   0.271    -.03715      .132197
            Robust |  .04752     .05624   0.8450   0.398    -.06271      .157757
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provinc
> e_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10558
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4616        5942            Kernel        = Epanechnikov
Eff. Number of obs |      1302        1613            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.771      56.771
       BW bias (b) |    97.310      97.310
         rho (h/b) |     0.583       0.583
        Unique obs |       319         247
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00218     .03634   -0.0599  0.952   -.073405       .06905
    Bias-corrected | -.00829     .03634   -0.2282  0.820   -.079519      .062935
            Robust | -.00829     .04093   -0.2026  0.839    -.08851      .071926
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03655     .05322   0.6868   0.492   -.067763      .140869
    Bias-corrected | -.04776     .05322   -0.8973  0.370   -.152076      .056557
            Robust | -.04776     .08334   -0.5731  0.567   -.211106      .115587
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        604
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         312            Kernel        =    Uniform
Eff. Number of obs |       292         312            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01846     .02752   0.6707   0.502   -.035485       .07241
    Bias-corrected |  .03595     .02752   1.3060   0.192      -.018      .089895
            Robust |  .03595     .05024   0.7154   0.474    -.06253      .134425
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2729
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1147        1582            Kernel        = Epanechnikov
Eff. Number of obs |       361         399            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    45.773      45.773
       BW bias (b) |   137.523     137.523
         rho (h/b) |     0.333       0.333
        Unique obs |       235         242
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01326     .02289   0.5793   0.562     -.0316      .058119
    Bias-corrected |  .01353     .02289   0.5911   0.554    -.03133      .058388
            Robust |  .01353     .02389   0.5664   0.571   -.033288      .060345
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .18711     .09561   1.9569   0.050   -.000288      .374507
    Bias-corrected |   .2027     .09561   2.1200   0.034    .015306      .390102
            Robust |   .2027     .12416   1.6326   0.103   -.040653      .446061
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1152
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         648            Kernel        =    Uniform
Eff. Number of obs |       504         648            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01585     .05689   0.2786   0.781    -.09565      .127354
    Bias-corrected |  .06959     .05689   1.2232   0.221   -.041914       .18109
            Robust |  .06959     .07262   0.9582   0.338   -.072744       .21192
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7829
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3469        4360            Kernel        = Epanechnikov
Eff. Number of obs |      1278        1748            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    81.451      81.451
       BW bias (b) |   120.842     120.842
         rho (h/b) |     0.674       0.674
        Unique obs |       314         236
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02134     .03653   0.5841   0.559   -.050252      .092924
    Bias-corrected |  .01479     .03653   0.4048   0.686   -.056802      .086374
            Robust |  .01479     .04374   0.3381   0.735   -.070939      .100511
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. **2_2_4_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        280
-------------------+----------------------            BW type       =     Manual
     Number of obs |       160         120            Kernel        =    Uniform
Eff. Number of obs |       160         120            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        856
-------------------+----------------------            BW type       =     Manual
     Number of obs |       441         415            Kernel        =    Uniform
Eff. Number of obs |       441         415            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5464
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3702        1762            Kernel        = Epanechnikov
Eff. Number of obs |      3701        1762            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       355         244
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 4 results.xls", append ctitle(province-cluster
> ed no Aug-Sep, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 4 results.xls
dir : seeout

. 
. *2_2_5) rdrobust on higheredu, sheet 5, no province no July-Oct
. 
. **2_2_5_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        720
-------------------+----------------------            BW type       =     Manual
     Number of obs |       396         324            Kernel        =    Uniform
Eff. Number of obs |       396         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08432     .05653   1.4917   0.136   -.026467      .195109
    Bias-corrected |  .12542     .05653   2.2187   0.027    .014628      .236203
            Robust |  .12542     .13192   0.9507   0.342   -.133145      .383976
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", replace ctitle(no province no 
> July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2508
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1190        1318            Kernel        =    Uniform
Eff. Number of obs |      1190        1318            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00868     .02651   -0.3275  0.743   -.060633      .043273
    Bias-corrected | -.01361     .02651   -0.5135  0.608   -.065566       .03834
            Robust | -.01361     .04536   -0.3001  0.764    -.10252      .075295
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15918
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8271        7647            Kernel        = Epanechnikov
Eff. Number of obs |      1236        1428            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    37.183      37.183
       BW bias (b) |    70.600      70.600
         rho (h/b) |     0.527       0.527
        Unique obs |       368         259

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01347     .02755   -0.4891  0.625   -.067462      .040516
    Bias-corrected | -.01719     .02755   -0.6239  0.533   -.071174      .036804
            Robust | -.01719     .03212   -0.5350  0.593   -.080139      .045769
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15159     .09137   1.6591   0.097   -.027488      .330665
    Bias-corrected |  .21204     .09137   2.3207   0.020    .032961      .391114
            Robust |  .21204     .22525   0.9413   0.347   -.229442      .653517
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1685
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         925            Kernel        =    Uniform
Eff. Number of obs |       760         925            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01349     .03942   -0.3421  0.732   -.090745      .063772
    Bias-corrected |  .00122     .03942   0.0310   0.975   -.076035      .078482
            Robust |  .00122     .07109   0.0172   0.986   -.138111      .140559
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4580        5907            Kernel        = Epanechnikov
Eff. Number of obs |       945        1221            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    44.617      44.617
       BW bias (b) |    93.395      93.395
         rho (h/b) |     0.478       0.478
        Unique obs |       318         246

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02306     .03699   -0.6235  0.533   -.095561      .049437
    Bias-corrected | -.03079     .03699   -0.8325  0.405   -.103292      .041707
            Robust | -.03079      .0417   -0.7385  0.460   -.112518      .050933
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04121     .08982   0.4588   0.646   -.134829       .21725
    Bias-corrected | -.16109     .08982   -1.7936  0.073   -.337134      .014945
            Robust | -.16109      .2607   -0.6179  0.537   -.672056      .349868
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         305            Kernel        =    Uniform
Eff. Number of obs |       281         305            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01827      .0327   0.5588   0.576   -.045812      .082351
    Bias-corrected |  .03604      .0327   1.1022   0.270   -.028046      .100117
            Robust |  .03604     .07234   0.4982   0.618   -.105744      .177814
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1136        1575            Kernel        = Epanechnikov
Eff. Number of obs |       359         401            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    46.167      46.167
       BW bias (b) |   133.485     133.485
         rho (h/b) |     0.346       0.346
        Unique obs |       234         241

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01149      .0292   0.3935   0.694   -.045735       .06871
    Bias-corrected |  .01149      .0292   0.3935   0.694   -.045733      .068712
            Robust |  .01149     .03092   0.3716   0.710   -.049105      .072084
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19852       .124   1.6010   0.109   -.044505      .441547
    Bias-corrected |  .30408       .124   2.4524   0.014    .061057       .54711
            Robust |  .30408     .29798   1.0205   0.307   -.279945      .888112
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1099
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         620            Kernel        =    Uniform
Eff. Number of obs |       479         620            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00889       .054   -0.1646  0.869   -.114733      .096955
    Bias-corrected |  .02648       .054   0.4903   0.624   -.079367       .13232
            Robust |  .02648     .09703   0.2729   0.785   -.163705      .216658
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7776
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3444        4332            Kernel        = Epanechnikov
Eff. Number of obs |      1119        1520            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    73.642      73.642
       BW bias (b) |   124.913     124.913
         rho (h/b) |     0.590       0.590
        Unique obs |       313         235

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0008     .03696   -0.0218  0.983   -.073236      .071626
    Bias-corrected |  -.0078     .03696   -0.2111  0.833   -.080234      .064628
            Robust |  -.0078     .04434   -0.1760  0.860   -.094711      .079105
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. **2_2_5_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        247
-------------------+----------------------            BW type       =     Manual
     Number of obs |       149          98            Kernel        =    Uniform
Eff. Number of obs |       149          98            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       430         393            Kernel        =    Uniform
Eff. Number of obs |       430         393            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5431
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3691        1740            Kernel        = Epanechnikov
Eff. Number of obs |      3690        1740            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       354         243

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 5 results.xls", append ctitle(no province no J
> uly-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 5 results.xls
dir : seeout

. 
. *2_2_6) rdrobust on higheredu, sheet 6, province-clustered no July-Oct
. 
. **2_2_6_1 Pooled 
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        720
-------------------+----------------------            BW type       =     Manual
     Number of obs |       396         324            Kernel        =    Uniform
Eff. Number of obs |       396         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08432     .06728   1.2533   0.210   -.047545      .216187
    Bias-corrected |  .12542     .06728   1.8641   0.062   -.006451      .257282
            Robust |  .12542     .13982   0.8970   0.370   -.148618      .399449
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", replace ctitle(province-cluste
> red no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat != ., covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster provinc
> e_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2508
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1190        1318            Kernel        =    Uniform
Eff. Number of obs |      1190        1318            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00868     .03234   -0.2684  0.788    -.07207       .05471
    Bias-corrected | -.01361     .03234   -0.4209  0.674   -.077003      .049777
            Robust | -.01361     .04663   -0.2919  0.770   -.105006      .077781
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat != ., c
> ovs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15918
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8271        7647            Kernel        = Epanechnikov
Eff. Number of obs |      1365        1621            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    41.370      41.370
       BW bias (b) |    75.442      75.442
         rho (h/b) |     0.548       0.548
        Unique obs |       368         259
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01635     .03008   -0.5435  0.587   -.075306      .042609
    Bias-corrected | -.02208     .03008   -0.7340  0.463   -.081036      .036879
            Robust | -.02208     .03553   -0.6215  0.534   -.091707      .047549
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_2 Pooled without SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .15159     .10472   1.4475   0.148   -.053661      .356838
    Bias-corrected |  .21204     .10472   2.0248   0.043    .006788      .417287
            Robust |  .21204     .22822   0.9291   0.353   -.235269      .659344
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & (educat==1 | educat==2), covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nnclu
> ster province_code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1685
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         925            Kernel        =    Uniform
Eff. Number of obs |       760         925            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01349     .04845   -0.2784  0.781   -.108438      .081465
    Bias-corrected |  .00122     .04845   0.0253   0.980   -.093728      .096175
            Robust |  .00122     .06928   0.0177   0.986   -.134559      .137006
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (educat==1 | e
> ducat==2), covs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provinc
> e_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10487
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4580        5907            Kernel        = Epanechnikov
Eff. Number of obs |      1195        1486            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.185      53.185
       BW bias (b) |   100.395     100.395
         rho (h/b) |     0.530       0.530
        Unique obs |       318         246
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02146     .04066   -0.5278  0.598   -.101158      .058236
    Bias-corrected | -.02936     .04066   -0.7221  0.470    -.10906      .050334
            Robust | -.02936       .046   -0.6383  0.523    -.11953      .060803
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_3 SecVoc
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04121     .08354   0.4933   0.622   -.122521      .204941
    Bias-corrected | -.16109     .08354   -1.9284  0.054   -.324825      .002637
            Robust | -.16109     .26972   -0.5973  0.550   -.689736      .367547
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==1, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        586
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         305            Kernel        =    Uniform
Eff. Number of obs |       281         305            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01827     .03136   0.5825   0.560   -.043203      .079742
    Bias-corrected |  .03604     .03136   1.1489   0.251   -.025438      .097508
            Robust |  .03604      .0661   0.5451   0.586   -.093524      .165595
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==1, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2711
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1136        1575            Kernel        = Epanechnikov
Eff. Number of obs |       350         392            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    45.816      45.816
       BW bias (b) |   134.010     134.010
         rho (h/b) |     0.342       0.342
        Unique obs |       234         241
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01196     .02602   0.4597   0.646   -.039043       .06297
    Bias-corrected |    .012     .02602   0.4612   0.645   -.039004      .063009
            Robust |    .012      .0274   0.4380   0.661   -.041703      .065708
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_4 SecGen
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .19852     .13914   1.4268   0.154   -.074184      .471226
    Bias-corrected |  .30408     .13914   2.1855   0.029    .031378      .576789
            Robust |  .30408     .28796   1.0560   0.291   -.260313       .86848
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==2, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1099
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         620            Kernel        =    Uniform
Eff. Number of obs |       479         620            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00889     .06734   -0.1320  0.895   -.140872      .123094
    Bias-corrected |  .02648     .06734   0.3932   0.694   -.105507      .158459
            Robust |  .02648      .0983   0.2693   0.788   -.166197      .219149
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==2, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7776
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3444        4332            Kernel        = Epanechnikov
Eff. Number of obs |      1200        1651            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    78.970      78.970
       BW bias (b) |   125.164     125.164
         rho (h/b) |     0.631       0.631
        Unique obs |       313         235
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00703     .03976   0.1767   0.860    -.07091      .084964
    Bias-corrected |  -.0015     .03976   -0.0378  0.970   -.079438      .076436
            Robust |  -.0015     .04823   -0.0311  0.975   -.096024      .093022
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. **2_2_6_5 SecJun
. *One year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(12) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        247
-------------------+----------------------            BW type       =     Manual
     Number of obs |       149          98            Kernel        =    Uniform
Eff. Number of obs |       149          98            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearning, 250, 2
> 5000) & educat ==3, covs(male exp expsqr) kernel(uni) p(1) h(36) all vce(nncluster province
> _code)

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        823
-------------------+----------------------            BW type       =     Manual
     Number of obs |       430         393            Kernel        =    Uniform
Eff. Number of obs |       430         393            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust highgen t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & educat ==3, co
> vs(male exp expsqr) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.
Not enough variability to compute the preliminary bandwidth. Try checking for mass points wit
> h option masspoints(check).
Not enough variability to compute the bias bandwidth (b). Try checking for mass points with o
> ption masspoints(check). 
Not enough variability to compute the loc. poly. bandwidth (h). Try checking for mass points 
> with option masspoints(check).

Covariate-adjusted Sharp RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       5431
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3691        1740            Kernel        = Epanechnikov
Eff. Number of obs |      3690        1740            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |   452.000     452.000
       BW bias (b) |   452.000     452.000
         rho (h/b) |     1.000       1.000
        Unique obs |       354         243
Number of clusters |        15          15

Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |       0          0       .        .          0            0
    Bias-corrected |       0          0       .        .          0            0
            Robust |       0          0       .        .          0            0
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 3
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Highgenedu Sheet 6 results.xls", append ctitle(province-cluster
> ed no July-Oct, secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male Exp controlle
> d/Highgenedu Sheet 6 results.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/ManualDivision Male 
> Exp controlled/Urban 1979 Highgen ManualD MaleExp controlled.log
  log type:  text
 closed on:   6 Aug 2024, 17:27:59
---------------------------------------------------------------------------------------------
