---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Fra
> me/Tenure/IV Urban ATF Tenure 1982 1971-92.log
  log type:  text
 opened on:   6 Aug 2024, 17:44:29

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1982)
(13 missing values generated)

. gen d = 1 if t >= 0 & t != .
(20,114 missing values generated)

. replace d = 0 if t < 1
(20,164 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. 
. *9) Tenure
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. 
. *Step Two: Regressions
. 
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. 
. *1)
. ivregress 2sls log_monthlyearning tenure tenuresqr male (higheredu secgenhighedu secgenedu 
> = t d td) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & educat 
> != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(6, 10607)   = 192.17
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0980
                                                        Adj R-squared = 0.0975
                                                        Root MSE      = 0.4722

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0212003   .0020308    10.44   0.000     .0172196    .0251811
   tenuresqr |  -.0001527   .0000839    -1.82   0.069    -.0003172    .0000118
        male |  -.0344135   .0092182    -3.73   0.000    -.0524829   -.0163441
           t |   .0022118   .0001611    13.73   0.000     .0018959    .0025277
           d |    .053852   .0183606     2.93   0.003     .0178618    .0898422
          td |  -.0009207   .0002587    -3.56   0.000    -.0014279   -.0004135
       _cons |   .3337515   .0161654    20.65   0.000     .3020643    .3654387
------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(6, 10607)   = 157.79
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0819
                                                        Adj R-squared = 0.0814
                                                        Root MSE      = 0.4665

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0212684   .0020062    10.60   0.000     .0173359     .025201
   tenuresqr |  -.0003476   .0000829    -4.19   0.000    -.0005101   -.0001851
        male |  -.0174293   .0091066    -1.91   0.056    -.0352799    .0004213
           t |   .0016571   .0001592    10.41   0.000      .001345    .0019691
           d |   .0821788   .0181382     4.53   0.000     .0466244    .1177332
          td |    -.00042   .0002556    -1.64   0.100     -.000921    .0000811
       _cons |   .2536921   .0159696    15.89   0.000     .2223886    .2849956
------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(6, 10607)   =  96.39
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0517
                                                        Adj R-squared = 0.0512
                                                        Root MSE      = 0.4871

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0207647   .0020945     9.91   0.000     .0166591    .0248703
   tenuresqr |  -.0004519   .0000866    -5.22   0.000    -.0006216   -.0002823
        male |   -.000988   .0095073    -0.10   0.917     -.019624     .017648
           t |   .0009452   .0001662     5.69   0.000     .0006194     .001271
           d |   .0922863   .0189363     4.87   0.000     .0551676     .129405
          td |   .0001398   .0002669     0.52   0.600    -.0003833    .0006629
       _cons |   .3513797   .0166723    21.08   0.000     .3186989    .3840606
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(6)    =       5.78
                                                  Prob > chi2     =     0.4482
                                                  R-squared       =          .
                                                  Root MSE        =     8.6751

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -21.01512   53.61966    -0.39   0.695    -126.1077    84.07748
secgenhighedu |   43.14685    105.579     0.41   0.683    -163.7841    250.0778
    secgenedu |  -25.00326   60.09776    -0.42   0.677    -142.7927    92.78619
       tenure |   .0858822   .1356412     0.63   0.527    -.1799697    .3517341
    tenuresqr |  -.0004043   .0024647    -0.16   0.870     -.005235    .0044264
         male |   .2750769   .2059037     1.34   0.182    -.1284868    .6786407
        _cons |   12.88502   12.16461     1.06   0.289    -10.95717    36.72721
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  47.6392  (p = 0.0000)
  Wu-Hausman F(3,10604)           =  15.9363  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.606  Chi-sq(6) P-value = 0.9963

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", replace ctitle(IV: higheredu secgenedu & their product, Pooled) 
> pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "E
> ndogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasti
> city df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr male provincedum2-provincedum15 (highere
> du secgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyea
> rning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(20, 10593)  =  71.59
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1191
                                                        Adj R-squared = 0.1174
                                                        Root MSE      = 0.4670

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0201073   .0020128     9.99   0.000     .0161619    .0240528
    tenuresqr |  -.0001205   .0000832    -1.45   0.147    -.0002836    .0000425
         male |  -.0318214   .0091245    -3.49   0.000    -.0497071   -.0139357
 provincedum2 |  -.1912259    .024646    -7.76   0.000    -.2395368   -.1429151
 provincedum3 |   -.121515   .0256535    -4.74   0.000    -.1718008   -.0712293
 provincedum4 |  -.1690162   .0248236    -6.81   0.000    -.2176751   -.1203573
 provincedum5 |  -.2341725   .0227567   -10.29   0.000      -.27878    -.189565
 provincedum6 |  -.2557496   .0250296   -10.22   0.000    -.3048123    -.206687
 provincedum7 |  -.2408465   .0237172   -10.15   0.000    -.2873367   -.1943563
 provincedum8 |  -.2323821   .0232641    -9.99   0.000    -.2779841   -.1867801
 provincedum9 |  -.2285348   .0239432    -9.54   0.000     -.275468   -.1816016
provincedum10 |  -.2313964   .0245042    -9.44   0.000    -.2794293   -.1833634
provincedum11 |  -.2829526   .0206205   -13.72   0.000    -.3233726   -.2425326
provincedum12 |  -.2400817   .0255321    -9.40   0.000    -.2901293   -.1900341
provincedum13 |    -.24601   .0235102   -10.46   0.000    -.2920944   -.1999257
provincedum14 |  -.1828401   .0301642    -6.06   0.000    -.2419675   -.1237126
provincedum15 |  -.1458324   .0304059    -4.80   0.000    -.2054336   -.0862311
            t |   .0021947   .0001598    13.73   0.000     .0018814    .0025079
            d |   .0462249    .018182     2.54   0.011     .0105848    .0818649
           td |  -.0007984   .0002565    -3.11   0.002    -.0013011   -.0002957
        _cons |   .5457141    .022691    24.05   0.000     .5012355    .5901928
-------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(20, 10593)  =  57.99
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0987
                                                        Adj R-squared = 0.0970
                                                        Root MSE      = 0.4626

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0203708   .0019936    10.22   0.000     .0164629    .0242786
    tenuresqr |  -.0003202   .0000824    -3.89   0.000    -.0004817   -.0001587
         male |   -.015474   .0090374    -1.71   0.087    -.0331891     .002241
 provincedum2 |  -.1983943   .0244108    -8.13   0.000    -.2462441   -.1505445
 provincedum3 |  -.1093698   .0254087    -4.30   0.000    -.1591756   -.0595639
 provincedum4 |  -.1649062   .0245867    -6.71   0.000    -.2131007   -.1167117
 provincedum5 |  -.2188641   .0225396    -9.71   0.000    -.2630459   -.1746824
 provincedum6 |  -.2199592   .0247907    -8.87   0.000    -.2685536   -.1713647
 provincedum7 |  -.2217068   .0234909    -9.44   0.000    -.2677533   -.1756603
 provincedum8 |  -.2082598   .0230421    -9.04   0.000    -.2534265    -.163093
 provincedum9 |  -.1919746   .0237147    -8.10   0.000    -.2384599   -.1454893
provincedum10 |  -.2098194   .0242704    -8.65   0.000    -.2573939   -.1622449
provincedum11 |  -.2430198   .0204237   -11.90   0.000     -.283054   -.2029855
provincedum12 |  -.2259412   .0252884    -8.93   0.000    -.2755112   -.1763712
provincedum13 |  -.2248157   .0232858    -9.65   0.000    -.2704602   -.1791711
provincedum14 |  -.1938018   .0298763    -6.49   0.000     -.252365   -.1352387
provincedum15 |  -.1398873   .0301157    -4.64   0.000    -.1989198   -.0808548
            t |   .0016433   .0001583    10.38   0.000      .001333    .0019535
            d |   .0751559   .0180084     4.17   0.000      .039856    .1104559
           td |   -.000322    .000254    -1.27   0.205    -.0008199    .0001759
        _cons |   .4469199   .0224744    19.89   0.000     .4028657     .490974
-------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(20, 10593)  =  36.60
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0646
                                                        Adj R-squared = 0.0629
                                                        Root MSE      = 0.4840

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0200583   .0020862     9.61   0.000      .015969    .0241476
    tenuresqr |  -.0004286   .0000862    -4.97   0.000    -.0005975   -.0002596
         male |   .0000188   .0094571     0.00   0.998     -.018519    .0185565
 provincedum2 |  -.1814861   .0255444    -7.10   0.000    -.2315579   -.1314142
 provincedum3 |  -.0799311   .0265887    -3.01   0.003    -.1320499   -.0278124
 provincedum4 |  -.1743417   .0257284    -6.78   0.000    -.2247743   -.1239091
 provincedum5 |   -.202598   .0235863    -8.59   0.000    -.2488315   -.1563645
 provincedum6 |  -.2082086   .0259419    -8.03   0.000    -.2590597   -.1573576
 provincedum7 |  -.2219755   .0245817    -9.03   0.000    -.2701604   -.1737907
 provincedum8 |  -.1637899   .0241121    -6.79   0.000    -.2110541   -.1165256
 provincedum9 |  -.1505289    .024816    -6.07   0.000    -.1991729   -.1018849
provincedum10 |  -.1835667   .0253975    -7.23   0.000    -.2333505   -.1337829
provincedum11 |  -.1838851   .0213721    -8.60   0.000    -.2257785   -.1419917
provincedum12 |  -.1817851   .0264627    -6.87   0.000    -.2336571   -.1299132
provincedum13 |  -.1983362   .0243672    -8.14   0.000    -.2461005    -.150572
provincedum14 |  -.2175756   .0312637    -6.96   0.000    -.2788583   -.1562928
provincedum15 |  -.1252096   .0315142    -3.97   0.000    -.1869834   -.0634357
            t |   .0009296   .0001656     5.61   0.000     .0006049    .0012543
            d |   .0856156   .0188447     4.54   0.000     .0486764    .1225549
           td |    .000212   .0002658     0.80   0.425     -.000309    .0007331
        _cons |    .520548   .0235181    22.13   0.000      .474448    .5666479
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(20)   =      10.66
                                                  Prob > chi2     =     0.9546
                                                  R-squared       =          .
                                                  Root MSE        =     8.0189

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -19.30621   43.08648    -0.45   0.654    -103.7542    65.14173
secgenhighedu |    39.7451   84.73002     0.47   0.639    -126.3227    205.8129
    secgenedu |  -23.24174   48.51732    -0.48   0.632     -118.334    71.85046
       tenure |   .0816445   .1106068     0.74   0.460    -.1351407    .2984298
    tenuresqr |  -.0003575   .0022302    -0.16   0.873    -.0047286    .0040136
         male |   .2744043   .1891859     1.45   0.147    -.0963931    .6452018
 provincedum2 |   -.612175   .5064088    -1.21   0.227    -1.604718    .3803681
 provincedum3 |  -.1392323   .4817876    -0.29   0.773    -1.083519    .8050541
 provincedum4 |  -1.224771   1.791186    -0.68   0.494    -4.735431    2.285888
 provincedum5 |   -.658098   1.377881    -0.48   0.633    -3.358696      2.0425
 provincedum6 |  -1.310546   2.460817    -0.53   0.594    -6.133659    3.512567
 provincedum7 |  -1.344767   2.348524    -0.57   0.567    -5.947789    3.258254
 provincedum8 |  -.5370421   .4938664    -1.09   0.277    -1.505002    .4309182
 provincedum9 |  -.4892962   .9433028    -0.52   0.604    -2.338136    1.359543
provincedum10 |  -.6553855   1.129122    -0.58   0.562    -2.868423    1.557652
provincedum11 |    -.24193   .6065419    -0.40   0.690     -1.43073    .9468704
provincedum12 |  -.1966418   .4653338    -0.42   0.673    -1.108679    .7153957
provincedum13 |  -.6727886   1.194985    -0.56   0.573    -3.014916    1.669339
provincedum14 |  -1.247562   2.063109    -0.60   0.545    -5.291181    2.796057
provincedum15 |  -.5862496   .7067271    -0.83   0.407    -1.971409      .79891
        _cons |   13.19151   10.79082     1.22   0.222    -7.958111    34.34114
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  49.0581  (p = 0.0000)
  Wu-Hausman F(3,10590)           =  16.3915  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.810  Chi-sq(20) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Pooled Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu secgenedu = t d
>  td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 1 &
>  educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(5, 5660)    =  86.31
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0708
                                                        Adj R-squared = 0.0700
                                                        Root MSE      = 0.4782

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |    .013146    .002814     4.67   0.000     .0076294    .0186627
   tenuresqr |   .0000511   .0001142     0.45   0.654    -.0001727     .000275
           t |    .002349   .0002239    10.49   0.000     .0019101     .002788
           d |   .0261675    .025515     1.03   0.305    -.0238517    .0761868
          td |  -.0014235   .0003591    -3.96   0.000    -.0021275   -.0007195
       _cons |   .3701236    .022219    16.66   0.000     .3265659    .4136813
------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(5, 5660)    =  71.14
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0591
                                                        Adj R-squared = 0.0583
                                                        Root MSE      = 0.4714

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0147573   .0027744     5.32   0.000     .0093184    .0201962
   tenuresqr |  -.0001546   .0001126    -1.37   0.170    -.0003753    .0000661
           t |   .0018124   .0002207     8.21   0.000     .0013797    .0022452
           d |   .0568237   .0251556     2.26   0.024     .0075092    .1061382
          td |  -.0009994   .0003541    -2.82   0.005    -.0016935   -.0003054
       _cons |   .2965898   .0219059    13.54   0.000     .2536458    .3395338
------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(5, 5660)    =  43.65
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0371
                                                        Adj R-squared = 0.0363
                                                        Root MSE      = 0.4909

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0136788   .0028886     4.74   0.000      .008016    .0193416
   tenuresqr |  -.0002029   .0001172    -1.73   0.084    -.0004327    .0000269
           t |   .0011888   .0002298     5.17   0.000     .0007383    .0016394
           d |   .0654913   .0261914     2.50   0.012     .0141462    .1168364
          td |  -.0004238   .0003686    -1.15   0.250    -.0011465    .0002988
       _cons |   .4097856   .0228079    17.97   0.000     .3650734    .4544978
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(5)    =       2.08
                                                  Prob > chi2     =     0.8378
                                                  R-squared       =          .
                                                  Root MSE        =     5.3011

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -11.08478   18.27646    -0.61   0.544    -46.90597    24.73642
secgenhighedu |   24.92859   38.39992     0.65   0.516    -50.33387    100.1911
    secgenedu |  -15.55633   23.33825    -0.67   0.505    -61.29845    30.18579
       tenure |   .0207516   .0387821     0.54   0.593    -.0552598    .0967631
    tenuresqr |   .0003884   .0027815     0.14   0.889    -.0050633    .0058402
        _cons |   11.45683   4.769669     2.40   0.016     2.108452    20.80521
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  31.2908  (p = 0.0000)
  Wu-Hausman F(3,5657)            =  10.4715  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   1.079  Chi-sq(5) P-value = 0.9560

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male) pva
> lue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endo
> geneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu se
> cgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning
> , 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(19, 5646)   =  29.79
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0911
                                                        Adj R-squared = 0.0880
                                                        Root MSE      = 0.4735

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0118438   .0027957     4.24   0.000     .0063632    .0173244
    tenuresqr |   .0000928   .0001134     0.82   0.413    -.0001294    .0003151
 provincedum2 |  -.2126328   .0340543    -6.24   0.000    -.2793923   -.1458732
 provincedum3 |  -.1265306   .0358549    -3.53   0.000      -.19682   -.0562411
 provincedum4 |  -.1892077   .0349197    -5.42   0.000    -.2576637   -.1207517
 provincedum5 |  -.2227622   .0319227    -6.98   0.000     -.285343   -.1601814
 provincedum6 |  -.2460616    .034587    -7.11   0.000    -.3138654   -.1782579
 provincedum7 |  -.2458958    .033703    -7.30   0.000    -.3119665    -.179825
 provincedum8 |  -.2236861   .0325524    -6.87   0.000    -.2875013   -.1598709
 provincedum9 |  -.2031551    .033207    -6.12   0.000    -.2682536   -.1380566
provincedum10 |  -.1982053   .0346481    -5.72   0.000    -.2661289   -.1302817
provincedum11 |  -.2862874   .0289729    -9.88   0.000    -.3430855   -.2294893
provincedum12 |  -.2233845   .0361974    -6.17   0.000    -.2943453   -.1524237
provincedum13 |  -.2351483   .0333295    -7.06   0.000     -.300487   -.1698096
provincedum14 |  -.1672717   .0432821    -3.86   0.000    -.2521213   -.0824222
provincedum15 |  -.1028921   .0429678    -2.39   0.017    -.1871256   -.0186587
            t |   .0023111   .0002227    10.38   0.000     .0018746    .0027476
            d |   .0205751    .025309     0.81   0.416    -.0290402    .0701904
           td |  -.0012969   .0003568    -3.63   0.000    -.0019964   -.0005974
        _cons |    .578082   .0317363    18.22   0.000     .5158667    .6402973
-------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(19, 5646)   =  24.37
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0758
                                                        Adj R-squared = 0.0727
                                                        Root MSE      = 0.4678

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |    .013718   .0027621     4.97   0.000     .0083033    .0191327
    tenuresqr |  -.0001208    .000112    -1.08   0.281    -.0003403    .0000988
 provincedum2 |  -.2274795   .0336449    -6.76   0.000    -.2934364   -.1615227
 provincedum3 |  -.1308084   .0354238    -3.69   0.000    -.2002527   -.0613641
 provincedum4 |  -.1948472   .0344999    -5.65   0.000    -.2624802   -.1272142
 provincedum5 |  -.2144552   .0315389    -6.80   0.000    -.2762836   -.1526268
 provincedum6 |  -.2139102   .0341711    -6.26   0.000    -.2808987   -.1469216
 provincedum7 |  -.2209352   .0332977    -6.64   0.000    -.2862116   -.1556588
 provincedum8 |  -.2006769    .032161    -6.24   0.000    -.2637249   -.1376289
 provincedum9 |  -.1786172   .0328078    -5.44   0.000     -.242933   -.1143014
provincedum10 |  -.1773977   .0342315    -5.18   0.000    -.2445047   -.1102907
provincedum11 |  -.2538306   .0286246    -8.87   0.000    -.3099458   -.1977154
provincedum12 |  -.2112753   .0357622    -5.91   0.000     -.281383   -.1411677
provincedum13 |  -.2254267   .0329288    -6.85   0.000    -.2899798   -.1608736
provincedum14 |  -.1685738   .0427617    -3.94   0.000    -.2524031   -.0847444
provincedum15 |  -.1094628   .0424512    -2.58   0.010    -.1926835   -.0262421
            t |   .0017823     .00022     8.10   0.000      .001351    .0022136
            d |   .0518417   .0250047     2.07   0.038     .0028229    .1008605
           td |  -.0008998   .0003525    -2.55   0.011    -.0015909   -.0002087
        _cons |   .4905639   .0313547    15.65   0.000     .4290966    .5520312
-------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(19, 5646)   =  14.98
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0480
                                                        Adj R-squared = 0.0448
                                                        Root MSE      = 0.4887

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0130613   .0028852     4.53   0.000     .0074052    .0187173
    tenuresqr |  -.0001794    .000117    -1.53   0.125    -.0004088    .0000499
 provincedum2 |  -.2104802   .0351444    -5.99   0.000    -.2793767   -.1415836
 provincedum3 |  -.1035947   .0370027    -2.80   0.005    -.1761341   -.0310552
 provincedum4 |  -.1928233   .0360375    -5.35   0.000    -.2634706   -.1221759
 provincedum5 |  -.1752496   .0329446    -5.32   0.000    -.2398337   -.1106655
 provincedum6 |  -.1830692   .0356941    -5.13   0.000    -.2530434    -.113095
 provincedum7 |  -.2122254   .0347818    -6.10   0.000    -.2804111   -.1440396
 provincedum8 |  -.1510879   .0335944    -4.50   0.000    -.2169459   -.0852299
 provincedum9 |  -.1412766     .03427    -4.12   0.000    -.2084589   -.0740943
provincedum10 |  -.1285986   .0357572    -3.60   0.000    -.1986965   -.0585007
provincedum11 |  -.1744407   .0299004    -5.83   0.000    -.2330569   -.1158245
provincedum12 |  -.1786435   .0373561    -4.78   0.000    -.2518758   -.1054112
provincedum13 |   -.169479   .0343964    -4.93   0.000    -.2369092   -.1020488
provincedum14 |  -.2011254   .0446676    -4.50   0.000     -.288691   -.1135597
provincedum15 |    -.11529   .0443432    -2.60   0.009    -.2022198   -.0283603
            t |   .0011691   .0002298     5.09   0.000     .0007186    .0016196
            d |    .061458   .0261191     2.35   0.019     .0102545    .1126615
           td |  -.0003747   .0003682    -1.02   0.309    -.0010966    .0003472
        _cons |   .5689216   .0327522    17.37   0.000     .5047147    .6331284
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(19)   =       4.69
                                                  Prob > chi2     =     0.9996
                                                  R-squared       =          .
                                                  Root MSE        =     6.2571

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |  -12.96602   23.41418    -0.55   0.580    -58.85697    32.92494
secgenhighedu |   29.31899   50.22335     0.58   0.559    -69.11697     127.755
    secgenedu |  -18.54846   31.21627    -0.59   0.552    -79.73123     42.6343
       tenure |   .0221768   .0441397     0.50   0.615    -.0643354     .108689
    tenuresqr |   .0006247   .0033972     0.18   0.854    -.0060337    .0072832
 provincedum2 |  -.4895538   .5600444    -0.87   0.382    -1.587221    .6081131
 provincedum3 |    .083362   .6661537     0.13   0.900    -1.222275    1.388999
 provincedum4 |  -.7236906   .7711546    -0.94   0.348    -2.235126    .7877447
 provincedum5 |   .0950354   .5133698     0.19   0.853    -.9111509    1.101222
 provincedum6 |  -.4975036   .7480674    -0.67   0.506    -1.963689    .9686817
 provincedum7 |  -.9192326   1.231367    -0.75   0.455    -3.332668    1.494203
 provincedum8 |  -.2925236   .5293934    -0.55   0.581    -1.330116    .7450683
 provincedum9 |  -.1484559   .4689173    -0.32   0.752    -1.067517    .7706051
provincedum10 |   .0438386   .6169617     0.07   0.943    -1.165384    1.253061
provincedum11 |   .3858506   .8925885     0.43   0.666    -1.363591    2.135292
provincedum12 |  -.2755534   .5150199    -0.54   0.593    -1.284974    .7338672
provincedum13 |   .2140154   .8296703     0.26   0.796    -1.412109    1.840139
provincedum14 |  -1.329481   1.747507    -0.76   0.447    -4.754532    2.095569
provincedum15 |  -.6426268    .736402    -0.87   0.383    -2.085948    .8006946
        _cons |   12.26595    6.35774     1.93   0.054    -.1949893     24.7269
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  36.9949  (p = 0.0000)
  Wu-Hausman F(3,5643)            =  12.3623  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.959  Chi-sq(19) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Male Prov
> ince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_
> p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu secgenedu = t d
>  td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 0 &
>  educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(5, 4942)    = 154.21
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1350
                                                        Adj R-squared = 0.1341
                                                        Root MSE      = 0.4637

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0293539   .0029317    10.01   0.000     .0236065    .0351013
   tenuresqr |  -.0003531   .0001238    -2.85   0.004    -.0005958   -.0001104
           t |   .0020526   .0002311     8.88   0.000     .0015995    .0025057
           d |    .082949   .0263269     3.15   0.002     .0313365    .1345615
          td |  -.0003792   .0003716    -1.02   0.307    -.0011076    .0003492
       _cons |   .2635807   .0218991    12.04   0.000     .2206488    .3065126
------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(5, 4942)    = 126.18
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1132
                                                        Adj R-squared = 0.1123
                                                        Root MSE      = 0.4596

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0280403    .002906     9.65   0.000     .0223432    .0337374
   tenuresqr |   -.000554   .0001227    -4.51   0.000    -.0007946   -.0003134
           t |   .0014834   .0002291     6.48   0.000     .0010343    .0019325
           d |   .1085802   .0260966     4.16   0.000     .0574193     .159741
          td |   .0002107   .0003683     0.57   0.567    -.0005113    .0009328
       _cons |   .1931186   .0217074     8.90   0.000     .1505623    .2356748
------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(5, 4942)    =  77.28
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0725
                                                        Adj R-squared = 0.0716
                                                        Root MSE      = 0.4818

------------------------------------------------------------------------------
   secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |    .028541   .0030462     9.37   0.000     .0225691     .034513
   tenuresqr |  -.0007382   .0001286    -5.74   0.000    -.0009904    -.000486
           t |   .0006711   .0002401     2.79   0.005     .0002003    .0011418
           d |   .1205033   .0273556     4.41   0.000     .0668742    .1741324
          td |   .0007549   .0003861     1.96   0.051    -2.01e-06    .0015117
       _cons |   .2905835   .0227547    12.77   0.000     .2459742    .3351929
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(5)    =       1.36
                                                  Prob > chi2     =     0.9285
                                                  R-squared       =          .
                                                  Root MSE        =     12.247

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   35.99113   249.2327     0.14   0.885     -452.496    524.4783
secgenhighedu |  -63.27881   455.1434    -0.14   0.889    -955.3434    828.7858
    secgenedu |   33.08456   243.2968     0.14   0.892    -443.7685    509.9376
       tenure |  -.1805403   1.505957    -0.12   0.905    -3.132161    2.771081
    tenuresqr |   .0012653   .0163069     0.08   0.938    -.0306957    .0332262
        _cons |   1.091591   48.51375     0.02   0.982    -93.99362     96.1768
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =  66.2969  (p = 0.0000)
  Wu-Hausman F(3,4939)            =  22.3583  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.082  Chi-sq(5) P-value = 0.9999

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female) p
> value addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "En
> dogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedastic
> ity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu se
> cgenhighedu secgenedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning
> , 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(19, 4928)   =  49.15
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1593
                                                        Adj R-squared = 0.1561
                                                        Root MSE      = 0.4578

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0284122   .0029016     9.79   0.000     .0227239    .0341006
    tenuresqr |  -.0003278   .0001226    -2.67   0.008    -.0005682   -.0000875
 provincedum2 |   -.160026   .0356737    -4.49   0.000    -.2299623   -.0900896
 provincedum3 |  -.1126652   .0365795    -3.08   0.002    -.1843772   -.0409531
 provincedum4 |  -.1459469   .0351202    -4.16   0.000    -.2147981   -.0770957
 provincedum5 |  -.2446393   .0323142    -7.57   0.000    -.3079894   -.1812891
 provincedum6 |  -.2631425   .0362301    -7.26   0.000    -.3341696   -.1921155
 provincedum7 |  -.2344942   .0331841    -7.07   0.000    -.2995498   -.1694386
 provincedum8 |  -.2401244   .0331364    -7.25   0.000    -.3050866   -.1751622
 provincedum9 |  -.2637412   .0345003    -7.64   0.000    -.3313773   -.1961052
provincedum10 |   -.265253   .0344829    -7.69   0.000    -.3328549   -.1976511
provincedum11 |  -.2781059   .0292394    -9.51   0.000    -.3354281   -.2207837
provincedum12 |  -.2529601   .0358351    -7.06   0.000    -.3232127   -.1827074
provincedum13 |  -.2575887   .0329874    -7.81   0.000    -.3222586   -.1929188
provincedum14 |  -.1947156    .041798    -4.66   0.000    -.2766583   -.1127729
provincedum15 |  -.1887665   .0428034    -4.41   0.000    -.2726803   -.1048526
            t |   .0020895   .0002287     9.14   0.000     .0016411    .0025379
            d |   .0720986    .026048     2.77   0.006     .0210328    .1231644
           td |  -.0003036   .0003674    -0.83   0.409    -.0010239    .0004167
        _cons |   .4834238   .0314237    15.38   0.000     .4218194    .5450281
-------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(19, 4928)   =  39.79
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1330
                                                        Adj R-squared = 0.1297
                                                        Root MSE      = 0.4551

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0272266   .0028848     9.44   0.000     .0215712    .0328821
    tenuresqr |  -.0005312   .0001219    -4.36   0.000    -.0007702   -.0002923
 provincedum2 |  -.1585195   .0354674    -4.47   0.000    -.2280513   -.0889876
 provincedum3 |   -.082388   .0363679    -2.27   0.024    -.1536853   -.0110907
 provincedum4 |   -.131263   .0349171    -3.76   0.000     -.199716     -.06281
 provincedum5 |  -.2228643   .0321273    -6.94   0.000     -.285848   -.1598805
 provincedum6 |  -.2242644   .0360205    -6.23   0.000    -.2948806   -.1536481
 provincedum7 |  -.2219169   .0329922    -6.73   0.000    -.2865962   -.1572376
 provincedum8 |  -.2155448   .0329448    -6.54   0.000    -.2801313   -.1509583
 provincedum9 |  -.2119685   .0343008    -6.18   0.000    -.2792134   -.1447237
provincedum10 |  -.2433884   .0342835    -7.10   0.000    -.3105993   -.1761775
provincedum11 |  -.2307435   .0290703    -7.94   0.000    -.2877342   -.1737529
provincedum12 |  -.2380362   .0356278    -6.68   0.000    -.3078826   -.1681899
provincedum13 |  -.2245779   .0327966    -6.85   0.000    -.2888738    -.160282
provincedum14 |   -.215351   .0415562    -5.18   0.000    -.2968198   -.1338823
provincedum15 |  -.1690229   .0425559    -3.97   0.000    -.2524514   -.0855944
            t |   .0015178   .0002274     6.67   0.000      .001072    .0019636
            d |    .097781   .0258974     3.78   0.000     .0470106    .1485514
           td |   .0002688   .0003653     0.74   0.462    -.0004473    .0009849
        _cons |   .3891403   .0312419    12.46   0.000     .3278923    .4503884
-------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(19, 4928)   =  26.20
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0918
                                                        Adj R-squared = 0.0883
                                                        Root MSE      = 0.4775

-------------------------------------------------------------------------------
    secgenedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |    .027741   .0030264     9.17   0.000     .0218079     .033674
    tenuresqr |  -.0007163   .0001279    -5.60   0.000     -.000967   -.0004656
 provincedum2 |  -.1389848   .0372083    -3.74   0.000    -.2119295     -.06604
 provincedum3 |  -.0481868    .038153    -1.26   0.207    -.1229837      .02661
 provincedum4 |  -.1530663   .0366309    -4.18   0.000    -.2248793   -.0812534
 provincedum5 |   -.231951   .0337042    -6.88   0.000    -.2980263   -.1658758
 provincedum6 |  -.2345252   .0377885    -6.21   0.000    -.3086075   -.1604428
 provincedum7 |  -.2317662   .0346116    -6.70   0.000    -.2996203   -.1639121
 provincedum8 |  -.1760177   .0345619    -5.09   0.000    -.2437744   -.1082611
 provincedum9 |  -.1618892   .0359844    -4.50   0.000    -.2324347   -.0913437
provincedum10 |   -.240219   .0359663    -6.68   0.000    -.3107289   -.1697091
provincedum11 |  -.1947063   .0304971    -6.38   0.000    -.2544943   -.1349184
provincedum12 |  -.1813653   .0373765    -4.85   0.000      -.25464   -.1080907
provincedum13 |  -.2284379   .0344063    -6.64   0.000    -.2958896   -.1609861
provincedum14 |  -.2310008    .043596    -5.30   0.000    -.3164684   -.1455333
provincedum15 |   -.131751   .0446447    -2.95   0.003    -.2192745   -.0442275
            t |   .0006933   .0002386     2.91   0.004     .0002256    .0011609
            d |   .1101202   .0271685     4.05   0.000     .0568578    .1633826
           td |   .0008103   .0003832     2.11   0.035     .0000591    .0015616
        _cons |   .4720829   .0327754    14.40   0.000     .4078285    .5363373
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(19)   =       0.22
                                                  Prob > chi2     =     1.0000
                                                  R-squared       =          .
                                                  Root MSE        =      38.69

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |    111.616   2398.901     0.05   0.963    -4590.143    4813.375
secgenhighedu |  -200.5774   4362.877    -0.05   0.963     -8751.66    8350.505
    secgenedu |   105.8572   2319.709     0.05   0.964    -4440.688    4652.402
       tenure |  -.6035609   13.75225    -0.04   0.965    -27.55747    26.35035
    tenuresqr |   .0051827   .1321503     0.04   0.969    -.2538271    .2641925
 provincedum2 |    .091839   15.00827     0.01   0.995    -29.32383    29.50751
 provincedum3 |   .7655542   22.85804     0.03   0.973    -44.03539     45.5665
 provincedum4 |    5.64388   132.5261     0.04   0.966    -254.1024    265.3902
 provincedum5 |   6.953318   152.6855     0.05   0.964    -292.3048    306.2114
 provincedum6 |   8.835366   196.9054     0.04   0.964    -377.0922    394.7629
 provincedum7 |   5.773001   132.0161     0.04   0.965    -252.9738    264.5198
 provincedum8 |   1.634759    44.0954     0.04   0.970    -84.79063    88.06015
 provincedum9 |   3.754853   83.45876     0.04   0.964    -159.8213     167.331
provincedum10 |   5.891376   131.7827     0.04   0.964     -252.398    264.1808
provincedum11 |   5.149328   112.1433     0.05   0.963    -214.6475    224.9461
provincedum12 |  -.6840931   11.35746    -0.06   0.952    -22.94431    21.57612
provincedum13 |   7.585557   168.0804     0.05   0.964    -321.8459    337.0171
provincedum14 |   2.638866    63.4798     0.04   0.967    -121.7792     127.057
provincedum15 |   .6533034   21.37262     0.03   0.976    -41.23627    42.54287
        _cons |  -17.55174   557.1728    -0.03   0.975     -1109.59    1074.487
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu secgenedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(3)          =   60.263  (p = 0.0000)
  Wu-Hausman F(3,4925)            =  20.2408  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   0.013  Chi-sq(19) P-value = 1.0000

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu secgenedu & their product, Female Pr
> ovince) pvalue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `w
> u_p', "Endogeneity df", `endog_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Hetero
> skedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. *2)
. ivregress 2sls log_monthlyearning tenure tenuresqr male (higheredu secgenhighedu = t d td )
>  if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & educat != ., fir
> st

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(6, 10607)   = 192.17
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0980
                                                        Adj R-squared = 0.0975
                                                        Root MSE      = 0.4722

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0212003   .0020308    10.44   0.000     .0172196    .0251811
   tenuresqr |  -.0001527   .0000839    -1.82   0.069    -.0003172    .0000118
        male |  -.0344135   .0092182    -3.73   0.000    -.0524829   -.0163441
           t |   .0022118   .0001611    13.73   0.000     .0018959    .0025277
           d |    .053852   .0183606     2.93   0.003     .0178618    .0898422
          td |  -.0009207   .0002587    -3.56   0.000    -.0014279   -.0004135
       _cons |   .3337515   .0161654    20.65   0.000     .3020643    .3654387
------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(6, 10607)   = 157.79
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0819
                                                        Adj R-squared = 0.0814
                                                        Root MSE      = 0.4665

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0212684   .0020062    10.60   0.000     .0173359     .025201
   tenuresqr |  -.0003476   .0000829    -4.19   0.000    -.0005101   -.0001851
        male |  -.0174293   .0091066    -1.91   0.056    -.0352799    .0004213
           t |   .0016571   .0001592    10.41   0.000      .001345    .0019691
           d |   .0821788   .0181382     4.53   0.000     .0466244    .1177332
          td |    -.00042   .0002556    -1.64   0.100     -.000921    .0000811
       _cons |   .2536921   .0159696    15.89   0.000     .2223886    .2849956
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(5)    =     913.59
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0513
                                                  Root MSE        =     .67965

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |    1.12839    .509343     2.22   0.027      .130096    2.126684
secgenhighedu |  -.6807668   .5516358    -1.23   0.217    -1.761953    .4004196
       tenure |   .0317867   .0030265    10.50   0.000     .0258548    .0377185
    tenuresqr |  -.0010547   .0001493    -7.06   0.000    -.0013473   -.0007621
         male |   .2971308   .0155879    19.06   0.000     .2665791    .3276824
        _cons |   7.825711   .0246605   317.34   0.000     7.777377    7.874045
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  16.9668  (p = 0.0002)
  Wu-Hausman F(2,10606)           =  8.49058  (p = 0.0002)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  28.2001  (p = 0.0000)
  Basmann chi2(1)        =  28.2565  (p = 0.0000)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  14.367  Chi-sq(6) P-value = 0.0258

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr male provincedum2-provincedum15 (highere
> du secgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250
> , 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(20, 10593)  =  71.59
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1191
                                                        Adj R-squared = 0.1174
                                                        Root MSE      = 0.4670

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0201073   .0020128     9.99   0.000     .0161619    .0240528
    tenuresqr |  -.0001205   .0000832    -1.45   0.147    -.0002836    .0000425
         male |  -.0318214   .0091245    -3.49   0.000    -.0497071   -.0139357
 provincedum2 |  -.1912259    .024646    -7.76   0.000    -.2395368   -.1429151
 provincedum3 |   -.121515   .0256535    -4.74   0.000    -.1718008   -.0712293
 provincedum4 |  -.1690162   .0248236    -6.81   0.000    -.2176751   -.1203573
 provincedum5 |  -.2341725   .0227567   -10.29   0.000      -.27878    -.189565
 provincedum6 |  -.2557496   .0250296   -10.22   0.000    -.3048123    -.206687
 provincedum7 |  -.2408465   .0237172   -10.15   0.000    -.2873367   -.1943563
 provincedum8 |  -.2323821   .0232641    -9.99   0.000    -.2779841   -.1867801
 provincedum9 |  -.2285348   .0239432    -9.54   0.000     -.275468   -.1816016
provincedum10 |  -.2313964   .0245042    -9.44   0.000    -.2794293   -.1833634
provincedum11 |  -.2829526   .0206205   -13.72   0.000    -.3233726   -.2425326
provincedum12 |  -.2400817   .0255321    -9.40   0.000    -.2901293   -.1900341
provincedum13 |    -.24601   .0235102   -10.46   0.000    -.2920944   -.1999257
provincedum14 |  -.1828401   .0301642    -6.06   0.000    -.2419675   -.1237126
provincedum15 |  -.1458324   .0304059    -4.80   0.000    -.2054336   -.0862311
            t |   .0021947   .0001598    13.73   0.000     .0018814    .0025079
            d |   .0462249    .018182     2.54   0.011     .0105848    .0818649
           td |  -.0007984   .0002565    -3.11   0.002    -.0013011   -.0002957
        _cons |   .5457141    .022691    24.05   0.000     .5012355    .5901928
-------------------------------------------------------------------------------

                                                        Number of obs = 10,614
                                                        F(20, 10593)  =  57.99
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0987
                                                        Adj R-squared = 0.0970
                                                        Root MSE      = 0.4626

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0203708   .0019936    10.22   0.000     .0164629    .0242786
    tenuresqr |  -.0003202   .0000824    -3.89   0.000    -.0004817   -.0001587
         male |   -.015474   .0090374    -1.71   0.087    -.0331891     .002241
 provincedum2 |  -.1983943   .0244108    -8.13   0.000    -.2462441   -.1505445
 provincedum3 |  -.1093698   .0254087    -4.30   0.000    -.1591756   -.0595639
 provincedum4 |  -.1649062   .0245867    -6.71   0.000    -.2131007   -.1167117
 provincedum5 |  -.2188641   .0225396    -9.71   0.000    -.2630459   -.1746824
 provincedum6 |  -.2199592   .0247907    -8.87   0.000    -.2685536   -.1713647
 provincedum7 |  -.2217068   .0234909    -9.44   0.000    -.2677533   -.1756603
 provincedum8 |  -.2082598   .0230421    -9.04   0.000    -.2534265    -.163093
 provincedum9 |  -.1919746   .0237147    -8.10   0.000    -.2384599   -.1454893
provincedum10 |  -.2098194   .0242704    -8.65   0.000    -.2573939   -.1622449
provincedum11 |  -.2430198   .0204237   -11.90   0.000     -.283054   -.2029855
provincedum12 |  -.2259412   .0252884    -8.93   0.000    -.2755112   -.1763712
provincedum13 |  -.2248157   .0232858    -9.65   0.000    -.2704602   -.1791711
provincedum14 |  -.1938018   .0298763    -6.49   0.000     -.252365   -.1352387
provincedum15 |  -.1398873   .0301157    -4.64   0.000    -.1989198   -.0808548
            t |   .0016433   .0001583    10.38   0.000      .001333    .0019535
            d |   .0751559   .0180084     4.17   0.000      .039856    .1104559
           td |   -.000322    .000254    -1.27   0.205    -.0008199    .0001759
        _cons |   .4469199   .0224744    19.89   0.000     .4028657     .490974
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(19)   =    1532.77
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1014
                                                  Root MSE        =     .66149

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   1.125648   .5036751     2.23   0.025     .1384629    2.112833
secgenhighedu |  -.7196765   .5465908    -1.32   0.188    -1.790975    .3516217
       tenure |   .0315126   .0029537    10.67   0.000     .0257234    .0373018
    tenuresqr |  -.0009962   .0001475    -6.75   0.000    -.0012852   -.0007071
         male |   .2971443   .0151071    19.67   0.000      .267535    .3267536
 provincedum2 |  -.5157453   .0383325   -13.45   0.000    -.5908757   -.4406149
 provincedum3 |  -.2262588   .0368099    -6.15   0.000    -.2984049   -.1541127
 provincedum4 |  -.3937015   .0367613   -10.71   0.000    -.4657524   -.3216506
 provincedum5 |  -.0280606   .0338905    -0.83   0.408    -.0944847    .0383636
 provincedum6 |  -.1530131   .0384126    -3.98   0.000    -.2283004   -.0777258
 provincedum7 |  -.2390399   .0357398    -6.69   0.000    -.3090886   -.1689912
 provincedum8 |  -.4139177   .0347881   -11.90   0.000    -.4821011   -.3457343
 provincedum9 |   -.091352   .0368674    -2.48   0.013    -.1636107   -.0190932
provincedum10 |  -.1576639   .0364647    -4.32   0.000    -.2291334   -.0861943
provincedum11 |  -.0240771   .0331077    -0.73   0.467     -.088967    .0408129
provincedum12 |  -.2150942   .0382546    -5.62   0.000    -.2900718   -.1401166
provincedum13 |   -.138963   .0355941    -3.90   0.000    -.2087261   -.0691999
provincedum14 |  -.2960895   .0460334    -6.43   0.000    -.3863133   -.2058658
provincedum15 |  -.3617041   .0436308    -8.29   0.000    -.4472189   -.2761892
        _cons |   8.027364    .039483   203.31   0.000     7.949979    8.104749
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  12.3786  (p = 0.0021)
  Wu-Hausman F(2,10592)           =   6.1837  (p = 0.0021)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  33.7225  (p = 0.0000)
  Basmann chi2(1)        =  33.7631  (p = 0.0000)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  42.412  Chi-sq(20) P-value = 0.0024

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Pooled Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu = t d td ) if i
> nrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 1 & educat !=
>  ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(5, 5660)    =  86.31
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0708
                                                        Adj R-squared = 0.0700
                                                        Root MSE      = 0.4782

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |    .013146    .002814     4.67   0.000     .0076294    .0186627
   tenuresqr |   .0000511   .0001142     0.45   0.654    -.0001727     .000275
           t |    .002349   .0002239    10.49   0.000     .0019101     .002788
           d |   .0261675    .025515     1.03   0.305    -.0238517    .0761868
          td |  -.0014235   .0003591    -3.96   0.000    -.0021275   -.0007195
       _cons |   .3701236    .022219    16.66   0.000     .3265659    .4136813
------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(5, 5660)    =  71.14
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0591
                                                        Adj R-squared = 0.0583
                                                        Root MSE      = 0.4714

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0147573   .0027744     5.32   0.000     .0093184    .0201962
   tenuresqr |  -.0001546   .0001126    -1.37   0.170    -.0003753    .0000661
           t |   .0018124   .0002207     8.21   0.000     .0013797    .0022452
           d |   .0568237   .0251556     2.26   0.024     .0075092    .1061382
          td |  -.0009994   .0003541    -2.82   0.005    -.0016935   -.0003054
       _cons |   .2965898   .0219059    13.54   0.000     .2536458    .3395338
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(4)    =     102.52
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0361
                                                  Root MSE        =     .66979

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .3827786   .7793494     0.49   0.623    -1.144718    1.910275
secgenhighedu |   -.260854   .8611289    -0.30   0.762    -1.948636    1.426928
       tenure |   .0328673   .0043285     7.59   0.000     .0243835     .041351
    tenuresqr |  -.0010871   .0002128    -5.11   0.000    -.0015042   -.0006701
        _cons |   8.282171   .0324355   255.34   0.000     8.218598    8.345743
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  2.82493  (p = 0.2435)
  Wu-Hausman F(2,5659)            =  1.41142  (p = 0.2439)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  27.8319  (p = 0.0000)
  Basmann chi2(1)        =  27.9397  (p = 0.0000)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   5.320  Chi-sq(5) P-value = 0.3781

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male) pvalue addstat(
> "Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df",
>  `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "
> Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heter
> oskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu se
> cgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 250
> 00) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(19, 5646)   =  29.79
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0911
                                                        Adj R-squared = 0.0880
                                                        Root MSE      = 0.4735

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0118438   .0027957     4.24   0.000     .0063632    .0173244
    tenuresqr |   .0000928   .0001134     0.82   0.413    -.0001294    .0003151
 provincedum2 |  -.2126328   .0340543    -6.24   0.000    -.2793923   -.1458732
 provincedum3 |  -.1265306   .0358549    -3.53   0.000      -.19682   -.0562411
 provincedum4 |  -.1892077   .0349197    -5.42   0.000    -.2576637   -.1207517
 provincedum5 |  -.2227622   .0319227    -6.98   0.000     -.285343   -.1601814
 provincedum6 |  -.2460616    .034587    -7.11   0.000    -.3138654   -.1782579
 provincedum7 |  -.2458958    .033703    -7.30   0.000    -.3119665    -.179825
 provincedum8 |  -.2236861   .0325524    -6.87   0.000    -.2875013   -.1598709
 provincedum9 |  -.2031551    .033207    -6.12   0.000    -.2682536   -.1380566
provincedum10 |  -.1982053   .0346481    -5.72   0.000    -.2661289   -.1302817
provincedum11 |  -.2862874   .0289729    -9.88   0.000    -.3430855   -.2294893
provincedum12 |  -.2233845   .0361974    -6.17   0.000    -.2943453   -.1524237
provincedum13 |  -.2351483   .0333295    -7.06   0.000     -.300487   -.1698096
provincedum14 |  -.1672717   .0432821    -3.86   0.000    -.2521213   -.0824222
provincedum15 |  -.1028921   .0429678    -2.39   0.017    -.1871256   -.0186587
            t |   .0023111   .0002227    10.38   0.000     .0018746    .0027476
            d |   .0205751    .025309     0.81   0.416    -.0290402    .0701904
           td |  -.0012969   .0003568    -3.63   0.000    -.0019964   -.0005974
        _cons |    .578082   .0317363    18.22   0.000     .5158667    .6402973
-------------------------------------------------------------------------------

                                                        Number of obs =  5,666
                                                        F(19, 5646)   =  24.37
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0758
                                                        Adj R-squared = 0.0727
                                                        Root MSE      = 0.4678

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |    .013718   .0027621     4.97   0.000     .0083033    .0191327
    tenuresqr |  -.0001208    .000112    -1.08   0.281    -.0003403    .0000988
 provincedum2 |  -.2274795   .0336449    -6.76   0.000    -.2934364   -.1615227
 provincedum3 |  -.1308084   .0354238    -3.69   0.000    -.2002527   -.0613641
 provincedum4 |  -.1948472   .0344999    -5.65   0.000    -.2624802   -.1272142
 provincedum5 |  -.2144552   .0315389    -6.80   0.000    -.2762836   -.1526268
 provincedum6 |  -.2139102   .0341711    -6.26   0.000    -.2808987   -.1469216
 provincedum7 |  -.2209352   .0332977    -6.64   0.000    -.2862116   -.1556588
 provincedum8 |  -.2006769    .032161    -6.24   0.000    -.2637249   -.1376289
 provincedum9 |  -.1786172   .0328078    -5.44   0.000     -.242933   -.1143014
provincedum10 |  -.1773977   .0342315    -5.18   0.000    -.2445047   -.1102907
provincedum11 |  -.2538306   .0286246    -8.87   0.000    -.3099458   -.1977154
provincedum12 |  -.2112753   .0357622    -5.91   0.000     -.281383   -.1411677
provincedum13 |  -.2254267   .0329288    -6.85   0.000    -.2899798   -.1608736
provincedum14 |  -.1685738   .0427617    -3.94   0.000    -.2524031   -.0847444
provincedum15 |  -.1094628   .0424512    -2.58   0.010    -.1926835   -.0262421
            t |   .0017823     .00022     8.10   0.000      .001351    .0022136
            d |   .0518417   .0250047     2.07   0.038     .0028229    .1008605
           td |  -.0008998   .0003525    -2.55   0.011    -.0015909   -.0002087
        _cons |   .4905639   .0313547    15.65   0.000     .4290966    .5520312
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(18)   =     398.99
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0860
                                                  Root MSE        =     .65224

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .2332866   .7714427     0.30   0.762    -1.278713    1.745286
secgenhighedu |  -.1246654   .8528902    -0.15   0.884    -1.796299    1.546969
       tenure |   .0316941   .0042875     7.39   0.000     .0232907    .0400975
    tenuresqr |  -.0009928   .0002119    -4.69   0.000     -.001408   -.0005775
 provincedum2 |  -.4776366   .0583421    -8.19   0.000     -.591985   -.3632881
 provincedum3 |   -.178831   .0520214    -3.44   0.001    -.2807911   -.0768708
 provincedum4 |  -.3885095   .0548109    -7.09   0.000    -.4959369   -.2810821
 provincedum5 |  -.0383695   .0481252    -0.80   0.425    -.1326932    .0559541
 provincedum6 |  -.1634428   .0514411    -3.18   0.001    -.2642654   -.0626201
 provincedum7 |  -.2455401   .0500761    -4.90   0.000    -.3436874   -.1473927
 provincedum8 |  -.4519526   .0475716    -9.50   0.000    -.5451912   -.3587141
 provincedum9 |  -.1093913   .0483976    -2.26   0.024    -.2042488   -.0145338
provincedum10 |  -.1862134   .0500729    -3.72   0.000    -.2843545   -.0880724
provincedum11 |  -.0790247   .0447896    -1.76   0.078    -.1668106    .0087613
provincedum12 |  -.2421278    .053365    -4.54   0.000    -.3467212   -.1375344
provincedum13 |  -.1847936   .0508406    -3.63   0.000    -.2844393   -.0851479
provincedum14 |   -.354918   .0628646    -5.65   0.000    -.4781304   -.2317056
provincedum15 |  -.3781673   .0611564    -6.18   0.000    -.4980316   -.2583029
        _cons |    8.50126   .0549905   154.60   0.000      8.39348    8.609039
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  4.02894  (p = 0.1334)
  Wu-Hausman F(2,5645)            =  2.00843  (p = 0.1343)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  32.4921  (p = 0.0000)
  Basmann chi2(1)        =  32.5641  (p = 0.0000)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  28.847  Chi-sq(19) P-value = 0.0684

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Male Province) pvalue
>  addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogen
> eity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `bas
> man_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p
> ', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu secgenhighedu = t d td ) if i
> nrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 0 & educat !=
>  ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(5, 4942)    = 154.21
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1350
                                                        Adj R-squared = 0.1341
                                                        Root MSE      = 0.4637

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0293539   .0029317    10.01   0.000     .0236065    .0351013
   tenuresqr |  -.0003531   .0001238    -2.85   0.004    -.0005958   -.0001104
           t |   .0020526   .0002311     8.88   0.000     .0015995    .0025057
           d |    .082949   .0263269     3.15   0.002     .0313365    .1345615
          td |  -.0003792   .0003716    -1.02   0.307    -.0011076    .0003492
       _cons |   .2635807   .0218991    12.04   0.000     .2206488    .3065126
------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(5, 4942)    = 126.18
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1132
                                                        Adj R-squared = 0.1123
                                                        Root MSE      = 0.4596

------------------------------------------------------------------------------
secgenhigh~u | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0280403    .002906     9.65   0.000     .0223432    .0337374
   tenuresqr |   -.000554   .0001227    -4.51   0.000    -.0007946   -.0003134
           t |   .0014834   .0002291     6.48   0.000     .0010343    .0019325
           d |   .1085802   .0260966     4.16   0.000     .0574193     .159741
          td |   .0002107   .0003683     0.57   0.567    -.0005113    .0009328
       _cons |   .1931186   .0217074     8.90   0.000     .1505623    .2356748
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(4)    =     344.63
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .76441

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   2.138723   .7492709     2.85   0.004     .6701788    3.607267
secgenhighedu |  -1.410685   .7950707    -1.77   0.076    -2.968995     .147625
       tenure |   .0239402   .0051364     4.66   0.000     .0138731    .0340074
    tenuresqr |  -.0008878   .0002435    -3.65   0.000     -.001365   -.0004106
        _cons |   7.688313   .0328925   233.74   0.000     7.623845    7.752781
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  59.4546  (p = 0.0000)
  Wu-Hausman F(2,4941)            =  30.0463  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  4.74679  (p = 0.0294)
  Basmann chi2(1)        =  4.74558  (p = 0.0294)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  10.509  Chi-sq(5) P-value = 0.0620

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female) pvalue addsta
> t("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df
> ", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p',
>  "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Het
> eroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu se
> cgenhighedu = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 250
> 00) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(19, 4928)   =  49.15
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1593
                                                        Adj R-squared = 0.1561
                                                        Root MSE      = 0.4578

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0284122   .0029016     9.79   0.000     .0227239    .0341006
    tenuresqr |  -.0003278   .0001226    -2.67   0.008    -.0005682   -.0000875
 provincedum2 |   -.160026   .0356737    -4.49   0.000    -.2299623   -.0900896
 provincedum3 |  -.1126652   .0365795    -3.08   0.002    -.1843772   -.0409531
 provincedum4 |  -.1459469   .0351202    -4.16   0.000    -.2147981   -.0770957
 provincedum5 |  -.2446393   .0323142    -7.57   0.000    -.3079894   -.1812891
 provincedum6 |  -.2631425   .0362301    -7.26   0.000    -.3341696   -.1921155
 provincedum7 |  -.2344942   .0331841    -7.07   0.000    -.2995498   -.1694386
 provincedum8 |  -.2401244   .0331364    -7.25   0.000    -.3050866   -.1751622
 provincedum9 |  -.2637412   .0345003    -7.64   0.000    -.3313773   -.1961052
provincedum10 |   -.265253   .0344829    -7.69   0.000    -.3328549   -.1976511
provincedum11 |  -.2781059   .0292394    -9.51   0.000    -.3354281   -.2207837
provincedum12 |  -.2529601   .0358351    -7.06   0.000    -.3232127   -.1827074
provincedum13 |  -.2575887   .0329874    -7.81   0.000    -.3222586   -.1929188
provincedum14 |  -.1947156    .041798    -4.66   0.000    -.2766583   -.1127729
provincedum15 |  -.1887665   .0428034    -4.41   0.000    -.2726803   -.1048526
            t |   .0020895   .0002287     9.14   0.000     .0016411    .0025379
            d |   .0720986    .026048     2.77   0.006     .0210328    .1231644
           td |  -.0003036   .0003674    -0.83   0.409    -.0010239    .0004167
        _cons |   .4834238   .0314237    15.38   0.000     .4218194    .5450281
-------------------------------------------------------------------------------

                                                        Number of obs =  4,948
                                                        F(19, 4928)   =  39.79
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1330
                                                        Adj R-squared = 0.1297
                                                        Root MSE      = 0.4551

-------------------------------------------------------------------------------
secgenhighedu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0272266   .0028848     9.44   0.000     .0215712    .0328821
    tenuresqr |  -.0005312   .0001219    -4.36   0.000    -.0007702   -.0002923
 provincedum2 |  -.1585195   .0354674    -4.47   0.000    -.2280513   -.0889876
 provincedum3 |   -.082388   .0363679    -2.27   0.024    -.1536853   -.0110907
 provincedum4 |   -.131263   .0349171    -3.76   0.000     -.199716     -.06281
 provincedum5 |  -.2228643   .0321273    -6.94   0.000     -.285848   -.1598805
 provincedum6 |  -.2242644   .0360205    -6.23   0.000    -.2948806   -.1536481
 provincedum7 |  -.2219169   .0329922    -6.73   0.000    -.2865962   -.1572376
 provincedum8 |  -.2155448   .0329448    -6.54   0.000    -.2801313   -.1509583
 provincedum9 |  -.2119685   .0343008    -6.18   0.000    -.2792134   -.1447237
provincedum10 |  -.2433884   .0342835    -7.10   0.000    -.3105993   -.1761775
provincedum11 |  -.2307435   .0290703    -7.94   0.000    -.2877342   -.1737529
provincedum12 |  -.2380362   .0356278    -6.68   0.000    -.3078826   -.1681899
provincedum13 |  -.2245779   .0327966    -6.85   0.000    -.2888738    -.160282
provincedum14 |   -.215351   .0415562    -5.18   0.000    -.2968198   -.1338823
provincedum15 |  -.1690229   .0425559    -3.97   0.000    -.2524514   -.0855944
            t |   .0015178   .0002274     6.67   0.000      .001072    .0019636
            d |    .097781   .0258974     3.78   0.000     .0470106    .1485514
           td |   .0002688   .0003653     0.74   0.462    -.0004473    .0009849
        _cons |   .3891403   .0312419    12.46   0.000     .3278923    .4503884
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(18)   =     596.82
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .74665

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   2.159088   .7439286     2.90   0.004      .701015    3.617161
secgenhighedu |    -1.4914   .7931765    -1.88   0.060    -3.045997    .0631979
       tenure |   .0238961   .0049898     4.79   0.000     .0141162    .0336759
    tenuresqr |  -.0008208   .0002412    -3.40   0.001    -.0012936    -.000348
 provincedum2 |  -.5782857   .0598071    -9.67   0.000    -.6955055   -.4610659
 provincedum3 |  -.2668891   .0628949    -4.24   0.000    -.3901609   -.1436173
 provincedum4 |  -.4022027   .0586364    -6.86   0.000     -.517128   -.2872774
 provincedum5 |  -.0130997   .0548958    -0.24   0.811    -.1206934     .094494
 provincedum6 |  -.1489023   .0642005    -2.32   0.020     -.274733   -.0230716
 provincedum7 |  -.2498933   .0569707    -4.39   0.000    -.3615539   -.1382327
 provincedum8 |  -.3729812   .0568898    -6.56   0.000    -.4844831   -.2614792
 provincedum9 |  -.0506071   .0648011    -0.78   0.435    -.1776149    .0764007
provincedum10 |  -.1207527   .0590953    -2.04   0.041    -.2365775    -.004928
provincedum11 |   .0334971   .0557415     0.60   0.548    -.0757543    .1427484
provincedum12 |  -.1865268   .0613514    -3.04   0.002    -.3067733   -.0662803
provincedum13 |  -.0833532   .0583928    -1.43   0.153     -.197801    .0310947
provincedum14 |  -.2525427   .0748906    -3.37   0.001    -.3993255   -.1057599
provincedum15 |  -.3074897   .0709099    -4.34   0.000    -.4464704   -.1685089
        _cons |   7.873806   .0590898   133.25   0.000     7.757992     7.98962
-------------------------------------------------------------------------------
Endogenous: higheredu secgenhighedu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(2)          =  52.0236  (p = 0.0000)
  Wu-Hausman F(2,4927)            =  26.1766  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =  5.59159  (p = 0.0180)
  Basmann chi2(1)        =  5.57529  (p = 0.0182)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  22.639  Chi-sq(19) P-value = 0.2536

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu & the product, Female Province) pval
> ue addstat("Engod: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endog
> eneity df", `endog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `b
> asman_p', "Overidentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall
> _p', "Heteroskedasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. *3)
. ivregress 2sls log_monthlyearning tenure tenuresqr male (higheredu = t d td ) if inrange(bi
> rthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(6, 10607)   = 192.17
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0980
                                                        Adj R-squared = 0.0975
                                                        Root MSE      = 0.4722

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0212003   .0020308    10.44   0.000     .0172196    .0251811
   tenuresqr |  -.0001527   .0000839    -1.82   0.069    -.0003172    .0000118
        male |  -.0344135   .0092182    -3.73   0.000    -.0524829   -.0163441
           t |   .0022118   .0001611    13.73   0.000     .0018959    .0025277
           d |    .053852   .0183606     2.93   0.003     .0178618    .0898422
          td |  -.0009207   .0002587    -3.56   0.000    -.0014279   -.0004135
       _cons |   .3337515   .0161654    20.65   0.000     .3020643    .3654387
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(4)    =     975.08
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1126
                                                  Root MSE        =     .65732

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |   .5024504   .0450522    11.15   0.000     .4141496    .5907511
      tenure |    .031228   .0028942    10.79   0.000     .0255555    .0369005
   tenuresqr |  -.0009426   .0001146    -8.23   0.000    -.0011671    -.000718
        male |   .2872041   .0129135    22.24   0.000     .2618941    .3125141
       _cons |   7.839205   .0213778   366.70   0.000     7.797305    7.881104
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr male t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =   15.475  (p = 0.0001)
  Wu-Hausman F(1,10608)           =  15.4889  (p = 0.0001)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  31.7765  (p = 0.0000)
  Basmann chi2(2)        =  31.8509  (p = 0.0000)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  15.444  Chi-sq(6) P-value = 0.0171

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr male provincedum2-provincedum15 (highere
> du  = t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & ed
> ucat != ., first

First-stage regressions
-----------------------

                                                        Number of obs = 10,614
                                                        F(20, 10593)  =  71.59
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1191
                                                        Adj R-squared = 0.1174
                                                        Root MSE      = 0.4670

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0201073   .0020128     9.99   0.000     .0161619    .0240528
    tenuresqr |  -.0001205   .0000832    -1.45   0.147    -.0002836    .0000425
         male |  -.0318214   .0091245    -3.49   0.000    -.0497071   -.0139357
 provincedum2 |  -.1912259    .024646    -7.76   0.000    -.2395368   -.1429151
 provincedum3 |   -.121515   .0256535    -4.74   0.000    -.1718008   -.0712293
 provincedum4 |  -.1690162   .0248236    -6.81   0.000    -.2176751   -.1203573
 provincedum5 |  -.2341725   .0227567   -10.29   0.000      -.27878    -.189565
 provincedum6 |  -.2557496   .0250296   -10.22   0.000    -.3048123    -.206687
 provincedum7 |  -.2408465   .0237172   -10.15   0.000    -.2873367   -.1943563
 provincedum8 |  -.2323821   .0232641    -9.99   0.000    -.2779841   -.1867801
 provincedum9 |  -.2285348   .0239432    -9.54   0.000     -.275468   -.1816016
provincedum10 |  -.2313964   .0245042    -9.44   0.000    -.2794293   -.1833634
provincedum11 |  -.2829526   .0206205   -13.72   0.000    -.3233726   -.2425326
provincedum12 |  -.2400817   .0255321    -9.40   0.000    -.2901293   -.1900341
provincedum13 |    -.24601   .0235102   -10.46   0.000    -.2920944   -.1999257
provincedum14 |  -.1828401   .0301642    -6.06   0.000    -.2419675   -.1237126
provincedum15 |  -.1458324   .0304059    -4.80   0.000    -.2054336   -.0862311
            t |   .0021947   .0001598    13.73   0.000     .0018814    .0025079
            d |   .0462249    .018182     2.54   0.011     .0105848    .0818649
           td |  -.0007984   .0002565    -3.11   0.002    -.0013011   -.0002957
        _cons |   .5457141    .022691    24.05   0.000     .5012355    .5901928
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =     10,614
                                                  Wald chi2(18)   =    1646.63
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1644
                                                  Root MSE        =     .63785

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .4652271   .0441854    10.53   0.000     .3786254    .5518289
       tenure |   .0307924   .0027989    11.00   0.000     .0253066    .0362781
    tenuresqr |  -.0008749   .0001111    -7.88   0.000    -.0010926   -.0006572
         male |   .2870065   .0125332    22.90   0.000      .262442    .3115711
 provincedum2 |   -.498567   .0347558   -14.34   0.000    -.5666871   -.4304469
 provincedum3 |   -.228427   .0354589    -6.44   0.000    -.2979251   -.1589289
 provincedum4 |  -.3860787   .0350052   -11.03   0.000    -.4546876   -.3174697
 provincedum5 |  -.0246238   .0325823    -0.76   0.450    -.0884839    .0392362
 provincedum6 |  -.1643504   .0360972    -4.55   0.000    -.2350996   -.0936011
 provincedum7 |  -.2382534   .0344577    -6.91   0.000    -.3057893   -.1707175
 provincedum8 |   -.417665   .0334324   -12.49   0.000    -.4831913   -.3521388
 provincedum9 |  -.1035658   .0344061    -3.01   0.003    -.1710005   -.0361311
provincedum10 |  -.1587263    .035153    -4.52   0.000    -.2276248   -.0898278
provincedum11 |  -.0359568   .0307162    -1.17   0.242    -.0961594    .0242458
provincedum12 |   -.211564   .0367967    -5.75   0.000    -.2836842   -.1394437
provincedum13 |  -.1403044    .034308    -4.09   0.000    -.2075467    -.073062
provincedum14 |  -.2770738   .0421471    -6.57   0.000    -.3596806   -.1944671
provincedum15 |  -.3569348   .0419263    -8.51   0.000    -.4391088   -.2747607
        _cons |    8.04244   .0364357   220.73   0.000     7.971028    8.113853
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr male provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  10.5348  (p = 0.0012)
  Wu-Hausman F(1,10594)           =  10.5254  (p = 0.0012)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =   38.133  (p = 0.0000)
  Basmann chi2(2)        =  38.1948  (p = 0.0000)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  44.445  Chi-sq(20) P-value = 0.0013

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |     10,614    8.356754     .697834   5.521461   10.12663
      tenure |     10,614    7.979932    7.217115         -1         40
   tenuresqr |     10,614    115.7612    176.8938          0       1600
        male |     10,614    .5338233    .4988782          0          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Pooled Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu  = t d td ) if inrange(birthy
> ear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(5, 5660)    =  86.31
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0708
                                                        Adj R-squared = 0.0700
                                                        Root MSE      = 0.4782

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |    .013146    .002814     4.67   0.000     .0076294    .0186627
   tenuresqr |   .0000511   .0001142     0.45   0.654    -.0001727     .000275
           t |    .002349   .0002239    10.49   0.000     .0019101     .002788
           d |   .0261675    .025515     1.03   0.305    -.0238517    .0761868
          td |  -.0014235   .0003591    -3.96   0.000    -.0021275   -.0007195
       _cons |   .3701236    .022219    16.66   0.000     .3265659    .4136813
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(3)    =     103.40
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0452
                                                  Root MSE        =     .66663

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |   .1476757   .0705435     2.09   0.036     .0094129    .2859385
      tenure |   .0323056    .003893     8.30   0.000     .0246756    .0399357
   tenuresqr |  -.0010428   .0001539    -6.78   0.000    -.0013444   -.0007413
       _cons |   8.284237   .0315606   262.49   0.000      8.22238    8.346095
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  2.62305  (p = 0.1053)
  Wu-Hausman F(1,5661)            =  2.62195  (p = 0.1055)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  28.1884  (p = 0.0000)
  Basmann chi2(2)        =  28.2993  (p = 0.0000)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   5.254  Chi-sq(5) P-value = 0.3856

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male) pvalue addstat("Engod: Durbin
>  p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df', "
> Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifica
> tion df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticity 
> df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu  =
>  t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male ==
>  1 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  5,666
                                                        F(19, 5646)   =  29.79
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.0911
                                                        Adj R-squared = 0.0880
                                                        Root MSE      = 0.4735

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0118438   .0027957     4.24   0.000     .0063632    .0173244
    tenuresqr |   .0000928   .0001134     0.82   0.413    -.0001294    .0003151
 provincedum2 |  -.2126328   .0340543    -6.24   0.000    -.2793923   -.1458732
 provincedum3 |  -.1265306   .0358549    -3.53   0.000      -.19682   -.0562411
 provincedum4 |  -.1892077   .0349197    -5.42   0.000    -.2576637   -.1207517
 provincedum5 |  -.2227622   .0319227    -6.98   0.000     -.285343   -.1601814
 provincedum6 |  -.2460616    .034587    -7.11   0.000    -.3138654   -.1782579
 provincedum7 |  -.2458958    .033703    -7.30   0.000    -.3119665    -.179825
 provincedum8 |  -.2236861   .0325524    -6.87   0.000    -.2875013   -.1598709
 provincedum9 |  -.2031551    .033207    -6.12   0.000    -.2682536   -.1380566
provincedum10 |  -.1982053   .0346481    -5.72   0.000    -.2661289   -.1302817
provincedum11 |  -.2862874   .0289729    -9.88   0.000    -.3430855   -.2294893
provincedum12 |  -.2233845   .0361974    -6.17   0.000    -.2943453   -.1524237
provincedum13 |  -.2351483   .0333295    -7.06   0.000     -.300487   -.1698096
provincedum14 |  -.1672717   .0432821    -3.86   0.000    -.2521213   -.0824222
provincedum15 |  -.1028921   .0429678    -2.39   0.017    -.1871256   -.0186587
            t |   .0023111   .0002227    10.38   0.000     .0018746    .0027476
            d |   .0205751    .025309     0.81   0.416    -.0290402    .0701904
           td |  -.0012969   .0003568    -3.63   0.000    -.0019964   -.0005974
        _cons |    .578082   .0317363    18.22   0.000     .5158667    .6402973
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      5,666
                                                  Wald chi2(17)   =     399.86
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0880
                                                  Root MSE        =     .65151

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .1209938      .0701     1.73   0.084    -.0163998    .2583874
       tenure |    .031404   .0037964     8.27   0.000     .0239633    .0388447
    tenuresqr |   -.000971   .0001503    -6.46   0.000    -.0012656   -.0006763
 provincedum2 |  -.4730737   .0492333    -9.61   0.000    -.5695693   -.3765782
 provincedum3 |  -.1768686   .0502031    -3.52   0.000    -.2752648   -.0784724
 provincedum4 |  -.3853456   .0502996    -7.66   0.000    -.4839311   -.2867602
 provincedum5 |  -.0365652   .0464632    -0.79   0.431    -.1276313    .0545009
 provincedum6 |  -.1645363   .0508373    -3.24   0.001    -.2641756   -.0648971
 provincedum7 |  -.2455522   .0500201    -4.91   0.000    -.3435898   -.1475145
 provincedum8 |  -.4521301    .047503    -9.52   0.000    -.5452342   -.3590259
 provincedum9 |  -.1098221   .0482538    -2.28   0.023    -.2043978   -.0152464
provincedum10 |  -.1863073   .0500129    -3.73   0.000    -.2843307   -.0882839
provincedum11 |   -.079529   .0446066    -1.78   0.075    -.1669563    .0078983
provincedum12 |  -.2410602   .0528037    -4.57   0.000    -.3445535   -.1375668
provincedum13 |   -.183196   .0495963    -3.69   0.000    -.2804029    -.085989
provincedum14 |  -.3526902    .060921    -5.79   0.000    -.4720932   -.2332873
provincedum15 |  -.3761023   .0594359    -6.33   0.000    -.4925946   -.2596101
        _cons |   8.501468   .0549107   154.82   0.000     8.393845    8.609091
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  3.94404  (p = 0.0470)
  Wu-Hausman F(1,5647)            =  3.93355  (p = 0.0474)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  32.5861  (p = 0.0000)
  Basmann chi2(2)        =  32.6589  (p = 0.0000)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  29.605  Chi-sq(19) P-value = 0.0570

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      5,666    8.491452    .6822885   5.521461   10.12663
      tenure |      5,666     8.42958    7.283157         -1         40
   tenuresqr |      5,666    124.0928     181.494          0       1600
        male |      5,666           1           0          1          1

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Male Province) pvalue addstat("Engo
> d: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `end
> og_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overi
> dentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosked
> asticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr (higheredu  = t d td ) if inrange(birthy
> ear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(5, 4942)    = 154.21
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1350
                                                        Adj R-squared = 0.1341
                                                        Root MSE      = 0.4637

------------------------------------------------------------------------------
   higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0293539   .0029317    10.01   0.000     .0236065    .0351013
   tenuresqr |  -.0003531   .0001238    -2.85   0.004    -.0005958   -.0001104
           t |   .0020526   .0002311     8.88   0.000     .0015995    .0025057
           d |    .082949   .0263269     3.15   0.002     .0313365    .1345615
          td |  -.0003792   .0003716    -1.02   0.307    -.0011076    .0003492
       _cons |   .2635807   .0218991    12.04   0.000     .2206488    .3065126
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(3)    =     454.01
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.0588
                                                  Root MSE        =     .66294

------------------------------------------------------------------------------
log_monthl~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   higheredu |   .8147967   .0590309    13.80   0.000     .6990984    .9304951
      tenure |   .0248486   .0044324     5.61   0.000     .0161612     .033536
   tenuresqr |  -.0006498   .0001762    -3.69   0.000    -.0009951   -.0003044
       _cons |   7.712559   .0259481   297.23   0.000     7.661701    7.763416
------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  55.3661  (p = 0.0000)
  Wu-Hausman F(1,4943)            =   55.936  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  10.4965  (p = 0.0053)
  Basmann chi2(2)        =   10.506  (p = 0.0052)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :   9.570  Chi-sq(5) P-value = 0.0884

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female) pvalue addstat("Engod: Durb
> in p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `endog_df',
>  "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Overidentifi
> cation df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heteroskedasticit
> y df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. ivregress 2sls log_monthlyearning tenure tenuresqr provincedum2-provincedum15 (higheredu = 
> t d td ) if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 250, 25000) & male == 
> 0 & educat != ., first

First-stage regressions
-----------------------

                                                        Number of obs =  4,948
                                                        F(19, 4928)   =  49.15
                                                        Prob > F      = 0.0000
                                                        R-squared     = 0.1593
                                                        Adj R-squared = 0.1561
                                                        Root MSE      = 0.4578

-------------------------------------------------------------------------------
    higheredu | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
       tenure |   .0284122   .0029016     9.79   0.000     .0227239    .0341006
    tenuresqr |  -.0003278   .0001226    -2.67   0.008    -.0005682   -.0000875
 provincedum2 |   -.160026   .0356737    -4.49   0.000    -.2299623   -.0900896
 provincedum3 |  -.1126652   .0365795    -3.08   0.002    -.1843772   -.0409531
 provincedum4 |  -.1459469   .0351202    -4.16   0.000    -.2147981   -.0770957
 provincedum5 |  -.2446393   .0323142    -7.57   0.000    -.3079894   -.1812891
 provincedum6 |  -.2631425   .0362301    -7.26   0.000    -.3341696   -.1921155
 provincedum7 |  -.2344942   .0331841    -7.07   0.000    -.2995498   -.1694386
 provincedum8 |  -.2401244   .0331364    -7.25   0.000    -.3050866   -.1751622
 provincedum9 |  -.2637412   .0345003    -7.64   0.000    -.3313773   -.1961052
provincedum10 |   -.265253   .0344829    -7.69   0.000    -.3328549   -.1976511
provincedum11 |  -.2781059   .0292394    -9.51   0.000    -.3354281   -.2207837
provincedum12 |  -.2529601   .0358351    -7.06   0.000    -.3232127   -.1827074
provincedum13 |  -.2575887   .0329874    -7.81   0.000    -.3222586   -.1929188
provincedum14 |  -.1947156    .041798    -4.66   0.000    -.2766583   -.1127729
provincedum15 |  -.1887665   .0428034    -4.41   0.000    -.2726803   -.1048526
            t |   .0020895   .0002287     9.14   0.000     .0016411    .0025379
            d |   .0720986    .026048     2.77   0.006     .0210328    .1231644
           td |  -.0003036   .0003674    -0.83   0.409    -.0010239    .0004167
        _cons |   .4834238   .0314237    15.38   0.000     .4218194    .5450281
-------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =      4,948
                                                  Wald chi2(17)   =     817.03
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1331
                                                  Root MSE        =     .63625

-------------------------------------------------------------------------------
log_monthly~g | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
    higheredu |   .7659331   .0568908    13.46   0.000     .6544292    .8774369
       tenure |   .0245191   .0042426     5.78   0.000     .0162037    .0328345
    tenuresqr |  -.0005634   .0001693    -3.33   0.001    -.0008951   -.0002316
 provincedum2 |  -.5629433   .0504877   -11.15   0.000    -.6618974   -.4639892
 provincedum3 |  -.3017607   .0512125    -5.89   0.000    -.4021354   -.2013861
 provincedum4 |  -.4089318   .0498735    -8.20   0.000    -.5066821   -.3111816
 provincedum5 |  -.0198517   .0466789    -0.43   0.671    -.1113406    .0716372
 provincedum6 |  -.1819275   .0526209    -3.46   0.001    -.2850626   -.0787924
 provincedum7 |  -.2451196    .048499    -5.05   0.000    -.3401759   -.1500632
 provincedum8 |  -.3855877   .0481404    -8.01   0.000    -.4799412   -.2912342
 provincedum9 |  -.1006839   .0503407    -2.00   0.045    -.1993497    -.002018
provincedum10 |  -.1241107   .0503347    -2.47   0.014    -.2227649   -.0254565
provincedum11 |    -.00913   .0433938    -0.21   0.833    -.0941803    .0759203
provincedum12 |  -.1832659   .0522593    -3.51   0.000    -.2856922   -.0808395
provincedum13 |   -.108152   .0484732    -2.23   0.026    -.2031578   -.0131462
provincedum14 |  -.2009578   .0593813    -3.38   0.001    -.3173429   -.0845726
provincedum15 |  -.3156721   .0603115    -5.23   0.000    -.4338805   -.1974638
        _cons |   7.911916   .0472982   167.28   0.000     7.819213    8.004619
-------------------------------------------------------------------------------
Endogenous: higheredu
Exogenous:  tenure tenuresqr provincedum2 provincedum3 provincedum4
            provincedum5 provincedum6 provincedum7 provincedum8 provincedum9
            provincedum10 provincedum11 provincedum12 provincedum13
            provincedum14 provincedum15 t d td

. estat endog

  Tests of endogeneity
  H0: Variables are exogenous

  Durbin (score) chi2(1)          =  46.9937  (p = 0.0000)
  Wu-Hausman F(1,4929)            =  47.2621  (p = 0.0000)

. local durbin_p = r(p_durbin)

. local wu_p = r(p_wu)

. local endog_df = r(df)

. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(2) =  12.5691  (p = 0.0019)
  Basmann chi2(2)        =  12.5502  (p = 0.0019)

. local sargan_p = r(p_sargan) 

. local basman_p = r(p_basmann) 

. local overid_df = r(df)

. ivhettest
IV heteroskedasticity test(s) using levels of IVs only
Ho: Disturbance is homoskedastic
    Pagan-Hall general test statistic   :  26.481  Chi-sq(19) P-value = 0.1173

. local pagan_hall_p = r(php)

. local hetero_df = r(df)

. sum log_monthlyearning tenure tenuresqr male if e(sample)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
log_monthl~g |      4,948    8.202511    .6834201   5.521461   10.12663
      tenure |      4,948    7.465036    7.106612         -1         33
   tenuresqr |      4,948    106.2205    170.9948          0       1089
        male |      4,948           0           0          0          0

. outreg2 using "`xlspath'", append ctitle(IV: higheredu, Female Province) pvalue addstat("En
> god: Durbin p-value", `durbin_p', "Engod: Wu-Hausman p-value", `wu_p', "Endogeneity df", `e
> ndog_df', "Overid: Sargan p-value", `sargan_p', "Overid: Basmann p-value", `basman_p', "Ove
> ridentification df", `overid_df', "Heterosk: Pagan-Hall p-value", `pagan_hall_p', "Heterosk
> edasticity df", `hetero_df')
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Frame/Tenure/IV 
> Urban ATF Tenure 1982 1971-92.xls
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/Ivregress/1982/Adjusted Time Fra
> me/Tenure/IV Urban ATF Tenure 1982 1971-92.log
  log type:  text
 closed on:   6 Aug 2024, 17:44:41
---------------------------------------------------------------------------------------------
