---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No contr
> ol/Urban 1979 Highgen FuzzyOption No Control.log
  log type:  text
 opened on:   6 Aug 2024, 17:24:51

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,431 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(33,372 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(5,190 real changes made)

. 
. *Step Two: Regressions
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        931
-------------------+----------------------            BW type       =     Manual
     Number of obs |       491         440            Kernel        =    Uniform
Eff. Number of obs |       491         440            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07655     .04788   1.5988   0.110   -.017293      .170385
    Bias-corrected |  .02616     .04788   0.5463   0.585   -.067681      .119997
            Robust |  .02616     .07427   0.3522   0.725   -.119402      .171718
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.2026     1.4743   1.4940   0.135   -.687029      5.09223
    Bias-corrected |  3.0787     1.4743   2.0882   0.037    .189065      5.96832
            Robust |  3.0787      2.273   1.3545   0.176   -1.37621      7.53359
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2723
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1286        1437            Kernel        =    Uniform
Eff. Number of obs |      1286        1437            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02552     .02887   0.8839   0.377    -.03107       .08211
    Bias-corrected |  .04993     .02887   1.7293   0.084   -.006661      .106519
            Robust |  .04993     .04194   1.1905   0.234   -.032271       .13213
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.8721     4.2954   0.9014   0.367   -4.54674      12.2909
    Bias-corrected |   1.914     4.2954   0.4456   0.656   -6.50487      10.3328
            Robust |   1.914     6.1566   0.3109   0.756   -10.1527      13.9806
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs() 
> fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16190
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8396        7794            Kernel        = Epanechnikov
Eff. Number of obs |      2727        2904            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.616      70.616
       BW bias (b) |   131.227     131.227
         rho (h/b) |     0.538       0.538
        Unique obs |       370         261

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01983     .02192   0.9048   0.366   -.023125      .062782
    Bias-corrected |  .01003     .02192   0.4577   0.647   -.032923      .052983
            Robust |  .01003     .02488   0.4032   0.687   -.038731      .058791
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.3788     2.8584   0.8322   0.405   -3.22353      7.98106
    Bias-corrected |  3.3995     2.8584   1.1893   0.234   -2.20277      9.00182
            Robust |  3.3995     3.2412   1.0488   0.294   -2.95316      9.75221
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        625
-------------------+----------------------            BW type       =     Manual
     Number of obs |       319         306            Kernel        =    Uniform
Eff. Number of obs |       319         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09445     .06629   1.4249   0.154   -.035471      .224371
    Bias-corrected |  .08857     .06629   1.3361   0.182   -.041351       .21849
            Robust |  .08857     .09644   0.9184   0.358   -.100442      .277582
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .92921     1.1388   0.8160   0.415   -1.30272      3.16113
    Bias-corrected |  1.1266     1.1388   0.9893   0.322   -1.10531      3.35854
            Robust |  1.1266     1.7083   0.6595   0.510   -2.22156      4.47479
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1840
-------------------+----------------------            BW type       =     Manual
     Number of obs |       832        1008            Kernel        =    Uniform
Eff. Number of obs |       832        1008            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03156      .0406   0.7774   0.437   -.048012      .111136
    Bias-corrected |  .04357      .0406   1.0730   0.283   -.036009       .12314
            Robust |  .04357      .0586   0.7434   0.457   -.071288      .158419
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.3242     5.3592   0.8069   0.420    -6.1797      14.8281
    Bias-corrected |  .86867     5.3592   0.1621   0.871   -9.63524      11.3726
            Robust |  .86867     7.6673   0.1133   0.910    -14.159      15.8964
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10681
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4668        6013            Kernel        = Epanechnikov
Eff. Number of obs |      1564        1964            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    65.301      65.301
       BW bias (b) |   119.922     119.922
         rho (h/b) |     0.545       0.545
        Unique obs |       320         248

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02197      .0322   0.6822   0.495   -.041144      .085079
    Bias-corrected |  .00825      .0322   0.2563   0.798   -.054858      .071365
            Robust |  .00825      .0366   0.2255   0.822   -.063485      .079992
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.2046     4.6436   0.6901   0.490   -5.89664      12.3059
    Bias-corrected |   5.027     4.6436   1.0826   0.279   -4.07424      14.1283
            Robust |   5.027     5.2739   0.9532   0.340   -5.30965      15.3637
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        206
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106         100            Kernel        =    Uniform
Eff. Number of obs |       106         100            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01123      .0334   0.3363   0.737   -.054224      .076687
    Bias-corrected | -.01828      .0334   -0.5474  0.584   -.083737      .047173
            Robust | -.01828      .0252   -0.7254  0.468   -.067678      .031113
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.9003     23.307   -0.2103  0.833   -50.5812      40.7805
    Bias-corrected | -21.588     23.307   -0.9262  0.354   -67.2689      24.0928
            Robust | -21.588     28.889   -0.7473  0.455   -78.2094      35.0333
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        633
-------------------+----------------------            BW type       =     Manual
     Number of obs |       304         329            Kernel        =    Uniform
Eff. Number of obs |       304         329            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01942      .0241   0.8059   0.420   -.027816      .066665
    Bias-corrected |   .0205      .0241   0.8506   0.395   -.026737      .067743
            Robust |   .0205     .03723   0.5507   0.582   -.052473      .093479
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.4374     10.364   0.7176   0.473   -12.8767      27.7514
    Bias-corrected |  3.9251     10.364   0.3787   0.705   -16.3889      24.2392
            Robust |  3.9251     15.936   0.2463   0.805   -27.3086      35.1588
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs() f
> uzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2768
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1164        1604            Kernel        = Epanechnikov
Eff. Number of obs |       523         570            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    63.634      63.634
       BW bias (b) |   108.016     108.016
         rho (h/b) |     0.589       0.589
        Unique obs |       236         243

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00646     .01791   0.3610   0.718   -.028631      .041559
    Bias-corrected |  .00314     .01791   0.1755   0.861   -.031953      .038237
            Robust |  .00314     .02117   0.1484   0.882   -.038359      .044643
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  19.841     55.685   0.3563   0.722   -89.2998      128.982
    Bias-corrected |  33.138     55.685   0.5951   0.552   -76.0031      142.278
            Robust |  33.138     65.824   0.5034   0.615   -95.8742       162.15
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12716     .08806   1.4441   0.149   -.045426      .299746
    Bias-corrected |  .12463     .08806   1.4154   0.157   -.047952       .29722
            Robust |  .12463     .12953   0.9622   0.336   -.129244      .378511
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1599     1.0734   1.0806   0.280   -.943882      3.26359
    Bias-corrected |  1.4765     1.0734   1.3756   0.169   -.627205      3.58027
            Robust |  1.4765     1.5941   0.9262   0.354   -1.64784      4.60091
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1207
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         679            Kernel        =    Uniform
Eff. Number of obs |       528         679            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03237     .05491   0.5895   0.556   -.075251      .139983
    Bias-corrected |  .06952     .05491   1.2662   0.205   -.038094       .17714
            Robust |  .06952     .07853   0.8853   0.376   -.084396      .223441
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.9756     6.4762   0.6139   0.539   -8.71756      16.6687
    Bias-corrected | -1.9404     6.4762   -0.2996  0.764   -14.6336      10.7527
            Robust | -1.9404     9.1507   -0.2121  0.832   -19.8755      15.9946
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs() f
> uzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7913
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3504        4409            Kernel        = Epanechnikov
Eff. Number of obs |      1270        1730            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    79.316      79.316
       BW bias (b) |   134.023     134.023
         rho (h/b) |     0.592       0.592
        Unique obs |       315         237

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04721     .03962   1.1917   0.233   -.030438      .124857
    Bias-corrected |   .0322     .03962   0.8128   0.416   -.045447      .109848
            Robust |   .0322     .04607   0.6989   0.485   -.058104      .122505
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .91124     1.3049   0.6983   0.485   -1.64638      3.46885
    Bias-corrected |  .89934     1.3049   0.6892   0.491   -1.65828      3.45695
            Robust |  .89934     1.5156   0.5934   0.553   -2.07122       3.8699
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_code
> )

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        931
-------------------+----------------------            BW type       =     Manual
     Number of obs |       491         440            Kernel        =    Uniform
Eff. Number of obs |       491         440            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .07655     .06064   1.2623   0.207   -.042309      .195401
    Bias-corrected |  .02616     .06064   0.4314   0.666   -.092697      .145013
            Robust |  .02616     .08707   0.3004   0.764   -.144503      .196819
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.2026     1.6967   1.2982   0.194   -1.12279      5.52799
    Bias-corrected |  3.0787     1.6967   1.8146   0.070   -.246701      6.40409
            Robust |  3.0787      2.562   1.2017   0.229   -1.94281      8.10019
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_code
> )

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2723
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1286        1437            Kernel        =    Uniform
Eff. Number of obs |      1286        1437            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02552     .04515   0.5652   0.572   -.062972      .114012
    Bias-corrected |  .04993     .04515   1.1059   0.269   -.038563      .138422
            Robust |  .04993     .05002   0.9981   0.318   -.048112      .147971
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.8721      6.478   0.5977   0.550   -8.82466      16.5688
    Bias-corrected |   1.914      6.478   0.2955   0.768   -10.7828      14.6107
            Robust |   1.914     7.2556   0.2638   0.792   -12.3068      16.1347
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs() 
> fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16190
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8396        7794            Kernel        = Epanechnikov
Eff. Number of obs |      3294        3459            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    83.282      83.282
       BW bias (b) |   130.840     130.840
         rho (h/b) |     0.637       0.637
        Unique obs |       370         261
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02738     .03294   0.8311   0.406   -.037189      .091943
    Bias-corrected |  .01335     .03294   0.4052   0.685   -.051218      .077914
            Robust |  .01335     .03437   0.3883   0.698   -.054017      .080713
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.7804     2.6585   0.6697   0.503   -3.43021      6.99095
    Bias-corrected |  2.5352     2.6585   0.9536   0.340    -2.6754      7.74575
            Robust |  2.5352     2.7525   0.9210   0.357   -2.85963      7.92998
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster p
> rovince_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        625
-------------------+----------------------            BW type       =     Manual
     Number of obs |       319         306            Kernel        =    Uniform
Eff. Number of obs |       319         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09445     .08139   1.1604   0.246   -.065076      .253976
    Bias-corrected |  .08857     .08139   1.0882   0.277   -.070956      .248095
            Robust |  .08857     .11413   0.7760   0.438   -.135128      .312268
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .92921     1.4767   0.6292   0.529   -1.96513      3.82354
    Bias-corrected |  1.1266     1.4767   0.7629   0.446   -1.76772      4.02095
            Robust |  1.1266     2.2003   0.5120   0.609   -3.18586      5.43908
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster p
> rovince_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1840
-------------------+----------------------            BW type       =     Manual
     Number of obs |       832        1008            Kernel        =    Uniform
Eff. Number of obs |       832        1008            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03156     .05804   0.5438   0.587   -.082196      .145321
    Bias-corrected |  .04357     .05804   0.7506   0.453   -.070193      .157324
            Robust |  .04357     .06373   0.6836   0.494   -.081349      .168481
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.3242     7.8164   0.5532   0.580   -10.9957      19.6441
    Bias-corrected |  .86867     7.8164   0.1111   0.912   -14.4512      16.1885
            Robust |  .86867     8.3732   0.1037   0.917   -15.5425      17.2798
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code
> )
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10681
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4668        6013            Kernel        = Epanechnikov
Eff. Number of obs |      2026        2530            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    83.018      83.018
       BW bias (b) |   126.862     126.862
         rho (h/b) |     0.654       0.654
        Unique obs |       320         248
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03576     .04111   0.8699   0.384   -.044814      .116338
    Bias-corrected |  .01683     .04111   0.4095   0.682   -.063741      .097411
            Robust |  .01683     .04445   0.3787   0.705   -.070284      .103954
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6667     2.6201   0.6361   0.525   -3.46858      6.80192
    Bias-corrected |  2.3226     2.6201   0.8865   0.375   -2.81263      7.45786
            Robust |  2.3226     2.7326   0.8500   0.395   -3.03314      7.67837
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        206
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106         100            Kernel        =    Uniform
Eff. Number of obs |       106         100            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01123     .03117   0.3604   0.719   -.049854      .072317
    Bias-corrected | -.01828     .03117   -0.5866  0.557   -.079368      .042803
            Robust | -.01828     .02598   -0.7038  0.482   -.069193      .032629
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.9003     25.563   -0.1917  0.848   -55.0026      45.2019
    Bias-corrected | -21.588     25.563   -0.8445  0.398   -71.6903      28.5142
            Robust | -21.588     33.035   -0.6535  0.513   -86.3354      43.1592
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        633
-------------------+----------------------            BW type       =     Manual
     Number of obs |       304         329            Kernel        =    Uniform
Eff. Number of obs |       304         329            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01942     .02333   0.8327   0.405   -.026298      .065146
    Bias-corrected |   .0205     .02333   0.8789   0.379   -.025219      .066225
            Robust |   .0205     .03463   0.5920   0.554    -.04738      .088386
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.4374     12.033   0.6181   0.537   -16.1471      31.0218
    Bias-corrected |  3.9251     12.033   0.3262   0.744   -19.6593      27.5096
            Robust |  3.9251     14.456   0.2715   0.786   -24.4078      32.2581
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs() f
> uzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2768
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1164        1604            Kernel        = Epanechnikov
Eff. Number of obs |       525         575            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    64.509      64.509
       BW bias (b) |   110.361     110.361
         rho (h/b) |     0.585       0.585
        Unique obs |       236         243
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0062     .01745   0.3552   0.722   -.028005      .040404
    Bias-corrected |  .00274     .01745   0.1571   0.875   -.031463      .036946
            Robust |  .00274     .02014   0.1362   0.892   -.036723      .042207
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  20.345     59.074   0.3444   0.731   -95.4377      136.129
    Bias-corrected |  34.608     59.074   0.5858   0.558   -81.1748      150.392
            Robust |  34.608     67.213   0.5149   0.607   -97.1261      166.343
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12716     .10223   1.2439   0.214   -.073208      .327528
    Bias-corrected |  .12463     .10223   1.2191   0.223   -.075734      .325001
            Robust |  .12463      .1476   0.8444   0.398    -.16466      .413927
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1599     .99424   1.1666   0.243   -.788826      3.10854
    Bias-corrected |  1.4765     .99424   1.4851   0.138   -.472148      3.42521
            Robust |  1.4765     1.7232   0.8569   0.392   -1.90084      4.85391
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1207
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         679            Kernel        =    Uniform
Eff. Number of obs |       528         679            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03237     .07173   0.4512   0.652   -.108224      .172957
    Bias-corrected |  .06952     .07173   0.9692   0.332   -.071068      .210113
            Robust |  .06952     .08332   0.8344   0.404    -.09378      .232826
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.9756     8.2565   0.4815   0.630   -12.2069      20.1581
    Bias-corrected | -1.9404     8.2565   -0.2350  0.814   -18.1229      14.2421
            Robust | -1.9404     9.5038   -0.2042  0.838   -20.5676      16.6867
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs() f
> uzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7913
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3504        4409            Kernel        = Epanechnikov
Eff. Number of obs |      1451        2030            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    89.498      89.498
       BW bias (b) |   123.574     123.574
         rho (h/b) |     0.724       0.724
        Unique obs |       315         237
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .06066     .05275   1.1499   0.250   -.042731      .164057
    Bias-corrected |  .03672     .05275   0.6961   0.486   -.066675      .140113
            Robust |  .03672     .05802   0.6328   0.527   -.077001      .150439
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .82066     1.4422   0.5690   0.569   -2.00592      3.64723
    Bias-corrected |  .85378     1.4422   0.5920   0.554   -1.97279      3.68035
            Robust |  .85378     1.4565   0.5862   0.558   -2.00085      3.70841
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        828
-------------------+----------------------            BW type       =     Manual
     Number of obs |       447         381            Kernel        =    Uniform
Eff. Number of obs |       447         381            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08266     .05628   1.4688   0.142   -.027645      .192973
    Bias-corrected |  .02602     .05628   0.4624   0.644   -.084286      .136333
            Robust |  .02602     .10432   0.2494   0.803   -.178448      .230495
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3545     1.3179   1.0278   0.304   -1.22858      3.93759
    Bias-corrected | -.04477     1.3179   -0.0340  0.973   -2.62785      2.53832
            Robust | -.04477      2.422   -0.0185  0.985   -4.79173       4.7022
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2620
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1242        1378            Kernel        =    Uniform
Eff. Number of obs |      1242        1378            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0185     .03063   0.6039   0.546   -.041535      .078528
    Bias-corrected |   .0482     .03063   1.5737   0.116    -.01183      .108233
            Robust |   .0482     .04729   1.0194   0.308   -.044478      .140881
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.7229     6.1512   0.6052   0.545   -8.33332       15.779
    Bias-corrected | -.98365     6.1512   -0.1599  0.873   -13.0398      11.0725
            Robust | -.98365     9.4466   -0.1041  0.917   -19.4986      17.5313
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16087
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8352        7735            Kernel        = Epanechnikov
Eff. Number of obs |      2120        2294            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.559      57.559
       BW bias (b) |   114.318     114.318
         rho (h/b) |     0.503       0.503
        Unique obs |       369         260

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00523     .02522   0.2073   0.836   -.044206      .054666
    Bias-corrected | -.00614     .02522   -0.2436  0.808   -.055579      .043293
            Robust | -.00614     .02839   -0.2164  0.829    -.06178      .049494
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  5.6283     26.305   0.2140   0.831   -45.9278      57.1843
    Bias-corrected |  16.926     26.305   0.6435   0.520   -34.6302      68.4818
            Robust |  16.926     29.606   0.5717   0.568   -41.1007      74.9523
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) al
> l

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09508     .08359   1.1374   0.255   -.068765      .258919
    Bias-corrected |  .11681     .08359   1.3974   0.162   -.047028      .280657
            Robust |  .11681     .15022   0.7776   0.437   -.177603      .411232
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.19956     1.4496   -0.1377  0.891   -3.04073       2.6416
    Bias-corrected | -1.8149     1.4496   -1.2520  0.211   -4.65608      1.02624
            Robust | -1.8149     2.6001   -0.6980  0.485   -6.91093       3.2811
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) al
> l

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1759
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         963            Kernel        =    Uniform
Eff. Number of obs |       796         963            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02047     .04407   0.4646   0.642   -.065904      .106852
    Bias-corrected |  .02622     .04407   0.5950   0.552   -.060157      .112599
            Robust |  .02622     .06964   0.3765   0.707   -.110261      .162703
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  5.5418     11.527   0.4808   0.631   -17.0509      28.1345
    Bias-corrected |  -1.617     11.527   -0.1403  0.888   -24.2097      20.9757
            Robust |  -1.617     18.185   -0.0889  0.929   -37.2595      34.0255
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10600
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4632        5968            Kernel        = Epanechnikov
Eff. Number of obs |      1374        1707            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    59.460      59.460
       BW bias (b) |   117.413     117.413
         rho (h/b) |     0.506       0.506
        Unique obs |       319         247

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00617     .03568   0.1729   0.863   -.063757      .076092
    Bias-corrected | -.00932     .03568   -0.2611  0.794    -.07924      .060608
            Robust | -.00932     .04026   -0.2314  0.817   -.088218      .069586
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.9043     49.858   0.1786   0.858   -88.8161      106.625
    Bias-corrected |  29.929     49.858   0.6003   0.548   -67.7911       127.65
            Robust |  29.929     56.258   0.5320   0.595    -80.334      140.193
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03045      .0581   0.5241   0.600   -.083417      .144312
    Bias-corrected | -.05045      .0581   -0.8684  0.385   -.164316      .063413
            Robust | -.05045     .07997   -0.6309  0.528    -.20718      .106278
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.8883     8.4263   -0.2241  0.823   -18.4036       14.627
    Bias-corrected | -11.217     8.4263   -1.3312  0.183   -27.7321      5.29849
            Robust | -11.217     14.839   -0.7559  0.450   -40.2998      17.8661
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        605
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         313            Kernel        =    Uniform
Eff. Number of obs |       292         313            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02362     .02908   0.8120   0.417   -.033385      .080616
    Bias-corrected |  .03538     .02908   1.2164   0.224   -.021623      .092378
            Robust |  .03538     .05495   0.6439   0.520   -.072315      .143069
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.6651     10.119   0.7575   0.449    -12.167      27.4972
    Bias-corrected |  2.0766     10.119   0.2052   0.837   -17.7556      21.9087
            Robust |  2.0766      18.54   0.1120   0.911   -34.2618      38.4149
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2740
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1152        1588            Kernel        = Epanechnikov
Eff. Number of obs |       669         682            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    84.007      84.007
       BW bias (b) |   153.936     153.936
         rho (h/b) |     0.546       0.546
        Unique obs |       235         242

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00887     .01809   0.4902   0.624   -.026582      .044314
    Bias-corrected |  .00999     .01809   0.5522   0.581    -.02546      .045436
            Robust |  .00999     .02126   0.4699   0.638   -.031675      .051651
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  11.681     24.578   0.4753   0.635   -36.4908      59.8531
    Bias-corrected |  11.203     24.578   0.4558   0.649   -36.9687      59.3752
            Robust |  11.203      28.89   0.3878   0.698   -45.4197      67.8261
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11015     .10953   1.0056   0.315   -.104527      .324819
    Bias-corrected |  .12007     .10953   1.0963   0.273   -.094601      .334745
            Robust |  .12007     .19572   0.6135   0.540   -.263536      .503681
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.14797     1.5281   -0.0968  0.923   -3.14296      2.84703
    Bias-corrected | -1.8534     1.5281   -1.2129  0.225   -4.84844      1.14155
            Robust | -1.8534     2.7212   -0.6811  0.496   -7.18686      3.47997
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         650            Kernel        =    Uniform
Eff. Number of obs |       504         650            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01024     .05958   0.1719   0.863   -.106525      .127013
    Bias-corrected |  .03736     .05958   0.6270   0.531   -.079412      .154126
            Robust |  .03736     .09278   0.4027   0.687   -.144481      .219195
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.2149     40.531   0.1780   0.859    -72.224      86.6538
    Bias-corrected | -24.979     40.531   -0.6163  0.538   -104.418      54.4601
            Robust | -24.979     62.974   -0.3967  0.692   -148.405      98.4474
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7860
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3480        4380            Kernel        = Epanechnikov
Eff. Number of obs |       802        1056            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.198      53.198
       BW bias (b) |    97.338      97.338
         rho (h/b) |     0.547       0.547
        Unique obs |       314         236

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01249     .05122   -0.2439  0.807   -.112875      .087893
    Bias-corrected | -.03216     .05122   -0.6278  0.530   -.132539      .068229
            Robust | -.03216     .05878   -0.5470  0.584   -.147367      .083056
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .42847     6.0322   0.0710   0.943   -11.3944      12.2513
    Bias-corrected |   .9619     6.0322   0.1595   0.873   -10.8609      12.7847
            Robust |   .9619     6.8997   0.1394   0.889   -12.5613      14.4851
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 3 results.xls
dir : seeout

. 
. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclus
> ter province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        828
-------------------+----------------------            BW type       =     Manual
     Number of obs |       447         381            Kernel        =    Uniform
Eff. Number of obs |       447         381            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08266     .06391   1.2935   0.196   -.042592       .20792
    Bias-corrected |  .02602     .06391   0.4072   0.684   -.099233       .15128
            Robust |  .02602     .09013   0.2887   0.773   -.150633       .20268
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3545     1.3967   0.9698   0.332   -1.38293      4.09194
    Bias-corrected | -.04477     1.3967   -0.0321  0.974    -2.7822      2.69267
            Robust | -.04477     2.5973   -0.0172  0.986   -5.13532      5.04578
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclus
> ter province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2620
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1242        1378            Kernel        =    Uniform
Eff. Number of obs |      1242        1378            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0185      .0467   0.3960   0.692   -.073042      .110035
    Bias-corrected |   .0482      .0467   1.0321   0.302   -.043338       .13974
            Robust |   .0482     .05285   0.9120   0.362   -.055386      .151789
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.7229     9.0293   0.4123   0.680   -13.9742        21.42
    Bias-corrected | -.98365     9.0293   -0.1089  0.913   -18.6808      16.7134
            Robust | -.98365     11.239   -0.0875  0.930   -23.0119      21.0446
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province
> _code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16087
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8352        7735            Kernel        = Epanechnikov
Eff. Number of obs |      2571        2762            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    68.984      68.984
       BW bias (b) |   117.260     117.260
         rho (h/b) |     0.588       0.588
        Unique obs |       369         260
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01425     .03368   0.4230   0.672   -.051757      .080251
    Bias-corrected | -.00182     .03368   -0.0542  0.957   -.067828       .06418
            Robust | -.00182     .03492   -0.0522  0.958   -.070271      .066624
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.5823     5.1057   0.3099   0.757    -8.4247      11.5894
    Bias-corrected |  2.8659     5.1057   0.5613   0.575   -7.14112      12.8729
            Robust |  2.8659     5.3292   0.5378   0.591   -7.57916       13.311
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) al
> l vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09508     .08469   1.1226   0.262   -.070915      .261069
    Bias-corrected |  .11681     .08469   1.3793   0.168   -.049178      .282806
            Robust |  .11681     .12508   0.9339   0.350   -.128334      .361962
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.19956     1.4204   -0.1405  0.888   -2.98354      2.58442
    Bias-corrected | -1.8149     1.4204   -1.2777  0.201    -4.5989      .969063
            Robust | -1.8149     2.7658   -0.6562  0.512   -7.23576      3.60593
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) al
> l vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1759
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         963            Kernel        =    Uniform
Eff. Number of obs |       796         963            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02047      .0607   0.3373   0.736   -.098491      .139439
    Bias-corrected |  .02622      .0607   0.4320   0.666   -.092744      .145186
            Robust |  .02622     .06865   0.3819   0.703   -.108334      .160776
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  5.5418     16.125   0.3437   0.731   -26.0627      37.1463
    Bias-corrected |  -1.617     16.125   -0.1003  0.920   -33.2215      29.9875
            Robust |  -1.617     19.387   -0.0834  0.934   -39.6143      36.3804
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nnclus
> ter province_code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10600
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4632        5968            Kernel        = Epanechnikov
Eff. Number of obs |      1692        2077            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.853      71.853
       BW bias (b) |   122.100     122.100
         rho (h/b) |     0.588       0.588
        Unique obs |       319         247
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01869     .04285   0.4363   0.663   -.065283      .102672
    Bias-corrected | -.00087     .04285   -0.0203  0.984   -.084847      .083109
            Robust | -.00087     .04643   -0.0187  0.985   -.091872      .090134
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.1751      5.955   0.3653   0.715   -9.49652      13.8467
    Bias-corrected |  3.8633      5.955   0.6487   0.517   -7.80835      15.5349
            Robust |  3.8633     6.2844   0.6147   0.539   -8.45382      16.1804
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03045     .05239   0.5812   0.561   -.072235       .13313
    Bias-corrected | -.05045     .05239   -0.9630  0.336   -.153134      .052231
            Robust | -.05045     .08118   -0.6215  0.534   -.209562       .10866
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -1.8883     6.4914   -0.2909  0.771   -14.6112      10.8346
    Bias-corrected | -11.217     6.4914   -1.7280  0.084   -23.9397      1.50606
            Robust | -11.217     13.131   -0.8542  0.393   -36.9531      14.5194
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        605
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         313            Kernel        =    Uniform
Eff. Number of obs |       292         313            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02362     .02778   0.8502   0.395   -.030824      .078055
    Bias-corrected |  .03538     .02778   1.2737   0.203   -.019062      .089817
            Robust |  .03538     .05078   0.6966   0.486   -.064154      .134909
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.6651     10.664   0.7188   0.472   -13.2358       28.566
    Bias-corrected |  2.0766     10.664   0.1947   0.846   -18.8244      22.9775
            Robust |  2.0766     16.876   0.1230   0.902   -31.0003      35.1534
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2740
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1152        1588            Kernel        = Epanechnikov
Eff. Number of obs |       675         698            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    85.324      85.324
       BW bias (b) |   154.065     154.065
         rho (h/b) |     0.554       0.554
        Unique obs |       235         242
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00955     .01868   0.5115   0.609    -.02705      .046155
    Bias-corrected |  .01071     .01868   0.5734   0.566   -.025894      .047311
            Robust |  .01071      .0222   0.4823   0.630   -.032807      .054223
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  10.663     22.424   0.4755   0.634   -33.2876      54.6131
    Bias-corrected |  10.329     22.424   0.4606   0.645   -33.6218      54.2789
            Robust |  10.329     26.087   0.3959   0.692    -40.802      61.4591
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11015     .10384   1.0607   0.289   -.093373      .313664
    Bias-corrected |  .12007     .10384   1.1563   0.248   -.083446      .323591
            Robust |  .12007     .17048   0.7043   0.481   -.214068      .454213
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.14797     1.3995   -0.1057  0.916   -2.89087      2.59494
    Bias-corrected | -1.8534     1.3995   -1.3244  0.185   -4.59635      .889465
            Robust | -1.8534     2.8479   -0.6508  0.515   -7.43519      3.72831
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         650            Kernel        =    Uniform
Eff. Number of obs |       504         650            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01024     .07646   0.1340   0.893   -.139623      .160111
    Bias-corrected |  .03736     .07646   0.4886   0.625    -.11251      .187224
            Robust |  .03736      .0952   0.3924   0.695   -.149233      .223947
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.2149     52.384   0.1377   0.890   -95.4561      109.886
    Bias-corrected | -24.979     52.384   -0.4768  0.633    -127.65      77.6923
            Robust | -24.979     67.463   -0.3703  0.711   -157.203      107.246
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7860
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3480        4380            Kernel        = Epanechnikov
Eff. Number of obs |       802        1056            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    53.852      53.852
       BW bias (b) |    88.245      88.245
         rho (h/b) |     0.610       0.610
        Unique obs |       314         236
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.01216     .06556   -0.1855  0.853   -.140658      .116338
    Bias-corrected | -.03843     .06556   -0.5862  0.558   -.166929      .090067
            Robust | -.03843     .07336   -0.5239  0.600    -.18221      .105348
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .45715     8.7085   0.0525   0.958   -16.6113      17.5256
    Bias-corrected |  .39433     8.7085   0.0453   0.964   -16.6741      17.4627
            Robust |  .39433     9.1736   0.0430   0.966   -17.5857      18.3743
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        723
-------------------+----------------------            BW type       =     Manual
     Number of obs |       399         324            Kernel        =    Uniform
Eff. Number of obs |       399         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11149     .07105   1.5691   0.117   -.027773      .250743
    Bias-corrected |  .08443     .07105   1.1882   0.235   -.054832      .223684
            Robust |  .08443     .15932   0.5299   0.596   -.227843      .396696
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3023     1.2918   1.0082   0.313   -1.22951      3.83409
    Bias-corrected | -1.5742     1.2918   -1.2186  0.223   -4.10595      .957642
            Robust | -1.5742     3.1011   -0.5076  0.612   -7.65211       4.5038
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2515
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1194        1321            Kernel        =    Uniform
Eff. Number of obs |      1194        1321            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01665     .03318   0.5018   0.616   -.048384      .081684
    Bias-corrected |  .05833     .03318   1.7578   0.079   -.006707      .123361
            Robust |  .05833     .05569   1.0473   0.295    -.05083      .167485
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.1436     8.1856   0.5062   0.613   -11.8998      20.1871
    Bias-corrected | -4.1694     8.1856   -0.5094  0.611   -20.2128      11.8741
            Robust | -4.1694     13.776   -0.3027  0.762   -31.1692      22.8304
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15982
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8304        7678            Kernel        = Epanechnikov
Eff. Number of obs |      1825        1992            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    51.442      51.442
       BW bias (b) |    98.043      98.043
         rho (h/b) |     0.525       0.525
        Unique obs |       368         259

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00095     .02845   -0.0332  0.973   -.056715      .054824
    Bias-corrected | -.01243     .02845   -0.4368  0.662     -.0682       .04334
            Robust | -.01243     .03289   -0.3779  0.705    -.07689       .05203
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -27.217     835.33   -0.0326  0.974   -1664.44      1610.01
    Bias-corrected |  305.25     835.33   0.3654   0.715   -1331.98      1942.47
            Robust |  305.25      965.4   0.3162   0.752    -1586.9      2197.39
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) al
> l

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08347     .10931   0.7637   0.445   -.130765      .297712
    Bias-corrected |   .1273     .10931   1.1646   0.244    -.08694      .341537
            Robust |   .1273     .25754   0.4943   0.621   -.377478      .632075
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.52717     2.4438   -0.2157  0.829   -5.31699      4.26265
    Bias-corrected | -6.0804     2.4438   -2.4880  0.013   -10.8702     -1.29055
            Robust | -6.0804     5.8457   -1.0401  0.298   -17.5377      5.37695
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) al
> l

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1688
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         928            Kernel        =    Uniform
Eff. Number of obs |       760         928            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00744     .04789   0.1554   0.877   -.086413      .101294
    Bias-corrected | -.00674     .04789   -0.1408  0.888   -.100594      .087113
            Robust | -.00674     .08372   -0.0805  0.936   -.170827      .157346
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  17.188     108.42   0.1585   0.874   -195.311      229.687
    Bias-corrected |  31.377     108.42   0.2894   0.772   -181.122      243.876
            Robust |  31.377     189.82   0.1653   0.869   -340.661      403.414
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10529
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4596        5933            Kernel        = Epanechnikov
Eff. Number of obs |      1380        1705            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.976      60.976
       BW bias (b) |   123.686     123.686
         rho (h/b) |     0.493       0.493
        Unique obs |       318         246

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00208     .03707   -0.0560  0.955   -.074741      .070589
    Bias-corrected | -.01815     .03707   -0.4895  0.624   -.090815      .054515
            Robust | -.01815     .04202   -0.4320  0.666   -.100498      .064199
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -26.713     485.59   -0.0550  0.956   -978.444      925.018
    Bias-corrected |  184.42     485.59   0.3798   0.704   -767.308      1136.15
            Robust |  184.42     550.28   0.3351   0.738    -894.11      1262.96
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03683     .08962   0.4110   0.681   -.138816      .212478
    Bias-corrected | -.14678     .08962   -1.6378  0.101   -.322425      .028869
            Robust | -.14678     .25863   -0.5675  0.570    -.65368      .360124
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.2949     13.499   -0.3182  0.750   -30.7519      22.1622
    Bias-corrected | -44.018     13.499   -3.2609  0.001   -70.4754     -17.5613
            Robust | -44.018     37.937   -1.1603  0.246   -118.373      30.3362
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        587
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         306            Kernel        =    Uniform
Eff. Number of obs |       281         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02575     .03277   0.7857   0.432   -.038478      .089973
    Bias-corrected |  .03953     .03277   1.2062   0.228   -.024698      .103752
            Robust |  .03953     .07264   0.5442   0.586   -.102843      .181897
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.2186     9.8317   0.7342   0.463   -12.0511      26.4883
    Bias-corrected |  1.8953     9.8317   0.1928   0.847   -17.3744       21.165
            Robust |  1.8953     20.802   0.0911   0.927   -38.8768      42.6673
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2722
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1141        1581            Kernel        = Epanechnikov
Eff. Number of obs |       658         675            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    84.294      84.294
       BW bias (b) |   157.146     157.146
         rho (h/b) |     0.536       0.536
        Unique obs |       234         241

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00888     .01927   0.4610   0.645   -.028889      .046658
    Bias-corrected |  .01038     .01927   0.5384   0.590   -.027397       .04815
            Robust |  .01038     .02281   0.4550   0.649   -.034321      .055074
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  11.281     25.206   0.4475   0.654   -38.1228      60.6847
    Bias-corrected |  10.454     25.206   0.4147   0.678   -38.9497      59.8578
            Robust |  10.454     29.822   0.3506   0.726   -47.9955      68.9036
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12178     .14709   0.8280   0.408   -.166507      .410072
    Bias-corrected |  .19768     .14709   1.3439   0.179   -.090609      .485969
            Robust |  .19768     .33659   0.5873   0.557   -.462034      .857394
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12754     1.8825   0.0677   0.946   -3.56213       3.8172
    Bias-corrected | -3.6755     1.8825   -1.9524  0.051   -7.36517      .014158
            Robust | -3.6755     4.5048   -0.8159  0.415   -12.5047      5.15372
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1101
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         622            Kernel        =    Uniform
Eff. Number of obs |       479         622            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00252     .06556   -0.0385  0.969    -.13102      .125978
    Bias-corrected |  .01497     .06556   0.2283   0.819   -.113532      .143467
            Robust |  .01497       .114   0.1313   0.896   -.208478      .238413
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -38.378     1008.8   -0.0380  0.970   -2015.63      1938.87
    Bias-corrected | -240.13     1008.8   -0.2380  0.812   -2217.38      1737.12
            Robust | -240.13     1753.4   -0.1370  0.891   -3676.69      3196.43
--------------------------------------------------------------------------------

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7807
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3455        4352            Kernel        = Epanechnikov
Eff. Number of obs |       840        1116            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.088      57.088
       BW bias (b) |   110.658     110.658
         rho (h/b) |     0.516       0.516
        Unique obs |       313         235

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02001      .0527   -0.3797  0.704   -.123311      .083284
    Bias-corrected | -.04189      .0527   -0.7947  0.427   -.145182      .061412
            Robust | -.04189     .06046   -0.6928  0.488   -.160384      .076614
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05973     4.0848   0.0146   0.988   -7.94639      8.06585
    Bias-corrected |  1.1069     4.0848   0.2710   0.786    -6.8992      9.11304
            Robust |  1.1069     4.6794   0.2366   0.813   -8.06455      10.2784
--------------------------------------------------------------------------------
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 5 results.xls
dir : seeout

. 
. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclus
> ter province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        723
-------------------+----------------------            BW type       =     Manual
     Number of obs |       399         324            Kernel        =    Uniform
Eff. Number of obs |       399         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11149     .08519   1.3086   0.191    -.05549      .278461
    Bias-corrected |  .08443     .08519   0.9910   0.322   -.082549      .251402
            Robust |  .08443     .13447   0.6279   0.530   -.179125      .347977
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.3023     1.2719   1.0239   0.306   -1.19067      3.79526
    Bias-corrected | -1.5742     1.2719   -1.2376  0.216   -4.06712      .918807
            Robust | -1.5742     2.7888   -0.5644  0.572   -7.04019      3.89188
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclus
> ter province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2515
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1194        1321            Kernel        =    Uniform
Eff. Number of obs |      1194        1321            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01665     .05124   0.3249   0.745    -.08378       .11708
    Bias-corrected |  .05833     .05124   1.1383   0.255   -.042103      .158757
            Robust |  .05833     .06658   0.8761   0.381   -.072166       .18882
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.1436     11.975   0.3460   0.729   -19.3276      27.6149
    Bias-corrected | -4.1694     11.975   -0.3482  0.728   -27.6407      19.3019
            Robust | -4.1694     16.765   -0.2487  0.804   -37.0284      28.6896
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province
> _code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15982
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8304        7678            Kernel        = Epanechnikov
Eff. Number of obs |      2115        2287            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.533      58.533
       BW bias (b) |    95.929      95.929
         rho (h/b) |     0.610       0.610
        Unique obs |       368         259
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00298     .03831   0.0779   0.938   -.072108      .078075
    Bias-corrected | -.01214     .03831   -0.3169  0.751   -.087235      .062949
            Robust | -.01214     .04214   -0.2882  0.773   -.094737      .070451
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.7929     95.891   0.0813   0.935   -180.149      195.735
    Bias-corrected |  46.644     95.891   0.4864   0.627   -141.298      234.586
            Robust |  46.644      104.7   0.4455   0.656   -158.557      251.845
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(12) al
> l vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08347     .12241   0.6819   0.495   -.156452      .323399
    Bias-corrected |   .1273     .12241   1.0399   0.298   -.112627      .367224
            Robust |   .1273     .23381   0.5445   0.586   -.330953      .585549
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.52717      2.202   -0.2394  0.811    -4.8431      3.78876
    Bias-corrected | -6.0804      2.202   -2.7612  0.006   -10.3963     -1.76444
            Robust | -6.0804     5.7386   -1.0596  0.289   -17.3279      5.16711
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs() fuzzy(highgen) kernel(uni) p(1) h(36) al
> l vce(nncluster province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1688
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         928            Kernel        =    Uniform
Eff. Number of obs |       760         928            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00744     .06819   0.1091   0.913   -.126205      .141087
    Bias-corrected | -.00674     .06819   -0.0989  0.921   -.140387      .126905
            Robust | -.00674     .09492   -0.0710  0.943   -.192777      .179296
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  17.188      155.4   0.1106   0.912    -287.39      321.766
    Bias-corrected |  31.377      155.4   0.2019   0.840   -273.201      335.955
            Robust |  31.377     219.64   0.1429   0.886    -399.11      461.863
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nnclus
> ter province_code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10529
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4596        5933            Kernel        = Epanechnikov
Eff. Number of obs |      1676        2085            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    72.563      72.563
       BW bias (b) |   131.928     131.928
         rho (h/b) |     0.550       0.550
        Unique obs |       318         246
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01194      .0452   0.2640   0.792   -.076661      .100531
    Bias-corrected | -.00702      .0452   -0.1553  0.877   -.095615      .081578
            Robust | -.00702     .05065   -0.1386  0.890   -.106292      .092256
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.4635     13.729   0.2523   0.801   -23.4448      30.3719
    Bias-corrected |   7.797     13.729   0.5679   0.570   -19.1113      34.7054
            Robust |   7.797     15.099   0.5164   0.606   -21.7961      37.3902
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03683     .08292   0.4442   0.657   -.125693      .199354
    Bias-corrected | -.14678     .08292   -1.7701  0.077   -.309302      .015745
            Robust | -.14678      .2658   -0.5522  0.581   -.667746       .37419
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -4.2949     11.851   -0.3624  0.717   -27.5215      18.9318
    Bias-corrected | -44.018     11.851   -3.7145  0.000   -67.2451     -20.7917
            Robust | -44.018     37.119   -1.1859  0.236   -116.771      28.7341
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        587
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         306            Kernel        =    Uniform
Eff. Number of obs |       281         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02575     .03169   0.8124   0.417   -.036373      .087868
    Bias-corrected |  .03953     .03169   1.2471   0.212   -.022594      .101648
            Robust |  .03953     .06738   0.5867   0.557   -.092526       .17158
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.2186      10.31   0.7002   0.484    -12.988      27.4251
    Bias-corrected |  1.8953      10.31   0.1838   0.854   -18.3113      22.1018
            Robust |  1.8953      18.83   0.1007   0.920   -35.0102      38.8007
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2722
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1141        1581            Kernel        = Epanechnikov
Eff. Number of obs |       664         691            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    85.212      85.212
       BW bias (b) |   157.470     157.470
         rho (h/b) |     0.541       0.541
        Unique obs |       234         241
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00938     .02013   0.4661   0.641   -.030072      .048837
    Bias-corrected |  .01092     .02013   0.5422   0.588   -.028539       .05037
            Robust |  .01092     .02416   0.4517   0.651   -.036443      .058274
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  10.555     24.273   0.4348   0.664   -37.0192      58.1282
    Bias-corrected |  9.8611     24.273   0.4063   0.685   -37.7127      57.4348
            Robust |  9.8611     28.505   0.3459   0.729   -46.0081      65.7302
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12178     .16502   0.7380   0.461   -.201641      .445206
    Bias-corrected |  .19768     .16502   1.1980   0.231   -.125744      .521103
            Robust |  .19768     .31928   0.6191   0.536   -.428105      .823465
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12754      1.463   0.0872   0.931   -2.73984      2.99492
    Bias-corrected | -3.6755      1.463   -2.5124  0.012   -6.54289     -.808128
            Robust | -3.6755     4.1539   -0.8848  0.376   -11.8169      4.46592
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs() fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1101
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         622            Kernel        =    Uniform
Eff. Number of obs |       479         622            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00252     .09199   -0.0274  0.978   -.182819      .177777
    Bias-corrected |  .01497     .09199   0.1627   0.871   -.165331      .195265
            Robust |  .01497     .14465   0.1035   0.918   -.268539      .298474
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -38.378     1410.2   -0.0272  0.978   -2802.24      2725.48
    Bias-corrected | -240.13     1410.2   -0.1703  0.865      -3004      2523.73
            Robust | -240.13     2201.9   -0.1091  0.913   -4555.68      4075.42
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs() fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7807
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3455        4352            Kernel        = Epanechnikov
Eff. Number of obs |       935        1264            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    62.134      62.134
       BW bias (b) |   109.301     109.301
         rho (h/b) |     0.568       0.568
        Unique obs |       313         235
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00545     .06905   -0.0790  0.937   -.140787      .129884
    Bias-corrected | -.03235     .06905   -0.4685  0.639   -.167687      .102984
            Robust | -.03235     .07882   -0.4105  0.681   -.186831      .122128
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .37552     19.138   0.0196   0.984   -37.1343      37.8853
    Bias-corrected |    3.36     19.138   0.1756   0.861   -34.1499      40.8698
            Robust |    3.36     20.105   0.1671   0.867   -36.0442      42.7641
--------------------------------------------------------------------------------
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No control/Earning Sh
> eet 6 results.xls
dir : seeout

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption No contr
> ol/Urban 1979 Highgen FuzzyOption No Control.log
  log type:  text
 closed on:   6 Aug 2024, 17:25:22
---------------------------------------------------------------------------------------------
