---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/Ru
> ral/Indicator DID Urban 1979.log
  log type:  text
 opened on:   8 Aug 2024, 13:50:50

. use "`datapath'", clear

. ****DIFF if DIFF has two procedures. First it creates a new dataset with parents info, then
>  it merges the new dataset for further regressions.
. ****Urban and Rural codes are in two .do files, but they are stored in the same excel workb
> ook (if we make the xlsxfolderpath the same).
. 
. *Step Zero: A New Dataset for Merging
. 
. gen headsecedu = .
(35,007 missing values generated)

. gen headhighedu = .
(35,007 missing values generated)

. gen spousesecedu = .
(35,007 missing values generated)

. gen spousehighedu = .
(35,007 missing values generated)

. gen headparty = .
(35,007 missing values generated)

. gen spouseparty = .
(35,007 missing values generated)

. gen spouseparentsecedu = .
(35,007 missing values generated)

. gen spouseparenthighedu = .
(35,007 missing values generated)

. gen spouseparentparty = .
(35,007 missing values generated)

. gen headparentsecedu = .
(35,007 missing values generated)

. gen headparenthighedu = .
(35,007 missing values generated)

. gen headparentparty = .
(35,007 missing values generated)

. replace headsecedu = 1 if A02 == 1 & inrange(A13_1, 4, 9)
(1,332 real changes made)

. replace headsecedu = 0 if A02 == 1 & inrange(A13_1, 1, 3)
(7,897 real changes made)

. replace headhighedu = 1 if A02 == 1 & inrange(A13_1, 7, 9)
(180 real changes made)

. replace headhighedu = 0 if A02 == 1 & inrange(A13_1, 1, 6)
(9,049 real changes made)

. replace spousesecedu = 1 if A02 == 2 & inrange(A13_1, 4, 9)
(686 real changes made)

. replace spousesecedu = 0 if A02 == 2 & inrange(A13_1, 1, 3)
(7,673 real changes made)

. replace spousehighedu = 1 if A02 == 2 & inrange(A13_1, 7, 9)
(110 real changes made)

. replace spousehighedu = 0 if A02 == 2 & inrange(A13_1, 1, 6)
(8,249 real changes made)

. replace headparty = 1 if A02 == 1 & A07_1 == 1
(1,198 real changes made)

. replace headparty = 0 if A02 == 1 & inrange(A07_1, 2, 4)
(8,040 real changes made)

. replace spouseparty = 1 if A02 == 2 & A07_1 == 1
(267 real changes made)

. replace spouseparty = 0 if A02 == 2 & inrange(A07_1, 2, 4)
(8,101 real changes made)

. replace spouseparentsecedu = 0 if A02 == 5 & inrange(A13_1, 1, 3)
(68 real changes made)

. replace spouseparentsecedu = 1 if A02 == 5 & inrange(A13_1, 4, 9)
(2 real changes made)

. replace spouseparenthighedu = 0 if A02 == 5 & inrange(A13_1, 1, 6)
(70 real changes made)

. replace spouseparenthighedu = 1 if A02 == 5 & inrange(A13_1, 7, 9)
(0 real changes made)

. replace spouseparentparty = 0 if A02 == 5 & inrange(A07_1, 2, 4)
(66 real changes made)

. replace spouseparentparty = 1 if A02 == 5 & A07_1 == 1
(5 real changes made)

. replace headparentsecedu = 0 if A02 == 4 & inrange(A13_1, 1, 3)
(1,573 real changes made)

. replace headparentsecedu = 1 if A02 == 4 & inrange(A13_1, 4, 9)
(64 real changes made)

. replace headparenthighedu = 0 if A02 == 4 & inrange(A13_1, 1, 6)
(1,632 real changes made)

. replace headparenthighedu = 1 if A02 == 4 & inrange(A13_1, 7, 9)
(5 real changes made)

. replace headparentparty = 0 if A02 == 4 & inrange(A07_1, 2, 4)
(1,544 real changes made)

. replace headparentparty = 1 if A02 == 4 & A07_1 == 1
(97 real changes made)

. collapse (max) headsecedu headhighedu spousesecedu spousehighedu headparty spouseparty spou
> separentsecedu spouseparenthighedu spouseparentparty headparentsecedu headparenthighedu hea
> dparentparty, by(hhcode)

. 
. save "`folderpath'/`logname'.dta", replace
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator &
    DIff-in-diff/1979/Rural/Indicator DID Urban 1979.dta saved

. 
. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(20,128 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(68 missing values generated)

. gen monthlyearning = annualearning/workmonths
(20,244 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(20,280 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(16,738 missing values generated)

. replace male=0 if A03==2
(16,738 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99
(7 missing values generated)

. gen age = 2018-birthyear
(7 missing values generated)

. gen agesqr = age*age
(7 missing values generated)

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,614 missing values generated)

. replace exp=0 if exp<0
(2,949 real changes made)

. gen expsqr = exp*exp
(3,614 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. 
. gen secvocedu=1 if A14==5
(33,786 missing values generated)

. replace secvocedu =0 if A14!=5
(33,786 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(400 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(254 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     33,640       96.10       96.10
          1 |      1,367        3.90      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,968 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(28,942 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(28,942 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,193 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,135       88.94       88.94
          1 |      3,872       11.06      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(32,602 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(23,009 missing values generated)

. replace secjun = 0 if secjun!=1
(23,009 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,009       65.73       65.73
          1 |     11,998       34.27      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. *income for secjun
. gen jun_log_monthlyearning = log_monthlyearning if secjun == 1
(27,895 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(33,640 missing values generated)

. replace educat=2 if secgenedu==1
(3,872 real changes made)

. replace educat=3 if secjun==1
(11,998 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,367        7.93        7.93
          2 |      3,872       22.46       30.39
          3 |     11,998       69.61      100.00
------------+-----------------------------------
      Total |     17,237      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(34,028 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(34,028 real changes made)

. replace highvocedu=0 if A15_7==6
(150 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(34,367 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(34,367 real changes made)

. replace highgenedu=0 if A15_7==6
(20 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,791 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,791 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(46 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,837       99.51       99.51
          1 |        170        0.49      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(33,388 missing values generated)

. replace higheredu=0 if higheredu!=1
(33,388 real changes made)

. 
. *6) Instrument
. 
. gen yearat15 = birthyear+15
(7 missing values generated)

. local obsnum = _N

. 
. forval i =  1/`obsnum' {
  2.         
.         *extract the observation's year at age 15
.         qui sum yearat15  in `i'
  3.         local yearvalue = round(mod(r(mean),100))
  4.         
.         *get the variables' names for this observation
.         *graduates of mid and sec schools
.         if inrange(`yearvalue', 0, 9) {
  5.                 local czgrad_year = "czgrad0`yearvalue'"
  6.                 local gzgrad_year = "gzgrad0`yearvalue'"
  7.         }
  8.         else {
  9.                 local czgrad_year = "czgrad`yearvalue'"
 10.                 local gzgrad_year = "gzgrad`yearvalue'"
 11.         }
 12.         *entrants of sec and universities
.         if inrange(`yearvalue'+1, 0, 9) {
 13.                 local gzentrant_year = "gzentrant0`=`yearvalue'+1'"
 14.                 local gxentrant_year = "gxentrant0`=`yearvalue'+1'"
 15.                 local vsentrant_year = "vsentrant0`=`yearvalue'+1'"
 16.                 local tsentrant_year = "tsentrant0`=`yearvalue'+1'"
 17.         }
 18.         else{
 19.                 if `yearvalue' == 99 {
 20.                 local gzentrant_year = "gzentrant00"
 21.                 local gxentrant_year = "gxentrant00"
 22.                 local vsentrant_year = "vsentrant00"
 23.                 local tsentrant_year = "tsentrant00"
 24.                 }
 25.         else {
 26.                 local gzentrant_year = "gzentrant`=`yearvalue'+1'"
 27.                 local gxentrant_year = "gxentrant`=`yearvalue'+1'"
 28.                 local vsentrant_year = "vsentrant`=`yearvalue'+1'"
 29.                 local tsentrant_year = "tsentrant`=`yearvalue'+1'"
 30.         }
 31.         }
 32.         
.         
.         *For Ins 1 & 2: check whether the variable names exist (whether we have those years
> ' or not)
.         capture ds `czgrad_year' `gzgrad_year' `gzentrant_year' `gxentrant_year'
 33.         if _rc == 0 {
 34.                 *generate/replace the instrument
.                 capture ds ins1_secgen_entrant_relative ins2_highedu_entrant_relative
 35.                 if _rc!=0 {
 36.                         qui gen ins1_secgen_entrant_relative = `gzentrant_year'/`czgrad_
> year' if _n == `i'
 37.                         qui gen ins2_highedu_entrant_relative = `gxentrant_year'/`gzgrad
> _year' if _n == `i'
 38.                 
.                 }
 39.                 else {
 40.                         qui replace ins1_secgen_entrant_relative = `gzentrant_year'/`czg
> rad_year' if _n == `i'
 41.                         qui replace ins2_highedu_entrant_relative = `gxentrant_year'/`gz
> grad_year' if _n == `i'
 42.                 }
 43.         }
 44.         
.         *For Ins 3
.         capture ds `czgrad_year' `vsentrant_year'
 45.         if _rc == 0 {
 46.                 *generate/replace the instrument
.                 capture ds ins3_vs_entrant_relative
 47.                 if _rc!=0 {
 48.                         qui gen ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_year
> ' if _n == `i'
 49.                 }
 50.                 else {
 51.                         qui replace ins3_vs_entrant_relative = `vsentrant_year'/`czgrad_
> year' if _n == `i'
 52.                 }
 53.         }
 54. }

. 
. 
. sum ins1_secgen_entrant_relative, d

                ins1_secgen_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%       .15625       .0699308
 5%     .1682079       .0699308
10%     .1885442       .0699308       Obs              12,056
25%     .2211083       .0699308       Sum of wgt.      12,056

50%     .3033619                      Mean           .3236294
                        Largest       Std. dev.      .1151896
75%     .4300829       .6448125
90%     .4801857       .6448125       Variance       .0132686
95%     .5088161       .6448125       Skewness       .3696383
99%     .5762522       .6448125       Kurtosis       1.967837

. sum ins2_highedu_entrant_relative, d

                ins2_highedu_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1447144       .1281053
 5%     .1651736       .1380375
10%        .2112       .1380375       Obs              12,056
25%     .2949015       .1380375       Sum of wgt.      12,056

50%     .5866208                      Mean           .5873466
                        Largest       Std. dev.      .3496799
75%     .8063707       2.985416
90%       .96183       2.985416       Variance        .122276
95%     1.052114       2.985416       Skewness       1.750181
99%     2.036869       2.985416       Kurtosis       10.40442

. sum ins3_vs_entrant_relative, d

                  ins3_vs_entrant_relative
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1185751       .0852398
 5%     .1373378       .0852398
10%     .1486554       .0852398       Obs              12,419
25%      .184019       .0852398       Sum of wgt.      12,419

50%      .234389                      Mean           .2488276
                        Largest       Std. dev.      .0852013
75%     .3009205       .6566039
90%     .3645212       .6566039       Variance       .0072593
95%     .4095488       .6566039       Skewness       .8011841
99%     .4754733       .6566039       Kurtosis         3.4377

. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: all characters numeric; province_code generated as float

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(34,491 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(448 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(68 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        709        2.03        2.03
         14 |      1,373        3.92        5.95
         15 |      1,282        3.66        9.61
         21 |      1,376        3.93       13.54
         32 |      2,939        8.40       21.94
         34 |      2,528        7.22       29.16
         37 |      2,640        7.54       36.70
         41 |      4,126       11.79       48.48
         42 |      2,913        8.32       56.81
         43 |      2,751        7.86       64.66
         44 |      2,578        7.36       72.03
         50 |      1,316        3.76       75.79
         51 |      2,849        8.14       83.93
         53 |      2,735        7.81       91.74
         62 |      2,892        8.26      100.00
------------+-----------------------------------
      Total |     35,007      100.00

. 
. *8) Birth Month cohort
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(3 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(7 missing values generated)

. gen d = 1 if t >= 0 & t != .
(18,408 missing values generated)

. replace d = 0 if t < 1
(18,448 real changes made)

. gen td = t * d
(7 missing values generated)

. 
. *9) Parent Indicators
. merge m:1 hhcode using "`folderpath'/`logname'.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            35,007  (_merge==3)
    -----------------------------------------

. *parent_secedu
. gen parent_secedu = 0 if (A02==1 & (inrange(H03_R1, 1, 3) | inrange(H03_R2, 1, 3))) | (A02=
> =2 & (inrange(H03_R3, 1, 3) | inrange(H03_R4, 1, 3)))
(28,206 missing values generated)

. replace parent_secedu = 0 if A02 ==3 & (headsecedu == 0 | spousesecedu == 0)
(9,445 real changes made)

. replace parent_secedu = 0 if (A02 == 2 & spouseparentsecedu == 0) | (A02 == 1 & headparents
> ecedu == 0)
(354 real changes made)

. replace parent_secedu=1 if (A02==1 & (inrange(H03_R1, 4, 9) | inrange(H03_R2, 4, 9)))|(A02=
> =2 & (inrange(H03_R3, 4, 9) | inrange(H03_R4, 4, 9)))
(441 real changes made)

. replace parent_secedu = 1 if A02 ==3 & (headsecedu == 1 | spousesecedu == 1)
(1,775 real changes made)

. replace parent_secedu = 1 if (A02 == 2 & spouseparentsecedu == 1) | (A02 == 1 & headparents
> ecedu == 1)
(15 real changes made)

. tab parent_secedu

parent_sece |
         du |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,834       86.93       86.93
          1 |      2,231       13.07      100.00
------------+-----------------------------------
      Total |     17,065      100.00

.  *parent_highedu
. gen parent_highedu = 0 if (A02==1 & (inrange(H03_R1, 1, 6) | inrange(H03_R2, 1, 6))) | (A02
> ==2 & (inrange(H03_R3, 1, 6) | inrange(H03_R4, 1, 6)))
(28,161 missing values generated)

. replace parent_highedu = 0 if A02 == 3 & (headhighedu == 0 | spousehighedu == 0)
(9,786 real changes made)

. replace parent_highedu = 0 if (A02 == 2 & spouseparenthighedu == 0) | (A02 == 1 & headparen
> thighedu == 0)
(358 real changes made)

. replace parent_highedu=1 if (A02==1 & (inrange(H03_R1, 7, 9) | inrange(H03_R2, 7, 9)))|(A02
> ==2 & (inrange(H03_R3, 7, 9) | inrange(H03_R4, 7, 9)))
(16 real changes made)

. replace parent_highedu = 1 if A02 == 3 & (headhighedu == 1 | spousehighedu == 1)
(269 real changes made)

. replace parent_highedu = 1 if (A02 == 2 & spouseparenthighedu == 1) | (A02 == 1 & headparen
> thighedu == 1)
(2 real changes made)

. tab parent_highedu

parent_high |
        edu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,778       98.32       98.32
          1 |        287        1.68      100.00
------------+-----------------------------------
      Total |     17,065      100.00

. *parent_partymember
. gen parent_partymember = 0 if ((A02==1 & (inrange(H07_R1, 2, 4) | inrange(H07_R2, 2, 4))) |
>  (A02==2 & (inrange(H07_R3, 2, 4) | inrange(H07_R4, 2, 4))))
(28,178 missing values generated)

. replace parent_partymember = 0 if A02 == 3 & (headparty == 0 | spouseparty == 0)
(9,759 real changes made)

. replace parent_partymember = 0 if (A02 == 2 & spouseparentparty == 0) | (A02 == 1 & headpar
> entparty == 0)
(339 real changes made)

. replace parent_partymember=1 if (A02==1 & (H07_R1 == 1 | H07_R2 == 1)) | (A02==2 & (H07_R3 
> == 1 | H07_R4 == 1))
(634 real changes made)

. replace parent_partymember = 1 if A02 == 3 & (headparty == 1 | spouseparty == 1)
(1,264 real changes made)

. replace parent_partymember = 1 if (A02 == 2 & spouseparentparty == 1) | (A02 == 1 & headpar
> entparty == 1)
(29 real changes made)

. tab parent_partymember

parent_part |
    ymember |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,165       88.73       88.73
          1 |      1,927       11.27      100.00
------------+-----------------------------------
      Total |     17,092      100.00

. 
. *10) GaoKao Indicator
. gen TakeGaoKao = 1 if A15_1 == 1
(32,059 missing values generated)

. replace TakeGaoKao = 0 if A15_1 == 2
(26,078 real changes made)

. tab TakeGaoKao

 TakeGaoKao |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,078       89.84       89.84
          1 |      2,948       10.16      100.00
------------+-----------------------------------
      Total |     29,026      100.00

. 
. *11) Key School Indicator
. 
. gen Keyschool = 0 if A14 != .

. replace Keyschool = 1 if inrange(A14, 1, 3)
(2,217 real changes made)

. 
. *12) Birth Year Dums
. keep if inrange(birthyear, 1971, 1992)
(24,572 observations deleted)

. tab birthyear, gen(birthyeardum)

  birthyear |      Freq.     Percent        Cum.
------------+-----------------------------------
       1971 |        658        6.31        6.31
       1972 |        546        5.23       11.54
       1973 |        587        5.63       17.16
       1974 |        516        4.94       22.11
       1975 |        451        4.32       26.43
       1976 |        416        3.99       30.42
       1977 |        388        3.72       34.14
       1978 |        358        3.43       37.57
       1979 |        357        3.42       40.99
       1980 |        375        3.59       44.58
       1981 |        367        3.52       48.10
       1982 |        408        3.91       52.01
       1983 |        345        3.31       55.31
       1984 |        382        3.66       58.97
       1985 |        408        3.91       62.88
       1986 |        510        4.89       67.77
       1987 |        595        5.70       73.47
       1988 |        551        5.28       78.75
       1989 |        568        5.44       84.20
       1990 |        627        6.01       90.21
       1991 |        536        5.14       95.34
       1992 |        486        4.66      100.00
------------+-----------------------------------
      Total |     10,435      100.00

. 
. *Step Two: Regressions
. 
. *Formulate excel sheet
. putexcel set "`xlsxpath'"

. putexcel C16:D16 E16:F16 G16:H16, merge hcenter
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. putexcel A17:B17 A19:A20 A21:A22 A23:A24 A25:A26 A27:A28, merge left
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. putexcel A17="Sum Statistics of" B18="Total Obs" A19="Keyschool" A21="parent_secedu" A23="p
> arent_highedu" A25="parent_partymember" A27="TakeGaoKao"
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. putexcel B19="mean" B21="mean" B23="mean" B25="mean" B27="mean" B20="obs" B22="obs" B24="ob
> s" B26="obs" B28="obs"
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. putexcel A16="Rural 1979" C16="SecVoc Track" E16="SecGen Track" G16="SecJun Track"
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. putexcel C17="t<0" D17="t>=0" E17="t<0" F17="t>=0" G17="t<0" H17="t>=0"
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. 
. 
. qui selmlog voc_log_monthlyearning male  highvocedu highgenedu adultedu birthyeardum2-birth
> yeardum22 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educ
> at=male  ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relativ
> e) dmf(2) showmlogit gen(m)

. qui regress voc_log_monthlyearning male  highvocedu highgenedu adultedu m1 m2 m3 birthyeard
> um2-birthyeardum22 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. drop m1 m2 m3

. 
. sum Keyschool parent_secedu parent_highedu parent_partymember TakeGaoKao if e(sample) & t <
>  0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   Keyschool |        114    .0175439    .1318659          0          1
parent_sec~u |        103    .1553398    .3639996          0          1
parent_hig~u |        103    .0194175    .1386618          0          1
parent_par~r |        103    .2621359    .4419468          0          1
  TakeGaoKao |        113    .1061947     .309459          0          1

. sum Keyschool parent_secedu parent_highedu parent_partymember TakeGaoKao if e(sample) & t >
> = 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   Keyschool |        518    .0366795    .1881555          0          1
parent_sec~u |        425    .2164706     .412324          0          1
parent_hig~u |        425    .0094118    .0966704          0          1
parent_par~r |        424    .1509434    .3584166          0          1
  TakeGaoKao |        495    .2363636    .4252778          0          1

. 
. qui sum monthlyearning if e(sample) & t < 0

. putexcel C18=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum monthlyearning if e(sample) & t >= 0

. putexcel D18=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum Keyschool if e(sample) & t < 0

. putexcel C19=`r(mean)' C20=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum Keyschool if e(sample) & t >= 0

. putexcel D19=`r(mean)' D20=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_secedu if e(sample) & t < 0

. putexcel C21=`r(mean)' C22=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_secedu if e(sample) & t >= 0

. putexcel D21=`r(mean)' D22=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_highedu if e(sample) & t < 0

. putexcel C23=`r(mean)' C24=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_highedu if e(sample) & t >= 0

. putexcel D23=`r(mean)' D24=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_partymember if e(sample) & t < 0

. putexcel C25=`r(mean)' C26=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_partymember if e(sample) & t >= 0

. putexcel D25=`r(mean)' D26=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum TakeGaoKao if e(sample) & t < 0

. putexcel C27=`r(mean)' C28=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum TakeGaoKao if e(sample) & t >= 0

. putexcel D27=`r(mean)' D28=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. 
. qui selmlog gen_log_monthlyearning male  highvocedu highgenedu adultedu birthyeardum2-birth
> yeardum22 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educ
> at=male  ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relativ
> e) dmf(2) showmlogit gen(m)

. qui regress gen_log_monthlyearning male  highvocedu highgenedu adultedu m1 m2 m3 birthyeard
> um2-birthyeardum22 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. drop m1 m2 m3

. 
. sum Keyschool parent_secedu parent_highedu parent_partymember TakeGaoKao if e(sample) & t <
>  0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   Keyschool |        209    .2583732    .4387912          0          1
parent_sec~u |        190    .1526316    .3605822          0          1
parent_hig~u |        190    .0105263    .1023261          0          1
parent_par~r |        192    .2083333    .4071782          0          1
  TakeGaoKao |        209    .4497608     .498664          0          1

. sum Keyschool parent_secedu parent_highedu parent_partymember TakeGaoKao if e(sample) & t >
> = 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   Keyschool |      1,006    .4284294    .4950973          0          1
parent_sec~u |        794    .2921914    .4550565          0          1
parent_hig~u |        794    .0201511    .1406057          0          1
parent_par~r |        794    .1851385    .3886547          0          1
  TakeGaoKao |      1,000        .726    .4462321          0          1

. 
. qui sum monthlyearning if e(sample) & t < 0

. putexcel E18=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum monthlyearning if e(sample) & t >= 0

. putexcel F18=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum Keyschool if e(sample) & t < 0

. putexcel E19=`r(mean)' E20=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum Keyschool if e(sample) & t >= 0

. putexcel F19=`r(mean)' F20=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_secedu if e(sample) & t < 0

. putexcel E21=`r(mean)' E22=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_secedu if e(sample) & t >= 0

. putexcel F21=`r(mean)' F22=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_highedu if e(sample) & t < 0

. putexcel E23=`r(mean)' E24=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_highedu if e(sample) & t >= 0

. putexcel F23=`r(mean)' F24=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_partymember if e(sample) & t < 0

. putexcel E25=`r(mean)' E26=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_partymember if e(sample) & t >= 0

. putexcel F25=`r(mean)' F26=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum TakeGaoKao if e(sample) & t < 0

. putexcel E27=`r(mean)' E28=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum TakeGaoKao if e(sample) & t >= 0

. putexcel F27=`r(mean)' F28=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. 
. qui selmlog jun_log_monthlyearning male  highvocedu highgenedu adultedu birthyeardum1-birth
> yeardum22 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667), sel(educ
> at=male  ins1_secgen_entrant_relative ins2_highedu_entrant_relative ins3_vs_entrant_relativ
> e) dmf(2) showmlogit gen(m)

. qui regress jun_log_monthlyearning male  highvocedu highgenedu adultedu m1 m2 m3 birthyeard
> um1-birthyeardum22 if inrange(birthyear, 1971, 1992) & inrange(monthlyearning, 200, 16667)

. drop m1 m2 m3

. 
. sum Keyschool parent_secedu parent_highedu parent_partymember TakeGaoKao if e(sample) & t <
>  0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   Keyschool |      1,499    .0166778    .1281038          0          1
parent_sec~u |      1,330     .062406    .2419825          0          1
parent_hig~u |      1,330           0           0          0          0
parent_par~r |      1,329    .1301731    .3366204          0          1
  TakeGaoKao |      1,298    .0038521    .0619693          0          1

. sum Keyschool parent_secedu parent_highedu parent_partymember TakeGaoKao if e(sample) & t >
> = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   Keyschool |      2,461    .0166599    .1280195          0          1
parent_sec~u |      1,920      .13125    .3377615          0          1
parent_hig~u |      1,920     .003125    .0558288          0          1
parent_par~r |      1,925    .1137662    .3176096          0          1
  TakeGaoKao |      2,022    .0024728     .049678          0          1

. 
. qui sum monthlyearning if e(sample) & t < 0

. putexcel G18=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum monthlyearning if e(sample) & t >= 0

. putexcel H18=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum Keyschool if e(sample) & t < 0

. putexcel G19=`r(mean)' G20=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum Keyschool if e(sample) & t >= 0

. putexcel H19=`r(mean)' H20=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_secedu if e(sample) & t < 0

. putexcel G21=`r(mean)' G22=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_secedu if e(sample) & t >= 0

. putexcel H21=`r(mean)' H22=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_highedu if e(sample) & t < 0

. putexcel G23=`r(mean)' G24=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_highedu if e(sample) & t >= 0

. putexcel H23=`r(mean)' H24=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_partymember if e(sample) & t < 0

. putexcel G25=`r(mean)' G26=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum parent_partymember if e(sample) & t >= 0

. putexcel H25=`r(mean)' H26=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum TakeGaoKao if e(sample) & t < 0

. putexcel G27=`r(mean)' G28=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. qui sum TakeGaoKao if e(sample) & t >= 0

. putexcel H27=`r(mean)' H28=`r(N)'
file /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/DID 1979.x
> lsx saved

. 
. putexcel save

. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Aiden/Indicator & DIff-in-diff/1979/Ru
> ral/Indicator DID Urban 1979.log
  log type:  text
 closed on:   8 Aug 2024, 13:51:50
---------------------------------------------------------------------------------------------
