---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male con
> trolled/Urban 1979 Highgen FuzzyOption Male controlled.log
  log type:  text
 opened on:   6 Aug 2024, 17:22:50

. use "`datapath'", clear

. 
. *Step One: Variables and Data Processing
. 
. *1) Monthly earning & it's ln value
. 
. gen annualearning = C05_1 if C05_1!=-99 & C05_1!=-88
(17,426 missing values generated)

. gen workmonths=C01_1 if C01_1!=-99
(79 missing values generated)

. gen monthlyearning = annualearning/workmonths
(17,471 missing values generated)

. gen log_monthlyearning = ln(monthlyearning)
(17,516 missing values generated)

. 
. *2) Sex (Male)
. 
. gen male=1 if A03==1
(18,084 missing values generated)

. replace male=0 if A03==2
(18,084 real changes made)

. 
. *3) Age & Exp
. 
. gen birthyear = A04_1 if A04_1!=-88 & A04_1!=-99

. gen age = 2018-birthyear

. gen agesqr = age*age

. 
. gen exp = age-A13_3-6 if A13_3>=0
(3,412 missing values generated)

. replace exp=0 if exp<0
(3,271 real changes made)

. gen expsqr = exp*exp
(3,412 missing values generated)

. 
. gen yearstart = C02 if C02!=-88 & C02!=-99
(17,464 missing values generated)

. gen tenure = 2018 - yearstart
(17,464 missing values generated)

. gen tenuresqr = tenure * tenure
(17,464 missing values generated)

. 
. *4) Secondary education (Sec Voc; Sec Gen; Sec Jun)
. 
. *Sec Voc
. *filter by secondary school types.
. gen secvocedu=1 if A14==5
(33,350 missing values generated)

. replace secvocedu =0 if A14!=5
(33,350 real changes made)

. *include who reported vocational secondary degrees
. replace secvocedu=1 if inrange(A13_1, 5, 6) & A13_2==1
(902 real changes made)

. *remove who had not finished secondary vocational education.
. replace secvocedu=0 if (inrange(A13_1,4,6) & A13_2>1) | A13_1<4
(188 real changes made)

. tab secvocedu

  secvocedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,636       90.01       90.01
          1 |      3,623        9.99      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec voc
. gen voc_log_monthlyearning = log_monthlyearning if secvocedu==1
(33,450 missing values generated)

. 
. *Sec Gen
. *filter by secondary school types.
. gen secgenedu = 1 if A14!=-99 & A14!=-88 & A14!=5
(22,075 missing values generated)

. replace secgenedu =0 if A14==-99 | A14==-88 | A14==5
(22,075 real changes made)

. *remove who had/have not finished secondary general schools.
. replace secgenedu =0 if (A13_1==4 & A13_2>1) | inrange(A13_1, 5, 6) | A13_1<4
(2,765 real changes made)

. tab secgenedu

  secgenedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,840       68.51       68.51
          1 |     11,419       31.49      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. *income for sec gen
. gen gen_log_monthlyearning = log_monthlyearning if secgenedu==1
(28,201 missing values generated)

. 
. *Only Sec Junior
. *filter by A13_1
. gen secjun = 1 if (A13_1 ==3 & A13_2 ==1) | (inrange(A13_1, 4, 6) & A13_2>1) 
(26,513 missing values generated)

. replace secjun = 0 if secjun!=1
(26,513 real changes made)

. tab secjun

     secjun |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,513       73.12       73.12
          1 |      9,746       26.88      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. gen jun_log_monthlyearning = log_monthlyearning if secjun==1
(30,659 missing values generated)

. 
. *Categotical variable of education
. gen educat=1 if secvocedu==1
(32,636 missing values generated)

. replace educat=2 if secgenedu==1
(11,419 real changes made)

. replace educat=3 if secjun==1
(9,746 real changes made)

. tab educat

     educat |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,623       14.62       14.62
          2 |     11,419       46.07       60.68
          3 |      9,746       39.32      100.00
------------+-----------------------------------
      Total |     24,788      100.00

. 
. *5) Higher education (High Voc; High Gen; Adult Edu; Higher Edu)
. 
. *Higher vocational education (full-time)
. gen highvocedu =1 if A13_1==7 & A13_2==1
(32,394 missing values generated)

. replace highvocedu=0 if highvocedu!=1
(32,394 real changes made)

. replace highvocedu=0 if A15_7==6
(959 real changes made)

. 
. *Higher general education (full-time)
. gen highgenedu =1 if (A13_1==8 & A13_2==1) | A13_1==9
(32,336 missing values generated)

. replace highgenedu =0 if highgenedu!=1
(32,336 real changes made)

. replace highgenedu=0 if A15_7==6
(567 real changes made)

. 
. *Adult continuing education
. gen adultedu = 1 if A15_7 == 6
(34,552 missing values generated)

. replace adultedu = 0 if A15_7!=6
(34,552 real changes made)

. replace adultedu = 0 if ((A13_1==7 | A13_1==8) & A13_2!=1) | A13_1<=6
(181 real changes made)

. tab adultedu

   adultedu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,733       95.79       95.79
          1 |      1,526        4.21      100.00
------------+-----------------------------------
      Total |     36,259      100.00

. 
. *higheredu (dummy variable of higher education)
. gen higheredu=1 if highvocedu==1 | highgenedu==1 | adultedu==1
(28,471 missing values generated)

. replace higheredu=0 if higheredu!=1
(28,471 real changes made)

. 
. *Track based Higheredu
. gen secvochighedu = secvocedu * higheredu

. gen secgenhighedu = secgenedu * higheredu

. gen secjunhighedu = secjun * higheredu

. 
. *6) Educational Instrucments; Omit here because we are using this RDD to estimate it locall
> y!!!
. 
. *7) Province fixed effect (Method: By the first two digits of household code)
. 
. destring hhcode, generate(province_code) force float
hhcode: contains nonnumeric characters; province_code generated as float
(2 missing values generated)

. replace province_code = floor(province_code/1000000000000) if province_code<100000000000000
(35,938 real changes made)

. replace province_code = floor(province_code/10000000000000) if province_code>=1000000000000
> 00 & province_code<1000000000000000
(319 real changes made)

. replace province_code = floor(province_code/1000000000000000) if province_code>=10000000000
> 000000
(0 real changes made)

. tab province_code, gen(provincedum)

     hhcode |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |      2,836        7.82        7.82
         14 |      2,555        7.05       14.87
         15 |      1,760        4.85       19.72
         21 |      2,218        6.12       25.84
         32 |      2,943        8.12       33.96
         34 |      2,254        6.22       40.17
         37 |      2,396        6.61       46.78
         41 |      2,959        8.16       54.94
         42 |      2,447        6.75       61.69
         43 |      2,289        6.31       68.01
         44 |      4,331       11.95       79.95
         50 |      2,115        5.83       85.78
         51 |      2,796        7.71       93.50
         53 |      1,226        3.38       96.88
         62 |      1,132        3.12      100.00
------------+-----------------------------------
      Total |     36,257      100.00

. 
. *8) Birth Month cohort & GaoKao_Treatment
. 
. gen birthmonth = A04_2 if A04_2!=-88 & A04_2!=-99
(13 missing values generated)

. gen t = birthmonth - 9 + 12 * (birthyear - 1979)
(13 missing values generated)

. gen d = 1 if t >= 1 & t != .
(18,431 missing values generated)

. replace d = 0 if t < 1
(18,418 real changes made)

. gen td = t * d
(13 missing values generated)

. 
. gen GaoKao_Treatment = 0 if A15_2<=1998 & A15_2!=-99 & A15_2!=-88
(33,372 missing values generated)

. replace GaoKao_Treatment = 1 if A15_2>=1999
(5,190 real changes made)

. 
. *Step Two: Regressions
. 
. *2_1) RDD Earning t
. 
. *2_1_1) rdrobust on earning, sheet 1, no province no omitting local variables
. 
. **2_1_1_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        931
-------------------+----------------------            BW type       =     Manual
     Number of obs |       491         440            Kernel        =    Uniform
Eff. Number of obs |       491         440            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0732     .04771   1.5341   0.125   -.020319      .166718
    Bias-corrected |  .02524     .04771   0.5289   0.597   -.068282      .118755
            Robust |  .02524     .07384   0.3418   0.733   -.119496       .16997
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8911      1.399   1.3518   0.176   -.850846      4.63298
    Bias-corrected |  2.8289      1.399   2.0221   0.043    .086965      5.57079
            Robust |  2.8289     2.1776   1.2991   0.194   -1.43911      7.09687
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", replace ctitle(no province no loc
> al adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2723
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1286        1437            Kernel        =    Uniform
Eff. Number of obs |      1286        1437            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02387     .02883   0.8282   0.408   -.032629      .080378
    Bias-corrected |  .04758     .02883   1.6505   0.099   -.008923      .104084
            Robust |  .04758     .04182   1.1378   0.255   -.034378      .129539
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.5739     4.2673   0.8375   0.402   -4.78988      11.9377
    Bias-corrected |  1.6495     4.2673   0.3865   0.699    -6.7143      10.0133
            Robust |  1.6495     6.1189   0.2696   0.787   -10.3433      13.6422
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16190
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8396        7794            Kernel        = Epanechnikov
Eff. Number of obs |      2670        2864            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    69.907      69.907
       BW bias (b) |   130.544     130.544
         rho (h/b) |     0.536       0.536
        Unique obs |       370         261

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01883     .02199   0.8562   0.392   -.024275      .061936
    Bias-corrected |  .00903     .02199   0.4104   0.682    -.03408      .052131
            Robust |  .00903     .02493   0.3620   0.717   -.039837      .057889
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   2.081     2.7637   0.7530   0.451   -3.33572      7.49782
    Bias-corrected |   2.954     2.7637   1.0689   0.285   -2.46277      8.37077
            Robust |   2.954     3.1276   0.9445   0.345   -3.17591      9.08392
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        625
-------------------+----------------------            BW type       =     Manual
     Number of obs |       319         306            Kernel        =    Uniform
Eff. Number of obs |       319         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0923     .06591   1.4005   0.161   -.036874      .221473
    Bias-corrected |  .08794     .06591   1.3344   0.182    -.04123      .217117
            Robust |  .08794     .09551   0.9208   0.357   -.099252      .275139
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .82322     1.1339   0.7260   0.468   -1.39923      3.04566
    Bias-corrected |  1.0953     1.1339   0.9660   0.334    -1.1271      3.31778
            Robust |  1.0953     1.7171   0.6379   0.524   -2.27009      4.46076
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1840
-------------------+----------------------            BW type       =     Manual
     Number of obs |       832        1008            Kernel        =    Uniform
Eff. Number of obs |       832        1008            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03065      .0405   0.7568   0.449   -.048729      .110037
    Bias-corrected |  .04341      .0405   1.0718   0.284   -.035974      .122792
            Robust |  .04341     .05834   0.7441   0.457   -.070933      .157751
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.2962     5.4834   0.7835   0.433   -6.45102      15.0435
    Bias-corrected |   .7731     5.4834   0.1410   0.888   -9.97414      11.5203
            Robust |   .7731     7.8481   0.0985   0.922    -14.609      16.1552
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10681
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4668        6013            Kernel        = Epanechnikov
Eff. Number of obs |      1477        1846            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    61.962      61.962
       BW bias (b) |   116.714     116.714
         rho (h/b) |     0.531       0.531
        Unique obs |       320         248

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01905       .033   0.5771   0.564    -.04564      .083737
    Bias-corrected |  .00521       .033   0.1580   0.874   -.059474      .069903
            Robust |  .00521     .03722   0.1401   0.889   -.067731       .07816
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.9106     6.5851   0.5939   0.553   -8.99591      16.8171
    Bias-corrected |  6.4608     6.5851   0.9811   0.327    -6.4457      19.3673
            Robust |  6.4608     7.4201   0.8707   0.384   -8.08235       21.004
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        206
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106         100            Kernel        =    Uniform
Eff. Number of obs |       106         100            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01259     .03364   0.3742   0.708   -.053348      .078529
    Bias-corrected | -.01865     .03364   -0.5543  0.579   -.084586       .04729
            Robust | -.01865     .02574   -0.7245  0.469   -.069096        .0318
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -6.4568     23.091   -0.2796  0.780   -51.7142      38.8006
    Bias-corrected |  -23.23     23.091   -1.0060  0.314   -68.4874      22.0273
            Robust |  -23.23     25.887   -0.8974  0.370   -73.9675      27.5074
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        633
-------------------+----------------------            BW type       =     Manual
     Number of obs |       304         329            Kernel        =    Uniform
Eff. Number of obs |       304         329            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01871      .0241   0.7763   0.438   -.028526      .065943
    Bias-corrected |  .02159      .0241   0.8959   0.370   -.025643      .068825
            Robust |  .02159      .0373   0.5788   0.563   -.051524      .094706
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.5071      11.78   0.7222   0.470   -14.5816      31.5958
    Bias-corrected |  1.9995      11.78   0.1697   0.865   -21.0892      25.0882
            Robust |  1.9995     18.145   0.1102   0.912   -33.5641      37.5632
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2768
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1164        1604            Kernel        = Epanechnikov
Eff. Number of obs |       595         619            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    72.167      72.167
       BW bias (b) |   128.801     128.801
         rho (h/b) |     0.560       0.560
        Unique obs |       236         243

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00221       .017   0.1299   0.897   -.031108      .035526
    Bias-corrected |  -.0001       .017   -0.0060  0.995   -.033418      .033215
            Robust |  -.0001     .01974   -0.0051  0.996   -.038798      .038594
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  57.299     439.34   0.1304   0.896   -803.785      918.383
    Bias-corrected |  122.22     439.34   0.2782   0.781   -738.864      983.303
            Robust |  122.22     510.36   0.2395   0.811   -878.076      1122.51
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. **2_1_1_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12539     .08744   1.4340   0.152   -.045995      .296775
    Bias-corrected |  .12262     .08744   1.4023   0.161   -.048765      .294006
            Robust |  .12262     .12791   0.9587   0.338   -.128069       .37331
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1298     1.0834   1.0428   0.297   -.993658      3.25328
    Bias-corrected |  1.4462     1.0834   1.3348   0.182   -.677296      3.56964
            Robust |  1.4462     1.6255   0.8897   0.374   -1.73984      4.63218
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1207
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         679            Kernel        =    Uniform
Eff. Number of obs |       528         679            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02975     .05478   0.5431   0.587   -.077611      .137109
    Bias-corrected |  .07098     .05478   1.2959   0.195   -.036377      .178344
            Robust |  .07098     .07818   0.9080   0.364   -.082246      .224213
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   3.912     6.9386   0.5638   0.573   -9.68747      17.5115
    Bias-corrected | -2.3373     6.9386   -0.3369  0.736   -15.9368      11.2621
            Robust | -2.3373     9.8084   -0.2383  0.812   -21.5614      16.8867
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7913
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3504        4409            Kernel        = Epanechnikov
Eff. Number of obs |      1253        1713            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    78.612      78.612
       BW bias (b) |   132.733     132.733
         rho (h/b) |     0.592       0.592
        Unique obs |       315         237

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .04482     .03971   1.1287   0.259   -.033004      .122639
    Bias-corrected |  .02975     .03971   0.7494   0.454   -.048067      .107576
            Robust |  .02975     .04618   0.6444   0.519   -.060748      .120258
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .74251     1.3319   0.5575   0.577   -1.86799        3.353
    Bias-corrected |  .65758     1.3319   0.4937   0.622   -1.95291      3.26808
            Robust |  .65758     1.5466   0.4252   0.671   -2.37374       3.6889
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 1 results.xls", append ctitle(no province no loca
> l adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 1 results.xls
dir : seeout

. 
. *2_1_2) rdrobust on earning, sheet 2, province-clustered no omitting local variables
. 
. **2_1_2_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_
> code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        931
-------------------+----------------------            BW type       =     Manual
     Number of obs |       491         440            Kernel        =    Uniform
Eff. Number of obs |       491         440            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0732      .0606   1.2079   0.227   -.045575      .191973
    Bias-corrected |  .02524      .0606   0.4164   0.677   -.093538      .144011
            Robust |  .02524     .08563   0.2947   0.768   -.142604      .193078
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.8911     1.5936   1.1867   0.235   -1.23233      5.01447
    Bias-corrected |  2.8289     1.5936   1.7751   0.076   -.294521      5.95228
            Robust |  2.8289     2.5588   1.1056   0.269   -2.18619      7.84395
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", replace ctitle(province-clustered
>  no local adjustment, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_
> code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2723
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1286        1437            Kernel        =    Uniform
Eff. Number of obs |      1286        1437            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02387     .04486   0.5322   0.595   -.064048      .111797
    Bias-corrected |  .04758     .04486   1.0607   0.289   -.040342      .135503
            Robust |  .04758     .04998   0.9521   0.341   -.050369       .14553
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.5739      6.422   0.5565   0.578   -9.01302      16.1608
    Bias-corrected |  1.6495      6.422   0.2568   0.797   -10.9374      14.2364
            Robust |  1.6495     7.1718   0.2300   0.818   -12.4069      15.7059
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat != ., covs(ma
> le) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16190
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8396        7794            Kernel        = Epanechnikov
Eff. Number of obs |      3228        3413            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    82.920      82.920
       BW bias (b) |   131.046     131.046
         rho (h/b) |     0.633       0.633
        Unique obs |       370         261
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02656     .03283   0.8092   0.418   -.037775      .090903
    Bias-corrected |   .0126     .03283   0.3837   0.701   -.051743      .076934
            Robust |   .0126     .03424   0.3679   0.713   -.054508      .079699
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.6032     2.5727   0.6232   0.533   -3.43918      6.64557
    Bias-corrected |  2.2328     2.5727   0.8679   0.385   -2.80955      7.27521
            Robust |  2.2328     2.6381   0.8464   0.397   -2.93768      7.40333
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnclust
> er province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        625
-------------------+----------------------            BW type       =     Manual
     Number of obs |       319         306            Kernel        =    Uniform
Eff. Number of obs |       319         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0923     .08136   1.1345   0.257   -.067159      .251758
    Bias-corrected |  .08794     .08136   1.0809   0.280   -.071515      .247402
            Robust |  .08794     .11079   0.7938   0.427   -.129202      .305088
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .82322     1.4267   0.5770   0.564   -1.97315      3.61958
    Bias-corrected |  1.0953     1.4267   0.7677   0.443   -1.70102       3.8917
            Robust |  1.0953     2.1994   0.4980   0.618   -3.21547      5.40615
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnclust
> er province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1840
-------------------+----------------------            BW type       =     Manual
     Number of obs |       832        1008            Kernel        =    Uniform
Eff. Number of obs |       832        1008            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03065      .0581   0.5276   0.598   -.083212       .14452
    Bias-corrected |  .04341      .0581   0.7472   0.455   -.070457      .157275
            Robust |  .04341     .06403   0.6780   0.498   -.082083      .168901
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.2962     7.9794   0.5384   0.590   -11.3431      19.9355
    Bias-corrected |   .7731     7.9794   0.0969   0.923   -14.8662      16.4124
            Robust |   .7731     8.5414   0.0905   0.928   -15.9678       17.514
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & (educat==1 | educat=
> =2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_
> code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10681
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4668        6013            Kernel        = Epanechnikov
Eff. Number of obs |      1932        2425            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    80.103      80.103
       BW bias (b) |   123.743     123.743
         rho (h/b) |     0.647       0.647
        Unique obs |       320         248
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03307     .04112   0.8043   0.421   -.047515      .113654
    Bias-corrected |  .01389     .04112   0.3379   0.735   -.066693      .094476
            Robust |  .01389     .04416   0.3146   0.753   -.072654      .100438
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   1.815      2.867   0.6331   0.527   -3.80417       7.4341
    Bias-corrected |  2.6288      2.867   0.9169   0.359   -2.99034      8.24793
            Robust |  2.6288      2.976   0.8833   0.377   -3.20406      8.46165
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_c
> ode)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        206
-------------------+----------------------            BW type       =     Manual
     Number of obs |       106         100            Kernel        =    Uniform
Eff. Number of obs |       106         100            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01259     .03203   0.3931   0.694   -.050179       .07536
    Bias-corrected | -.01865     .03203   -0.5823  0.560   -.081417      .044121
            Robust | -.01865      .0275   -0.6781  0.498   -.072551      .035256
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -6.4568     23.944   -0.2697  0.787   -53.3857      40.4721
    Bias-corrected |  -23.23     23.944   -0.9702  0.332   -70.1589      23.6989
            Robust |  -23.23     29.335   -0.7919  0.428   -80.7264      34.2663
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_c
> ode)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        633
-------------------+----------------------            BW type       =     Manual
     Number of obs |       304         329            Kernel        =    Uniform
Eff. Number of obs |       304         329            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01871     .02325   0.8048   0.421   -.026853       .06427
    Bias-corrected |  .02159     .02325   0.9288   0.353   -.023971      .067153
            Robust |  .02159     .03504   0.6161   0.538   -.047093      .090275
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.5071     12.721   0.6688   0.504   -16.4248       33.439
    Bias-corrected |  1.9995     12.721   0.1572   0.875   -22.9324      26.9314
            Robust |  1.9995     15.843   0.1262   0.900   -29.0529      33.0519
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==1, covs(mal
> e) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2768
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1164        1604            Kernel        = Epanechnikov
Eff. Number of obs |       623         636            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    75.602      75.602
       BW bias (b) |   125.419     125.419
         rho (h/b) |     0.603       0.603
        Unique obs |       236         243
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00241     .01695   0.1420   0.887    -.03082      .035634
    Bias-corrected | -.00066     .01695   -0.0388  0.969   -.033885      .032569
            Robust | -.00066     .01972   -0.0334  0.973   -.039299      .037983
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  49.248     344.23   0.1431   0.886   -625.438      723.934
    Bias-corrected |  118.14     344.23   0.3432   0.731   -556.542      792.831
            Robust |  118.14     396.87   0.2977   0.766   -659.713      896.002
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. **2_1_2_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if inrange(t, -12, 11) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nncluster province_c
> ode)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        419
-------------------+----------------------            BW type       =     Manual
     Number of obs |       213         206            Kernel        =    Uniform
Eff. Number of obs |       213         206            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .12539     .10205   1.2287   0.219   -.074624      .325404
    Bias-corrected |  .12262     .10205   1.2016   0.230   -.077394      .322635
            Robust |  .12262     .14197   0.8637   0.388    -.15563      .400871
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1298     .98036   1.1524   0.249   -.791662      3.05128
    Bias-corrected |  1.4462     .98036   1.4751   0.140     -.4753      3.36764
            Robust |  1.4462      1.772   0.8161   0.414   -2.02684      4.91919
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if inrange(t, -36, 35) & inrange(monthlyearning, 250, 25000) 
> & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nncluster province_c
> ode)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1207
-------------------+----------------------            BW type       =     Manual
     Number of obs |       528         679            Kernel        =    Uniform
Eff. Number of obs |       528         679            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02975     .07143   0.4165   0.677   -.110254      .169752
    Bias-corrected |  .07098     .07143   0.9937   0.320    -.06902      .210986
            Robust |  .07098     .08351   0.8500   0.395   -.092698      .234665
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   3.912     8.8381   0.4426   0.658   -13.4103      21.2343
    Bias-corrected | -2.3373     8.8381   -0.2645  0.791   -19.6597       14.985
            Robust | -2.3373     10.161   -0.2300  0.818   -22.2533      17.5786
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if inrange(monthlyearning, 250, 25000) & educat ==2, covs(mal
> e) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7913
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3504        4409            Kernel        = Epanechnikov
Eff. Number of obs |      1440        2003            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    88.465      88.465
       BW bias (b) |   122.989     122.989
         rho (h/b) |     0.719       0.719
        Unique obs |       315         237
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .05836     .05265   1.1085   0.268   -.044831      .161547
    Bias-corrected |  .03407     .05265   0.6471   0.518   -.069121      .137257
            Robust |  .03407      .0577   0.5904   0.555   -.079029      .147165
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .71416     1.4251   0.5011   0.616   -2.07904      3.50737
    Bias-corrected |  .66488     1.4251   0.4665   0.641   -2.12832      3.45809
            Robust |  .66488     1.4235   0.4671   0.640   -2.12512      3.45489
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 2 results.xls", append ctitle(province-clustered 
> no local adjustment, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 2 results.xls
dir : seeout

. 
. *2_1_3) rdrobust on earning, sheet 3, no province no Aug-Sep
. 
. **2_1_3_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        828
-------------------+----------------------            BW type       =     Manual
     Number of obs |       447         381            Kernel        =    Uniform
Eff. Number of obs |       447         381            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0806     .05625   1.4330   0.152   -.029641      .190849
    Bias-corrected |  .02687     .05625   0.4776   0.633   -.083379      .137111
            Robust |  .02687     .10412   0.2580   0.796    -.17721      .230942
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0001     1.2343   0.8102   0.418   -1.41914      3.41938
    Bias-corrected | -.17181     1.2343   -0.1392  0.889   -2.59107      2.24745
            Robust | -.17181     2.2672   -0.0758  0.940   -4.61548      4.27186
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", replace ctitle(no province no Aug
> -Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2620
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1242        1378            Kernel        =    Uniform
Eff. Number of obs |      1242        1378            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01727     .03062   0.5640   0.573   -.042746      .077284
    Bias-corrected |  .04632     .03062   1.5128   0.130   -.013693      .106337
            Robust |  .04632     .04726   0.9801   0.327   -.046312      .138957
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.3295      5.964   0.5583   0.577   -8.35966      15.0186
    Bias-corrected | -1.2584      5.964   -0.2110  0.833   -12.9476      10.4307
            Robust | -1.2584     9.1519   -0.1375  0.891   -19.1958       16.679
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16087
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8352        7735            Kernel        = Epanechnikov
Eff. Number of obs |      2163        2344            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.107      58.107
       BW bias (b) |   116.475     116.475
         rho (h/b) |     0.499       0.499
        Unique obs |       369         260

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00512     .02508   0.2043   0.838   -.044037      .054284
    Bias-corrected | -.00627     .02508   -0.2501  0.803   -.055433      .042889
            Robust | -.00627     .02816   -0.2227  0.824   -.061466      .048921
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.6462     22.206   0.2092   0.834   -38.8759      48.1683
    Bias-corrected |  13.665     22.206   0.6154   0.538   -29.8573      57.1868
            Robust |  13.665     24.925   0.5482   0.584   -35.1864      62.5159
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09523     .08356   1.1397   0.254   -.068534      .258999
    Bias-corrected |  .12244     .08356   1.4653   0.143   -.041331      .286202
            Robust |  .12244     .14993   0.8166   0.414   -.171424      .416296
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.18505     1.4248   -0.1299  0.897   -2.97754      2.60745
    Bias-corrected | -1.2912     1.4248   -0.9062  0.365   -4.08367      1.50132
            Robust | -1.2912     2.5594   -0.5045  0.614   -6.30758      3.72524
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1759
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         963            Kernel        =    Uniform
Eff. Number of obs |       796         963            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02052     .04406   0.4657   0.641   -.065833      .106867
    Bias-corrected |  .02828     .04406   0.6418   0.521   -.058073      .114628
            Robust |  .02828     .06962   0.4062   0.685   -.108168      .164724
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  5.5427     11.504   0.4818   0.630   -17.0039      28.0894
    Bias-corrected | -1.5585     11.504   -0.1355  0.892   -24.1051      20.9882
            Robust | -1.5585     18.148   -0.0859  0.932   -37.1287      34.0117
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10600
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4632        5968            Kernel        = Epanechnikov
Eff. Number of obs |      1325        1641            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.434      57.434
       BW bias (b) |   115.007     115.007
         rho (h/b) |     0.499       0.499
        Unique obs |       319         247

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00406     .03632   0.1118   0.911   -.067126      .075248
    Bias-corrected | -.01145     .03632   -0.3153  0.753   -.082638      .059736
            Robust | -.01145     .04084   -0.2804  0.779   -.091487      .068584
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  14.749     128.93   0.1144   0.909    -237.94      267.437
    Bias-corrected |  68.807     128.93   0.5337   0.594   -183.882      321.495
            Robust |  68.807     144.94   0.4747   0.635   -215.278      352.891
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03373     .05842   0.5773   0.564   -.080783      .148237
    Bias-corrected | -.05245     .05842   -0.8977  0.369   -.166957      .062064
            Robust | -.05245     .08117   -0.6462  0.518   -.211527      .106634
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.8499     8.3983   -0.3393  0.734   -19.3103      13.6105
    Bias-corrected | -12.181     8.3983   -1.4505  0.147   -28.6419       4.2789
            Robust | -12.181     14.131   -0.8620  0.389   -39.8782      15.5152
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        605
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         313            Kernel        =    Uniform
Eff. Number of obs |       292         313            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02269     .02907   0.7806   0.435   -.034277      .079656
    Bias-corrected |  .03712     .02907   1.2771   0.202   -.019847      .094086
            Robust |  .03712       .055   0.6749   0.500   -.070678      .144916
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   8.706     11.633   0.7484   0.454   -14.0933      31.5054
    Bias-corrected | -.77116     11.633   -0.0663  0.947   -23.5705      22.0282
            Robust | -.77116     21.551   -0.0358  0.971   -43.0112      41.4689
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2740
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1152        1588            Kernel        = Epanechnikov
Eff. Number of obs |       647         663            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    81.039      81.039
       BW bias (b) |   155.569     155.569
         rho (h/b) |     0.521       0.521
        Unique obs |       235         242

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |    .006     .01835   0.3267   0.744   -.029969      .041961
    Bias-corrected |  .00688     .01835   0.3750   0.708   -.029084      .042846
            Robust |  .00688     .02129   0.3231   0.747   -.034856      .048618
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  21.307     65.184   0.3269   0.744   -106.451      149.064
    Bias-corrected |  20.175     65.184   0.3095   0.757   -107.582      147.933
            Robust |  20.175     75.667   0.2666   0.790   -128.129       168.48
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. **2_1_3_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11329     .10952   1.0344   0.301   -.101368      .327958
    Bias-corrected |  .13109     .10952   1.1969   0.231   -.083573      .345753
            Robust |  .13109     .19536   0.6710   0.502   -.251808      .513987
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00527     1.4298   -0.0037  0.997   -2.80761      2.79707
    Bias-corrected | -1.3292     1.4298   -0.9297  0.353   -4.13155      1.47313
            Robust | -1.3292     2.5544   -0.5204  0.603   -6.33578      3.67736
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         650            Kernel        =    Uniform
Eff. Number of obs |       504         650            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00909     .05956   0.1527   0.879    -.10764      .125826
    Bias-corrected |  .04219     .05956   0.7083   0.479   -.074547      .158918
            Robust |  .04219     .09275   0.4548   0.649    -.13961      .223981
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.3903      46.79   0.1579   0.874   -84.3173       99.098
    Bias-corrected | -30.428      46.79   -0.6503  0.515   -122.136      61.2796
            Robust | -30.428     72.701   -0.4185  0.676   -172.919      112.063
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7860
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3480        4380            Kernel        = Epanechnikov
Eff. Number of obs |       865        1144            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.354      57.354
       BW bias (b) |   104.411     104.411
         rho (h/b) |     0.549       0.549
        Unique obs |       314         236

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00765     .04921   -0.1555  0.876   -.104093      .088791
    Bias-corrected | -.02662     .04921   -0.5409  0.589   -.123057      .069827
            Robust | -.02662     .05659   -0.4703  0.638   -.137538      .084308
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   1.227     10.775   0.1139   0.909   -19.8911       22.345
    Bias-corrected |  .81751     10.775   0.0759   0.940   -20.3005      21.9355
            Robust |  .81751      12.36   0.0661   0.947    -23.408       25.043
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 3 results.xls", append ctitle(no province no Aug-
> Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 3 results.xls
dir : seeout

. 
. *2_1_4) rdrobust on earning, sheet 4, province-clustered no Aug-Sep
. 
. **2_1_4_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nn
> cluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        828
-------------------+----------------------            BW type       =     Manual
     Number of obs |       447         381            Kernel        =    Uniform
Eff. Number of obs |       447         381            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0806     .06409   1.2576   0.209   -.045016      .206223
    Bias-corrected |  .02687     .06409   0.4192   0.675   -.098753      .152486
            Robust |  .02687      .0895   0.3002   0.764   -.148551      .202284
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.0001      1.268   0.7887   0.430   -1.48521      3.48545
    Bias-corrected | -.17181      1.268   -0.1355  0.892   -2.65714      2.31352
            Robust | -.17181     2.5345   -0.0678  0.946   -5.13935      4.79572
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", replace ctitle(province-clustered
>  no Aug-Sep, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nn
> cluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2620
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1242        1378            Kernel        =    Uniform
Eff. Number of obs |      1242        1378            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01727      .0465   0.3714   0.710   -.073867      .108405
    Bias-corrected |  .04632      .0465   0.9962   0.319   -.044814      .137458
            Robust |  .04632     .05291   0.8754   0.381   -.057388      .150033
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.3295     8.7053   0.3825   0.702   -13.7326      20.3916
    Bias-corrected | -1.2584     8.7053   -0.1446  0.885   -18.3205      15.8036
            Robust | -1.2584     10.924   -0.1152  0.908   -22.6683      20.1514
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster prov
> ince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      16087
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8352        7735            Kernel        = Epanechnikov
Eff. Number of obs |      2769        2932            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    72.531      72.531
       BW bias (b) |   122.306     122.306
         rho (h/b) |     0.593       0.593
        Unique obs |       369         260
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01604     .03306   0.4853   0.627   -.048747      .080827
    Bias-corrected |  .00059     .03306   0.0178   0.986   -.064199      .065375
            Robust |  .00059      .0345   0.0170   0.986   -.067026      .068202
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  1.1518     3.9133   0.2943   0.769    -6.5181       8.8217
    Bias-corrected |  1.6712     3.9133   0.4271   0.669   -5.99871      9.34109
            Robust |  1.6712     4.0471   0.4129   0.680   -6.26106      9.60344
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        544
-------------------+----------------------            BW type       =     Manual
     Number of obs |       283         261            Kernel        =    Uniform
Eff. Number of obs |       283         261            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .09523     .08532   1.1162   0.264   -.071984      .262448
    Bias-corrected |  .12244     .08532   1.4351   0.151    -.04478      .289652
            Robust |  .12244     .12312   0.9944   0.320   -.118875      .363746
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.18505     1.3531   -0.1368  0.891   -2.83702      2.46693
    Bias-corrected | -1.2912     1.3531   -0.9543  0.340   -3.94315       1.3608
            Robust | -1.2912     2.7354   -0.4720  0.637   -6.65248      4.07014
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1759
-------------------+----------------------            BW type       =     Manual
     Number of obs |       796         963            Kernel        =    Uniform
Eff. Number of obs |       796         963            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02052      .0608   0.3375   0.736   -.098642      .139676
    Bias-corrected |  .02828      .0608   0.4651   0.642   -.090881      .147437
            Robust |  .02828     .06914   0.4090   0.683   -.107237      .163793
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  5.5427     16.083   0.3446   0.730   -25.9794      37.0649
    Bias-corrected | -1.5585     16.083   -0.0969  0.923   -33.0807      29.9637
            Robust | -1.5585     19.333   -0.0806  0.936    -39.451       36.334
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nn
> cluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10600
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4632        5968            Kernel        = Epanechnikov
Eff. Number of obs |      1692        2077            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    71.005      71.005
       BW bias (b) |   121.640     121.640
         rho (h/b) |     0.584       0.584
        Unique obs |       319         247
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01792     .04321   0.4148   0.678   -.066759      .102604
    Bias-corrected | -.00157     .04321   -0.0363  0.971    -.08625      .083113
            Robust | -.00157     .04672   -0.0336  0.973   -.093135      .089999
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  2.3603     6.3994   0.3688   0.712   -10.1824       14.903
    Bias-corrected |  4.3012     6.3994   0.6721   0.502    -8.2415      16.8438
            Robust |  4.3012     6.7346   0.6387   0.523   -8.89836      17.5007
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        178
-------------------+----------------------            BW type       =     Manual
     Number of obs |        94          84            Kernel        =    Uniform
Eff. Number of obs |        94          84            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03373     .05378   0.6271   0.531   -.071677      .139131
    Bias-corrected | -.05245     .05378   -0.9752  0.329   -.157851      .052958
            Robust | -.05245      .0833   -0.6296  0.529   -.215709      .110816
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -2.8499     6.2351   -0.4571  0.648   -15.0705      9.37072
    Bias-corrected | -12.181     6.2351   -1.9537  0.051   -24.4021      .039111
            Robust | -12.181     11.976   -1.0171  0.309   -35.6544      11.2915
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        605
-------------------+----------------------            BW type       =     Manual
     Number of obs |       292         313            Kernel        =    Uniform
Eff. Number of obs |       292         313            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02269      .0276   0.8221   0.411   -.031402      .076781
    Bias-corrected |  .03712      .0276   1.3450   0.179   -.016972      .091211
            Robust |  .03712     .05143   0.7218   0.470   -.063677      .137916
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   8.706     11.685   0.7450   0.456   -14.1969       31.609
    Bias-corrected | -.77116     11.685   -0.0660  0.947   -23.6741      22.1318
            Robust | -.77116     19.973   -0.0386  0.969    -39.917      38.3747
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2740
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1152        1588            Kernel        = Epanechnikov
Eff. Number of obs |       682         703            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    86.215      86.215
       BW bias (b) |   154.827     154.827
         rho (h/b) |     0.557       0.557
        Unique obs |       235         242
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00868     .01855   0.4680   0.640    -.02768      .045045
    Bias-corrected |  .00962     .01855   0.5183   0.604   -.026747      .045978
            Robust |  .00962     .02202   0.4366   0.662   -.033546      .052776
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  13.733     30.261   0.4538   0.650   -45.5782      73.0437
    Bias-corrected |  13.795     30.261   0.4559   0.648   -45.5157      73.1062
            Robust |  13.795     35.248   0.3914   0.696   -55.2897      82.8803
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. **2_1_4_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        366
-------------------+----------------------            BW type       =     Manual
     Number of obs |       189         177            Kernel        =    Uniform
Eff. Number of obs |       189         177            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11329     .10477   1.0814   0.280   -.092046      .318635
    Bias-corrected |  .13109     .10477   1.2512   0.211   -.074251       .33643
            Robust |  .13109     .16762   0.7821   0.434   -.197442      .459621
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00527     1.2729   -0.0041  0.997   -2.50019      2.48965
    Bias-corrected | -1.3292     1.2729   -1.0442  0.296   -3.82413      1.16571
            Robust | -1.3292     2.6787   -0.4962  0.620   -6.57943        3.921
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1154
-------------------+----------------------            BW type       =     Manual
     Number of obs |       504         650            Kernel        =    Uniform
Eff. Number of obs |       504         650            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00909     .07609   0.1195   0.905   -.140039      .158225
    Bias-corrected |  .04219     .07609   0.5544   0.579   -.106946      .191317
            Robust |  .04219      .0952   0.4431   0.658   -.144396      .228767
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  7.3903     60.436   0.1223   0.903   -111.063      125.844
    Bias-corrected | -30.428     60.436   -0.5035  0.615   -148.881      88.0251
            Robust | -30.428     77.833   -0.3909  0.696   -182.977      122.121
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-2 | t>=1) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7860
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3480        4380            Kernel        = Epanechnikov
Eff. Number of obs |       930        1214            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    60.743      60.743
       BW bias (b) |    98.420      98.420
         rho (h/b) |     0.617       0.617
        Unique obs |       314         236
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00015     .06133   0.0024   0.998   -.120053       .12035
    Bias-corrected | -.02559     .06133   -0.4173  0.676   -.145792      .094611
            Robust | -.02559     .06859   -0.3731  0.709   -.160015      .108833
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -65.657      27229   -0.0024  0.998   -53433.3        53302
    Bias-corrected |  -11577      27229   -0.4252  0.671   -64944.8      41790.5
            Robust |  -11577      30460   -0.3801  0.704   -71276.9      48122.6
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 4 results.xls", append ctitle(province-clustered 
> no Aug-Sep, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 4 results.xls
dir : seeout

. 
. *2_1_5) rdrobust on earning, sheet 5, no province no July-Oct
. 
. **2_1_5_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        723
-------------------+----------------------            BW type       =     Manual
     Number of obs |       399         324            Kernel        =    Uniform
Eff. Number of obs |       399         324            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10939     .07108   1.5391   0.124   -.029913      .248702
    Bias-corrected |  .08316     .07108   1.1700   0.242   -.056149      .222466
            Robust |  .08316     .15926   0.5221   0.602   -.228992      .395309
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .81443     1.2017   0.6777   0.498   -1.54093      3.16979
    Bias-corrected | -2.0421     1.2017   -1.6993  0.089   -4.39743      .313295
            Robust | -2.0421     2.9094   -0.7019  0.483   -7.74447      3.66033
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", replace ctitle(no province no Jul
> y-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2515
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1194        1321            Kernel        =    Uniform
Eff. Number of obs |      1194        1321            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01522     .03319   0.4585   0.647   -.049831      .080263
    Bias-corrected |  .05537     .03319   1.6685   0.095   -.009674      .120419
            Robust |  .05537     .05574   0.9934   0.321   -.053878      .164622
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.6187     7.9197   0.4569   0.648   -11.9036      19.1409
    Bias-corrected | -4.6492     7.9197   -0.5870  0.557   -20.1715      10.8731
            Robust | -4.6492     13.325   -0.3489  0.727    -30.766      21.4676
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15982
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8304        7678            Kernel        = Epanechnikov
Eff. Number of obs |      1792        1961            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    50.741      50.741
       BW bias (b) |    96.958      96.958
         rho (h/b) |     0.523       0.523
        Unique obs |       368         259

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00186     .02869   -0.0648  0.948   -.058095      .054378
    Bias-corrected | -.01335     .02869   -0.4651  0.642   -.069582      .042891
            Robust | -.01335     .03315   -0.4026  0.687   -.078309      .051619
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -9.4719     156.01   -0.0607  0.952   -315.249      296.305
    Bias-corrected |   51.36     156.01   0.3292   0.742   -254.416      357.137
            Robust |   51.36     180.18   0.2851   0.776   -301.786      404.506
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08105     .10933   0.7413   0.459   -.133241      .295344
    Bias-corrected |  .12829     .10933   1.1733   0.241   -.086006      .342579
            Robust |  .12829     .25685   0.4995   0.617   -.375121      .631695
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.85672      2.736   -0.3131  0.754   -6.21918      4.50574
    Bias-corrected | -5.9198      2.736   -2.1637  0.030   -11.2822     -.557313
            Robust | -5.9198     6.4233   -0.9216  0.357   -18.5092      6.66967
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36
> ) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1688
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         928            Kernel        =    Uniform
Eff. Number of obs |       760         928            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00655     .04788   0.1368   0.891   -.087293      .100397
    Bias-corrected | -.00666     .04788   -0.1390  0.889   -.100502      .087188
            Robust | -.00666     .08375   -0.0795  0.937   -.170806      .157492
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  18.689     134.09   0.1394   0.889   -244.119      281.497
    Bias-corrected |  36.186     134.09   0.2699   0.787   -226.622      298.993
            Robust |  36.186     234.81   0.1541   0.878   -424.036      496.407
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10529
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4596        5933            Kernel        = Epanechnikov
Eff. Number of obs |      1289        1606            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    57.160      57.160
       BW bias (b) |   119.381     119.381
         rho (h/b) |     0.479       0.479
        Unique obs |       318         246

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00896     .03852   -0.2325  0.816   -.084455      .066544
    Bias-corrected | -.02554     .03852   -0.6629  0.507   -.101036      .049964
            Robust | -.02554     .04332   -0.5894  0.556   -.110449      .059377
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -6.6392     31.108   -0.2134  0.831   -67.6092      54.3308
    Bias-corrected |    6.68     31.108   0.2147   0.830     -54.29        67.65
            Robust |    6.68     34.983   0.1909   0.849   -61.8857      75.2458
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03956      .0902   0.4385   0.661   -.137238      .216356
    Bias-corrected | -.15917      .0902   -1.7646  0.078   -.335968      .017626
            Robust | -.15917     .26234   -0.6067  0.544   -.673346      .355004
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -4.745      13.31   -0.3565  0.721   -30.8322      21.3422
    Bias-corrected | -41.495      13.31   -3.1176  0.002   -67.5827     -15.4082
            Robust | -41.495     37.386   -1.1099  0.267    -114.77      31.7793
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        587
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         306            Kernel        =    Uniform
Eff. Number of obs |       281         306            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02445     .03276   0.7464   0.455   -.039752      .088646
    Bias-corrected |  .04099     .03276   1.2513   0.211   -.023214      .105184
            Robust |  .04099     .07276   0.5633   0.573   -.101617      .183587
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.5227     11.846   0.7195   0.472   -14.6948      31.7403
    Bias-corrected | -.73254     11.846   -0.0618  0.951   -23.9501      22.4851
            Robust | -.73254     25.544   -0.0287  0.977   -50.7985      49.3334
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2722
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1141        1581            Kernel        = Epanechnikov
Eff. Number of obs |       655         671            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    83.785      83.785
       BW bias (b) |   165.257     165.257
         rho (h/b) |     0.507       0.507
        Unique obs |       234         241

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00691     .01932   0.3577   0.721   -.030956      .044776
    Bias-corrected |  .00796     .01932   0.4118   0.681   -.029911      .045821
            Robust |  .00796     .02249   0.3537   0.724   -.036124      .052034
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  17.753     49.725   0.3570   0.721   -79.7066      115.212
    Bias-corrected |  17.136     49.725   0.3446   0.730   -80.3229      114.596
            Robust |  17.136     57.903   0.2960   0.767   -96.3505      130.623
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. **2_1_5_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11781     .14726   0.8000   0.424   -.170809      .406425
    Bias-corrected |  .19043     .14726   1.2932   0.196   -.098187      .479047
            Robust |  .19043      .3353   0.5679   0.570   -.466737      .847597
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06816     1.9688   -0.0346  0.972   -3.92692       3.7906
    Bias-corrected | -4.0402     1.9688   -2.0521  0.040   -7.89892     -.181395
            Robust | -4.0402     4.6413   -0.8705  0.384   -13.1369      5.05655
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1101
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         622            Kernel        =    Uniform
Eff. Number of obs |       479         622            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00578     .06555   -0.0881  0.930   -.134259      .122708
    Bias-corrected |  .01672     .06555   0.2551   0.799   -.111763      .145204
            Robust |  .01672     .11403   0.1466   0.883   -.206767      .240209
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -13.37     156.89   -0.0852  0.932   -320.862      294.123
    Bias-corrected | -42.503     156.89   -0.2709  0.786   -349.995      264.989
            Robust | -42.503     272.61   -0.1559  0.876   -576.813      491.807
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7807
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3455        4352            Kernel        = Epanechnikov
Eff. Number of obs |       807        1070            VCE method    =         NN
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    55.889      55.889
       BW bias (b) |   108.420     108.420
         rho (h/b) |     0.515       0.515
        Unique obs |       313         235

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.02459     .05333   -0.4611  0.645    -.12912      .079938
    Bias-corrected | -.04665     .05333   -0.8747  0.382    -.15118      .057879
            Robust | -.04665     .06121   -0.7621  0.446   -.166622      .073321
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .60412     3.2593   0.1854   0.853   -5.78396       6.9922
    Bias-corrected |  1.0448     3.2593   0.3205   0.749   -5.34332      7.43283
            Robust |  1.0448      3.735   0.2797   0.780   -6.27574      8.36525
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 5 results.xls", append ctitle(no province no July
> -Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 5 results.xls
dir : seeout

. 
. *2_1_6) rdrobust on earning, sheet 6, province-clustered no July-Oct
. 
. **2_1_6_1 Pooled 
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nn
> cluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        723
-------------------+----------------------            BW type       =     Manual
     Number of obs |       399         324            Kernel        =    Uniform
Eff. Number of obs |       399         324            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .10939     .08525   1.2832   0.199   -.057698      .276487
    Bias-corrected |  .08316     .08525   0.9754   0.329   -.083934      .250251
            Robust |  .08316     .13443   0.6186   0.536   -.180315      .346632
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .81443     1.1236   0.7249   0.469   -1.38774      3.01659
    Bias-corrected | -2.0421     1.1236   -1.8175  0.069   -4.24423      .160096
            Robust | -2.0421     2.8921   -0.7061  0.480   -7.71045      3.62631
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", replace ctitle(province-clustered
>  no July-Oct, pooled, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat != ., covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nn
> cluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2515
-------------------+----------------------            BW type       =     Manual
     Number of obs |      1194        1321            Kernel        =    Uniform
Eff. Number of obs |      1194        1321            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .01522       .051   0.2984   0.765   -.084739      .115171
    Bias-corrected |  .05537       .051   1.0858   0.278   -.044583      .155327
            Robust |  .05537     .06628   0.8354   0.403   -.074536       .18528
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  3.6187     11.478   0.3153   0.753   -18.8777       26.115
    Bias-corrected | -4.6492     11.478   -0.4051  0.685   -27.1455      17.8471
            Robust | -4.6492     16.367   -0.2841  0.776   -36.7276      27.4292
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat != ., covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster prov
> ince_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      15982
-------------------+----------------------            BW type       =      mserd
     Number of obs |      8304        7678            Kernel        = Epanechnikov
Eff. Number of obs |      2115        2287            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    58.694      58.694
       BW bias (b) |    96.593      96.593
         rho (h/b) |     0.608       0.608
        Unique obs |       368         259
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00256     .03816   0.0672   0.946   -.072231       .07736
    Bias-corrected | -.01283     .03816   -0.3363  0.737   -.087628      .061963
            Robust | -.01283     .04189   -0.3063  0.759   -.094945      .069279
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  6.3214     90.284   0.0700   0.944   -170.632      183.275
    Bias-corrected |  42.024     90.284   0.4655   0.642    -134.93      218.977
            Robust |  42.024     98.122   0.4283   0.668   -150.293       234.34
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_2 Pooled without SecJun
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(12
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        473
-------------------+----------------------            BW type       =     Manual
     Number of obs |       247         226            Kernel        =    Uniform
Eff. Number of obs |       247         226            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .08105      .1228   0.6600   0.509   -.159627      .321731
    Bias-corrected |  .12829      .1228   1.0447   0.296   -.112393      .368966
            Robust |  .12829       .234   0.5482   0.584   -.330345      .586919
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.85672     2.4785   -0.3457  0.730   -5.71441      4.00097
    Bias-corrected | -5.9198     2.4785   -2.3885  0.017   -10.7775     -1.06208
            Robust | -5.9198     6.6214   -0.8940  0.371   -18.8974      7.05785
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & (educat==1 | educat==2), covs(male) fuzzy(highgen) kernel(uni) p(1) h(36
> ) all vce(nncluster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1688
-------------------+----------------------            BW type       =     Manual
     Number of obs |       760         928            Kernel        =    Uniform
Eff. Number of obs |       760         928            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00655     .06828   0.0960   0.924   -.127283      .140386
    Bias-corrected | -.00666     .06828   -0.0975  0.922   -.140491      .127177
            Robust | -.00666     .09464   -0.0703  0.944   -.192148      .178834
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  18.689     192.45   0.0971   0.923    -358.51      395.887
    Bias-corrected |  36.186     192.45   0.1880   0.851   -341.013      413.384
            Robust |  36.186     270.62   0.1337   0.894   -494.221      566.593
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & (ed
> ucat==1 | educat==2), covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nn
> cluster province_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =      10529
-------------------+----------------------            BW type       =      mserd
     Number of obs |      4596        5933            Kernel        = Epanechnikov
Eff. Number of obs |      1625        2017            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    70.717      70.717
       BW bias (b) |   128.712     128.712
         rho (h/b) |     0.549       0.549
        Unique obs |       318         246
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |   .0094      .0461   0.2039   0.838   -.080962      .099765
    Bias-corrected | -.00989      .0461   -0.2144  0.830   -.100249      .080478
            Robust | -.00989     .05137   -0.1924  0.847   -.110566      .090795
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  4.2383     20.972   0.2021   0.840   -36.8653       45.342
    Bias-corrected |  11.571     20.972   0.5517   0.581   -29.5329      52.6745
            Robust |  11.571      23.07   0.5016   0.616   -33.6451      56.7867
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, pooled without secjun, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_3 SecVoc
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        160
-------------------+----------------------            BW type       =     Manual
     Number of obs |        83          77            Kernel        =    Uniform
Eff. Number of obs |        83          77            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        14          14

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .03956     .08488   0.4661   0.641   -.126803       .20592
    Bias-corrected | -.15917     .08488   -1.8753  0.061   -.325532       .00719
            Robust | -.15917     .27167   -0.5859  0.558   -.691639      .373297
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -4.745     11.459   -0.4141  0.679   -27.2043      17.7143
    Bias-corrected | -41.495     11.459   -3.6212  0.000   -63.9548     -19.0361
            Robust | -41.495     36.106   -1.1493  0.250   -112.263      29.2717
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==1, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        587
-------------------+----------------------            BW type       =     Manual
     Number of obs |       281         306            Kernel        =    Uniform
Eff. Number of obs |       281         306            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .02445     .03157   0.7743   0.439   -.037432      .086326
    Bias-corrected |  .04099     .03157   1.2982   0.194   -.020894      .102864
            Robust |  .04099     .06808   0.6020   0.547   -.092455      .174425
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  8.5227     11.854   0.7190   0.472   -14.7099      31.7554
    Bias-corrected | -.73254     11.854   -0.0618  0.951   -23.9652      22.5001
            Robust | -.73254     23.483   -0.0312  0.975   -46.7588      45.2938
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==1, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       2722
-------------------+----------------------            BW type       =      mserd
     Number of obs |      1141        1581            Kernel        = Epanechnikov
Eff. Number of obs |       679         721            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    88.135      88.135
       BW bias (b) |   161.627     161.627
         rho (h/b) |     0.545       0.545
        Unique obs |       234         241
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .00941      .0199   0.4729   0.636   -.029589      .048409
    Bias-corrected |   .0105      .0199   0.5277   0.598   -.028498        .0495
            Robust |   .0105     .02392   0.4390   0.661   -.036382      .057383
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  12.167       26.8   0.4540   0.650   -40.3606      64.6955
    Bias-corrected |   12.42       26.8   0.4634   0.643    -40.108       64.948
            Robust |   12.42     31.668   0.3922   0.695   -49.6488      74.4887
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secvoc, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. **2_1_6_4 SecGen
. *One year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -12, 11) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(12) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =        313
-------------------+----------------------            BW type       =     Manual
     Number of obs |       164         149            Kernel        =    Uniform
Eff. Number of obs |       164         149            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    12.000      12.000
       BW bias (b) |    12.000      12.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .11781     .16723   0.7045   0.481   -.209961      .445577
    Bias-corrected |  .19043     .16723   1.1387   0.255   -.137339      .518198
            Robust |  .19043     .32297   0.5896   0.555   -.442571      .823431
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.06816     1.4804   -0.0460  0.963   -2.96978      2.83346
    Bias-corrected | -4.0402     1.4804   -2.7290  0.006   -6.94178     -1.13853
            Robust | -4.0402     4.4473   -0.9085  0.364   -12.7566      4.67632
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 12-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. *Three year each
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(t, -36, 35) & inrange(monthlyearn
> ing, 250, 25000) & educat ==2, covs(male) fuzzy(highgen) kernel(uni) p(1) h(36) all vce(nnc
> luster province_code)

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       1101
-------------------+----------------------            BW type       =     Manual
     Number of obs |       479         622            Kernel        =    Uniform
Eff. Number of obs |       479         622            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    36.000      36.000
       BW bias (b) |    36.000      36.000
         rho (h/b) |     1.000       1.000
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional | -.00578     .09166   -0.0630  0.950   -.185428      .173877
    Bias-corrected |  .01672     .09166   0.1824   0.855   -.162932      .196374
            Robust |  .01672     .14454   0.1157   0.908   -.266564      .300006
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -13.37     216.33   -0.0618  0.951   -437.376      410.637
    Bias-corrected | -42.503     216.33   -0.1965  0.844   -466.509      381.503
            Robust | -42.503     334.99   -0.1269  0.899   -699.071      614.065
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, uniform weight, 36-month bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. *Automatic
. rdrobust log_monthlyearning t if (t<=-3 | t>=2) & inrange(monthlyearning, 250, 25000) & edu
> cat ==2, covs(male) fuzzy(highgen) kernel(epa) p(1) bwselect(mserd) all vce(nncluster provi
> nce_code)
Mass points detected in the running variable.

Covariate-adjusted Fuzzy RD estimates using local polynomial regression.

      Cutoff c = 0 | Left of c  Right of c            Number of obs =       7807
-------------------+----------------------            BW type       =      mserd
     Number of obs |      3455        4352            Kernel        = Epanechnikov
Eff. Number of obs |       822        1094            VCE method    =  NNcluster
    Order est. (p) |         1           1
    Order bias (q) |         2           2
       BW est. (h) |    56.532      56.532
       BW bias (b) |    99.931      99.931
         rho (h/b) |     0.566       0.566
        Unique obs |       313         235
Number of clusters |        15          15

First-stage estimates. Outcome: highgen. Running variable: t.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  -.0232     .07464   -0.3109  0.756   -.169497      .123088
    Bias-corrected | -.05058     .07464   -0.6777  0.498   -.196875       .09571
            Robust | -.05058     .08545   -0.5920  0.554   -.218055      .116889
--------------------------------------------------------------------------------

Treatment effect estimates. Outcome: log_monthlyearning. Running variable: t. Treatment Statu
> s: highgen.
--------------------------------------------------------------------------------
            Method |   Coef.    Std. Err.    z     P>|z|    [95% Conf. Interval]
-------------------+------------------------------------------------------------
      Conventional |  .63397     4.6371   0.1367   0.891   -8.45462      9.72255
    Bias-corrected |  .91929     4.6371   0.1982   0.843   -8.16929      10.0079
            Robust |  .91929     4.9378   0.1862   0.852   -8.75866      10.5972
--------------------------------------------------------------------------------
Covariate-adjusted estimates. Additional covariates included: 1
Std. Err. adjusted for clusters in province_code
Estimates adjusted for mass points in the running variable.

. local bandwidth = e(h_l)

. mata : st_numscalar("e(N)", `e(N_h_l)'+`e(N_h_r)')

. outreg2 using "`folderpath'/Earning Sheet 6 results.xls", append ctitle(province-clustered 
> no July-Oct, secgen, epa weight, automatic bandwidth) pvalue
/Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male controlled/Earni
> ng Sheet 6 results.xls
dir : seeout

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/wyattwyatt/Downloads/Revision Code/Wyatt/RDD/Highgen/FuzzyOption Male con
> trolled/Urban 1979 Highgen FuzzyOption Male controlled.log
  log type:  text
 closed on:   6 Aug 2024, 17:23:19
---------------------------------------------------------------------------------------------
